{
  "url": "https://lite.cnn.com/2026/02/14/business/businesses-cater-ex-relationship-valentines",
  "title": "Do you think love stinks? These businesses have your Valentine’s Day figured out | CNN Business",
  "date": "2026-02-15T07:11:06.882279+00:00",
  "authors": [],
  "text": "Source: CNN\n\nNot everyone loves the gooey, heart-shaped version of Valentine’s Day. Even for those who celebrate, the pressure to deliver the picture-perfect night can — quite frankly — stink.\n\nThis Valentine’s Day, some nonprofits and businesses are siding with the jaded lovers of the world. Those skipping romance this season can name an ex after a pile of animal feces, shred old photos for dining deals or smash their way through staged date nights in rage rooms.\n\nAccording to Google, the phrase “I hate Valentine’s Day” has seen an over 5,000% increase in searches in the past month, suggesting demand for cathartic campaigns like these is growing alongside the holiday itself.\n\n“Even for those who aren’t currently heartbroken, participating in ‘anti-Valentine’s Day’ events can serve as a small act of self-affirmation,” said Raluca Ursu, an associate professor of marketing at the NYU Stern School of Business. “(It’s) a way to acknowledge past challenges, celebrate resilience and perhaps even laugh at what once hurt.”\n\nFor some, the anti-romance promotions might just be a way to make it through the mushy holiday. For others, like nonprofit organizations and businesses, they’re a way to capture every customer — lover or hater.\n\nZoos and shelters around the world are offering lighthearted ways to support their animals while letting go of heartbreak.\n\nAt WildCat Ridge Sanctuary in Scotts Mills, Oregon, people can donate $100 to have an ex-partner’s name placed on a gelatin heart made with meat and nutrients. The heart is fed to one of the sanctuary’s big cats, and donors receive a video of the feeding.\n\nThe “Be My Bloody Valentine” fundraiser has grown from about 10 participants in its first year in 2020 to more than 75 last year.\n\n“It’s definitely something we have no plans on discontinuing,” said Ian Ford, associate executive director at Wildcat Ridge Sanctuary.\n\nWildCat Ridge isn’t alone in turning heartbreak into donations. Ireland’s Galway SPCA, for example, is running its “Neuter Your Ex” fundraiser, where feral cats are named after former partners before being neutered and released as part of its population control program.\n\nThe Maryland Zoo is offering a “Dollars for Dung” promotion that allows donors to name a pile of animal waste after someone from their past, starting at $5. Meanwhile, the Bronx Zoo in New York has revived itsannual traditionof naming one of the zoo’s thousands of Madagascar hissing cockroaches for $15.\n\nRestaurants are also leaning into the anti-romance trend, with something on the menu for everyone — whether they’re in love, opting out of the tradition or just hungry for some revenge. National restaurant chains and local eateries have adopted unconventional promotions to disrupt the usual “for two” dining packages.\n\nHart’s, an upscale Mediterranean restaurant in Brooklyn, New York, is marking its ninth annual “Love Stinks” event — the longest-running promotion in the restaurant’s history.\n\nCompared to traditional date-night cuisine, Hart’s limited menu leans into pungent ingredients like anchovies, garlic and blue cheese. Dishes like an onion tart with anchovies emphasize that the best parts of love don’t always smell so sweet.\n\n“It’s really turned into a tradition, not only for us, but for some of our regulars,” said Nick Perkins, co-founder of Hart’s.\n\n“It’s become so popular that starting last year, we started doing it two days in a row,” he said.\n\nWith Valentine’s Day spending expected to reach a record $29.1 billion this year, according to theNational Retail Federation, these anti-romance promotions can offer some relief from the pressures that often come with the holiday’s price tag. Other restaurants are also experimenting with breakup-themed promotions as alternatives to steak dinners and love potions.\n\nHooters is once again offering its “Shred Your Ex” promotion, which gives 10 free wings to customers who shred a photo of an ex online or in person. And Wendy’s is promoting its $1 Dave’s single cheeseburger deal on mobile orders the day after Valentine’s Day, also known as Singles Awareness day.\n\nExperiential businesses and live events are letting customers find camaraderie by hating in-person.\n\nIn New York City, bar and event space Two Doors Down sold out its “Singles Only, Anti Valentine’s Day” event, marketed as a pressure-free night for 150 single participants with “No roses. No Pressure. No forced Romance.”\n\nValentine’s Day cynics can also release their fury at Smash Sacramento, a rage-room where customers pay to destroy objects in a controlled environment, during their second annual “Anti-Valentine’s Club” promotion.\n\nDavid Messier, owner and operator of Smash Sacramento Inc., recounted stories of groups who come to recreate Hollywood scenes of flipping romantic tables over and smashing plates.\n\nThe reenactments were so popular that Messier extended the event to span the whole Valentine’s Day week this year, with most of the extra 75 time slots reserved by parties that host up to 10 people.\n\n“You can sit there, talk benign conversation — and then flip the table over, throw the glasses, throw the chairs to the wall,” Messier said, adding that customers often describe it as the highlight of their night. “You can live out your wildest fantasies.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://wildcatridgesanctuary.org/my-bloody-valentine-2026/",
      "text": "Be My Bloody Valentine"
    },
    {
      "url": "https://gspca.ie/products/valentines-day",
      "text": "Neuter Your Ex"
    },
    {
      "url": "https://www.marylandzoo.org/news-and-updates/2026/01/dollars-for-dung/",
      "text": "Dollars for Dung"
    },
    {
      "url": "https://bronxzoo.com/roach",
      "text": "annual tradition"
    },
    {
      "url": "https://www.instagram.com/p/DTf6qtKDYh6/",
      "text": "Love Stinks"
    },
    {
      "url": "https://nrf.com/media-center/press-releases/valentine-s-day-spending-expected-to-reach-new-records",
      "text": "National Retail Federation"
    },
    {
      "url": "https://www.hooters.com/shredyourex/#section-intro",
      "text": "Shred Your Ex"
    },
    {
      "url": "https://events.getthursday.com/event/thursday-anti-valentines-day-two-doors-down-new-york/",
      "text": "Singles Only, Anti Valentine’s Day"
    },
    {
      "url": "https://www.smashsacramento.com/downtown-sacramento-location",
      "text": "Anti-Valentine’s Club"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/business/businesses-cater-ex-relationship-valentines",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/business/businesses-cater-ex-relationship-valentines",
      "text": "Cookie Settings"
    }
  ],
  "hash": "002fc8236216ae4d5acb293fd2dcdc201d70a0ced99ee9d371d7a78846a981e4",
  "scraped_at": "2026-02-15T07:11:06.882292+00:00"
}