{
  "url": "https://lite.cnn.com/2026/02/18/us/delta-emergency-landing-houston",
  "title": "Delta flight makes emergency landing after pilot says a passenger wanted to access the cockpit | CNN",
  "date": "2026-02-19T07:31:37.063077+00:00",
  "authors": [
    "Alexandra Skores",
    "Pete Muntean",
    "Aaron Cooper",
    "CNN"
  ],
  "text": "Source: CNN\n\nA Delta Air Lines flight from Houston to Atlanta made an emergency landing early Wednesday after a passenger tried to access the cockpit, the pilot told air traffic controllers.\n\nDelta flight 2557, a Boeing 717 aircraft, had just taken off from Houston’s Hobby Airport when the pilot declared an emergency. Eighty-five passengers and five crew members were on board, according to Delta.\n\n“We had a passenger get up and try to access the cockpit,” the pilot can be heard in a radio recording with air traffic control captured by Broadcastify. “Can you coordinate and have security standing by?”\n\nAfter confirming the cockpit was secure, he requested police and paramedics meet the plane when it landed.\n\n“(He is) in cuffs in the back of the aircraft, but he did assault another passenger, so we would like that other passenger checked out,” the pilot told air traffic control.\n\nIn 2025, there were 1,621 unruly passengers reported to the Federal Aviation Administration. So far, in 2026, there have been 126.\n\nWednesday, the plane signaled an emergency using its transponder and landed back at Hobby Airport about 17 minutes after taking off. Emergency vehicles accompanied the plane to the gate.\n\n“They are coming to the gate. The police are there waiting,” an air traffic controller told emergency responders. “Follow the aircraft to the ramp.”\n\nDelta later told CNN that the passenger “approached crew and customers but did not make contact with or attempt to access the flight deck.”\n\n“The safety of our customers and crew is paramount, and Delta has zero tolerance for unruly behavior,” the airline said in a statement. “We apologize to our customers for this experience and delay in their travels.”\n\nThe flight later took off again and arrived in Atlanta about 90 minutes behind schedule.\n\nThe FAA is investigating the incident.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/us/delta-emergency-landing-houston",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/us/delta-emergency-landing-houston",
      "text": "Cookie Settings"
    }
  ],
  "hash": "00937331dce54b3065af802c3dd6f9bf4d2fb98e72073137d43c51224655af68",
  "scraped_at": "2026-02-19T07:31:37.063092+00:00"
}