{
  "url": "https://lite.cnn.com/2026/02/11/middleeast/iran-mistreated-narges-mohammadi-nobel-committee-intl",
  "title": "Iranian authorities subjected Nobel laureate Narges Mohammadi to ‘life-threatening mistreatment,’ Nobel Committee says | CNN",
  "date": "2026-02-12T21:31:00.117400+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nImprisoned Nobel peace laureateNarges Mohammadiwas subjected to beatings and “life-threatening mistreatment” by Iranian authorities during her arrest and detention, the Norwegian Nobel Committee said Wednesday, citing “credible reports” that its chairman described to CNN as “horrifying.”\n\nJørgen Watne Frydnes, chair of the Norwegian Nobel Committee, told CNN on Wednesday that Mohammadi has been subjected to severe physical abuse in Iran, according to credible reports from inside the country.\n\nFrydnes told CNN’s chief international anchor, Christiane Amanpour, that the committee is “horrified” by the accounts it has received regarding Mohammadi’s recent arrest and detention.\n\nAccording to those reports, during her arrest in December, she was beaten repeatedly with wooden sticks and batons and dragged across the ground by her hair, sustaining injuries that left open wounds on her head. He said she was also repeatedly kicked in the pelvis and genital area, leaving her in severe pain and unable to sit or function normally.\n\n“The reports are, in fact, horrifying,” Frydnes told CNN. “This constitutes cruel and inhumane treatment — a blatant violation of international human rights law.” He added that heavy interrogations and intimidation have continued during her detention and that she has been denied adequate and sustained medical care.\n\nFrydnes expressed particular concern given Mohammadi’s known heart disease and other medical conditions, warning that her health needs are not being properly addressed.\n\n“We definitely worry that she will not be able to live any longer,” he said, citing the seriousness of her condition and the reported escalation of mistreatment in recent weeks.\n\nHe linked her case to what he described as broader unlawful mass killings and repression following recentprotests in Iran, calling her treatment another example of the regime’s crackdown.\n\nAddressing what actions the Nobel Committee can take, Frydnes said it is appealing directly to Iranian authorities to uphold international law and cease violations. He also called on the international community to increase pressure on Tehran.\n\n“This is a call both to the regime in Iran and to the international community to put pressure on them so that Ms. Mohammadi’s safety is taken care of,” he said. He urged governments in contact with Iran to make her immediate and unconditional release part of their discussions.\n\nFrydnes acknowledged that awarding the Nobel Peace Prize to individuals facing persecution can carry risks, potentially intensifying pressure against them. However, he noted that Mohammadi had taken significant risks for years before receiving the prize and has remained steadfast in advocating for “women, life, freedom,” a reference to the Iranian slogan, as well as democracy and basic human rights in Iran.\n\nDuring her arrest in December, security forces beat the activist repeatedly and dragged her by the hair, tearing sections of her scalp, and continued to beat her in the transport vehicle, the Nobel Committee said in a statement issued earlier Wednesday.\n\nCNN has reached out to the Iranian Foreign Ministry and its UN mission in New York for comment.\n\nMohammadi, one of Iran’s most prominent human rights activists, won theNobel Peace Prize in 2023and has spent most of the past two decades as an inmate of Tehran’s notorious Evin prison.\n\nIn December 2024, Iranian authorities suspended her prison term to allow her to recover from surgery, but she was arrested again a year later and has remained in detention since then.\n\nOn Saturday, Mohammadi was sentenced to more than seven additional years in prison, according to her lawyer.\n\nThe new sentence was imposed amid awidespread crackdownon dissent in Iran following mass protests against the regime in January that have plunged the country into crisis.\n\nOn Sunday, Mohammadi ended a hunger strike she began in early February to protest her “unlawful detention, dire prison conditions, and the denial of contact with her family and lawyers,” according to her foundation, which cited reports indicating that her physical condition was “deeply alarming.”\n\nIn a short call on Sunday with her lawyer Mostafa Nili, Mohammadi said she was hospitalized last week but was transferred back to the detention center in Mashhad before her treatment was complete.\n\nMohammadi has a medical history that includes heart attacks, chest pain and high blood pressure, as well as spinal disc issues and other illnesses, according to the foundation, which is run by her family.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/middleeast/iran-narges-mohammadi-new-sentence-intl-hnk",
      "text": "Narges Mohammadi"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/middleeast/iran-supreme-leader-khamenei-protests-criminal-trump-intl-latam",
      "text": "protests in Iran"
    },
    {
      "url": "https://www.cnn.com/2023/10/06/world/nobel-peace-prize-winner-2023-intl",
      "text": "Nobel Peace Prize in 2023"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/middleeast/iran-high-tech-additions-playbook-crushing-protests-intl",
      "text": "widespread crackdown"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/middleeast/iran-mistreated-narges-mohammadi-nobel-committee-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/middleeast/iran-mistreated-narges-mohammadi-nobel-committee-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "00fec3d297698dee12dfd1d12d6848ebd5cbd8efe26a57a3ad67a27a8207a748",
  "scraped_at": "2026-02-12T21:31:00.117414+00:00"
}