{
  "url": "https://lite.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
  "title": "Colin Gray trial: Students wounded in Georgia school shooting testify in trial of shooter’s father | CNN",
  "date": "2026-02-19T07:32:28.734838+00:00",
  "authors": [
    "Eric Levenson",
    "Isabel Rosales",
    "CNN"
  ],
  "text": "Source: CNN\n\nMelany Delira-Castaneda was 15 and in her ninth-grade math class at Apalachee High School in Winder, Georgia, when her ear began ringing and she smelled smoke.\n\nShe stood up and turned toward the door and saw Colt Gray, then 14, pointing a firearm into the classroom and firing indiscriminately, she said.\n\n“I didn’t know I was shot, but I was. My body just told me to hold my arm,” Melany, now 16, said quietly through tears. “I was holding my arm and I hid between a pillar … between (the teacher’s)smartboard and my desk.”\n\nMelany was one of about a dozen students who testified about the traumatic September 2024 attack on Tuesday in thetrial of Colin Gray, the father of Colt Gray, on charges of murder and manslaughter. Prosecutors allege Colin Gray bought his son the AR-15-style rifle used in the shooting despite previous warnings that his son was a danger to others, actions that constitute criminally reckless conduct.\n\nColin Gray has pleaded not guilty to nearly 30 charges, including two counts each of second-degree murder and involuntary manslaughter. His attorney said in opening statements Monday that Colin Gray was unaware his son was planning the shooting and had taken steps to try to get him help.\n\nThe trial began Monday with opening statements and testimony from teachers, police and parents at the school that day who spoke about the horror of the attack, which lefttwo students and two teachers dead. Nine other people were injured.\n\nColin Gray’s trial is part of a broader push to hold more people accountable for a school shooting, including the shooter’sparentsandresponding law enforcement officers. This case bears close similarities to the trials ofJames and Jennifer Crumbley, whose then-15-year-old son killed four students in 2021 at his high school in Oxford, Michigan.\n\nLegally, the case centers on what Colin Gray knew about his son’s dangerousness and his actions or inaction leading up to the shooting. Yet testimony from the wounded students put the focus instead on the harrowing moments of the attack itself – and the ripple effects of its aftermath.\n\nFor Melany, that aftermath meant getting treatment for a gunshot wound in her left shoulder, as well as dealing with the emotional trauma of what she witnessed.\n\n“I feel like, just seeing what I saw that day just sticks with me, and not being able to trust certain people,” she said of the shooting’s effect on her.\n\nColt Gray ultimately surrendered to police and hasadmitted to the shooting, according to authorities. Now 16, he has pleaded not guilty to55 felony counts, including four counts of malice murder. A trial date has not been set.\n\nIn addition to Melany, fellow students Nautica Walton, Taylor Jones, Natalie Griffith, Jaxson Beaver and Ronaldo Vega testified about the moments they were shot during the attack. They were all in their ninth-grade math class when they said Colt Gray opened fire through the class window.\n\nNautica said she felt a hot spot on her leg and realized she had been shot, falling in and out of consciousness. First responders cut off her camo shorts to care for her that day, and a photo of the shorts was shown in court.\n\nBecause of the shooting, she can’t play sports anymore and is “very paranoid” and depressed, she said.\n\nTaylor said she looked at the classroom door and saw a “kid standing there with a gun” whom she had never seen before. She jumped to the floor and soon realized she had been shot in the leg.\n\n“After I got shot, I turned to my friend Landon and asked him to hold my hand because I was scared,” she said.\n\nShe was airlifted to a hospital and has spent months there due to multiple surgeries. She said she can’t play volleyball anymore and finds it hard to walk, and she missed an entire school year during her recovery.\n\nNatalie said she was shot in her shoulder and hand. As she was taken out of the classroom to an ambulance, she saw Colt Gray in handcuffs and angrily cursed at him, she said.\n\n“I saw red. I was very mad,” she said. “I remember yelling at him that we were kids.”\n\nOther students who were not physically injured in the attack took the stand to discuss their psychological wounds.\n\nHayden Bowen said she now has anxiety and panic attacks, and she described wrestling withsurvivor’s guilt.\n\n“I often have really bad thoughts,” she told the court. “It’s going to happen again, and this time I’m going to die, because I was supposed to the first time.”\n\nWilliam Cariker said he hid behind a table during the shooting and texted what could have been his final words to a family group chat.\n\n“There’s a school shooting if I don’t make it I love you all,” he wrote.\n\nTwo teachers who survived the attack also testified Tuesday. David Phenix, a special education teacher at Apalachee, told the court he heard a loud noise outside the classroom and stepped out to investigate. He went 3 to 5 feet into the hallway and saw a student aiming at him with a rifle, he said, and he fled back into the classroom.\n\nShot in the hip and foot, Phenix was able to crawl back into the room and close the door behind him, surveillance video shows. His co-teacher, Valerie Lancaster, testified she used rags to apply pressure to his wounds and stem the bleeding.\n\nPhenix had a boot on his foot and had surgery on his hip, but his recovery is ongoing, he said. He returned to work in a limited capacity in December 2024 and retired last May.\n\nThe defense declined to cross-examine any of the students or teachers.\n\nSitting at the defendant’s table, Colin Gray remained attentive during the witness testimony. If convicted, he faces 10 to 30 years in prison on each murder charge and one to 10 years on each manslaughter charge.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "trial of Colin Gray"
    },
    {
      "url": "https://www.cnn.com/2024/09/05/us/victims-apalachee-high-school-shooting",
      "text": "two students and two teachers dead"
    },
    {
      "url": "https://www.cnn.com/2024/03/03/us/james-crumbley-trial-mass-shooting-accountability",
      "text": "parents"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/school-shooting-trials-police-officers",
      "text": "responding law enforcement officers"
    },
    {
      "url": "https://www.cnn.com/2024/03/16/us/james-jennifer-crumbley-trials-differences/index.html",
      "text": "James and Jennifer Crumbley"
    },
    {
      "url": "https://www.cnn.com/2024/10/22/us/apalachee-school-shooter-colt-gray-has-waived-arraignment-and-entered-a-not-guilty-plea",
      "text": "admitted to the shooting"
    },
    {
      "url": "https://www.cnn.com/2024/10/17/us/colt-colin-gray-apalachee-school-shooting",
      "text": "55 felony counts"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "Cookie Settings"
    }
  ],
  "hash": "01746ffe39d2023ba8c3c177fb75131f94e1b03eba148956b86417a291af4085",
  "scraped_at": "2026-02-19T07:32:28.734852+00:00"
}