{
  "url": "https://lite.cnn.com/2026/02/27/health/henrietta-lacks-cells-novartis-settlement",
  "title": "Novartis settles with Henrietta Lacks’ estate over use of her ‘stolen’ cells to advance medicine | CNN",
  "date": "2026-03-01T07:08:13.536711+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nNovartis has settled a lawsuit by the estate of Henrietta Lacks that alleged the pharmaceutical giant unjustly profited off her cells, which were taken from her tumor without her knowledge in 1951 and reproduced in labs to enable major medical advancements, including the polio vaccine.\n\nDetails of the agreement, which was finalized in federal court in Maryland this month, aren’t public.\n\nThe Lacks family and Swiss-based Novartis said in a joint statement that they are “pleased they were able to find a way to resolve this matter filed by Henrietta Lacks’ Estate outside of court” but aren’t commenting further.\n\nIt’s the second settlement in lawsuits filed by the estate that accused biomedical businesses of reaping rewards from a racist medical system that took advantage of Black patients like Lacks. The settlement ends litigation between Novartis, one of the world’s largest pharmaceutical companies, and the estate of Lacks, a mother who died of cervical cancer at age 31 and was buried in an unmarked grave.\n\nThe 2024 lawsuit had sought from Novartis “the full amount of its net profits obtained by commercializing the HeLa cell line,” which the complaint said had been cultivated from “stolen cells.”\n\nDoctors at Johns Hopkins Hospitaltook Lacks’ cervical cellsin 1951 without her knowledge, and the tissue taken from her tumor before she died became the first human cells to continuously grow and reproduce in lab dishes. HeLa cells became a cornerstone of modern medicine, enabling countless scientific and medical innovations, including the development of genetic mapping and even COVID-19 vaccines, but the Lacks family wasn’t compensated along the way despite that incalculable impact on science and medicine.\n\nJohns Hopkins said it never sold or profited from the cell lines, but many companies have patented ways of using them.\n\nIn 2023, Lacks’ estatereached an undisclosed settlementwith the biotechnology company Thermo Fisher Scientific Inc. Lawyers for the family argued in that case that the company continued to commercialize the results long after the origins of the HeLa cell line became well known and unjustly enriched itself off Lacks’ cells.\n\nThere are other pending lawsuits by the Lacks estate. Just over a week after the estate settled the case with Thermo Fisher Scientific, attorneys for the estate filed alawsuit against Ultragenyx Pharmaceuticalin Baltimore federal court, the same venue as the previously settled case. Litigation with Ultragenyx as well as Viatris, a pharmaceutical company, remain active.\n\nAttorneys for the family have indicated there could be additional complaints filed.\n\nLacks was a poor tobacco farmer from southern Virginia who married and moved with her husband to Turner Station, a historically Black community outside Baltimore. They were raising five children when doctors discovered a tumor in Lacks’ cervix and saved a sample of her cancer cells collected during a biopsy.\n\nWhile most cell samples died shortly after being removed from the body, her cells survived and thrived in laboratories. They became known as the first immortalized human cell line because scientists could cultivate them indefinitely, meaning researchers anywhere could reproduce studies using identical cells.\n\nThe remarkable science involved — and the impact on the Lacks family, some of whom had chronic illnesses and no health insurance — were documented in a bestselling book by Rebecca Skloot, “The Immortal Life of Henrietta Lacks,” which was published in 2010. Oprah Winfrey portrayed her daughter in an HBO movie about the story.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://apnews.com/television-481edae2f5eb468fa086ccd85713638a",
      "text": "took Lacks’ cervical cells"
    },
    {
      "url": "https://apnews.com/article/henrietta-lacks-hela-cells-thermo-fisher-scientific-bfba4a6c10396efa34c9b79a544f0729",
      "text": "reached an undisclosed settlement"
    },
    {
      "url": "https://apnews.com/article/henrietta-lacks-cells-new-lawsuit-baaeb5d88387edd61d795befcf614721",
      "text": "lawsuit against Ultragenyx Pharmaceutical"
    }
  ],
  "hash": "018fdc9033fc994de4073fad3fa342ff0ae0b58bc9020bc1b7b98df28b3d25a0",
  "scraped_at": "2026-03-01T07:08:13.536723+00:00"
}