{
  "url": "https://lite.cnn.com/2026/02/27/asia/afghanistan-pakistan-strikes-what-we-know-intl-hnk",
  "title": "Why are Pakistan and Afghanistan launching attacks, with Pakistani official declaring ‘open war’? | CNN",
  "date": "2026-02-28T06:59:17.000586+00:00",
  "authors": [
    "Sophia Saifi",
    "Masoud Popalzai",
    "Rhea Mogul"
  ],
  "text": "Source: CNN\n\nAfghanistan and Pakistan are fighting again, trading deadly shelling and mortar fire across their rugged border, with Islamabad’s defense minister saying his country’s patience had “run out” and declaring “open war” on its Taliban-run neighbor.\n\nIt’s thelatest flare-upin an on-off conflict that pitches Pakistan’s well-funded, powerful and nuclear-armed military against hardened Afghan Taliban fighters with decades of battle experience – including victory over US and NATO forces in 2021 after years of insurgency.\n\nHere’s what we know about the latest violence, which threatens to exacerbate instability in the region.\n\nLate Thursday night the Taliban’s military launched attacks on Pakistani positions along some sections of their porous and disputed border that wends 1,600 miles through rugged mountains and desert.\n\nKabul said those attacks were in retaliation for Pakistan’sbombingof what it said were militant camps in Afghanistan over the weekend that left at least 18 people dead.\n\nIn response, early on Friday, Pakistan launched Ghazab Lil Haqq – or “Operation Righteous Fury.”\n\nPakistani airstrikes had hit Kabul, the southeastern province of Paktia, and Kandahar, considered the spiritual birthplace of the Taliban where the group’ssecretive leader Hibatullah Akhundzadais believed to be based.\n\nThe Taliban said the Pakistani attacks killed 19 civilians and injured 26 others, with the majority of casualties being women and children, according to Deputy Spokesman Hamdullah Fitrat.\n\nPakistan said its strikes targeted Afghan defense facilities, a significant escalation in the country’s retaliation strategy. A Pakistani military spokesman claimed later on Friday that the armed forces had destroyed 73 Taliban posts along the border and captured more than a dozen other positions.\n\nA Kabul resident described the moment her family was woken by a loud explosion on Friday.\n\n“I was terrified,” the woman, who CNN is not naming for safety reasons, said.\n\n“Then we heard gunfire. When we looked out of our apartment window, we saw bullet-like flames going up in the sky,” she said, adding she could not sleep and was still awake at 5 a.m., fearing what could happen next.\n\n“Since the first explosion, the lights of most of the houses and apartments around us have been on,” the woman said. “I’m sure every Kabul resident is sitting in fear of being hit by a bomb.”\n\nThe two sides have reported differing casualty figures. Pakistan claimed that its military had killed 274 Afghan Taliban fighters and injured 400. Afghanistan said 13 of its soldiers had been killed and 22 wounded in Friday’s attack. The Taliban-government spokesman, Zabiullah Mujaid, also claimed that Afghanistan killed 55 Pakistani soldiers and captured others, as its forces destroyed 19 Pakistani military posts. CNN isn’t able to verify reports from the remote region where the fighting is taking place.\n\nPakistan’s information minister said militants from the Pakistani Taliban attempted to launch drones attacks in the northwest from within the country, which Pakistan’s anti-drone systems thwarted.\n\n“The incidents have again exposed direct linkages between Afghan Taliban Regime and Terrorism in Pakistan,” Pakistan’s information minister Attaullah Tarar said.\n\nTarar lambasted the Afghan Taliban as an “illegitimate regime,” in a later statement Friday, and claimed it “actively sponsors cross-border terrorism, institutionalizes slavery, and orchestrates the systematic erasure of women and minorities.”\n\nAfghanistan’s Mujaid said on Friday: “We have always repeatedly emphasized a peaceful solution, and we still want to find a solution through dialogue.”\n\nThe US State Department expressed support for Pakistan’s “right to defend itself” against Taliban attacks, Under Secretary of State for Political Affairs, Allison Hooker said in a social media post.\n\nYes. Despite sharing close economic and cultural ties, the two countries have a complicated history.\n\nLast October, they fought their deadliest conflict in years, with a fragile ceasefire in place since.\n\nAfter the Afghan Taliban was ousted from power by NATO forces in 2001 for sheltering the perpetrators of the September 11 attacks, Pakistan became one of its main backers.\n\nIts fighters found shelter over the border in Pakistan, and support for their subsequent insurgency against the US-backed Afghan government, in what became the US’ longest-ever war.\n\nBut since the Taliban’s ultimate victory in that war following the chaotic US withdrawal and their return to power in Kabul, Pakistan has faced a surge in Islamist violence.\n\nIslamabad blames Pakistani Taliban militants,  also known as Tehrik-e-Taliban Pakistan (TTP), for much of that violence – and accuses Kabul of giving them shelter on its territory.\n\nKabul has denied an alliance with thePakistani Taliban, but on Friday the militant group’s chief Mufti Noor Wali Mehsud appeared to confirm it. Mehsud urged the TTP’s militants to take revenge for Pakistan’s ‘invasion’ of Afghanistan.\n\nMany of those attacks are carried out with US weapons left behind during the chaotic withdrawal,CNN has reported.\n\nMore than 1,200 people, including military and civilians, were killed in militant attacks across the country in 2025, according to data shared with CNN by the Pakistani military. That’s double the number recorded in 2021, when the US retreated from Kabul and the Afghan Taliban returned to power.\n\nMany Afghan Taliban figures still have property and families in Pakistan, the country’s Defense Minister Khawaja Asif told CNN in November. When asked by CNN if the current spike in violence was the definition of blowback, he replied “Yeah, I think so.”\n\nAsif took to social media early Friday to accuse Afghanistan of gathering “all the terrorists of the world” and “exporting terrorism,” while depriving its own people of human rights.\n\n“Our patience has run out,” Asif wrote on X. “Now it is open war between us and you.”\n\nBy the numbers, the disparity between the Pakistani and Afghan militaries is stark, according to the International Institute for Strategic Studies’ (IISS) “Military Balance 2025.”\n\nThe military remains Pakistan’s most powerful institution, having solidified its dominance throughout the country’s history with coups and constitutional amendments.\n\nAs a nuclear power, Pakistan commands a sophisticated defense apparatus comprising an army, navy, air force, and marine corps. According to the IISS, these branches total approximately 660,000 active-duty troops, reinforced by paramilitary and military police units numbering nearly 300,000 personnel.\n\nTheir conventional strength is bolstered by a modern arsenal, including US-made F-16 fighter jets, French Mirage jets, and the JF-17, jointly produced with China, Islamabad’s primary defense partner.\n\nIn contrast, Afghanistan possesses a singular, unified force: the Taliban.\n\nEstimated at fewer than 200,000 personnel, the Taliban’s military structure lacks a functional air force, relying instead on a handful of aging Soviet-era attack helicopters and transport aircraft abandoned during the US withdrawal as well as quadcopter drones.\n\nWhile they lack the heavy weaponry of their neighbors, their guerilla tactics are a defining characteristic of their military identity, hardened by their ideological rigidity, religious fervor and decades of asymmetric warfare.\n\nPrevious flare-ups have calmed after days of fighting, and mediation by foreign governments including Saudi Arabia, Turkey and Qatar.\n\nAnalysts fear further escalation could compound instability.\n\nAbdul Basit, a senior associate fellow from the S. Rajaratnam School of International Studies said there are “dangerous times ahead.”\n\n“Any retaliation by the Afghans will be in Pakistan’s urban centers… This is a recipe for chaos and chaos is what terrorist networks seek to flourish.”\n\n“Drones are a poor man’s air force, the Afghan Taliban have drones, they have suicide bombers, they are innovative,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/asia/afghanistan-pakistan-border-attack-intl-latam",
      "text": "latest flare-up"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/asia/pakistan-strikes-afghanistan-militant-camps-intl-hnk",
      "text": "bombing"
    },
    {
      "url": "https://www.cnn.com/2025/07/08/asia/icc-arrest-warrant-taliban-leaders-women-intl",
      "text": "secretive leader Hibatullah Akhundzada"
    },
    {
      "url": "https://www.cnn.com/2016/01/20/asia/pakistan-taliban-profile-2016",
      "text": "Pakistani Taliban"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/asia/pakistan-us-afghanistan-weapons-intl-hnk-dst",
      "text": "CNN has reported"
    }
  ],
  "hash": "01f201dbcc7e8085ad61df1295bcd7ed0fe8efaf0add7621984d632767ab7f7c",
  "scraped_at": "2026-02-28T06:59:17.000598+00:00"
}