{
  "url": "https://lite.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
  "title": "Justice Department un-redacts more names in Epstein files after pressure from lawmakers | CNN Politics",
  "date": "2026-02-12T21:32:02.977300+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Justice Department on Monday un-redacted more names in the Jeffrey Epstein files after pressure from lawmakers who reviewed unredacted versions of several records.\n\nRepublican Rep.Thomas Massieof Kentucky, in an interview with CNN’s Kaitlan Collins, said the Justice Department had previously redacted the identities of several people named in a 2019 FBIdocument.\n\nThe newly unredacted names include billionaire business magnate Les Wexner; Epstein’s longtime assistant Lesley Groff; and former French modeling agent Jean-Luc Brunel; each of whom are listed in the document as co-conspirators of Epstein’s.\n\nCNN has reached out to Wexner’s foundation for comment.\n\nWexner is the former CEO of Victoria’s Secret parent company L Brands and previously employed Epstein as a money manager. He has said hesevered tieswith Epstein in 2007.\n\n“The Assistant U.S. Attorney in charge of the Epstein investigation stated at the time that Mr. Wexner was neither a co-conspirator nor target in any respect,” a legal representative for Wexner said in astatementgiven to media outlets in December when Wexner’s name appeared in Epstein documents released by the DOJ. “Mr. Wexner cooperated fully by providing background information on Epstein and was never contacted again.”\n\nAn attorney for Groff, Michael Bachner, said in a statement to CNN that Groff had “never seen this document and was unaware of it.”\n\n“In fact, neither Lesley nor her counsel were ever notified that she was considered a co-conspirator. On the contrary, after Lesley voluntarily spoke with prosecutors, and answered each and every question asked of her, she was told that she was not being prosecuted,” he wrote.\n\nBrunel, meanwhile, was arrested on charges including raping a minor and wasfound dead in his prison cellin 2022. A medical examiner ruled his death was suicide by hanging. He had denied any wrongdoing, and his lawyers said at the time that his death was not due to guilt but rather a “sense of injustice.”\n\nIn a 2019 note to L Brands employees, Wexner disavowed Epstein and denied knowledge of any illegal activity.\n\nIn an onlineexchangewith Massie on Monday night, Deputy Attorney General Todd Blanche said that while the Justice Department had “unredacted Les Wexner’s name from this document,” he was already mentioned in the Epstein documents “thousands of times.”\n\n“DOJ is hiding nothing,” Blanche wrote.\n\nThe Justice Department on Monday revealed another name after pressure from Massie and the other lawmakers who reviewed some of the unredacted material earlier in the day.\n\nIn 2009, Epstein wrote a brief email to a redacted recipient, “where are you? are you ok I loved the torture video.”\n\nMassie said on social media that the email recipient was a sultan. Blanche later wrote in an Xpostto the congressman that the name was unredacted in a separate file and linked to an email from Sultan Bin Sulayem, an Emirati businessman. Bin Sulayem was later also named by lawmakers on the House floor. CNN has reached out to DP World, where he is CEO, for comment.\n\nIt is unclear what “torture video” Epstein is referring to in the email Blanche linked to.\n\nThe Justice Department also revealed several other names listed in a heavily redacted document that lawmakers, including Massie, said were being protected in the files.\n\n“What I saw that bothered me were the names of at least six men that have been redacted that are likely incriminated by their inclusion in these files,” Massie said on Monday, adding that “it took some digging to find them.”\n\nOn Tuesday, California Rep. Ro Khanna, who with Massie sponsored the bill to compel the release of the files, named the six men on the House floor, saying that he had forced DOJ’s hand to disclose the names.\n\nThe Justice Department has not explained why redactions have been made in such a confused and inconsistent way, nor have they addressed why other individuals beyond Epstein were never charged, except to say there was no evidence that would allow them to prosecute anyone else.\n\nBut a source familiar with the process told CNN that many of the emails that are fully redacted are female victims turned co-conspirators or they were email addresses with no name, so the DOJ had to redact per a privacy law. Some of the FBI files were also already redacted.\n\nIn a hearing before Congress last year, FBI Director Kash Patel said there was no credible information that showed Epstein trafficked girls to others.\n\n“If there were, I would bring the case yesterday — that he trafficked to other individuals,” Patel said at the time. “And the information we have, again, is limited.”\n\nA draftindictmentthat was never brought against Epstein but was released by the DOJ last week alleged that from 2001 to 2005, Epstein and three unnamed defendants engaged in a conspiracy to “procure females under the age of 18” to engage “in lewd conduct” for money “to satisfy Jeffrey Epstein’s prurient interests.” The identities of the unnamed defendants are not known publicly.\n\nInstead of bringing the indictment — which included scores of charges — against Epstein and the three unnamed individuals, federal prosecutors in 2007 reached a non-prosecution agreement with Epstein, who avoided federal charges and served 13 months in state prison on prostitution charges.\n\nIn a 2020review, the Justice Department found that former US attorney for the Southern District of Florida Alex Acosta had used “poor judgement” in the deal but did not find that Acosta had engaged in professional misconduct.\n\nCNN’s Paula Reid, Kaanita Iyer and Aileen Graef contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/video/epstein-files-department-of-justice-todd-blanche-rep-thomas-massie-kaitlan-collins-les-wexner-redactions-sultan",
      "text": "Thomas Massie"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00173201.pdf",
      "text": "document"
    },
    {
      "url": "https://www.cnn.com/2019/09/10/business/leslie-wexner-jeffrey-epstein",
      "text": "severed ties"
    },
    {
      "url": "https://www.nbc4i.com/news/local-news/new-albany/wexner-named-as-possible-co-conspirator-in-epstein-files-lawyer-offers-context/",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2022/02/19/europe/jean-luc-brunel-jeffrey-epstein-death-intl",
      "text": "found dead in his prison cell"
    },
    {
      "url": "https://x.com/DAGToddBlanche/status/2021043176350355731",
      "text": "exchange"
    },
    {
      "url": "https://x.com/DAGToddBlanche/status/2021039636831781134?s=20",
      "text": "post"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01703108.pdf",
      "text": "indictment"
    },
    {
      "url": "https://www.cnn.com/2020/11/12/politics/department-of-justice-alex-acosta-epstein",
      "text": "review"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "Cookie Settings"
    }
  ],
  "hash": "022f9701a4f34441290f3b390ef40665c36fa82c8e2295544c09f72f7becb54b",
  "scraped_at": "2026-02-12T21:32:02.977313+00:00"
}