{
  "url": "https://lite.cnn.com/2026/02/16/australia/australia-repatriate-isis-families-syria-intl-hnk",
  "title": "Australia refuses to repatriate ISIS-linked citizens in Syria as escape attempt fails | CNN",
  "date": "2026-02-18T07:32:43.393313+00:00",
  "authors": [
    "Lex Harvey",
    "Sandi Sidhu",
    "Nechirvan Mando",
    "CNN"
  ],
  "text": "Source: CNN\n\nAustralia will not repatriate its citizens with links to Islamic State members, Prime Minister Anthony Albanese told the national broadcaster the ABC Tuesday, with blunt advice to families stranded in Syria: “If you make your bed, you lie in it.”\n\nHis comments followed reports that 34 Australian women and children were turned back by Syrian authorities after they had left the Al-Roj detention camp housing ISIS militants and their families with the aim of returning to Australia via the Syrian capital, Damascus.\n\nRashid Omar, a camp official, told CNN two male relatives of the detained families had arrived at the camp and requested that their relatives be handed over. The men said they had coordinated with Syrian authorities to transfer their family members from the camp to Damascus then onto Australia.\n\nThe camp official said the men showed temporary Australian passports which they said had been issued for the families.\n\n“Based on this, we agreed and transported them by bus. However, shortly after leaving, Damascus informed us that there are no coordination made so they had to turn back to the camp,” Omar said.He said camp officials “don’t understand why they were sent back despite already holding temporary Australian passports.”\n\nWhen asked by the ABC if the detainees had Australian passports, Albanese said he couldn’t confirm “anything about individuals.”\n\n“What I can say is that we’re providing absolutely no support and we are not repatriating people,” Albanese told ABC Radio. “We have no sympathy, frankly, for people who travelled overseas in order to participate in what was an attempt to establish a caliphate to undermine, destroy our way of life.”\n\nIt is not clear why the families were turned back from Damascus and if they will be able to re-attempt the journey.\n\nPressure has been mounting on Australia, the US, the UK and other countries to repatriate thousands of citizens, most of them women and children, who have been trapped in detention camps in Syria since the fall of the Caliphate more than five years ago.\n\nAmnesty Internationaland other NGOS have warned of widespread and systematic human rights abuses in the camps, where they say detainees, many of whom were forcibly trafficked to ISIS or born into the Caliphate, are subjected to torture, gender-based violence, forced disappearance and other atrocities.\n\nSome countries have begun the legally and politically fraught process of repatriating their citizens, but progress has been slow as many governments have been reluctant to act due to national security concerns and domestic opposition.\n\nTheAl-Roj camp, where the 34 Australians have been living, is home toShamima Begum, the London schoolgirl who ran away at the age of 15 to join ISIS in 2015 and was subsequently stripped of her British citizenship.\n\nAustralia has previouslyrepatriated groups of women and childrenwith links to ISIS from Syrian refugee camps in 2019 and 2022.\n\nLast year, two Australian women and four children escaped Syria on their own and returned home via Lebanon without support from Australian authorities,according to the ABC.\n\nIn a statement to CNN, a Australian government spokesperson said the country “is not and will not repatriate people from Syria.”\n\n“Our security agencies have been monitoring – and continue to monitor – the situation in Syria to ensure they are prepared for any Australians seeking to return to Australia,” the spokesperson said.\n\n“People in this cohort need to know that if they have committed a crime and if they return to Australia they will be met with the full force of the law.”\n\nSave the Children has long advocated on behalf of Australian citizens in Syrian detention, and in 2023 took the federal government to court to compel officials to bring them home – and lost. The organization told CNN they are not involved in this recent attempt by the Australians to leave the camp, but urged the government to repatriate them.\n\n“These innocent children have already lost years of their childhood, and deserve the chance to rebuild their lives in safety at home, and to reintegrate into the Australian way of life,” Save the Children Australia CEO Mat Tinkler said in a statement to CNN.\n\nThe collapse of Syria’s longtime dictator Bashar al-Assad in 2024 created further uncertainty for those living in detention camps. Syria’s new government has been pushing the Kurdish-led Syrian Democratic Forces, who fought ISIS alongside the US, out of large swathes of northern Syria, including the detention camps.\n\nLast month,a group of UN expertscalled on “over 50 countries to urgently repatriate, rehabilitate and reintegrate the thousands of foreign nationals in detention, while ensuring accountability in line with international law.”\n\nEarlier this week, theUN Refugee agency saida significant number of residents had left Al-Hol camp, the other major detention camp in Syria, and that the Syrian government plans to relocate them.\n\nSeparately,the US this week said it transferred morethan 5,700 “adult male ISIS fighters” from detention camps in Syria to Iraqi custody. The UN expert group had previously criticized the move, which it said contravened detainees’ rights to due process and subjected them to inhumane prison conditions.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.amnesty.org/en/latest/news/2024/04/syria-mass-death-torture-and-other-violations-against-people-detained-in-aftermath-of-islamic-state-defeat-new-report/",
      "text": "Amnesty International"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/middleeast/syria-kurds-isis-detention-center-roj-intl",
      "text": "Al-Roj camp, where the 34 Australians have been living"
    },
    {
      "url": "https://www.cnn.com/2023/02/22/europe/shamima-begum-ruling-intl-gbr",
      "text": "Shamima Begum"
    },
    {
      "url": "https://www.cnn.com/2022/10/29/world/australia-repatriation-isis-families-syria-camps-intl-hnk",
      "text": "repatriated groups of women and children"
    },
    {
      "url": "https://www.abc.net.au/news/2025-10-03/isis-brides-return-australia-smuggle-syria/105850360",
      "text": "according to the ABC"
    },
    {
      "url": "https://www.ohchr.org/en/press-releases/2026/01/un-experts-urge-restoration-peace-human-rights-and-security-north-east-syria",
      "text": "a group of UN experts"
    },
    {
      "url": "https://x.com/llosa_gonzalo/status/2022996566273921513",
      "text": "UN Refugee agency said"
    },
    {
      "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/4406293/us-forces-complete-mission-in-syria-to-transfer-isis-detainees-to-iraq/",
      "text": "the US this week said it transferred more"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/australia/australia-repatriate-isis-families-syria-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/australia/australia-repatriate-isis-families-syria-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "02bf4174557ea3ba1f7ba8e16a109fe4a6f319fb5e8a7f58ce9ea14075b2c1ad",
  "scraped_at": "2026-02-18T07:32:43.393325+00:00"
}
