{
  "url": "https://lite.cnn.com/2026/02/20/business/egg-prices-farmers",
  "title": "Egg prices have plummeted. That’s great news for consumers — and a crisis for farmers. | CNN Business",
  "date": "2026-02-22T07:11:14.943431+00:00",
  "authors": [
    "Vanessa Yurkevich, CNN"
  ],
  "text": "Source: CNN\n\nEgg prices have been plummeting.\n\nThat’s great news for American shoppers, but bad news for American farmers.\n\nThe average price of a dozen eggs at the grocery store is $2.58, according to the Bureau of Labor Statistics. That’s about half of what many consumers were paying a year ago.\n\nBird flocks have been on the rebound after last year’s avian flu outbreak, but that has farmers suddenly selling at a loss.\n\n“Our farmers have traded one crisis for another,” said Emily Metz, president and CEO of the government-created resource group American Egg Board.\n\nLast winter, the avian flu swept the country, killing 50 million egg-laying birds, according to Metz. Consumer demand held steady as supply dwindled, leading to egg shortages and record prices at the grocery store.\n\nSince then, farmers have worked tirelessly to rebuild their flock and tighten biosecurity with assistance from the US Department of Agriculture. It worked: The supply of eggs has ballooned, and prices fell.\n\nThe cost of eggs for consumers is 34% lower than last year, according to January’s consumer price index. But for farmers, they have too many eggs selling at rock bottom prices.\n\nThe speed at which the prices of eggs went from record highs to recent lows is “remarkable,” said Mike Puglisi, a second-generation egg farmer.\n\n“We appear to be making more eggs than are needed. We got a little break on the (avian flu) outbreaks so people were able to restock and get our flock size back up,” said Puglisi, who owns Puglisi Egg Farms in the eastern United States.\n\nOn average, a farm spends 98 cents to $1.05 to produce a dozen eggs, according to Jada Thompson, an associate professor of agricultural economics at the University of Arkansas. That often doesn’t include operational costs like packaging and transportation, which have risen in the last year.\n\nMeanwhile, wholesale egg prices are trading at 92 cents nationally, according to the USDA, their lowest level in three years.\n\n“Now they’re in a situation where (farmers are) dealing with historic low wholesale prices, which means that they’re producing eggs below the cost of production,” said Metz of the American Egg Board.\n\nPuglisi Egg Farms is a midsized company, producing 486 million eggs a year out of their two farms in Delaware and New Jersey. Puglisi didn’t lose any birds last winter, but he’s still operating at a loss. He says it’s far worse for farmers who lost birds last year.\n\n“It would be tough because you were out of business for that timeframe and now you’re getting back into business just in time to take the losses, which is exactly what I was worried about in 2022 when we got avian flu,” said Puglisi, who lost his entire flock that year. “They could be in precarious position at this point.”\n\nFor smaller producers, the one-two punch of lost birds and low prices could put them out of business.\n\n“We’re seeing farmers who are struggling in the market, and if these conditions persist, we will lose family farms. And that will be devastating to our industry,” said Metz.\n\nFewer farms would swing the pendulum again – back to shortages and higher prices, Thompson said.\n\n“The concern long-term for producers is that, okay, well that company goes out of business, you have less competition. So now we might have shortages of eggs later on,” she said.\n\nAn easy fix would be for consumers to just buy more eggs. But many Americans have bought fewer eggs because of high prices and shortages last year.\n\n“The high prices of eggs changed habits for the consumer and the exporters.  It will take low prices to get consumers to increase their demand, and that will take time,” said Michael Swanson, the chief agricultural economist at Wells Fargo’s Agri-Food Institute.\n\nTo better mitigate the wild swings in price and supply, farmers and agricultural groups are advocating for a vaccine against avian flu. While farms have reported fewer cases this year, the virus is still highly contagious and transmitted through wild birds.\n\nLast year, the USDA announced it would invest $100 million to research and develop vaccines. But the use is controversial. Vaccines don’t protect against the spread of the virus, and the United States is a major exporter of poultry. Many countries won’t accept vaccinated birds.\n\n“Our farmers still need tools in their toolbox to fight this virus and make sure that these highs and lows are mitigated through every possible means,” Metz said. It “will bring a level of certainty and calm to the egg industry that’s desperately needed.”\n\nThe previous version of this story incorrectly stated the number of birds infected with avian flu last year. The correct amount is 50 million.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/business/egg-prices-farmers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/business/egg-prices-farmers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "032533ac5b253c4f3ddaf6aa1d12e81e2a65ff317c1bd41c919ab87a0d663e3d",
  "scraped_at": "2026-02-22T07:11:14.943443+00:00"
}