{
  "url": "https://lite.cnn.com/2026/02/27/politics/scouting-america-pentagon-hegseth",
  "title": "Scouting America will alter its policies to maintain support from the US military, Pentagon says | CNN Politics",
  "date": "2026-03-01T07:08:01.139718+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nScouting America will alter several policies at the urging of the Pentagon, including one targeting transgender youths, Defense Secretary Pete Hegseth announced on Friday as he pushes a campaign against military support for diversity, equity and inclusion efforts.\n\nSome of the changes mirror what the organization suggested to the Defense Department in January, which included discontinuing its Citizenship in Society merit badge and introducing a Military Service merit badge as well as waiving registration fees for the children of military personnel.\n\nUnder Hegseth, the Pentagon has taken aim at the military’s partnership with Scouting America, decrying its historic rebrand in 2024 from the Boy Scouts and other changes in recent years that he sees as part of “woke culture” efforts that he wants to root out.\n\nHegseth said in a videopostedon X that the Pentagon will “vigorously review” the changes the organization has made in six months and will cease its support of Scouting America if it fails to comply.\n\n“We hope that doesn’t happen, but it could,” Hegseth said. “Ideally, I believe the Boy Scouts should go back to being the Boy Scouts as originally founded, a group that develops boys into men. Maybe someday.”\n\nScouting America, which is based in Irving, Texas, didn’t immediately comment.\n\nThe organization beganallowing gay youthin 2013, ended a blanket ban ongay adult leadersin 2015 and announced in 2017 that it would accept transgender students. It began accepting girls as Cub Scouts as of 2018 and into the flagship Boy Scout program — renamed Scouts BSA — in 2019. As of May 2024, more than 6,000 girls had earned the coveted Eagle Scout rank.\n\nThe Pentagon said in a statement earlier this month that it was reviewing its relationship withScouting America, claiming it had “lost its way” in many ways and calling the organization’s diversity, equity and inclusion efforts “unacceptable.”\n\n“Scouting America’s leadership has made decisions that run counter to the values of this administration,” the February 6 statement said, “including an embrace of DEl and other social justice, gender-fluid ideological stances.”\n\nThe Pentagon previously said it and Scouting America were nearing an agreement to continue their partnership if the organization “rapidly implements the common-sense, core value reforms.”\n\n“Scouting America remains far from perfect, but they have firmly committed to a return to core principles,” the statement said. “Back to God and country—immediately!”\n\nThe US military and the Boy Scouts have had longtime ties, including the military providing logistical support for the National Boy Scout Jamboree since its inception in 1937.\n\nThe military also has a long history of sponsoring Scout troops and activities on US military bases and has maintained a strong relationship with the Eagle Scouts, whose members often enlist in the armed forces.\n\nIn a statement last year, Scouting America raised concerns following a report from NPR that the Pentagon planned to cut support for Scouting programs on military bases as well as for the National Jamboree and would eliminate increases in pay grade for Eagle Scouts who enlist.\n\nThe Scouts told Hegseth in January that after hearing his suggestions, they had come up with a plan for him to review, which included discontinuing their Citizenship in Society merit badge and introducing a Military Service merit badge, waiving registration fees for military personnel and holding a ceremony to rededicate themselves to leadership, duty to God, duty to country and service, besides dissolving their DEI board committee.\n\nFounded in 1910, the Boy Scouts of America achieved a vaunted status in the US over the decades, with pinewood derbies, the Scout Oath and Eagle Scouts becoming part of the lexicon.\n\nLore has it that American businessman William Boyce was inspired to start the organization after he became lost in the fog in London and was guided to his destination by a youth who turned down a tip, telling Boyce that because he was a scout (they were formed in Britain in 1907) he couldn’t accept money for a good deed.\n\nSince then, the organization has faced controversies and undergone significant changes.\n\nIn 1990, the organization expelled an Eagle Scout who had become an assistant scoutmaster after discovering he was co-president of his university’s gay and lesbian organization. He sued in 1992 alleging discrimination and lost at the US Supreme Court, which ruled that the Scouts could maintain membership and leadership criteria that excluded gay people.\n\nConservative groups rallied around the Boy Scouts, but scores of institutions curtailed support as the ban continued. The ban ended in 2013. In 2015, the organization ended its blanket ban on gay adult leaders while allowing church-sponsored Scout units to maintain the exclusion for religious reasons.\n\nIn 2017, the Boy Scoutsannounced that they would allow transgender childrenwho identify as boys to enroll in their boys-only programs. That came after an 8-year-old was asked to leave his Scout troop in New Jersey after parents and leaders found out he was transgender.\n\nThe Boy Scouts also faced a flood of sexual abuse claims and sought bankruptcy protection in 2020, when it had been named in about 275 lawsuits and had told insurers it was aware of another 1,400 claims.\n\nIn 2023, a judge upheld the $2.4 billion bankruptcy plan allowing the organization to keep operating while compensating more than 80,000 men who filed claims saying they were sexually abused while in scouting.\n\nLast year, Scouting America’s President and CEO Roger Krone acknowledged some backlash to the rebrand but described the overall response as a positive one that generated wider interest.\n\n“The fact that we were going with a more kind of gender-neutral name, a lot of people kind of wanted to know more about it,” Krone said.\n\nThe organization said it saw a gain in membership of about 16,000 new scouts, less than 2% from the prior year. The organization said at the time that it had just over 1 million members.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://x.com/SecWar/status/2027369564531818827?s=20",
      "text": "posted"
    },
    {
      "url": "https://www.cnn.com/2013/05/23/us/boy-scouts-sexual-orientation",
      "text": "allowing gay youth"
    },
    {
      "url": "https://www.cnn.com/2015/07/27/us/boy-scouts-gay-leaders-feat",
      "text": "gay adult leaders"
    },
    {
      "url": "https://www.cnn.com/2024/05/07/us/boy-scouts-rebrands-scouting-america-reaj",
      "text": "Scouting America"
    },
    {
      "url": "https://www.cnn.com/2017/01/30/us/boy-scouts-transgender-membership",
      "text": "announced that they would allow transgender children"
    }
  ],
  "hash": "0342e280be57aa314dc1ea9661ab177393c90dbc2e25a68f4235db0e48a806dd",
  "scraped_at": "2026-03-01T07:08:01.139730+00:00"
}