{
  "url": "https://lite.cnn.com/2026/02/13/media/don-lemon-arraignment-minnesota",
  "title": "Don Lemon pleads not guilty to federal charges stemming from church protest | CNN Business",
  "date": "2026-02-14T07:06:59.548079+00:00",
  "authors": [],
  "text": "Source: CNN\n\nDon Lemonpleaded not guilty Friday ﻿to federal charges stemming from his presence at a protest at a St. Paul, Minnesota, church last month.\n\nHe appeared in court flanked by his attorneys, wearing a dark suit with a red tie and his signature black-framed glasses.\n\nLemon is charged with two federal crimes: conspiring to violate someone’s constitutional rights and violating the FACE Act, which prohibits the use of force or threats to intentionally interfere with someone expressing their First Amendment right to practice religion.\n\nFederal prosecutors allege Lemon and another independent journalist, Georgia Fort, participated in a “takeover-style attack” of Cities Church and intimidated congregants, after the two livestreamed a group of anti-Immigration and Customs Enforcement protesters rushing into the church on January 18, interrupting the service.\n\n“This isn’t just about me, this is about all journalists, especially in the United States,” Lemon told reporters and a crowd of supporters gathered outside the courthouse following the hearing.\n\n“The events before my arrest and what’s happened since show that people are finally realizing what (the Trump administration) is all about. The process is the punishment with them,” Lemon declared. “I will not be intimidated, I will not back down, I will fight these baseless charges and I will not be silenced.”\n\nFour other defendants were also arraigned Friday for their alleged involvements in the church protest. Each pleaded not guilty.\n\nDuring the hearing, Lemon’s attorney Abbe Lowell said the defense intends to file a motion to get access to the grand jury materials which led to the indictment. A motion to declare the case unconstitutional is also forthcoming, Lowell indicated.\n\nThe journalist and former CNN anchor – who now hosts his own show on YouTube – has vowed to fight the charges. He hired Joseph H. Thompson, a former Minnesota federal prosecutor, to represent him alongside Lowell, according to court records filed earlier this week.\n\nThompson was one of at least six federal prosecutorswho recently resigned from the Minnesota US Attorney’s officeamid tensions with the Trump administration over the investigation into the fatal shooting of Renee Good.\n\nLemon was arrested in a hotel lobby in Beverly Hills on January 29 while he was in Los Angeles to cover the Grammy Awards. More than two dozen agents from Homeland Security Investigations and the FBI arrested him, according to a law enforcement source familiar with the operation.\n\nHe was held overnight in federal custody, and released on his own recognizance the following day.\n\nOn Friday, Lowell asked for the return of Lemon’s phone, which he said was seized after the journalist was “tracked” to Los Angeles. Prior to the hearing, federal officials told Lemon’s attorneys the phone was being sent to Minnesota, Lowell said, but its whereabouts are currently unknown.\n\nOne of the prosecutors confirmed the federal government obtained a search warrant for the phone but is still in the process of executing it. They could not provide an estimated timeline for when the search would be complete and the phone returned to Lemon.\n\nAhead of the hearing, a small group of people rallied outside the courthouse, waving flags, carrying signs and chanting, “Drop the charges, support our press!”\n\nLemon has repeatedly said, even during his live YouTube stream of the church disruption, that he was present at the demonstration as a journalist, not an activist. In footage of the episode, Lemon was heard saying, “I’m just here photographing, I’m not part of the group … I’m a journalist.”\n\nIn a statement Friday, the lead pastor of Cities Church said such a disruption “should never happen again.”\n\n“Our church, like countless others around the world, gathers each Sunday to worship Jesus. Until January 18, 2026, we had done so in peace, grateful for the freedoms we enjoy in this nation,” Jonathan Parnell said after the arraignments. “A group of agitators disrupted our service, accosted our members, and terrified our children,” he said, calling it “wrong” and “shameful.”\n\nThe Justice Department first attempted to charge eight people, including Lemon. A magistrate judge rejected the charges against five of those people –Lemon among them– saying there was insufficient evidence to charge.\n\nThe judge, however, encouraged prosecutors to take the case to a grand jury and seek an indictment. And Lemon on his YouTube show said the government would try again to charge him.\n\n“I have spent my entire career covering the news – I will not stop now,” Lemon said on the steps of the federal courthouse in Los Angeles following his release last month. “In fact, there is no more important time than right now, this very moment, for a free and independent media that shines a light on the truth and holds those in power accountable.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/politics/don-lemon-custody",
      "text": "Don Lemon"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/politics/resignations-minnesota-prosecutors-trump-ice-shooting",
      "text": "who recently resigned from the Minnesota US Attorney’s office"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/don-lemon-justice-department-minnesota",
      "text": "Lemon among them"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/media/don-lemon-arraignment-minnesota",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/media/don-lemon-arraignment-minnesota",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0440ac256386657a16a90aa7c388f45d0188ee86d75d9eee52d72939ca3063cf",
  "scraped_at": "2026-02-14T07:06:59.548092+00:00"
}