{
  "url": "https://lite.cnn.com/2026/02/22/politics/gavin-newsom-book-tour",
  "title": "Gavin Newsom discusses a potential 2028 matchup with Kamala Harris and why his son doesn’t want him to run | CNN Politics",
  "date": "2026-02-23T07:35:47.210158+00:00",
  "authors": [
    "David Wright, CNN"
  ],
  "text": "Source: CNN\n\nCalifornia Gov. Gavin Newsom, launching a book tour widely seen as a prelude to a presidential run, discussed with CNN the possibility of running against former Vice President Kamala Harris, another longtime figure in California politics.\n\n“What happens if and when those parallel careers intersect and collide?” CNN’s Dana Bash asked Newsom in an interview that aired Sunday.\n\n“Well, I’m San Francisco now, she’s LA,” Newsom said at first. “So there’s a little distance between the two of us. You know, fate will determine that.”\n\n“I’ve never gotten in the way of her ambition, ever,” he added. “I haven’t. And I don’t imagine I would in the future.”\n\n“But if you run against each other for president,” Bash followed up. Newsom responded, “Yeah I just – that’s fate. I don’t – you know, you can only control what you can control.”\n\nNewsom has been forthright about his interest in the 2028 presidential race. Harris opted out of running to succeed Newsom as California governor but has left open the possibility of a third presidential bid.\n\nHarris served as district attorney in San Francisco before being elected the California attorney general and then a US senator before serving as vice president. Newsom was San Francisco’s mayor prior to becoming lieutenant governor and then governor.\n\nThe two have collided at times – Harriswrote in her most recent book, “107 Days,”that when she called Newsom to ask for his support after former President Joe Biden ended his reelection bid, Newsom texted back, “Hiking. Will call back,” and never did. (Newsom, who did endorse Harris quickly, later told reporters the call came from an unknown number.)\n\nSpeaking to Bash, Newsom emphasized that he would carefully weigh the decision with his family.  Asked if his family was on board, Newsom responded, “I don’t know. It depends on the day.”\n\nAnd he shared concerns from one of his sons about a potential presidential bid.\n\n“My son … it was very powerful, texted me a few months ago when there was some headline that suggested that I made some decision, and he goes, ‘Dad, are you running (for) president?” Newsom said.\n\nHe continued, “I said, no, we’ll make this decision as a family. And he goes, you can’t. And I said, why? He goes, ‘I’m too young. You need to spend more time with us.’\n\n“I mean, how do you deal with that one?” he said.\n\n“How do you deal with that one?” Bash responded.\n\n“Exactly – I’m asking you,” Newsom replied with a smile.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/19/politics/kamala-harris-book-joe-biden",
      "text": "wrote in her most recent book, “107 Days,”"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/gavin-newsom-book-tour",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/gavin-newsom-book-tour",
      "text": "Cookie Settings"
    }
  ],
  "hash": "05412411485f34e80a0a50ff0fa4404f7332b825584ce7e05c16f5a0dc7d1ce2",
  "scraped_at": "2026-02-23T07:35:47.210170+00:00"
}
