{
  "url": "https://lite.cnn.com/2026/02/24/politics/what-to-watch-sotu-time",
  "title": "What to watch at Trump’s State of the Union address | CNN Politics",
  "date": "2026-02-25T07:32:00.562420+00:00",
  "authors": [
    "Kevin Liptak"
  ],
  "text": "Source: CNN\n\nA lot has changed since President Donald Trump addressed Congress a year ago. But in one area, at least, his State of the Union address Tuesday evening seems likely to resemble his last visit to the House chamber.\n\n“It’s going to be a long speech,” he said, after delivering the longest joint session address in history last March. “We have so much to talk about.”\n\nAfter a year of political upheaval and declining popularity, Trump certainly has plenty to discuss when he climbs the rostrum Tuesday at 9 p.m. ET. Traditionally a laundry list of both accomplishments and policy prescriptions, the State of the Union is typically a president’s largest television audience of the year.\n\nFor Trump, who appears in various settings on television multiple times a week, the challenge will be to break through beyond the boasts, grievances and vague promises that comprise his usual events.\n\nIn some ways, the president and his team are looking to the speech as a reset after a bruising stretch. He’ll make several new policy announcements, including proposing new tax cuts. He has been reviewing the speech with advisers for the last several days and did some practice runs from a lectern, according to people familiar with the prep.\n\nHe is expected to come to the address with at least a few surprises, both contained in his remarks and in the form of guests sitting up in the galleries. Trump has invited his own set of guests reflecting his priorities, a break from typical precedent, which are separate from those of first lady Melania Trump.\n\nHere are four things to watch for in Trump’s speech:\n\nTrump will enter the House Chamber on Tuesday looking to defy historic expectations: as he frequently says, incumbent presidents’ parties often suffer in midterm elections.\n\nAnd Republicans are hoping his speech acts as a messaging kickoff for a campaign season that could very well hinge on Trump’s own standing among American voters.\n\nDuring a closed-door political strategy session last week among top Trump officials, pollsters and strategists made the (perhaps unsurprising) point that economic issues will dictate November’s election — and that focusing there is imperative. In a CNN poll taken before the speech, 57% of Americans named the economy and cost of living issues as the most important issue for Tuesday’s speech.\n\nThe official theme of his speech is “America at 250: Strong, Prosperous and Respected.” Trump is expected to argue that he ushered in a new age of American prosperity during the first year of his second term, with plans to reference specific stories from ordinary Americans who say the president’s policies have helped them. He’ll also offer new proposals meant to lower costs.\n\nAt least, that’s what’s in the written speech. Trump, however, often has different plans. Even events ostensibly focused on the economy end up meandering in other directions, including his immigration crackdown and old gripes about people he dislikes.\n\nWhen he does discuss the economy, it is often to boast about its relative strength — an approach some GOP advisers worry risks downplaying Americans’ economic worries.\n\nTuesday’s speech will be carefully scripted with references to cost-saving initiatives, including lowering prescription drug prices and cutting taxes. But many Americans still say the economy isn’t working for them — providing a test for Trump in acknowledging there’s still work to do.\n\nFour days before Trump’s State of the Union, the Supreme Court dealt a blow to one of the pillars of his agenda: the unilateral tariffs he’s used as leverage around the world, on both trade and his broader foreign policy.\n\nTrump insists he has backup options. He’s already announced he would apply a 15% global tariff using a different — but untested — authority. Still, the decision was a blow, evoking significant outrage from Trump even days later, and almost certainly forced some changes to the remarks he was planning to deliver.\n\nOne major problem for Trump arising from the court’s ruling was the litany of policy items he’s claimed would be paid for by the tariffs. That includes a $12 billion bailout for farmers announced last year and $2,000 rebate checks for Americans, the timing of which was never announced.\n\nHow Trump addresses the apparent shortfalls of his past promises remains an open question.\n\nTraditionally, at least a handful of Supreme Court justices attend the State of the Union, often seated near the front. After Friday’s decision, Trump railed against those who ruled against him, in particular the two conservatives he appointed, Neil Gorsuch and Amy Coney Barrett.\n\nIf they opt to attend, it could provoke another tirade from the president.\n\nThe massive military buildup around Iran, and Trump’s threats of war against the country, will make for a tense backdrop to Tuesday’s speech. While the president has hinted at pursuing regime change, and insisted Iran not obtain a nuclear weapon, he has yet to lay out to the American people what might justify a prolonged conflict.\n\nIt seems unlikely he would use the State of the Union to make such an argument. His advisers have planned a mostly domestic speech. And in CNN’s poll, only 2% of respondents said they wanted to hear from the president on foreign policy in his address — the lowest of any issue.\n\nStill, while it won’t be the centerpiece of his State of the Union address, Trump is expected to spell out some of his thinking about Iran during his speech, according to people familiar with the matter, as he considers new strikes in the country.\n\nthe rumblings of war have led to questions about what authorities the president would rely upon to stage a new attack on Iranian leaders or facilities. He has not made any formal attempt to gain buy-in from Congress, which holds the constitutional authority to declare war.\n\nTrump is perhaps more likely to recount last year’s mission to take out Iran’s nuclear facilities, something he frequently boasts about when he ticks through the accomplishments of his first year back in office.\n\nYet that may raise questions about pending action in Iran. While Trump claims the nuclear facilities were “totally obliterated,” he is now suggesting further strikes might be necessary to prevent Tehran from obtaining a nuclear weapon.\n\nAfter a chaotic and disjointed response to last year’s address — which included the cane-waving Rep. Al Green being ejected from the chamber — Democrats are hoping this year to appear more united in their opposition to Trump’s message.\n\nThe official party response will come from Virginia Gov. Abigail Spanberger, whose speech from Colonial Williamsburg seems likely to address the issue of protecting American Democracy as the country approaches its 250th birthday.\n\nSpanberger, who swept into the governor’s mansion last year after a 15-point win, offered what many Democrats hope is a preview of a winning election season. She said she would address “rising costs, chaos in their communities, and a real fear of what each day might bring.”\n\nBut the assignment is among the most fraught in politics. Many in both parties who have been selected for the official response find themselves at best forgotten, and at worst ridiculed, in the aftermath.\n\nSome Democrats in Congress are planning to skip Trump’s speech altogether, choosing to attend various counter-rallies instead.\n\nBetsy Klein contributed to this report.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/what-to-watch-sotu-time",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/what-to-watch-sotu-time",
      "text": "Cookie Settings"
    }
  ],
  "hash": "058268d69f164b31e42242b20998375969a315eba082562e0ac5b1c94045b852",
  "scraped_at": "2026-02-25T07:32:00.562431+00:00"
}