{
  "url": "https://lite.cnn.com/2026/02/23/investing/us-stocks-trump-tariffs",
  "title": "Dow tumbles more than 800 points as tariff uncertainty and AI disruption fears roil markets | CNN Business",
  "date": "2026-02-24T07:31:42.923285+00:00",
  "authors": [
    "John Towfighi, CNN"
  ],
  "text": "Source: CNN\n\nStocks fell, gold moved higher and volatility picked up Monday as uncertainty about President Donald Trump’s new proposed tariffs and nerves about artificial intelligence weighed on Wall Street.\n\nThe Dow closed lower by 823 points, or 1.66%, and posted its worst day in one month. The broader S&P 500 fell 1.04%, and the tech-heavy Nasdaq Composite sank 1.13%.\n\nAfter the Supreme Court on Fridaystruck downthe tariffs Trump had levied using an emergency powers law, the president over the weekend announced he would hike tariffs to anew level of 15%on imports into the United States via different legal authority.\n\nThe renewed focus on tariffs, in addition to confusion aboutpotential refunds, is clouding the outlook for stocks. Wall Street’s fear gauge, the VIX, jumped 12% Monday and surpassed 20 points, a threshold that signals elevated volatility in markets.\n\n“The push and pull with tariffs is likely to be a distracting theme for markets for the remainder of the year, albeit with less volatility than the initial shock last April,” Michael Landsberg, CIO at Landsberg Bennett Private Wealth Management, said in a note.\n\nWhile investors are grappling with new tariff announcements, Wall Street is also wrestling with lingering weakness in technology and AI stocks. The tech-heavy Nasdaq is down roughly 5.8% since hitting a record high in late October.\n\nFears ofAI disruptioncontinue to weigh on markets. Citrini Research on Sunday published a report on Substack laying out hypothetical scenarios for how developments in AI could disrupt certain parts of the economy. Stocks that were mentioned in the report tumbled on Monday.\n\nAmerican Express shares (AXP) sank 7.2% and had their worst day since April. Shares of DoorDash (DASH) and private equity firm KKR (KKR), two other companies named in the post, sank 6.6% and 8.89%, respectively.\n\nSeparately, IBM shares (IBM) dropped 13.15% and had their worst day since 2000 after Anthropic published a blog post about how its AI tool Claude can help “break the cost barrier” to modernizing the popular COBOL (Common Business-Oriented Language) computer programming language.\n\nMore than 60% of stocks in the S&P 500 closed lower Monday. Stocks had eked out a gain on Friday, but sentiment weakened over the weekend as Trump said he would hike his new proposed tariff from 10% to 15%.\n\nGold, considered a haven amid uncertainty, rose 3.4% and climbed above $5,200 a troy ounce. “Fear” was the sentiment driving markets, according toCNN’s Fear and Greed Index.\n\nLingering concerns aboutprivate creditas well as US-Iran tensions also added to market jitters, according to Matt Maley, chief market strategist at Miller Tabak + Co.\n\n“With so many uncertainties coming to a head at the same time, it’s not a big surprise that stocks are experiencing some weakness,” Maley said in an email.\n\nBitcoin dropped more than 4% across the past day and hovered around $64,600. The cryptocurrencycontinues to languishthis year and is down almost 50% since its record high above $126,000 in early October.\n\nThe US dollar slightly weakened against other major currencies. Treasury yields fell as investors scooped up bonds.\n\n“The key issue for markets is not just the tariff level itself, but the unpredictability surrounding what comes next,” Daniela Hathorn, senior market analyst at Capital.com, said in a note.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
      "text": "struck down"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "new level of 15%"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
      "text": "potential refunds"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/ai-disruption-fears-us-stocks",
      "text": "AI disruption"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/AXP",
      "text": "AXP"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/DASH",
      "text": "DASH"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/KKR",
      "text": "KKR"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/IBM",
      "text": "IBM"
    },
    {
      "url": "https://www.cnn.com/markets/fear-and-greed",
      "text": "CNN’s Fear and Greed Index"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/business/what-is-blue-owl-private-credit",
      "text": "private credit"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/investing/bitcoin-price",
      "text": "continues to languish"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/investing/us-stocks-trump-tariffs",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/investing/us-stocks-trump-tariffs",
      "text": "Cookie Settings"
    }
  ],
  "hash": "05e98c9d7cf0b91c52cc60a59cc0fe5220827a0cd09632eee5ac9d7aec6c12f0",
  "scraped_at": "2026-02-24T07:31:42.923298+00:00"
}