{
  "url": "https://lite.cnn.com/2026/02/13/economy/trumps-immigration-jobs-hiring",
  "title": "Why Trump’s immigration crackdown isn’t boosting hiring | CNN Business",
  "date": "2026-02-15T07:12:55.984305+00:00",
  "authors": [],
  "text": "Source: CNN\n\nOn the surface, the Trump administration’s bet on immigration and jobs seems like simple math: If a swath of workers are removed from the country, employers will need to turn to the workers still in the United States to backfill those jobs.\n\nThat’s not what’s happening, though. American workers, citizen or not, are seeing slower wage growth, fewer job openings and a higher unemployment rate.\n\nAs it turns out, there are a lot of complicated factors keepingunemployed Americans on the sidelines. ﻿Chief among them is lower demand overall fromremoving people from the United Statesand stopping new immigrants from entering.\n\n“In President Trump’s first year in office, all job growth went to American-born workers while job growth declined for foreign-born workers,” White House spokeswoman Taylor Rogers told CNN in a statement.\n\nOne million new jobs went to native-born workers, while foreign employment declined by 100,000 during Trump’s first year, according to Labor Department data. “The President continues to deliver on his promise to put American workers first,” Rogers said.\n\nLast year, between 200,000 and more than 1 million immigrants in the United States stopped working, according to differentanalysesof Census Bureau data.\n\nThe decline came as the Trump administration ramped up deportations and staged raids everywhere fromcar factoriestoHome Depot parking lotsin search of people who entered the country illegally.\n\nBut as immigrants left the workforce, the unemployment rate for native-born Americans didn’t fall. In fact, the rate jumped to 4.7% in January from 4.1% the year before, according to Wednesday’sjobs report. That not only exceeds the overall unemployment rate of 4.3%, but also the 4.6% rate for foreign-born workers.\n\nMeanwhile, January’s average hourly earnings for private-sector workers rose more slowly than last year.\n\nRemoving people from the countryled to fewer workers and fewer people to buy the goods and services those workers produced, said Stan Veuger, a senior fellow at the conservative-leaning American Enterprise Institute.\n\n“As net migration goes down and as deportations from the interior go up, you’re not just losing workers, you’re also losing people on the demand side,” Veuger told CNN. “You’re losing customers of businesses that hire workers.”\n\nEven when jobs don’t get eliminated entirely due the immigration crackdown, that doesn’t mean more employment for the people who are left.\n\nIn some sectors, native-born workers aren’t necessarilyrushing in for jobs, even if they’re currently unemployed, said Joe Brusuelas, chief economist at RSM.\n\n“Immigrants are willing and able to do jobs that the overwhelming majority of our native-born population are simply not willing to do,” he said.\n\nAgriculture, for example, relies on a labor force that’smostly foreign-born. Nearly a quarter of all farming workers in 2023 were immigrants unauthorized to be in the country, according to ananalysispublished last year by Pew Research Center.\n\n“It’s about a mixture of preferences, skills and advanced education among the native-born population that works against oversimplified ideas about creating artificial scarcity via labor supply that automatically preferences domestic-born workers,” Brusuelas told CNN.\n\nTariffs are having an impact on employment, too.\n\n“Trump’s trade policy, and even more importantly, trade policy uncertainty, is putting downward pressure on those industries,” said Wendy Edelberg, a senior fellow at the liberal-leaning Brookings Institution.\n\nGiven how frequently Trump changes tariff rates, employers have beenhesitant to take on more workers.\n\nIn some sectors, they’ve had to resort to layoffs as well, in part because of the added expense of tariffs.\n\nManufacturinghas taken an especially big hit over the past year, laying off nearly 100,000 workers. Firms have had to pay more for raw materials like steel and aluminum, which are being tariffed at 50%. They’ve also seen customers push off orders due to the higher costs.\n\nNative-born American workers are also contending with employers looking for automated solutions, like AI, to deal with all those pressures.\n\nThe drive to improve productivity with AI is partly to blame for Amazon’s two rounds ofmassive layoffsover the past few months. And it’s hardly the only business.\n\nIn the Federal Reserve’s Beige Book, a collection of business anecdotes amassed by the 12 regional banks, the Boston Fed called attention to an IT services firm that “paused hiring plans as it considered using AI instead.”\n\nThe Atlanta Fed noted an even more widespread impact, saying, “several contacts described accelerating the use of AI to increase productivity and to manage head count.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/economy/us-labor-market-outcomes",
      "text": "unemployed Americans on the sidelines"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/01/09/us/dhs-immigration-crackdown-ice-arrests-protests-vis/index.html",
      "text": "removing people from the United States"
    },
    {
      "url": "https://www.pewresearch.org/short-reads/2025/08/21/key-findings-about-us-immigrants/",
      "text": "analyses"
    },
    {
      "url": "https://www.cnn.com/2025/11/14/us/hyundai-georgia-raid-korean-workers-back-hnk",
      "text": "car factories"
    },
    {
      "url": "https://www.cnn.com/2025/06/13/business/ice-workplace-raids-home-depot",
      "text": "Home Depot parking lots"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "jobs report"
    },
    {
      "url": "https://www.cnn.com/2025/08/28/politics/ice-deportations-immigrants-trump",
      "text": "Removing people from the country"
    },
    {
      "url": "https://www.cnn.com/2024/03/21/business/construction-industry-needs-immigrant-workers",
      "text": "rushing in for jobs"
    },
    {
      "url": "https://www.cnn.com/2025/08/06/us/oregon-cherry-harvest-immigrant-worker-shortage",
      "text": "mostly foreign-born"
    },
    {
      "url": "https://www.pewresearch.org/race-and-ethnicity/2025/08/21/u-s-unauthorized-immigrant-population-reached-a-record-14-million-in-2023/",
      "text": "analysis"
    },
    {
      "url": "https://www.cnn.com/2026/01/10/economy/tariffs-economic-impact",
      "text": "hesitant to take on more workers"
    },
    {
      "url": "https://www.cnn.com/2025/12/17/economy/jobs-trump-manufacturing-trade",
      "text": "Manufacturing"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/tech/amazon-layoffs-ai",
      "text": "massive layoffs"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/economy/trumps-immigration-jobs-hiring",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/economy/trumps-immigration-jobs-hiring",
      "text": "Cookie Settings"
    }
  ],
  "hash": "05f1a9c290571ac830dae6fd3a20d18fde5d70e66ea7c785ab24077359c9f3ba",
  "scraped_at": "2026-02-15T07:12:55.984319+00:00"
}