{
  "url": "https://lite.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
  "title": "The US economy added a stronger-than-expected 130,000 jobs last month | CNN Business",
  "date": "2026-02-11T16:31:13.339068+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nHiring picked up as 2026 kicked into gear, with the US economy adding a stronger-than-expected 130,000 jobs last month and the unemployment rate dropping to 4.3%, according to new Bureau of Labor Statistics data released Wednesday.\n\nEconomistswere expectingthat employers added about 75,000 jobs in January and that unemployment held steady at 4.4%, according to FactSet estimates.\n\nIt’s the strongest month of employment gains since December 2024, potentially fueling optimism the US labor market has turned a corner after a year of weak job gains that a BLS annual revision on Wednesday showed were even worse than first reported.\n\n“The latest data show hiring came out of the gate stronger than expected to start the year,” Daniel Zhao, chief economist with Glassdoor, wrote in commentary issued Wednesday. “After a slow start in the first leg, the labor market may be finding its footing now.”\n\nStill, economists had cautioned that January’s employment gains would likely be lifted by seasonal and weather-related factors and that longstanding concerns – including lack of broad-based job gains, weak demand and broad uncertainty – continue to weigh heavily on the jobs market.\n\nThe report suggests the labor market is stabilizing, Josh Hirt, senior economist at Vanguard, told CNN in an interview. But it’s too early to say the market is reaccelerating yet.\n\nNotably, in January, the vast majority of the month’s employment gains came from the health care and social assistance sector (123,500 jobs added). Health care, buoyed by an aging population, drove job growth last year while most other industries were in a “hiring recession,” as dubbed by Heather Long, Navy Federal Credit Union senior economist.\n\nWednesday’s report, which was delayed a few days because of the brief government shutdown, also provided more clarity on recent labor market trends: Job growth last year was far weaker than previously estimated, following annual data revisions.\n\nThe latest revisions – including an annual benchmarking, a yearly update of seasonal adjustment factors, and a recalibration of how the BLS captures employment changes at new and closed businesses – show that the US economy added just 181,000 jobs in 2025, versus 584,000 as previously estimated.\n\nLast year was already theweakest year of employment gainsoutside of a recession since 2003, but the gains now average just 15,000 jobs per month –versus 50,000 per month previously – after those and other revisions, BLS data shows.\n\nJanuary jobs reports typically feature data revisions to include more comprehensive employment figures that come in after the initial survey-based reports.\n\nThe most significant of these adjustments is the annual benchmark revision, which squares the monthly payroll estimates from employer surveys (a more timely read on the labor market with some cost to accuracy) with the Quarterly Census of Employment and Wages program, which is fed with data derived from state unemployment insurance tax records (heavily lagged but provides a near-complete employment count).\n\nThe latest annual benchmark revision showed that there were 898,000 fewer jobs added between April 2024 and March 2025. On a not seasonally adjusted basis, the downward revision was 862,000 – the second-largest negative adjustment on record behind a downward revision of 902,000 in 2009, according toBLS data that goes back to 1979.\n\nSuch large swings, positive or negative, typically occur when the economy suddenly changes and in volumes that seemingly well-tuned models and surveys can’t capture as quickly.\n\nThe likeliest contributors to last year’s large swing included declining survey response rates, models that previously didn’t accurately capture jobs created and those lost at new and closed businesses, and misreporting issues (such as counting contract or informal workers or initially reporting more immigrant workers in the surveys than unemployment insurance reports.\n\nThis story is developing and will be updated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/economy/us-jobs-report-january-preview-revisions",
      "text": "were expecting"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/economy/us-jobs-report-final-december",
      "text": "weakest year of employment gains"
    },
    {
      "url": "https://www.bls.gov/web/empsit/cestn.htm#tb5",
      "text": "BLS data that goes back to 1979"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "Cookie Settings"
    }
  ],
  "hash": "061307cab1fed4e5bc2d0705a1093aae5c6b1105089fcf27aa2a0c8ec596956a",
  "scraped_at": "2026-02-11T16:31:13.339080+00:00"
}