{
  "url": "https://lite.cnn.com/2026/02/24/americas/mexico-searching-mothers-nancy-guthrie-latam-intl",
  "title": "A group of Mexican mothers with years of experience looking for missing people joins Guthrie search | CNN",
  "date": "2026-02-25T07:31:41.815471+00:00",
  "authors": [
    "Valeria León",
    "Michael Rios",
    "Norma Galeana"
  ],
  "text": "Source: CNN\n\nA group of Mexican mothers with years of experience looking for missing people in Mexico’s Sonora state has arrived in Arizona to help in the search forNancy Guthrie.\n\nInitially, the Madres Buscadoras de Sonora (Searching Mothers of Sonora) applied for a permit to carry out a field search in the Arizona desert. They had hoped to start on Tuesday, but the local sheriff denied the application on the grounds it could disturb the official investigation.\n\nThe Madres – a national network comprised of volunteers, mothers and wives – are undeterred, however. Some of them have traveled to Arizona to distribute flyers bearing Guthrie’s image while others have remained in Mexico to search in the border town of Nogales.\n\nThe presence of the group in Arizona comes as the search for Guthrie – the 84-year-old mother of “Today” show host Savannah Guthrie – enters its fourth week. Guthrie was last seen on January 31 before she was apparently kidnapped from her secluded home in Arizona’s Catalina Foothills outside of Tucson, about 60 miles from the Mexican border.\n\nOn Tuesday, Savannah Guthrie announced in a video on Instagram that the family isoffering up to $1 millionfor information leading to their mother’s recovery. The video was the first statement from the Guthrie family in over a week.\n\nThough the case continues to draw significant attention, authorities’ investigative updates have slowed.\n\n“We are here to assist in any way we can,” the organization’s leader Cecilia Flores told CNN. “We will do everything in our power to help this family. Nancy is a mother who deserves to be reunited with her family.”\n\nThe group says they were asked to help by a friend of the Guthrie family. However, their presence hasn’t been welcomed by some locals – particularly after some of them carried out a limited search of a creek bed near the Guthrie home.\n\n“The neighbors came out yelling at us and telling us to leave, that it was private property,” said Lupita Tello, one of the Madres.\n\n“We want to explore the surrounding area, the exits, everything, even the main exits from the main streets,” she said, but added that they hadn’t been able to do a “proper search because of the regulations here.”\n\n“I respect the laws and the rules, but I don’t know where we could search without running into problems with people, because people just don’t cooperate,” Tello added.\n\nAsked about the Madres, the Pima County Sheriff’s Department told CNN, “We appreciate their concern … and we all want to find Nancy, but this work is best left to professionals.”\n\n“(We have) volunteer opportunities if they wish to get involved with the department,” it added. “Private property laws apply. It is up to each individual property owner to grant permission for anyone to be on their property.”\n\nFlores started Madres Buscadoras de Sonora afterher three sons disappearedin 2015 and 2019. All three are thought to have been abducted by organized criminal groups, which has become a growing crisis in Mexico.\n\nSince its founding in 2019, the group has grown into a national network that has helped locate more than 5,000 people across the country, alive and dead.\n\nThe group has extensive experience carrying out field searches in remote areas, where drug cartels often dispose of their victims, though Flores stresses that many searches are ultimately unsuccessful, leaving a painful uncertainty for families – as she has herself experienced.\n\nFlores said one of her sons was eventually returned by his abductors, and she’s still holding out hope that she will find her two other missing children.\n\nShe told CNN that pain and uncertainty is often what keeps searchers going, despite the toll on their health.\n\n“Every day, hope slowly fades,” Flores said. “The body gets tired. And the truth is, this desperation is so great that we are getting sick day by day.”\n\nWhile Flores’ group is also searching for signs that Guthrie might have been taken to Mexico, Mexican authorities have rejected the possibility.\n\n“The FBI informed us that they currently have no leads to suggest that this woman could be in Mexico,” Carlos Flores, general commissioner of the Criminal Investigation Agency for the State of Sonora, told reporters on February 19.\n\nSonora’s attorney general, Gustavo Rómulo Salas, added that they have not received any request from the FBI to search for her on Mexican soil.\n\nOfficials on both sides of the US-Mexico border had previously been told to be on the lookout for clues that might assist in the case as part of standard investigative procedures, according to a law enforcement official familiar with the matter. Investigators briefed US Border Patrol agents and Mexican law enforcement authorities, the official said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/timeline-nancy-guthrie-search",
      "text": "Nancy Guthrie"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/nancy-guthrie-masked-suspect-video-details",
      "text": "offering up to $1 million"
    },
    {
      "url": "https://cnnespanol.cnn.com/2024/07/13/ceci-flores-madre-buscadora-desaparecidos-mexico-orix",
      "text": "her three sons disappeared"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/americas/mexico-searching-mothers-nancy-guthrie-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/americas/mexico-searching-mothers-nancy-guthrie-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "063c3718f5336fbe619f1310532220f9e32837566141ab4d8bd9685728392b94",
  "scraped_at": "2026-02-25T07:31:41.815484+00:00"
}