{
  "url": "https://lite.cnn.com/2026/02/23/us/delta-flight-engine-fire-savannah-airport-hnk",
  "title": "Delta flight returns to Savannah airport after engine trouble sparks grass fire | CNN",
  "date": "2026-02-24T07:32:25.006795+00:00",
  "authors": [
    "Sana Noor Haq",
    "Diego Mendoza",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Federal Aviation Administration is investigating after a Delta Air Lines flight from Savannah, Georgia, to Atlanta was forced to turn back Sunday night due to engine trouble, sparking a large grass fire near the airport runway.\n\nDelta flight 1067, a Boeing 737-900, had just taken off from Savannah/Hilton Head International Airport around 6:45 p.m. Sunday when the pilot declared an emergency.\n\n“Everything ok? I saw a pretty large flame on takeoff,” an air traffic controller asked the pilot, heard in a radio recording on Broadcastify.\n\n“We lost left engine straight out here for Delta 1067,” the pilot can be heard saying.\n\nThe controller acknowledges the grass fire shortly after, telling another plane on the runway to move﻿, saying “we’re going to get a fire truck out there, that whole taxiway is on fire.”\n\nThe pilot of flight 1067 later asks: “This fire. Is it related to the runway? Is it what just happened with our airplane, or is it something different?”\n\nThe controller replied, “Unfortunately, when the engine blew, it set the whole grass on the left side of the airport on fire.”\n\nThere were 179 customers, 2 pilots and 4 flight attendants on board, according to Delta. No one was injured.\n\n“Delta flight 1067 from Savannah to Atlanta returned to the airport soon after takeoff Sunday evening, following a mechanical issue with the aircraft’s left engine,” the airline said in a statement.\n\n“The Boeing 737-900 landed safely and was met by fire trucks, with customers deplaning at the gate,” Delta said.\n\nThe flight landed back at the airport at 7:12 p.m., according to flight trackerFlightAware.\n\nVideo shared on social media showed large rings of fire alongside the runway, with a thick, orange haze on the horizon. In one video, breakneck winds can be heard.\n\nPassengers Mary Muff and Jeanne Miraglia told CNN affiliateWTOChow they heard a large boom around take off.\n\n“The pilot came on saying the engine had blown, but we have another good engine,” Miraglia told WTOC.“And we’re gonna be fine and told us what to look for - fire trucks, grass fires, and things like that.”\n\nEmergency response teams, including firefighters, were called to the scene Garden City Fire Rescue said onFacebook. The department said it was operating in coordination with the Savannah Fire Department, Pooler Fire-Rescue and 165th Airlift Wing Fire Department.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.flightaware.com/live/flight/DAL1067/history/20260222/2156Z/KSAV/KSAV",
      "text": "FlightAware"
    },
    {
      "url": "https://www.live5news.com/2026/02/23/grass-fire-reported-near-savannahhilton-head-international-airport/",
      "text": "WTOC"
    },
    {
      "url": "https://www.facebook.com/GardenCityFireRescueGA/posts/pfbid02Jf8RgYvLQY7w8kMKjwf9BFJUwUX1taiBFrnXF1Kd7FBgwFCiRQfhaVF69PqBDhcHl",
      "text": "Facebook"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/delta-flight-engine-fire-savannah-airport-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/us/delta-flight-engine-fire-savannah-airport-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "067fdd88f7196ad9eace29b386af8553d429430b9aebf81d8d1fa234a23a4363",
  "scraped_at": "2026-02-24T07:32:25.006808+00:00"
}