{
  "url": "https://lite.cnn.com/2026/02/17/politics/fulton-county-ballots-justice-department",
  "title": "Fulton County accuses Justice Department of misleading the judge who approved elections office search warrant | CNN Politics",
  "date": "2026-02-19T07:32:45.321831+00:00",
  "authors": [
    "Tierney Sneed, CNN"
  ],
  "text": "Source: CNN\n\nOfficials in Fulton County, Georgia, accused the Justice Department of making “serious” omissions in the application the FBI filed to obtain a search warrant for2020 election ballotslast month.\n\nThe local officials, who are seeking the return of the election materials, wrote in a court filing Tuesday that “instead of alleging probable cause to believe a crime has been committed,” the FBI’s application “does nothing more than describe the types of human errors that its own sources confirm occur in almost every election—without any intentional wrongdoing whatsoever.”\n\nFulton Countybashed the FBI for not informing the magistrate judge who approved the warrant that the allegations of election “defects” it was putting forward had been previously investigated. The local officials also took the FBI to task for not including information in the application that would cast doubt on the credibility of the witnesses that the federal criminal probe apparently is relying on.\n\nCNN reached out to the Justice Department for comment. The FBI declined to comment.\n\nKurt Olsen, a 2020 election denier now serving in the White House who made the referral that launched the criminal probe, has been sanctioned by multiple courts, the new Fulton County filing noted. The county also argued that other witnesses the affidavit cited lacked election administration expertise or reached conclusions based on speculation.\n\nThe seizure of the election materials last month came as President Donald Trump has remained fixated on the false idea that the 2020 vote was rigged against him. A federal judge will hold a hearing next week on the county’s request that those materials be returned. The judge previously granted the county’s request to unseal the warrant application materials, including an affidavit by an FBI agent that revealed the search was being justified with long-standing and already-scrutinized claim.\n\nFulton County responded to those allegations Tuesday with a declaration from Ryan Macias, an election technology and security expert who has worked on thousands of elections.\n\nHe said the FBI’s affidavit was full of “gross mischaracterizations of the facts of how elections work and are directly at odds with the findings and conclusions of all of the prior investigations of the November 2020 election in Fulton County.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
      "text": "2020 election ballots"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/fulton-county-election-office-fbi-warrant",
      "text": "Fulton County"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
      "text": "Kurt Olsen"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/fulton-county-ballots-justice-department",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/fulton-county-ballots-justice-department",
      "text": "Cookie Settings"
    }
  ],
  "hash": "068a029bb621368c2bfda6f45a0e5380e689e53b30065839d6844a8cb8de7e41",
  "scraped_at": "2026-02-19T07:32:45.321845+00:00"
}