{
  "url": "https://lite.cnn.com/2026/02/24/us/tyler-robinson-case-prosecutors-charlie-kirk",
  "title": "Tyler Robinson: Judge declines to dismiss prosecutors from the case against alleged Charlie Kirk shooter Tyler Robinson | CNN",
  "date": "2026-02-25T07:32:27.217461+00:00",
  "authors": [
    "Elizabeth Wolfe",
    "Andi Babineau"
  ],
  "text": "Source: CNN\n\nA Utah County prosecutor’s office will be allowed to continue building its death penalty case against Charlie Kirk’s alleged killer, Tyler Robinson, despite the defense’s claims that it mishandled a potential conflict of interest.\n\nRobinson’s defense attorneys had asked for the entire Utah County Attorney’s Office to berecused from the case, arguing that the presence of a lead prosecutor’s child at the event where Kirk was assassinated had tainted the office’s decisions. But a judge on Tuesday ruled the child’s attendance “did not materially influence” prosecutors’ actions.\n\nDuring a split two-day hearing earlier this year, deputy attorney Chad Grunander testified his child attended the Turning Point USA event where Kirk was shot last year. The 18-year-old, who is a student at Utah Valley University where the event was held, did not see the fatal moment or witness anybody in the crowd who may have been a suspect, prosecutors argued.\n\nIn the hours and days following the shooting, Grunander informed many of his colleagues that his child was present, he said. Even so, Utah County Attorney Jeffrey Gray appointed Grunander as one of the attorneys tasked with prosecuting Robinson.\n\nGray told the court he believes the child’s presence was “completely irrelevant” to decisions made in the case, including the choice to pursue the death penalty against Robinson.\n\nUtah District Court Judge Tony Graf appeared to agree in his ruling Tuesday.\n\n“The court is unpersuaded that Mr. Grunander’s relationship with (his child) creates an appearance of bias in this case,” Graf told the court.\n\nGraf determined the child had “no unique, relevant information” about Kirk’s killing that would lead them to be called as a potential witness at trial.\n\nProsecutors have said they have no plans to call the child as a witness. Graf told Robinson’s defense team that they may subpoena the child if they believe the teenager’s testimony is relevant to the case.\n\nThe Utah County Attorney’s Office disclosed the possible conflict to Robinson’s team on October 20, a little over a month after Kirk was killed, Gray testified.\n\nBut Robinson’s defense attorney, Richard Novak, insisted Gray has taken an “inappropriately casual approach” to the issue. He argued Grunander should have been sequestered from the case, and defense attorneys should have been immediately notified of the potential conflict.\n\n“The decision as to what charges to file, the decision as to whether or not to seek the death penalty, should never, ever have been made in consultation with Mr. Grunander,” Novak said in closing arguments.\n\nBut the judge concluded there is no evidence that Gray’s choice to pursue the death penalty was influenced by Grunander’s concern for his child’s safety.\n\nNovak fought for the full recusal of the attorney’s office instead of the dismissal of Grunander or a handful of attorneys. The issue in front of the court, he argued, was not whether the child’s presence was a conflict of interest. Instead, he asked the judge to consider the office’s handling of the issue.\n\nAsked during the early February hearing whether his child’s presence that day impacted his decision making in the case, Grunander said, “No, not at all.”\n\nHe said it was clear his child was not in the “zone of danger,” referring to a legal doctrine that in part determines whether people are placed in immediate risk of physical harm.\n\nThe deputy prosecutor said his office disclosed his child’s presence out of “an abundance of caution,” not because they believed it was an issue.\n\n“Don’t mistake our disclosure, my disclosure, our abundance of caution, our professionalism, integrity, to be a concession that we believe there’s merit to this alleged conflict,” he told the court.\n\nOne of Robinson’s attorneys, Kathy Nester, was notably absent from the virtual hearing Tuesday. Nester also representsKouri Richins, whosemurder trial began this weekin Park City. Richins is accused of poisoning her husband with fentanyl in 2022, thenwriting a children’s bookto help her sons grieve.\n\nRobinson has not yet entered pleas for the slew of charges he’s facing, including aggravated murder, felony use of a firearm, obstruction of justice and witness tampering, along with several victim targeting enhancements and an aggravating factor of having committed a violent offense in the presence of a child.\n\nHe won’t be arraigned until after his preliminary hearing, which has been scheduled to begin May 18 and is expected to last three days.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/us/tyler-robinson-charlie-kirk-court",
      "text": "recused from the case"
    },
    {
      "url": "https://www.cnn.com/live-video-5",
      "text": "Kouri Richins"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/kouri-richins-trial-murder-husband",
      "text": "murder trial began this week"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/us/kouri-richins-utah-trial",
      "text": "writing a children’s book"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/tyler-robinson-case-prosecutors-charlie-kirk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/us/tyler-robinson-case-prosecutors-charlie-kirk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "068dc6e1437a972bca5217869a6495c664ab14a23f219c8245598ad3604a1eb4",
  "scraped_at": "2026-02-25T07:32:27.217472+00:00"
}