{
  "url": "https://lite.cnn.com/2026/02/20/sport/don-garber-mls-commissioner-vinicius-kylian-mbappe-soccer",
  "title": "Don Garber: MLS Commissioner ‘would love’ to see Vinícius Jr. and Kylian Mbappé join the league | CNN",
  "date": "2026-02-23T07:38:28.515022+00:00",
  "authors": [
    "Don Riddell",
    "Glen Levy",
    "CNN"
  ],
  "text": "Source: CNN\n\nOn the eve of the new Major LeagueSoccer(MLS) season, MLS Commissioner Don Garber has expressed his interest in Real Madrid superstarsVinícius JúniorandKylian Mbappéeventually becoming part of the league and playing their club soccer in North America.\n\nThe 31st season of MLS kicks off on Saturday, with a veritable blockbuster on tap betweenreigning MLS Cup champion Inter Miamiand LAFC.\n\nAn expected crowd of over 70,000 at the LA Coliseum should see soccer superstar Lionel Messi and Miami go up against LAFC andSon Heung-min, with the South Korean icon about to play in his first full season in the league after leaving Premier League club Tottenham Hotspur last summer.\n\nGarber, who has been commissioner since 1999 and overseen the growth of the league from 10 to 30 clubs, was bullish about the prospects of more A-list players taking their talents to MLS when speaking toCNN Sportson Thursday.\n\n“Would I love to see Vini here?” Garber asked. “Would I love to see Mbappé here? I think that some of the great players in the world want to play in the US, and that’s the game changer.”\n\nWhile MLS has seen a succession of top-tier international stars play in the league – arguably kick-started by David Beckham in 2007, who leftLos Blancosfor the LA Galaxy – it was the stunning signing of Messi, perhaps the greatest footballer of all time, in the summer of 2023 to Inter Miami that turned heads like never before.\n\n“I don’t think anybody thought we’d ever sign Leo,” acknowledged Garber about Messi’s move. “I don’t think Miami thought they could sign him, I don’t think Beckham (who is now co-owner of Miami) thought that they could sign him.\n\n“They were optimistic and super, super passionate about the idea, but here he is: scoring goals, leading Argentina in World Cup qualifying, playing in the Club World Cup in front of an audience.\n\n“(He’s) a good, humble guy, loves his kids, enjoys Miami, you know, he’s the right kind of guy to show the rest of the world what Major League Soccer is.”\n\nGarber pointed out that “the days of ‘Is soccer going to make it in America”’ are over,” explaining that, while it used to be the case that the league needed to appeal to star players – “here’s what we’re doing in Major League Soccer, come help us build it” – things are different in 2026.\n\nNoting the “energy and momentum going into the season” in a World Cup year – Garber expects around 50 MLS players to represent their countries at the tournament – the MLS commissioner says that his league is here to stay: “We’re a player in the world stage, we’re a player amongst the major leagues here in North America.”\n\nBut the 68-year-old’s sights are now set on whether MLS “can compete at some point with the Premier League, with Serie A … the Bundesliga” and is confident that a marquee signing will choose to form part of MLS in the prime of their career.\n\n“I think the next (star to come over) will be one of the top players in the world. Very confident of that actually.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/benfica-goalkeeper-anatoliy-trubin-looks-for-more-champions-league-magic-against-real-madrid",
      "text": "Soccer"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/vinicius-madrid-benfica-halted-alleged-racial-abuse",
      "text": "Vinícius Júnior"
    },
    {
      "url": "https://www.cnn.com/2025/06/26/sport/kylian-mbappe-sues-psg-spt-intl",
      "text": "Kylian Mbappé"
    },
    {
      "url": "https://www.cnn.com/2025/12/06/sport/soccer-messi-inter-miami-vancouver-mls-cup",
      "text": "reigning MLS Cup champion Inter Miami"
    },
    {
      "url": "https://www.cnn.com/2025/08/06/sport/son-heung-min-signs-lafc-spt-intl-hnk",
      "text": "Son Heung-min"
    },
    {
      "url": "https://www.cnn.com/sport",
      "text": "CNN Sports"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/sport/don-garber-mls-commissioner-vinicius-kylian-mbappe-soccer",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/sport/don-garber-mls-commissioner-vinicius-kylian-mbappe-soccer",
      "text": "Cookie Settings"
    }
  ],
  "hash": "08875bcc0670671645d830395b85b14238ab0b80a59486b9911902a585d76542",
  "scraped_at": "2026-02-23T07:38:28.515037+00:00"
}