{
  "url": "https://lite.cnn.com/2026/02/13/weather/trump-colorado-lab-ncar-supercomputer-climate",
  "title": "Trump admin is pulling supercomputers out of NCAR weather research center | CNN",
  "date": "2026-02-14T07:07:38.640800+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA leading American research lab is slated to lose its critical supercomputing facility, according to aletter released Thursdayby the National Science Foundation.\n\nThe move is part of the Trump administration’seffort to disassemble the National Center for Atmospheric Research in Boulder, one of the world’s top weather and climate research centers, which the admin views as a source of climate change alarmism.\n\nThe computing center, which is slated to be turned over to an unspecified third party, runs weather and climate research models and is used by about 1,500 researchers from over 500 universities around the country. The work done on this supercomputer benefits the American people by leading to more accurate forecasts of extreme weather and climate events, aircraft turbulence and more.\n\nThe problem with spinning off the computing center away from the research center is that it could disrupt access to high performance computing. Muchas with AI, high power computing is essential for simulating weather and climate and for evaluating the accuracy of new forecast models, which eventually end up contributing to what Americans see in the weather apps each day.\n\nNOAA, for example, just chose to upgrade its next-generation computer models using a system developed by NCAR researchers known as “Modeling for Prediction Across Scales.” The agency also relies on the supercomputing facility to run some of its current models.\n\nThe White Houseannounced its intention to “break up” NSF NCARin January.\n\nSome Colorado officials view the move as part of a retribution campaign being waged by the White House that is designed to pressure Colorado Governor Jared Polis, a Democrat, intogranting clemency to Tina Peters, a former county election clerk who was convicted in a 2020 election-related data breach scheme. Peters is a prominent 2020 election denier.\n\nIn a letter sent to his NCAR staff, director Everette Joseph notes the concern over losing control and potentially even access to the supercomputer in Wyoming.\n\n“We do not yet know who the new managing entity will be nor do we know the timeline for this transition,” Joseph stated.\n\n“I understand that this is diﬃcult news and that it raises many questions, most of which I cannot answer at this point. However, we will be working to get more details as soon as possible from NSF, including how this will impact our science and the community we support,” he said.\n\nNSF also recently issued a letter requesting proposals for how NCAR and the nation’s weather research infrastructure should be reorganized. That request indicated support for the center’s weather-related programs, but itsclimate researchwas not mentioned as something that will continue.\n\nThe atmospheric sciences community is rallying around trying to save NCAR as it is currently organized.\n\nIn response to the NSF request, former NCAR director James Hurrell along with other prominent colleagues in the weather and climate community told NSF that “Any path that leads to the fragmentation or dismantling of NSF NCAR is fundamentally not in the nation’s interest.”\n\nHurrell’s letter to NSF points out that breaking up the institution could therefore imperil NOAA’s effort to improve its own weather modeling capabilities, which have consistently lagged its international competitors in recent years.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nsf.gov/news/transitioning-ncar-wyoming-supercomputing-center-operations",
      "text": "letter released Thursday"
    },
    {
      "url": "https://www.cnn.com/2025/12/17/climate/ncar-trump-climate-research-weather-safety-forecasts",
      "text": "effort to disassemble the National Center for Atmospheric Research in Boulder"
    },
    {
      "url": "https://x.com/russvought/status/2001099488774033692?s=20",
      "text": "announced its intention to “break up” NSF NCAR"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/politics/tina-peters-colorado-jared-polis",
      "text": "granting clemency to Tina Peters"
    },
    {
      "url": "https://www.cnn.com/2025/04/11/climate/trump-noaa-budget-cuts",
      "text": "climate research"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/weather/trump-colorado-lab-ncar-supercomputer-climate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/weather/trump-colorado-lab-ncar-supercomputer-climate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0916dc71013bc628625285ac6854f973bf1820f583ddd015289055117370c99b",
  "scraped_at": "2026-02-14T07:07:38.640811+00:00"
}
