{
  "url": "https://lite.cnn.com/2026/02/16/middleeast/dana-eden-tehran-israel-dead-athens-intl",
  "title": "Israeli TV producer of award-winning show ‘Tehran’ found dead in Athens hotel room | CNN",
  "date": "2026-02-17T07:30:35.179672+00:00",
  "authors": [
    "Christian Edwards, CNN"
  ],
  "text": "Source: CNN\n\nDana Eden, anIsraeliproducer best known for co-creating the Apple TV show “Tehran,” was found dead on Sunday in Athens, where the show’s fourth season was being filmed, Greek police said.\n\nEden, 52, was found dead in a hotel room after a relative made several failed attempts to reach her. Police said that her death is being treated as a suicide, Reuters reported.\n\n“We mourn the passing of our friend and partner in a long line of productions, series and programs at the Israeli Public Broadcasting Corporation,” Kan, Israel’s public broadcaster, said in a statement.\n\nKan said that Eden had traveled to Greece to oversee the “complex and significant production” of the fourth season of “Tehran,” a spy thriller that premiered in 2020 and received an International Emmy Award in 2021 for best drama series.\n\n“Her professional work, uncompromising commitment and love of creation have left a deep mark on the Israeli Broadcasting Corporation,” Kan added.\n\n“Tehran” follows the plight of Tamar Rabinyan, a young Mossad agent born in Iran but raised in Israel who returns to Iran on a mission to sabotage Iran’s nuclear program. Since Israelis are banned from visiting Iran, the show was filmed in Athens, due to its similarities with the Iranian capital.\n\nIn her Emmy acceptance speech, Eden said that working on the show with Iranian actors who had fled the regime showed her that “we have a lot in common.”\n\n“Tehran is not only an espionage series. It’s also about understanding the human behind your enemy,” she said. “I hope we can walk together – the Iranians and the Israelis, in Jerusalem and in Tehran – as friends, and not as enemies.”\n\nMuch of Eden’s work was in collaboration with Shula Spiegel, who also worked as a producer on “Tehran.” The pair’s production company, Dana and Shula Productions, said Eden’s death was “a moment of great pain for the family, friends and colleagues.”\n\nMiki Zohar, Israel’s culture minister, said he received the news of Eden’s death “with great sadness,” praising her as “one of the most prominent and influential producers in the Israeli television industry.”\n\n“Dana left a deep mark on Israeli creation and brought our story to international stages with pride, talent and courage. I share in the sorrow of the family, friends and colleagues. May her memory be a blessing,” Zohar said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/02/15/middleeast/crime-epidemic-inequality-israeli-arabs-intl",
      "text": "Israeli"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/middleeast/dana-eden-tehran-israel-dead-athens-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/middleeast/dana-eden-tehran-israel-dead-athens-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0955d11264b214ba7bdbba788499a0a4e6884181b2ba5ac4572661494f6aff43",
  "scraped_at": "2026-02-17T07:30:35.179684+00:00"
}