{
  "url": "https://lite.cnn.com/2026/02/12/politics/us-troops-withdrawal-syria-isis",
  "title": "US military pulls last troops from key military facility in Syria | CNN Politics",
  "date": "2026-02-12T21:29:35.714934+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nUS military forces have departed a strategic military garrison inSyriaafter more than a decade “as part of a deliberate and conditions-based transition” to a smaller US footprint in the country, US Central Command said on Thursday.\n\nThe US troops at al-Tanf garrison had primarily been focused on anti-ISIS efforts as part of Combined Joint Task Force-Operation Inherent Resolve. The Pentagon announced in April 2025 that it would begin consolidating its presence in Syria following the territorial defeat of ISIS in 2019.\n\n“U.S. forces remain poised to respond to any ISIS threats that arise in the region as we support partner-led efforts to prevent the terrorist network’s resurgence,” CENTCOM Commander Adm. Brad Cooper said in a statement. “Maintaining pressure on ISIS is essential to protecting the U.S.homeland and strengthening regional security.”\n\nSyria’s defense ministry said in a statement on Thursday that its army has now taken control of al-Tanf in coordination with the United States.\n\nUS officials have heavily invested in supporting Syria’s new president, Ahmed Al-Sharaa, as his government has worked to secure control over Syria following its successful effort to overthrow Bashar al-Assad in December 2024. Al-Sharaa previously led a US-designated terrorist group and until recently had a$10 million US bountyon his head but has attempted to transition what had been a hodgepodge resistance force into a governing authority in the country.\n\nAn ISIS ambush in Palmyra in December killed two Iowa Army National Guard soldiers and an American interpreter. Following the attack US officials pledged a continued focus on targeting ISIS in the region, and as recently as last week CENTCOM forces “located and destroyed an ISIS communication site, critical logistics node, and weapons storage facilities with 50 precision munitions delivered by fixed-wing, rotary-wing, and unmanned aircraft,” according toa statement.\n\nSyria’s military forces are currently made up of an array of fighters from different backgrounds and with varying extremist views and affiliations, CNN has reported. But the Trump administration has made clear that it backs Al-Sharaa as Syria’s new leader, painting his extremist ties as a thing of the past and emphasizing his partnership in targeting ISIS in the region.\n\nIn November, Al-Sharaa became the first Syrian head of state to visit the White House. “He’s a very strong leader,” President Donald Trump told reporters at the time, calling Al-Sharaa “a tough guy from a tough place.” The visit came after the US partially lifted sanctions on Syria, marking a major shift in relations between the two countries.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/middleeast/syria",
      "text": "Syria"
    },
    {
      "url": "https://www.cnn.com/2024/12/20/politics/us-delegation-meets-syrian-rebel-leader/index.html",
      "text": "$10 million US bounty"
    },
    {
      "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/4397247/us-forces-strike-isis-targets-in-syria-as-partners-sustain-pressure/",
      "text": "a statement."
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/us-troops-withdrawal-syria-isis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/us-troops-withdrawal-syria-isis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "095cf9faf0e55109fe9d206354fcb2bd1dce84e03e8989a7a395a9aeff549f45",
  "scraped_at": "2026-02-12T21:29:35.714947+00:00"
}