{
  "url": "https://lite.cnn.com/2026/02/15/europe/former-energy-minister-detained-ukraine-intl",
  "title": "Ukraine’s anti-corruption authority detains ex-minister while trying to leave the country | CNN",
  "date": "2026-02-16T07:34:24.037897+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA former Ukrainian energy minister has been detained in connection with a major corruption scandal while trying to leave the country, authorities said on Sunday.\n\nUkraine’s anti-corruption bureau (NABU) said its detectives “detained the former minister of energy as part of the Midas case,” referencing a wide-ranging investigation into corruption in Ukraine’s energy sector that triggered a major political crisis last year.\n\n“Initial investigative actions are ongoing, carried out in accordance with the requirements of the law,” NABU added in a statement, without naming the former minister.\n\nThe scandal, which centers on alleged kickbacks from contractors including those working to protect critical energy infrastructure, led both the serving and a former energy minister to resign last year at President Volodymyr Zelensky’s request. Both denied wrongdoing.\n\nChief of staff to the president, Andriy Yermak, alsoresignedamid the fallout.\n\nInvestigators said about $100 million had been siphoned off as state-owned businesses including Energoatom, which operates Ukraine’s nuclear power plants, paid companies for work done to enhance security at key sites.\n\nAt the time, Ukraine’s anti-corruption body announced it had carried out searches on dozens of properties as part of the investigation.\n\nCorruption allegations are nothing new in Ukraine. Since 2023, NABU has opened investigations into a series of scandals.\n\nIn January 2024, Ukraine’s Security Service (SBU) said it had discovered amass corruption schemein the purchase of weapons by the country’s military amounting to nearly $40 million.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/28/world/andriy-yermak-ukraine-corruption-raid-intl",
      "text": "resigned"
    },
    {
      "url": "https://www.cnn.com/2024/01/28/europe/ukraine-weapons-procurement-corruption-shell-intl",
      "text": "mass corruption scheme"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/europe/former-energy-minister-detained-ukraine-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/europe/former-energy-minister-detained-ukraine-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "09ce7daa5a18bcee766e579d3bddff76c36e705076364320e231d1b19b60712f",
  "scraped_at": "2026-02-16T07:34:24.037912+00:00"
}