{
  "url": "https://lite.cnn.com/2026/02/12/politics/republicans-congress-trump-legislative-branch",
  "title": "Republicans in Congress show a little pride after enduring Trump’s abuse for a year | CNN Politics",
  "date": "2026-02-12T21:29:31.654607+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThis week brought fresh signs that asPresident Donald Trump’spopularity withers, Republicans in Congress are starting to reassert some of the prerogatives — and pride — that they abandoned during his first year back in office.\n\nIt’s a contrast from just last spring when the Republican-controlled House voted to strip itself of power to stop Trump’s tariffs — and did so by takingsome liberties with the concept of time.\n\nIt voted to effectively pretend that a day was not a day, in order to skirt a rule that says any attempts to cancel Trump’s tariffs emergency had to be voted on within 15 days.\n\nThe Constitution expressly gives Congress the power over tariffs. So here was the House not just declining to stop Trump from gobbling up that power, but willfullypreventing itself from reclaiming it. All in the name of helping Trump.\n\nIf anything encapsulatesCongress’ willful acquiescence and fealty to Trump, those votes had to be it. But it was part of a broader trend. The Constitution arguably makes the legislative branch more powerful than the executive and judicial branches, but GOP lawmakers have repeatedly ceded that power to keep the peace with Trump.\n\nSome have even spoken as if their roles were todo whatever Trump wanted— as if their elections didn’t matter, next to Trump’s 49.8% plurality in the 2024 election.\n\nThat dynamic is hardly going away, but with looming midterm elections — in which they’re on the ballot and Trump’s not — GOP lawmakers are breaking with him in more ways.\n\nThree House Republicansvoted this weekto prevent an extension of House Speaker Mike Johnson’s tariffs gimmick. And meanwhile, key Republicans have balked at a pair of major Trump incursions into the legislative branch: his administration’s apparent monitoring of lawmakers’ searches of the Jeffrey Epstein files, and its failed attempt to indict six congressional Democrats.\n\nThetariffs voteTuesday was hardly a resounding reclamation of congressional power, given 214 Republicans still voted to continue ceding it to Trump. But it was a significant rebuke of Trump and Johnson that means we’re likely to see a bevy of tariffs votes in the coming months.\n\nThose votes could test Republicans’ willingness to toe Trump’s unpopular line on tariffs in an election year — and potentially make the tariffs more difficult to sustain if the GOP defections grow.\n\nAlready on Wednesday,six House Republicansjoined with Democrats to block Trump’s Canada tariffs. Given the Senate already voted against those tariffs, that means majorities of both GOP-controlled chambers are now on-record opposing what Trump has done.\n\n(Still, even if both chambers passed the same measure, Trump could veto it. They would then need two-thirds majorities to override him, which would require much bigger GOP defections than we’re currently seeing.)\n\nWednesday also delivered some more big moments in the relationship between the two branches of government.\n\nPhotographs of a document that Attorney General Pam Bondi brought to her testimony to the House Judiciary Committee suggested DOJ appeared to havemonitored lawmakers’ searches of the Epstein fileswhen they viewed the unredacted files at the Justice Department this week. (The department didn’t immediately respond to a request for comment about the paperwork Bondi brought to the hearing.)\n\nThat raised the prospect that the executive branch was effectively spying on members. Democrats criticized it as a violation of the separation of powers.\n\nJohnson’s usual response when such controversies arise is to punt or downplay. But while the GOP speaker allowed there was still more to learn, he told CNN on Thursday it wasn’t “appropriate” for lawmakers’ searches to be tracked.\n\n“I think members should obviously have the right to peruse those at their own speed and with their own discretion and I don’t think it’s appropriate for anybody to be tracking that,” he said.\n\nAlso Wednesday — on a bigger scale — we saw a coterie of Republicans speak out against DOJ’sfailed attempt to indict six congressional Democrats.\n\nThe effort traces back to a video in which those six Democrats had urged members of the military not to obey illegal orders. Trump and others around him suggested that message was akin to treason.\n\nBut Trump’s threat — that these lawmakers had committed “seditious behavior, punishable by death” — didn’t just come across as an effort to criminalize speech; but to potentially criminalize speech that effectively justrestated what members of the military are already told.\n\nMany Republicans have now criticized the administration’s effort to indict the Democrats, even as some assured that they objected to the six lawmakers’ video.\n\nSen. Thom Tillis of North Carolina, who’s not running for reelection, called it “political lawfare.” Sen. Lisa Murkowski of Alaska called it “chilling.” Sens. Josh Hawley, Bill Cassidy, Mike Rounds and Susan Collins all objected. Senate Armed Services Chairman Roger Wicker said the grand jury that rejected the charges“made the right decision.” Senate Judiciary Chairman Chuck Grassley of Iowa said federal law enforcement should be targeting “real law-breakers.”\n\nSenate Majority Leader John Thune didn’t judge the attempted indictments as harshly but did suggest it simply wasn’t a legal matter.\n\n“That wouldn’t have been my response to that,” the South Dakota Republican said.\n\nAre all of these responses full-throated? No. And these Republicans all could have objected more strongly weeks ago when Trump telegraphed his effort at retribution.\n\nBut it’s rare you see so many GOP lawmakers speaking out on a subject so quickly.  And that undoubtedly owes at least in part to what this effort could have meant for their branch of government.\n\nNobody should look at this week’s developments and deduce that Republicans in Congress are suddenly ready to fight Trump for the honor of the legislative branch.\n\nSo much of Trump’s project is built on claiming massive amounts of unilateral power. And Congress acting as even an equal partner would likely torpedo the entire thing — especially given the GOP’s House majority is so small.\n\nAnd in many ways, the damage is done. The precedent has been set for a Congress controlled by the president’s party to effectively stand by — to try to let the president serve as a more authoritarian leader who can be checked (eventually and maybe) by the judiciary but rarely by the legislature.\n\nBut at some point, Republicans have to recognize that ceding all that power to the notoriously unwieldy and chaotic Trump has caused them lots of political problems, and that maybe this isn’t how they want to conduct business forever.\n\nAn election year, perhaps unsurprisingly, seems to be when they’re coming to that realization.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump’s"
    },
    {
      "url": "https://www.nytimes.com/2025/04/10/us/congress-johnson-calendar.html",
      "text": "some liberties with the concept of time"
    },
    {
      "url": "https://www.nytimes.com/2025/09/07/us/politics/trump-congresss-power.html",
      "text": "Congress’ willful acquiescence and fealty to Trump"
    },
    {
      "url": "https://www.washingtonpost.com/politics/2024/11/14/checks-balances-some-gop-lawmakers-say-just-do-whatever-trump-wants/",
      "text": "do whatever Trump wanted"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
      "text": "voted this week"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
      "text": "tariffs vote"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/house-republicans-trump-canada-tariff-vote",
      "text": "six House Republicans"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/pam-bondi-house-hearing-02-11-26?post-id=cmli7mnhx001u3b6ptdafvy1y",
      "text": "monitored lawmakers’ searches of the Epstein files"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
      "text": "failed attempt to indict six congressional Democrats"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/politics/hang-democrats-trump-seditious-behavior",
      "text": "restated what members of the military are already told"
    },
    {
      "url": "https://thehill.com/homenews/senate/5734392-republican-senators-defend-democrats/",
      "text": "“made the right decision"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/republicans-congress-trump-legislative-branch",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/republicans-congress-trump-legislative-branch",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0a1e400dbb55a898afd74900f071eedf320e5a39df59964fd8260fce81f7de26",
  "scraped_at": "2026-02-12T21:29:31.654620+00:00"
}