{
  "url": "https://lite.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
  "title": "Marco Rubio reassures Europe’s leaders of US backing if they change course | CNN",
  "date": "2026-02-15T07:10:46.103282+00:00",
  "authors": [],
  "text": "Source: CNN\n\nSecretary of State Marco Rubio applied a velvet glove to the Trump administration’s still-clenched fist during his high-profile speech at theMunich Security Conferenceon Saturday, offering some reassurance to uneasyEuropean leadersthat the US remains committed to their long-standing partnership but without backing away from its underlying demand that they change course on a number of fronts.\n\nRubio’s message that Washington is not looking to abandon the transatlantic alliance was well-received by European allies in the audience who just one year ago sat stone-faced as Vice President JD Vance stood at the same podium anddelivered a broadly false desecrationof Europe’s culture and values.\n\nThe top US diplomat twice received applause when he evoked Europe and the US’ shared histories — saying America is a “child” of Europe with the continents’ fates “intertwined.”\n\nBut Rubio’s message was still stark. It carried a warning from the Trump administration that it would “do this alone” unless Europe assumes more responsibility for its own security and shares the same values as the US — a shift that requires reforming the current system of international cooperation.\n\n“We want allies who can defend themselves so that no adversary will ever be tempted to test our collective strength,” Rubio said.\n\n“For we in America have no interest in being polite and orderly caretakers of the West’s managed decline. We do not seek to separate but to revitalize an old friendship,” he added.\n\nPresident Donald Trump has often criticized Europe for relying too heavily on US assistance, particularly when it comes to security, and demanded that NATO allies increase defense spending.\n\nMore broadly, Trump has also vowed to disrupt the international status quo and, one year into his second term, has done exactly that at remarkable speed.\n\nRubio’s speech comes as US allies have increasingly grown concerned and questioned whether the country intends to abandon its partnership with Europe due to Trump’s threats of retaliatory tariffs, bid to take over Greenland and pullback of international aid.\n\nVance’s speech at last year’s Munich Security Conference exacerbated concerns as he vented to European leaders, telling them the biggest threat to their security came “from within,” rather than from China and Russia — remarks that have formed the White House’s black-and-whitenational security strategy.\n\nVance’s words were still ringing in the ears of European officials as they arrived this week in Munich, where many have focused on the end of the US-led international order — one of the few points of agreement between Washington and its NATO allies.\n\n“A divide has opened up between Europe and the United States,” German Chancellor Friedrich Merz said on Friday ahead of Rubio’s speech.\n\n“The United States’ claim to leadership has been challenged, and possibly lost,” he said.\n\nRubio acknowledged as much on Thursday as he departed for Munich, telling reporters that“the old world is gone, frankly”and that “we live in a new era in geopolitics.”\n\nHe delivered a similar message during the speech on Saturday, though with a softer touch.\n\n“While we are prepared, if necessary, to do this alone, it is our preference  and it is our hope to do this together with you, our friends here in Europe,” Rubio told the audience in Munich.\n\n“For the United States and Europe, we belong together,” Rubio added, emphasizing the importance of the long partnership, which has come under intense strain.\n\nRubio acknowledged that the US can, at times, be somewhat “direct and urgent in our counsel,” but sought to reassure European leaders that the Trump administration is committed to the alliance.\n\n“We want allies who are proud of their culture and of their heritage, who understand that we are heirs to the same great and noble civilization, and who together with us are willing and able to defend it,” he said.\n\nVance complimented Rubio’s remarks, writing on social media, “This is a great speech. Worth watching the whole thing.”\n\nRubio’s tone was in stark contrast to that used by Vance a year ago. But the message to Europe was the same: Reform, or you’re on your own.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-rubio-munich-02-14-26",
      "text": "Munich Security Conference"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/europe/munich-security-conference-merz-rubio-intl",
      "text": "European leaders"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl",
      "text": "delivered a broadly false desecration"
    },
    {
      "url": "https://www.cnn.com/2025/12/05/politics/trump-national-security-strategy",
      "text": "national security strategy"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/world/video/the-old-world-is-gone-us-secretary-of-state-marco-rubio-munich-security-conference",
      "text": "“the old world is gone, frankly”"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0a28cfc249f3d77937eef897ae53f158b222f51a9adf984b881ed85edf88be2b",
  "scraped_at": "2026-02-15T07:10:46.103295+00:00"
}