{
  "url": "https://lite.cnn.com/2026/02/08/china/jimmy-lai-sentenced-20-years-intl-hnk",
  "title": "Hong Kong’s Jimmy Lai sentenced to 20 years in prison after landmark national security trial | CNN",
  "date": "2026-02-11T16:41:21.402555+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFormer Hong Kong media tycoonJimmy Laihas been sentenced to 20 years in prison, ending a years-long legal battle that has come to define Beijing’s transformational crackdown on the once-freewheeling financial hub.\n\nThe 78-year-old self-made billionaire was among the highest-profile government critics charged since Beijing imposed a sweepingnational security lawon the semi-autonomous southern city in 2020.\n\nThe sentence is the longest delivered under that law and means Lai will not be eligible for parole until he is in his late 90s.\n\nIt has galvanized international calls for the pro-democracy media mogul’s release, following a landmark trial that was closely watched by Western world leaders, including US President Donald Trump, who previously vowed to “get him out.”\n\nTrump is expected to travel to China in the coming months to meet his counterpart Xi Jinping and many of Lai’s supporters will be lobbying him to raise the case.\n\nLai’s son Sebastien called the sentence draconian and “life-threatening” for his father.\n\n“Twenty years, it’s a farce. It’s essentially tantamount to a life sentence, or as Human Rights Watch calls it a death sentence, because in the conditions that my father is being kept in, I don’t know if he even has a tenth of that,” his son said.\n\nHis daughter Claire described it as “heartbreakingly cruel.”\n\n“I have watched my father’s health deteriorate dramatically and the conditions he’s kept in go from bad to worse. If this sentence is carried out, he will die a martyr behind bars,” she said.\n\nLai’s outspokenness over Hong Kong’s shrinking freedoms – including to top US officials – and his role as the founder of now-defunct Apple Daily, a fiercely pro-democracy tabloid newspaper, had long made him a thorn in Beijing’s side.\n\nBoth Beijing and Hong Kong’s government have repeatedly rejected international criticism of Lai’s prosecution and dismissed accusations that his jailing was politically motivated or an assault on press freedom. Authorities have said Lai has received adequate medical attention in prison.\n\n“Lai used Apple Daily to poison the minds of citizens, incite hatred, distort facts, deliberately create social division, glorify violence, and openly beg external forces to sanction China and the Hong Kong Special Administrative Region,” city leader John Lee, a former police officer and security chief, said on Monday.\n\nLai wasfound guiltyof two national security charges and a sedition charge in December following a years-long court battle.\n\nLooking visibly slim in a white jacket, Lai smiled slightly upon hearing the sentence Monday. Before the court session began, he had put his hands together to greet those sitting in the court gallery and turned to see six former Apple Daily colleagues who were also awaiting sentencing.\n\nThose colleagues were jailed too, receiving sentences ranging from 6 years, 9 months to 10 years behind bars. Apple Daily and its affiliated companies were fined 6 million Hong Kong Dollars ($767,000).\n\nBeijing’s national security law has transformed Hong Kong, with authorities jailing dozens of dissidents; forcing civil society groups and outspoken media outlets to disband; and neutering the city’s once-raucous political scene.\n\nCity and national authorities say the law has “restored stability” following mass anti-government protests in 2019 that turned violent at times.\n\nSupporters had been lining up for days outside the West Kowloon court since last week hoping to catch a glimpse of Lai. Police ramped up security outside, searching those lining up.\n\n“He is the flag of Hong Kong,” Chan Chun-yee, 75, who arrived outside the court on Thursday, told CNN. “I don’t agree with everything he did but I aligned with his spirit and the things he pursued, such as freedom, democracy and justice.”\n\nWhen convicting Lai in December, the three judges hand-picked by the Hong Kong government to preside over national security cases said they found that there was “no doubt that (Lai) had harbored his resentment and hatred of the PRC (People’s Republic of China),” calling him a “mastermind of the conspiracies.”\n\nThey pointed to his lobbying of US politicians during Trump’s first term – much of it before the security law was enacted – as evidence of sedition and colluding with foreign forces, including his meetings with senior White House figures and attempts to meet Trump himself.\n\nLai also used Apple Daily to call for international sanctions against China and Hong Kong, the judges concluded. The US alone sanctioned more than a dozen Hong Kong and Chinese officials.\n\nIn a press summary of Monday’s sentence, the judges called his actions “conspiracies” that were “not only well planned but were premeditated” to reach both local and overseas audiences.\n\nThey also concluded that Lai committed the “most serious category” of sedition given the number of articles involved and the duration of the offence. Prosecutors previously said Apple Daily had published up to 161 seditious articles.\n\nLai can appeal the verdict and sentence. But the process often drags on for years, with a slim success rate. Only one in almost 100 people charged under the national security law has ever been fully acquitted.\n\nInternational relations experts said Lai’s battle for freedom could now spill over into the diplomatic sphere.\n\nLai, a British passport holder and a practicing Catholic, has powerful voices lobbying for his release in both Britain and the United States. In the latter, many on the Christian right have been vocal supporters.\n\nTrump has vowed repeatedly to secure Lai’s release. In August, Trump said he had put out a “request” to Chinese leader Xi Jinping, asking him to consider freeing Lai.\n\nLai’s treatment could turn into another sticking point for the world’s two biggest economies, which are already clashing over a range of issues from trade to Taiwan.\n\n“Trump will likely raise it again in his bargaining with Xi,” said Hung Ho-fung, Professor of Political Economy at John Hopkins University’s School of Advanced International Studies.\n\n“He (Lai) is British citizen and a pro-democracy icon in the greater China region. Just raising the issue to Beijing is good press.”\n\nMeanwhile, Beijing may also find Lai a “useful bargaining chip,” given his ailing health.\n\n“If Beijing could exact compromises from Washington over trade, tech, and even Taiwan by eventually granting Lai a compassionate release based on health grounds, it is a good bargain,” he said.\n\n“Better than letting him die in jail and become another martyr,” Ho added.\n\nThere was swift global reaction to Lai’s sentence from multiple human rights groups, including Amnesty International which described the sentence as “a cold-blooded attack on freedom of expression.”\n\nBritain’s Foreign Secretary Yvette Cooper called it a “politically motivated prosecution” in a statement on Monday, adding that she was concerned for Lai’s health.\n\nMany Western governments have also condemned Lai’s prosecution and previously called for his release.\n\nBeijing’s foreign ministry spokesperson Lin Jian hit back on Monday urging other countries to “refrain from making irresponsible remarks on judicial proceedings in (Hong Kong), and not to interfere in (its) judicial affairs.”\n\nIn many ways Lai’s life story tracks that of the city whose cause he came to embrace.\n\nBorn in mainland China, Lai arrived in British-ruled Hong Kong at 12 years old, just one of millions of mainlanders who fled communist China and moved to the free-wheeling business hub.\n\nHe worked his way up from factory laborer to wealthy clothing tycoon and then pivoted to media, founding Apple Daily in 1995, two years before Hong Kong was handed over to China.\n\nThe outspoken publisher and his newspaper were once at the forefront of the city’s pro-democracy movement, in a time of much greater press freedom.\n\nThe newspaper printed its last edition in June 2021 after police raided its office and froze its assets. Many ex-Apple Daily journalists have since left Hong Kong.\n\nThe city’s press freedom ranking plunged drastically from 80th out of 180 countries in 2021 to 140th last year, according to Reporters Without Borders. Hong Kong once ranked 18th, in 2002.\n\nA Hong Kong government spokesperson has said Lai’s case has “nothing to do with freedom of the press at all.”\n\nEric Lai, a senior fellow at Georgetown University’s Center for Asian Law, and no relation to Jimmy Lai, said a credible financial hub requires the free flow of information to safeguard a transparent investment environment.\n\n“With critical media outlets shut down and criminalized, as well as open exchange with foreign officials and policymakers on critical policy affairs being deemed criminal activities, the state of information access and free exchange of ideas and opinions are sharply jeopardized,” he said.\n\n“It has nothing to do with press freedom because they prioritize the need for safeguarding regime security over freedom of expressing sharp critiques,” Eric Lai said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/14/china/jimmy-lai-verdict-hong-kong-national-security-intl-hnk",
      "text": "Jimmy Lai"
    },
    {
      "url": "https://www.cnn.com/2020/06/29/china/hong-kong-national-security-law-passed-intl-hnk",
      "text": "national security law"
    },
    {
      "url": "https://www.cnn.com/2025/12/14/china/jimmy-lai-verdict-hong-kong-national-security-intl-hnk",
      "text": "found guilty"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/china/jimmy-lai-sentenced-20-years-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/08/china/jimmy-lai-sentenced-20-years-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0a6df4b47c0552c4b60fcd66d2d85e36331a4b6fc6331cb7d45d891eb5056e0d",
  "scraped_at": "2026-02-11T16:41:21.402568+00:00"
}