{
  "url": "https://lite.cnn.com/2026/02/21/sport/rondale-moore-dies-at-25-nfl",
  "title": "NFL receiver Rondale Moore found dead in his Indiana hometown | CNN",
  "date": "2026-02-24T07:32:52.052297+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nRondale Moore, an NFL receiver who had season-ending training camp knee injuries in each of the last two years after a standout college career at Purdue and a promising start with the Arizona Cardinals, was found dead Saturday, authorities said. He was 25.\n\nPolice said Moore died of a suspected self-inflicted gunshot wound. Moore was found dead in the garage of a property in his hometown of New Albany, police chief Todd Bailey said. The death remains under investigation.\n\nFloyd County Coroner Matthew Tomlin also confirmed Moore’s death. He said an autopsy would be conducted on Sunday.\n\nAfter being traded to the Atlanta Falcons in 2024, Moore dislocated his right knee during training camp and never played for them. He signed with the Minnesota Vikings in 2025, but he blew out his left knee while returning a punt in their first exhibition game and spent another full season on injured reserve. Moore was so distraught after immediately realizing the seriousness of that injury that he slammed his hand down on a cart so hard the sound was audible throughout the stadium.\n\nThe Vikings said they had spoken with Moore’s family to offer condolences and support.\n\n“I am devastated by the news of Rondale’s death. While Rondale had been a member of the Vikings for a short time, he was someone we came to know well and care about deeply,” coach Kevin O’Connell said in a statement distributed by the team. “He was a humble, soft-spoken, and respectful young man who was proud of his Indiana roots. As a player, he was disciplined, dedicated and resilient despite facing adversity multiple times as injuries sidelined him throughout his career. We are all heartbroken by the fact he won’t continue to live out his NFL dream and we won’t all have a chance to watch him flourish.”\n\nIn a statement, the Cardinals said they were “devastated and heartbroken.”\n\n“Our thoughts and deepest condolences are with his family, friends, teammates, and everyone who loved him and had the privilege of knowing such a special person,” the team said ina social media post.\n\nMoore grew up in New Albany, just across the Indiana border from Louisville, Kentucky, and was a first team All-American as a freshman at Purdue in 2018.\n\n“Rondale Moore was a complete joy to coach. The ultimate competitor who wouldn’t back down from any challenge. Rondale had a work ethic unmatched by anyone. A great teammate that would come through in any situation. We all loved Rondale; we loved his smile and his competitive edge that always wanted to please everyone he came in contact,” Louisville coach Jeff Brohm saidon social media. Brohm was the coach at Purdue when Moore played there.\n\nDrafted in the second round by the Cardinals in 2021, Moore had 1,201 receiving yards and three touchdowns plus 249 rushing yards and one score over three seasons. He served as their primary returner for kickoffs and punts as a rookie before injuries pushed him away from that role.\n\n“Can’t even begin to fathom or process this,” former Cardinals teammate J.J. Watt said onsocial media. “There’s just no way. Way too soon. Way too special. So much left to give. Rest in peace Rondale.”\n\nCORRECTION: An earlier version of this story corrected a misidentified photo. The photo was previously removed, and this version adds a correction footnote to the bottom of the story.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/azcardinals/status/2025422121686712624?s=12",
      "text": "a social media post"
    },
    {
      "url": "https://x.com/JeffBrohm/status/2025385271273951328",
      "text": "on social media"
    },
    {
      "url": "https://x.com/jjwatt/status/2025389799889051722",
      "text": "social media"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/sport/rondale-moore-dies-at-25-nfl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/sport/rondale-moore-dies-at-25-nfl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0a963a1b4a90a93d360345dd59e7bcfd7e09dd0a91e2281944512eb90e3463a1",
  "scraped_at": "2026-02-24T07:32:52.052311+00:00"
}