{
  "url": "https://lite.cnn.com/2026/02/27/style/demna-gucci-ai",
  "title": "Can Gucci make luxury AI? | CNN",
  "date": "2026-02-28T06:59:21.204651+00:00",
  "authors": [
    "Rachel Tashjian"
  ],
  "text": "Source: CNN\n\nBackstage at the runway debut of the newnewGucci – the third rebrand that the luxury titan has undergone since Alessandro Michele left in 2022 – designer Demna was feeling the amore. “I hope I made you feel Gucci today,” he said. “The energy, the passion, the fun, the sexy…. I feel like I’m falling in love with this feeling I cannot really understand.”\n\nBefore a single look appeared on the runway, Demna had already generated big feelings with a series of AI-generated images shared to Gucci’s Instagram page earlier this week. Alongside real pictures of Sophia Loren exiting a Gucci boutique in 1966 and Michelangelo’s David were peculiar pictures of conspicuous wealth: ahelmet-haired sciurain Gucci accessories striding through a wood-paneled restaurant while drab business people locked eyes on her; a sleazy 1980s coupleperchedon a muscle car. Though the origins of the pictures weren’t quite clear at first, Gucci soon added a tag to the posts indicating that they had been generated using artificial intelligence – a bold choice when the use of the technology remains contentious, and one that left many commenters aghast.\n\n“I heard about that,” Demna said backstage, rolling his eyes and smiling.\n\nDid he think his use of AI was controversial? “I don’t think so! I think this is 2026. I’m using things as a tool,” he said. “If I can use it to do something that gives me a quick idea or visualization of something, why shouldn’t I do it? It’s like, in 2008 retailers were refusing e-com because it was not quality. I mean, I find it ridiculous.”\n\nNo one understands the art of fashion provocation better than Demna, who over a decade at Balenciaga reshaped the world’s understanding of luxury from a conservative bubble fetishizing bourgeois quality to a much more immediate language that rendered familiar and quotidian clothes (ill-fitting security guard suits, track pants, puffer jackets, T-shirts, sneakers) with a layer of aspirational uncanniness. Fashion audiences have been skeptical or even suspicious of his work, accusing Demna of designing these enormous sneakers and blobby silhouettes to play some kind of prank on rich people delusional enough to buy the stuff.\n\nAs for whether the clothes on Demna’s Gucci runway were indeed energetic, passionate, fun and sexy – well, they had more in common with AI’s notion of those feelings than a human being’s. (In fact, he mentioned backstage that ChatGPT predicted he would make oversized bomber jackets with monograms – clearly he’s very comfortable with the technology.)\n\nPeople had expected something epic. In a sort of teaser collection for fashion week last fall, Demna showed a short film directed by Spike Jonze and Halina Reijn, starring Demi Moore and Edward Norton, that suggested something strange and pop, a vision of contemporary wealth that had an undercurrent of darkness but lots of punchy, potent joy. (After all, having money should befun, even if billionaires don’t make it look so.) Add to that the fact that this was his first runway show – a distinction that may seem minor to casual observers but marks a higher degree of seriousness, of brand identity throwdown, than any other project.\n\nBut rather than the surrealism of modern wealth or AI (a couple extra fingers here, a few too many sleeves there), Demna’s debut was surprisingly vacant: rail thin women and muscly men in skintight, under-designed clothes. The models swaggered and popped their hips, and British rapper Fakemink paused mid-runway to answer a text (?!), but the show was humorless.\n\nThe blankness of our contemporary world – the blandness of most of popular culture; the unrewarding chase of followers online and status offline; the bleak and beige aesthetics of our time; the vaguely informed emptiness of recreating earlier eras, like Y2K it-girls with their it-bags in their elbows – was all on display, like a tour through some ill-tended garden of earthly displeasures. Some of the looks were so plain, like a cheap-looking gray slip dress and white horsebit heels, or a pair of leggings with a shrunken T-shirt, that they read as cynically commercial canvases engineered solely to sell the bags.\n\nOf course, that is who wears luxury clothing today – spend $100 on your Zara dress and $5,000 on your Gucci bag. Gone are the cognoscenti who dutifully attended couture shows like academics preparing papers, their manicured hands dexterously able to tell one label’s cashmere from another. (If anyone like that still exists, they’re exotic objects of fascination, as that Gucci AI image suggests.) In their place are people in Los Angeles, Paris, Dubai, New York and Shanghai who are feeling themselves because they spent a lot of money somewhere, at some point.\n\nIt’s entirely possible, for that reason, that the rich, or more likely wannabe-rich, might look at Demna’s runway and – gulp –feel seen.\n\nStill, if the goal is really to go big – and Gucci is Kering’s blue chip label, which it desperately needs to revive after years of steeply declining sales – Demna could sharpen up his quality. Tom Ford, who led Gucci through a legendary run from the 1990s through 2004 with an unapologetically sex-sells attitude, knew that to make sleazy really work, your leather jackets had to be precise, your stitching exact, your fabrics beautiful. Can Demna convince more than just those who are desperate to look basic and rich that it costs a lot to look that cheap?\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.instagram.com/p/DVHBEdDDLFn/",
      "text": "helmet-haired sciura"
    },
    {
      "url": "https://www.instagram.com/p/DVHPJWMjEXN/",
      "text": "perched"
    }
  ],
  "hash": "0aff868417fceb4ba38470cd09250b2b18c0c5866dd96e4bf0f9208849c5aa9b",
  "scraped_at": "2026-02-28T06:59:21.204664+00:00"
}