{
  "url": "https://lite.cnn.com/2026/02/09/politics/ken-paxton-turning-point-endorsement-texas-senate",
  "title": "Ken Paxton wins Turning Point Action endorsement in heated GOP Senate primary in Texas | CNN Politics",
  "date": "2026-02-11T16:40:52.955590+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nTurning Point Action has endorsed Texas Attorney General Ken Paxton in one of the GOP’s nastiestprimary battles, supporting the controversial, conservative firebrand in his bid to unseat longtime Sen. John Cornyn.\n\nPaxton announced the endorsement on X, noting he felt “honored” to be supported by the group, which is an affiliate of Turning Point USA,the influential conservative nonprofit founded by the late political activistCharlie Kirk.\n\n“The movement that Charlie Kirk built has inspired millions, and I’m proud to be standing alongside Turning Point Action in carrying on the fight to save this country and defend our freedoms,” Paxton added.\n\nThe endorsement comes as top Senate Republicans have been putting pressure on President Donald Trump to pick a side in the Texas GOP primary before it’s too late: Cornyn, Paxton and Rep. Wesley Hunt are set to face off in a primary next month, which could lead to a costly runoff in May.\n\nAUniversity of Houston pollreleased Monday found that 38% of likely voters intend to vote for Paxton – compared to 31% for Cornyn and 17% for Hunt, with 12% unsure.\n\nCornyn, who is currently in his fourth term in office, has been somewhat critical of Trump and repeatedly shared concerns about Trump’s electability in the leadup to the 2024 presidential race. However, in the past year,he’s tried to align himself closelywith the president: His launch video featured footage of Trump praising him in 2019 and he posted a photo on X of him reading “The Art of the Deal.”\n\nCNN reportedearlier this weekthat senior Republicans fear it could cost at least $200 million to defend the seat in Texas if Paxton – who has ahistory of scandals– is the nominee, draining critical resources that could be spent elsewhere. Democrats have been bolstered by wins in major off-year contests and hope to capitalize on that momentum and retake both Congressional chambers, even if the path to a Democratic majority in the Senate is very narrow.\n\nCornyn has continued to seek out Trump’s endorsement, and he approached Trump again last week following a Democratic upsetin a deep-red slice of Texas.\n\nIn an interview with CNN, Cornyn warned that Democrats could win the seat if the wrong Republican — namely Paxton — makes it to the general election.\n\n“I think if Republicans nominate the attorney general, I think they absolutely do,” Cornyn told CNN when asked whether Democrats had a chance of flipping the senate seat. “At minimum … we’d have to spend hundreds of millions of dollars to salvage that seat that could be used in places like Georgia, Michigan and New Hampshire and elsewhere.”\n\nMeanwhile, Democrats are engaged in a heated primary of their own, with Rep. Jasmine Crockett, a 44-year-old civil rights attorney, and state Rep. James Talarico, a 36-year-old former teacher and Presbyterian seminarian, vying for the nomination.\n\nCNN’s Manu Raju and Sarah Ferris contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/senate-races-february-2026",
      "text": "primary battles"
    },
    {
      "url": "https://www.cnn.com/2025/09/10/politics/charlie-kirk-obituary",
      "text": "Charlie Kirk"
    },
    {
      "url": "https://www.uh.edu/hobby/primary2026/",
      "text": "University of Houston poll"
    },
    {
      "url": "https://www.cnn.com/2025/04/06/politics/cornyn-texas-senate-primary",
      "text": "he’s tried to align himself closely"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/politics/trump-primary-endorsements-senate-house-republicans",
      "text": "earlier this week"
    },
    {
      "url": "https://www.cnn.com/2025/08/16/politics/ken-paxton-texas-redistricting",
      "text": "history of scandals"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/texas-state-senate-special-election-taylor-rehmet",
      "text": "in a deep-red slice of Texas"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/ken-paxton-turning-point-endorsement-texas-senate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/ken-paxton-turning-point-endorsement-texas-senate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0be9920923fb0ff0b3bde665a851ee292d21be9b1cc70fc3d5b160b9756b4f54",
  "scraped_at": "2026-02-11T16:40:52.955601+00:00"
}