{
  "url": "https://lite.cnn.com/2026/02/21/entertainment/willie-colon-death",
  "title": "Willie Colón, American salsa legend and pioneering trombonist, dies at age 75 | CNN",
  "date": "2026-02-23T07:36:40.884455+00:00",
  "authors": [
    "Reuters"
  ],
  "text": "Source: Reuters\n\nAmerican salsa legend Willie Colón, the pioneering trombonist, vocalist and composer, died on Saturday at age 75, his family said in a statement.\n\n“While we grieve his absence, we also rejoice in the timeless gift of his music and the cherished memories he created that will live on forever,” the family said on Colon’s Facebook page.\n\nThe cause of death was not disclosed.\n\nBorn in the Bronx to Puerto Rican parents, Colón recorded dozens of albums including La Gran Fuga (The Big Break) in 1970 and El Juicio in 1972, according to Fania Records, a label that promoted salsa music.\n\nHe signed with Fania at age 15 and two years later, in 1967, released his first album El Malo, which has sold more than 300,000 copies, according to his biography on the LA Philharmonic website.\n\nColón’s music combined elements of jazz, rock and salsa, incorporating the rhythms of traditional music from Cuba, Puerto Rico, Brazil, and Africa, the biography said.\n\n“A significant overarching theme in Colón’s music—which draws from many cultures and several different styles—is an exploration of the competing associations that Puerto Ricans have with their home and with the United States,” it said.\n\n“He uses his songs to depict and investigate the problems of living in the U.S. as a Puerto Rican and also to imply the cultural contributions that Puerto Ricans have to offer.”\n\nIn 2004, he received a lifetime achievement award from the Latin Academy of Recording Arts and Sciences.\n\nA longtime social activist, Colón was a member of the Latino Commission on AIDS and the United Nations Immigrant Foundation and was a board member at the Congressional Hispanic Caucus Institute, according to the biography.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/entertainment/willie-colon-death",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/entertainment/willie-colon-death",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0c0d829ba2145a3c77db2709d6a41795cd6016813ce2b46b1bf397596f810c17",
  "scraped_at": "2026-02-23T07:36:40.884468+00:00"
}