{
  "url": "https://lite.cnn.com/2026/02/17/travel/toronto-path-canada-underground-networks",
  "title": "Where is everybody? Inside Canada’s invisible underworlds | CNN",
  "date": "2026-02-19T07:33:08.047382+00:00",
  "authors": [
    "Vivian Song, CNN"
  ],
  "text": "Source: CNN\n\nIt’s lunch hour on a wintry Wednesday afternoon and the streets of Toronto’s Financial District feel eerily abandoned.\n\nSnow flurries are blowing at an angle, the sky is a leaden grey, and visibility is poor. Only a handful of pedestrians mummified in puffer coats can be seen waddling down the snow and slush-covered sidewalks of Adelaide Street West braving the 7F (-14C) windchill under the shadow of monolithic office towers .\n\nOtherwise, the streets are unsettlingly quiet.\n\nFirst-time visitors could be forgiven for mistaking Canada’s largest and most populous city (also thefourth largestcity in North America) for an abandoned, quasi-dystopian concrete jungle, rather than the humming economic engine that it is.\n\nUntil, that is, they venture underground.\n\nBecause come winter, many Torontonians who live and work in the heart of Canada’s finance industry move into the sprawling subterranean underworld known as the PATH, a 30-kilometer network of labyrinthine pedestrian walkways that connect shops, restaurants, residences, office towers and subway stations, as well as tourist attractions.\n\nOn social media forums, users jokingly refer to the thousands of downtown office workers as gnomes, gophers or “mole people” who live and work underground. Or, that the workers in the maze of passageways are people who entered the PATH, got lost and couldn’t find their way out.\n\nIn the city’s Financial District, home to Canada’s major banks, locals are easily distinguishable from tourists and visitors by the conspicuous absence of winter paraphernalia. In place of winter coats, finance bros strut the halls in their puffer and fleece vests. Sartorial sightings among the smartly dressed, badge-wearing women include bare-footed sling backs, sleeveless tops and crisply-pressed, floor-length dress pants, with nary a salt stain to be seen.\n\n“The PATH isn’t just underground shopping. It’s a part of how downtown Toronto works every day,” explains Amy Harrell, executive director of the Toronto Financial District Business Improvement Area. “It’s a weather-protected city within a city that connects people who work, travel, eat and explore downtown Toronto.”\n\nToronto is one of several Canadian cities with built-in, climate-controlled infrastructure to protect pedestrians from frigid Canadian winters and punishing summer heat waves. Montreal’s underground is the RÉSO. The Edmonton Pedway and Winnipeg Skywalk are made up of tunnels and skywalks, while Calgary’s Plus 15 network is made up of elevated bridges and walkways.\n\nIn the cult Canadian indie 2000 film “Waydowntown,” a group of young office workers bet a month’s salary on who can last the longest living in Calgary’s Plus 15 without going outside. Needless to say, cabin fever brings on their demise .\n\nThe buzzing underground networks are an important part of the modern, urban lifestyle in Canada’s coldest metropolises, and can be fascinating — and disorienting — for visitors.\n\nFor locals, these sheltered passages can also make surfacing almost unnecessary.\n\nWhen Jadiel Teófilo moved from Brazil to Toronto three years ago, it was his first time experiencing snow, sub-zero temperatures and polar vortexes. But strangely, the 28-year-old confesses the transition was relatively smooth.\n\n“Since I have the PATH, I didn’t really spend that much time in the cold,” the software engineer tells CNN Travel.\n\nTeófilo lives near the Scotiabank Arena and works in the Scotia Plaza. Apart from a short hop across the street from his apartment, he spends his entire day indoors as his 15-minute walk to work connects through the PATH.  His typical winter work attire is a light raincoat, a T-shirt and a pair of sneakers — he has yet to buy snow boots.\n\nAlong with work, the PATH is also where Teófilo does his weekly grocery shopping, drug store errands, and even physiotherapy for a sprained wrist.\n\n“My first impression was that it was all very nice. It has all the shops and stores that you want,” he says. “It’s very clean and all the buildings are well maintained. But it’s just hard to navigate.”\n\nThat’s because the wayfinding system is notoriously confusing. Even its own tenants say so.\n\n“If you can get lunch down here and not get lost, you can direct invest,” reads a digital ad from a major Canadian bank in the PATH.\n\nToronto’s first underground pedestrian path was built in 1900 when the T. Eaton Co. dug a passageway to connect its main store on downtown Yonge Street (now the CF Toronto Eaton Centre) to its bargain annex building. A tunnel linking Union Station to the luxurious Royal York Hotel (now the Fairmont Royal York), was also built to protect its elite guests from the public riff raff downtown, explains Laura Miller, an associate professor of architecture at the University of Toronto.\n\n“Eaton’s was intended to contain you within their retail environment, while the Union Station Royal York tunnel was to ensure a continuity of class, like a VIP line,” Miller explains.\n\nIn other words, the network was built less for weatherproofing the general public and more as a commercial strategy.\n\nThe concept of private development continues to underpin the PATH’s contemporary growth, as each segment of the network today is also owned by private developers. The result is a patchwork of ad-hoc extensions that can lead to abrupt dead ends and head-scratching configurations.\n\nAfter months of struggling with the PATH’s wayfinding system which directs visitors to neighborhoods and landmarks, Teófilo decided to create a navigational app of his own,Toronto PATH.\n\n“I wanted to maximize the usage of the path for people like me so that I don’t have to walk outside as much.”\n\nFor eight months, the software engineer explored the tunnels and pathways every weekend and mapped the PATH using 3D scanning and modeling software on his phone.\n\n“I realized it was definitely bigger than I thought,” he says.\n\nThe underground tunnels also link major tourist attractions in the downtown core. Technically, a visitor could book a stay at any of the hotels with PATH access — the landmark Fairmont Royal York or InterContinental Toronto Centre among others — and hit several of the city’s major attractions without stepping foot in the brisk or boiling outdoors.\n\nA dry, covered, sports-centered itinerary, for instance, could include shopping at the historic CF Toronto Eaton Centre shopping complex and a visit to the Hockey Hall of Fame at Brookfield Place. Fans headed to a Toronto Raptors or Toronto Maple Leafs hockey game at the Scotiabank Arena could grab a pre-game meal of ramen or sourdough pizza at the premium Chefs Hall in the Richmond Adelaide Centre, or a hot fried chicken sandwich and craft beer at Union Chicken in Union Station.\n\nAnd a more high-brow, indoor Toronto experience might include fine dining at Bymark, helmed by local celebrity chef and restaurateur Mark McEwan, or a meal at Canoe which offers sweeping views of the city from atop the TD Centre’s 54th floor, followed by a concert at Roy Thomson Hall.\n\nFor years, Toronto held bragging rights to being the largest pedestrian subway network in the world. Travel websites and content creators continue to refer to the PATH as the world’s largest underground shopping complex today. But in November 2023,Guinness World Recordsquietly updated its guide and passed the official title to Toronto’s friendly rival, Montreal.\n\nA spokesperson for Guinness World Records confirmed in an email to CNN that Toronto was the previous titleholder up until 2023, when Montreal’s underground networkRÉSOedged past Toronto with a distance of 32 kilometers.\n\n“There’s more diversity connected to our network than Toronto. We have more cultural, residential and universities while Toronto is more financial and commercial,” says Danny Pavlopoulos, founder ofSpade and Palacio, which conducts walking tours in both cities.\n\nIndeed, Montreal’s underground city connects to museums and points of interest like the Place des Arts, the Musée d’art contemporain de Montréal, and hosts the annualArt Souterrain, an underground arts festival that will host its 18th edition in April and May.\n\nFounder Frédéric Loury says the goal of the art show has always been to democratize the contemporary art scene and to meet the people where they are: along their commute or their daily errands.\n\n“I noticed that contemporary art remained an art form that was perceived as very exclusive, closed off from itself. There was no renewal of audiences,” Loury says. “Art Souterrain is about changing the access and making art more universal, more democratic.”\n\nWhen told that Montreal is now the new official Guinness titleholder, though, Pavlopoulos expressed cool indifference, pointing out that therein lies a key difference in the tale of two cities.\n\n“I love Toronto, I go all the time. But in Montreal we don’t care about stuff like that. It’s a very Toronto thing, to try to one up something else.”\n\nWhile no longer the record holder, Toronto’s PATH shows signs of growth and revival.\n\nOn a busy weekday lunch hour, food courts in Toronto’s underground are packed with office workers. It’s a strong sign of recovery after the pandemic shuttered businesses and turned the underground into a ghost town.\n\nHarrell says 60 new businesses and amenities have opened in the last 18 months, including pilates and yoga studies, an indoor golf simulator and DIY painting and art event spaces. The arrival of new experiential businesses also fits into the PATH’s evolving, post-pandemic role as a third space outside work and home during the winter months.\n\nToronto resident Adam Chen recognized the underground’s potential as a third space and has been hostingfree walks through the PATHsince last winter. Every Saturday morning at 8 a.m. Chen meets with 20 or so strangers who have signed up to his Happy Town walks that start at the CF Toronto Eaton Centre and loop around to hit landmarks like the Metro Toronto Convention Centre and Roy Thomson Hall.\n\nThe walks are not intended as guided tours, but as a warm, dry, safe space where strangers can share some friendly conversation and community during the long, cold winters.\n\nBy 9:30 a.m., participants have gotten in their 10,000 steps. The only rule: talking about work is off limits.\n\n“The winter is pretty tough for a lot of people downtown,” Chen says, as the weather can be confining.\n\n“There’s a vacuum of connection and people can feel isolated. This is a time when people need to congregate the most and probably the best place for that right now, which is filled with empty spaces where people can sit and connect, is the PATH.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.destinationtoronto.com/media/resources/toronto-statistics/",
      "text": "fourth largest"
    },
    {
      "url": "https://m.imdb.com/video/vi2029781273/?playlistId=tt0219405&ref_=tt_ov_pr_ov_vi",
      "text": "Waydowntown"
    },
    {
      "url": "https://torontopathapp.com/",
      "text": "Toronto PATH"
    },
    {
      "url": "https://www.guinnessworldrecords.com/world-records/71969-largest-underground-shopping-complex",
      "text": "Guinness World Records"
    },
    {
      "url": "https://montreal.ca/articles/reso-le-reseau-souterrain-de-montreal-13713",
      "text": "RÉSO"
    },
    {
      "url": "https://spadeandpalacio.com/",
      "text": "Spade and Palacio"
    },
    {
      "url": "https://www.artsouterrain.com/",
      "text": "Art Souterrain"
    },
    {
      "url": "https://www.instagram.com/p/DSxX8GXkebG/",
      "text": "free walks through the PATH"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/travel/toronto-path-canada-underground-networks",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/travel/toronto-path-canada-underground-networks",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0c42c245363e90c36970d5c09050ad89f07b94447d11b4f325ef4ea544f20507",
  "scraped_at": "2026-02-19T07:33:08.047393+00:00"
}