{
  "url": "https://lite.cnn.com/2026/02/14/politics/supreme-court-voting-rights-louisiana",
  "title": "States ready to seize Supreme Court redistricting decision amid countdown to midterm elections | CNN Politics",
  "date": "2026-02-15T07:11:02.745848+00:00",
  "authors": [],
  "text": "Source: CNN\n\nLouisiana Attorney General Liz Murrill arrived at the Supreme Court shortly before 10 a.m. on January 9 and took a seat in the spectator section of the columned courtroom. When US Solicitor General John Sauer, the Trump administration’s top courtroom lawyer, entered a few minutes later, he cut across the room to warmly greet her.\n\nMurrill was waiting for ruling in a redistricting case that could unwind protections for Blacks and Latinos under the 1965 Voting Rights Act. The decision could simultaneously boost the GOP’s chances in the US House of Representatives this year.\n\nLouisiana, backed by the Trump administration and several other Republican-controlled states, has its eye on the upcoming midterm elections and told the justices it wanted a decision by early January as it seeks to replace its current congressional map – which includes two court-ordered majority Black districts – with a new map for this year’s midterm elections.\n\nBut it did not take long after the justices ascended the bench that day for the gavel to fall. There was no decision inLouisiana v. Callais. Nor has one come since.\n\nSpeculation has only grown about the case and its consequences for voters and control of the US House, where the GOP holds a slim margin. (The justices announced on Friday that they will be issuing more opinions later this month.)\n\nThe case tests the Voting Rights Act’s Section 2, which prohibits race discrimination, and a remedy that judges have often required when they find that maps have diluted the voting power of Blacks or Hispanics. Such “majority-minority districts” are intended to give them a chance to elect a candidate of choice.\n\nStates have been closely watching for Supreme Court action, some of them anticipating an opportunity for relief from earlier court orders and a chance to redistrict before November’s midterm elections. Each week that passes, however, makes it harder for some places to consider such an option. In Louisiana, where primary deadlines were pushed back last year to potentially take advantage of a Supreme Court ruling, deadlines are closing.\n\nIrrespective of what happens in the current cycle, the eventual Supreme Court decision is certain to give states more latitude for 2028 and future elections. That’s because over the past two decades the conservative court has been steadily erasing the racial remedies of the Voting Rights Act and deferring to state legislatures.\n\nSo far, the court’s actions in the Louisiana dispute suggest the majority will make it more difficult to bring Section 2 claims. The only question is to what degree. At the most extreme, the court could outright invalidate Section 2’s protection for minorities in the redistricting process.\n\nAfter a round of oral arguments in an earlier court session, the justices suddenly scheduled a second hearing in Louisiana v. Callais andbroadened their reviewof the Voting Rights Act.  Based on that second round of arguments, held last October, the justices appear ready to further limit the protections of the law considered an exemplar of the nation’s civil rights era. The VRA was passed after the March 7, 1965, “Bloody Sunday” attack on marchers as they crossed the Edmund Pettus Bridge in Alabama.\n\nYet the court majority may be more apt to adopt the Trump administration’s argument for scaling back coverage, rather than accept Louisiana’s move for fully dismantling the VRA provision intended to protect against race discrimination. Even that approach, however, could diminish Black representation in public office.\n\nThe justices have splintered so deeply on past voting-rights controversies that the case may produce a series of separate writings, from both the majority and dissenting camps. The final ruling may not come until later in the spring.\n\nThe court under Chief Justice John Roberts and the Trump administration have aligned in their antagonism to race-based measures and interest in lifting federal election regulations. Within days of taking office last year, Trump’s lawyers retracted the Biden Justice Department brief in the Louisiana case that sought to preserve the Voting Rights Act.\n\nWell before Trump first came to office, the Roberts Court had begun retrenching on the VRA.\n\nWilliam and Mary law professor Rebecca Green, an election-law expert, attributes its pattern to the current majority’s “colorblind” approach, attempting to eliminate racial remedies across the board. That was seen in its2023 decisionforbidding colleges and universities from considering students’ race in admissions.\n\nIn the context of redistricting, some justices similarly are trying to keep race from ever being a factor in drawing legislative lines. But, Green said, “Congress has prohibited minority vote dilution. And there’s really no way to comply with the Voting Rights Act or provide a remedy for a violation without taking race into account.”\n\nGreen also noted that the court has “doubled down on the idea that state legislatures are acting in good faith,” for example, with its December order toleave in placea new Texas congressional map challenged as a racial gerrymander.\n\nThe map, with potentially five new Republican seats, arose from President Donald Trump’s 2025 push for off-year redistricting to potentially increase the number of Republicans in the US House; California responded with a new map that could add five additional Democratic seats. The Supreme Court recentlyallowed that map to stand, too.\n\nIn the high court’s more consequential pattern favoring states and localities, Chief Justice Roberts in 2013 led the court to a 5-4 decision, inShelby County v. Holder, that gutted a VRA provision (known as Section 5) requiring states with a history of discrimination to obtain approval from the US Justice Department before making electoral changes.\n\nThen, in 2021, the majoritydiminished the reach of Section 2for certain challenges to state practices. That Arizona case, Brnovich v. Democratic National Committee, concerned requirements that ballots cast at the wrong precinct be discarded and criminalized the third-party collection of absentee ballots (such as were sometimes used in remote tribal areas of the state).\n\nNow Section 2’s coverage for redistricting practices hangs in the balance. Conflicts among the justices in the Louisiana case were evident from the start. The dispute was first heard in March 2025, but then in June the justices issued the unusual order calling for re-argument.\n\nJustice Clarence Thomas dissented from the order, making clear he wanted the court to avoid any delay in finding that Section 2 violates the Constitution as it takes voters’ race into account. “I am hopeful,” Thomas wrote then, “that this Court will soon realize that the conflict its Section 2 jurisprudence has sown with the Constitution is too severe to ignore.”\n\nThomas has yet to claim a majority for his view that Section 2 clashes with the constitutional guarantee of equal protection. And as recently as a 2023 case from Alabama, Allen v. Milligan, the justices said the awareness and use of race was not only permissible but might be required, to compensate for a prior map that, for example, was the result of legislative “cracking” and “packing” techniques – that is, dispersing or concentrating Blacks among districts.\n\nJustice Brett Kavanaugh, who was the key fifth vote in that Alabama case, has suggested that Section 2’s race-based safeguard may no longer be needed some 60 years after passage of the VRA and that, as the court found in the context of higher education, it may violate the Constitution’s guarantee of equal protection of the law. Kavanaugh appears positionedto be a decisive justicehere.\n\nLower court judges who heard the Louisiana controversy had ordered the second majority-Black district after finding that the state legislature had, in an atmosphere of racially polarized voting, divided Black voters across districts in a way that diluted their electoral power. A group of mainly White residents subsequently sued, contending that the revised map was an unconstitutional racial gerrymander.\n\nThe state initially defended the revised map, but Attorney General Murrill and her legal team argued more recently, once the justices reframed the case, that “race-based redistricting is fundamentally contrary to our Constitution.”\n\nThe US solicitor general’s office does not go that far. It instead focuses on how lower court judges assess a VRA violation in the first place and whether a legislature’s map might be driven by politics rather than by race.\n\n“In short,” Sauer wrote in the federal government’s brief, “this Court’s Section 2 jurisprudence should account for the fact that, today, a State’s failure to create a compact majority-minority district, even where demographically possible, is far more likely to reflect political motives than racial ones.”\n\nKavanaugh latched on to the option regarding a state’s “political objectives.” He called it a “real innovation.”\n\nUnder the US solicitor general’s approach, challengers trying to succeed on a VRA Section 2 claim would have to separate party from race and show that the state’s failure to create a majority-minority district reflected racial motives rather than political ones.\n\nCritics, including Harvard University law professor Nicholas Stephanopoulos, say that could extinguish Section 2 claims, particularly in the South, where Blacks overwhelmingly vote Democratic and Whites overwhelmingly vote Republican. Legislators could assert that arguably discriminatory maps protected incumbents and preserved a partisan balance.\n\n“(T)he SG’s position would render Section 2 a dead letter in the southern jurisdictions where the provision has historically had its greatest impact,”Stephanopoulos saidof the solicitor general’s position, noting that an additional minority district can usually be drawn only at the cost of an existing Republican district. “This swap of an old Republican district for a new minority-opportunity district, however, is exactly what the SG’s proposal would prevent.”\n\nDuring October’s oral arguments, Janai Nelson, NAACP Legal Defense Fund director-counsel, told Kavanaugh that requiring new scrutiny of partisanship could undercut state responsibility “to ensure that all voters have an equally open electoral process.”\n\n“The fact that Black voters may correlate with voting Democrat or White voters may correlate with voting Republican does not deny the fact that there is racially polarized voting,” Nelson said. “And the totality of the circumstances, including the inability to elect Black candidates in Louisiana on a statewide basis for a number of offices – there’s never been a Black person in Louisiana elected statewide – is additional indicia that race is playing an outsized role in the electoral process in Louisiana.”\n\nThe state legislature, meanwhile, postponed filing deadlines for the midterm elections, as Murrill and other Louisiana officials anticipated a high court ruling and possible opportunity to change the current map with two Black-majority districts.\n\nBut the filing period for the general primary now is upon candidates. A deadline was Friday, and the justices are not scheduled to return to their courtroom until February 20.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/supreme-court-voting-rights-act-redistricting-10-15-25",
      "text": "Louisiana v. Callais"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/politics/voting-rights-act-supreme-court-conservatives",
      "text": "broadened their review"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/22pdf/20-1199_hgdj.pdf",
      "text": "2023 decision"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/25a608_7khn.pdf",
      "text": "leave in place"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/supreme-court-california-redistricting-map",
      "text": "allowed that map to stand"
    },
    {
      "url": "https://www.cnn.com/2013/06/25/politics/scotus-voting-rights",
      "text": "Shelby County v. Holder"
    },
    {
      "url": "https://www.cnn.com/2021/07/01/politics/voting-rights-act-supreme-court-ruling",
      "text": "diminished the reach of Section 2"
    },
    {
      "url": "https://www.cnn.com/2025/10/16/politics/brett-kavanaugh-future-of-voting-rights-act-analysis",
      "text": "to be a decisive justice"
    },
    {
      "url": "https://electionlawblog.org/?p=152332",
      "text": "Stephanopoulos said"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/supreme-court-voting-rights-louisiana",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/politics/supreme-court-voting-rights-louisiana",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0c8c0f33f735ea856b36cb573169d6be0ab2031575cce4a8602a9c78c526779d",
  "scraped_at": "2026-02-15T07:11:02.745860+00:00"
}