{
  "url": "https://lite.cnn.com/2026/02/20/science/mummified-cheetah-discovery-saudi-arabia",
  "title": "Mummified cheetahs found in Saudi Arabia caves could help reintroduction efforts | CNN",
  "date": "2026-02-22T07:11:08.823059+00:00",
  "authors": [
    "Taylor Nicioli, CNN"
  ],
  "text": "Source: CNN\n\nWhen scientists with the National Center for Wildlife in Saudi Arabia were surveying caves in search of wildlife in 2022 and 2023, they came across something unexpected: seven naturally mummified cheetahs in five caves near the northern city of Arar. The remains were largely intact with well-preserved soft tissue and skeletons.\n\nNow, an analysis of three of the mummies’ DNA has revealed something that could help reintroduce cheetahs to the Arabian Peninsula wilderness, researchers say.\n\nCheetahs once inhabited much of Africa and parts of Asia, but now they are found in only 9% of their historic range. It was previously believed that the Asiatic cheetah, called Acinonyx jubatus venaticus, was the only subspecies ever present in Saudi Arabia. The species is now critically endangered, with a small wild population remaining in Iran. Across the peninsula, cheetahs were deemedlocally extinctin the 1970s.\n\nBut when the researchers analyzed three of the mummies, they found that two of the oldest specimens were genetically closer to the subspeciesAcinonyx jubatus hecki, known as the Northwest African cheetah.\n\nThe findings, published in January in the journalCommunications Earth & Environment,  reveal that at least two subspecies of cheetah once roamed the Arabian Peninsula. The discovery could help reintroduction efforts as scientists now know which cheetah lineages once lived in the peninsula and have evidence of their success in the area.\n\n“It was highly surprising,” said lead author Ahmed Al Boug, an ecologist researcher and deputy CEO of the National Center for Wildlife in Saudi Arabia. “This finding represents the first documented case of natural mummification in cheetahs, and first physical evidence that cheetah subspecies occurred in the Arabian Peninsula.\n\n“Moreover, cave use by cheetahs is extremely atypical behavior, making both the discovery itself and the context in which it occurred entirely unexpected,” he added in an email.\n\nThe researchers are investigating why the cheetahs entered and used the caves; they do not believe it was accidental or for isolation as they neared the end of life. Nonetheless, the cave environment and its hyper-arid conditions contributed to the mummification of the cheetahs, Al Boug said.\n\nAlongside the seven cheetah mummies, the researchers came across skeletal remains of 54 additional cats within the caves. The study authors dated five of them and found the oldest to be about 4,000 years old. Two mummies that were analyzed date from about 130 to 1,870 years ago, according to the study. The authors plan to investigate further the remaining mummies and skeleton fragments to potentially identify the subspecies of additional samples, Al Boug said.\n\n“This discovery is significant in that it represents the easternmost record of an African cheetah subspecies and demonstrates that northern Saudi Arabia was occupied by multiple cheetah lineages over millennia,” Al Boug said. “Together, these findings refine our understanding of cheetah landscape use, clarify timelines of regionalextirpation, and improve resolution on the subspecies historically present in this region.”\n\nTo identify the subspecies of the mummified cheetahs, the authors extracted complete genome sequences from three of the seven remains. It was the first time DNA has been extracted  from naturally mummified cheetahs or large felines, according toa news release from the journal.\n\nAdrian Tordiffe, a veterinary wildlife specialist based in India, said it is surprising that some of the cheetah remains were only about a century old as it reveals that these cats lived in Saudi Arabia far more recently than people realized.\n\n“Even more striking is that the remains show different subspecies of cheetahs lived there at different times,” said Tordiffe, also a lecturer at South Africa’s University of Pretoria, in an email. He was not involved with the study.\n\n“This tells us the Arabian Peninsula was once an important natural bridge for cheetahs, not an ecological dead end.”\n\nTordiffe added that the discovery gives conservationists clear evidence of what species lived in the area in a not-so-distant past. “Because we now know which cheetah lineages lived in Arabia, reintroduction efforts can focus on using animals that are ecologically appropriate, rather than bringing in cheetahs from completely different environments.\n\n“The remains also include young animals and adults, showing that cheetahs weren’t just passing through, they were breeding and thriving. That tells us the landscape once supported full cheetah populations, especially alongside prey species like gazelles, which are now being successfully restored in Saudi Arabia. This research turns cheetah reintroduction from a hopeful idea into a well-informed plan based on real evidence,” Tordiffe said.\n\nWildlife populations in the Arabian Peninsula were historically diminished  by the impact of humans, including overhunting and land-use changes, Al Boug said. But now, with large, protected areas in the Middle East, many of the primary threats to cheetahs, such as habitat degradation, human disturbance and competition with lions have been reduced, he added. As a result, Al Boug said he believes that Saudi Arabia is well-positioned to support the recovery of a species once widespread across the region.\n\n“Showing the length of time the cheetah lived in Saudi Arabia shows that they were an important part of the ecosystem and not just passing through,” said Laurie Marker, founder and executive director of the Cheetah Conservation Fund, a nonprofit that acts to prevent the extinction of cheetahs. Marker was not involved with the new study, but the fund is partnered with the National Center for Wildlife for cheetah reintroduction efforts in Saudi Arabia.\n\n“Cheetahs and other top predators play important roles in the ecosystem. Cheetahs are great hunters and eat rapidly then   also leave remains for feeding other species. Therefore where we find top predators there is a greater amount of biodiversity as they feed the other small mammals, birds and insects,” she added in an email.\n\n“As the Saudis are bringing back their wildlife species, the cheetah will be an important addition to rewilding, bringing back a healthy ecosystem to the desert once again.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.sciencedirect.com/topics/earth-and-planetary-sciences/local-extinction",
      "text": "locally extinct"
    },
    {
      "url": "https://www.nature.com/articles/s43247-025-03021-6",
      "text": "Communications Earth & Environment"
    },
    {
      "url": "https://apps.usgs.gov/thesaurus/term-simple.php?thcode=2&code=365",
      "text": "extirpation"
    },
    {
      "url": "https://www.eurekalert.org/news-releases/1112348",
      "text": "a news release from the journal"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/science/mummified-cheetah-discovery-saudi-arabia",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/science/mummified-cheetah-discovery-saudi-arabia",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0cc473ccc5f395511de61795572596afa396d8207f784dc0c491923938d22124",
  "scraped_at": "2026-02-22T07:11:08.823073+00:00"
}