{
  "url": "https://lite.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
  "title": "Trump announces global tariffs will increase to 15% from 10% ‘effective immediately’ | CNN Business",
  "date": "2026-02-24T07:33:29.626461+00:00",
  "authors": [
    "Auzinea Bacon, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump said on Saturday that he will increase the global tariffs he imposed a day earlier to 15% from 10% following an adverse ruling at the Supreme Court.\n\nThe court on Friday ruled that Trump exceeded his authority with the way he imposed tariffs on trading partners using the International Emergency Economic Powers Act (IEEPA), a law from 1977 reserved for national emergencies.\n\nTrump said in a Truth Social post that “effective immediately,” he would be “raising the 10% Worldwide Tariff on Countries … to the fully allowed, and legally tested, 15% level.” Headded that the administration will determine and issue the new tariffs “during the next short number of months.”\n\nAfter the 6-3 decision, Trump lashed out at the Supreme Court, calling the ruling “deeply disappointing” and adding that he was ashamed of the justices who ruled against his tariffs, which included his own appointees.\n\nTrumpsaid Friday that he would impose a 10% global tariff using presidential powers under trade law Section 122. Those tariffs were set to take effect at 12:01 a.m. ET on Tuesday.\n\nThe White House did not respond to CNN’s request for comment on whether the 15% tariff will take effect on Tuesday.\n\nThe 15% duties would make this year’s effective tariff rate 6%, according to Erica York, vice president of federal tax policy at the Tax Foundation. That’s a measure of the estimated duties as a share of estimated imported goods for the year, according to the Tax Foundation.\n\nPresidents can impose up to 15% in tariffs using Section 122, but those duties are temporary and require congressional approval after 150 days.\n\nTrump imposed sweeping tariffs last year, including the so-called “reciprocal” tariffs that have raised duties as high as 50% on key trading partners, including India and Brazil, and duties onceas high as 145%on China.\n\nTrump may continue imposing duties using other trade laws. The administration has already used Section 232 investigations to impose across-the-board duties onsteel, aluminum,copper,lumber, furniture, cars and car parts.\n\nThe administration could also use Section 301 to investigate countries that potentially violate other nations’ trade agreements or practices in a way that is “unjustifiable” and “burdens or restricts” US business.\n\nAnother tactic would be to impose duties of up to 50% if the US believes trading partners are engaging in discriminatory trade practices,a move that could violate World Trade Organization agreement terms.\n\nTrump is expected to discuss global trade Tuesday in the State of the Union address.\n\nFor many countries, a 15% duty is better than the rates faced under the IEEPA tariffs.\n\nBrazil, which faced duties as high as 50%, along with Canada, China, India, Indonesia, Mexico and South Africa, would face lower rates, noted Joe Brusuelas, chief economist at RSM US.\n\nBut countries like Argentina, Australia, Saudi Arabia and the United Kingdom would face higher tariffs, he added.\n\nBrazil, India and many Asian countries that secured trade deals with Trump are “temporarily winners,” said Kyle Handley, an economics professor at the University of California, San Diego. The administration could impose new tariffs on specific industries using other authorities, he said.\n\nFor now, retailers like Walmart, Target, Costco and Amazon stand to benefit from lower tariffs, Brusuelas said. Appliances were also hit hard by Trump’s tariffs, which negatively impacted companies like Home Depot, Lowe’s and IKEA.\n\nWhile steel and aluminum tariffs remain unaffected, auto parts were “reciprocal,” he added. That’s good news for carmakers like GM, Ford and Toyota.\n\nConsumers who paid higher prices on many items may not benefit from lower tariffs, and there’s a lack of certainty about refunds for individual importers.\n\n“I’ve got a feeling the American people won’t see it,” Treasury Secretary Scott Bessent said about refunds on Friday at an event hosted by the Economic Club of Dallas.\n\nItems in stores may get cheaper as the imported inventory sells, Handley suggested, “but there won’t be too much relief.” And uncertainty will remain for many businesses and trading partners.\n\n“It’s not clear the president has nearly as much flexibility to run around and negotiate very particular deals with every single country, industry by industry. That era is over,” said Handley.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26?post-id=cmlv7utjs00053b6qacfwgs26",
      "text": "deeply disappointing"
    },
    {
      "url": "https://www.cnn.com/2025/05/06/business/tariffs-price-increases-shortages-ports",
      "text": "as high as 145%"
    },
    {
      "url": "https://www.cnn.com/2025/02/10/politics/tariffs-steel-aluminum-trump",
      "text": "steel, aluminum,"
    },
    {
      "url": "https://google.com/search?q=furniture+tariff+cnn&rlz=1C5GCCM_en&oq=furniture+tariff+cnn&gs_lcrp=EgZjaHJvbWUqBggAEEUYOzIGCAAQRRg7MggIARAAGBYYHjIKCAIQABiABBiiBDIKCAMQABiABBiiBDIKCAQQABiABBiiBDIGCAUQRRg8MgYIBhBFGDzSAQgzNjYxajBqNKgCALACAfEF1yZPvfUj5tQ&sourceid=chrome&ie=UTF-8",
      "text": "lumber, furniture"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0da62f4c0cc0351b7db3db0240e34836e2f9dac1b49b5b2188c5841cb3735284",
  "scraped_at": "2026-02-24T07:33:29.626475+00:00"
}