{
  "url": "https://lite.cnn.com/2026/02/14/politics/obama-minnesota-ice-operation-dictatorships",
  "title": "Obama compares ICE’s ‘rogue behavior’ in Minnesota to dictatorships | CNN Politics",
  "date": "2026-02-15T07:10:48.170891+00:00",
  "authors": [],
  "text": "Source: CNN\n\nFormer President Barack Obama criticized Immigration and Customs Enforcement agents’conduct in Minnesotaas dangerous, saying “the rogue behavior” is akin to what “we’ve seen in authoritarian countries” and “in dictatorships.”\n\nThe comments, which came during a wide-ranginginterview with liberal podcasterBrian Tyler Cohen out Saturday, are the latest example of the former presidentreneging on his long-standing strategy of minimizinghis public presence to allow the next generation of Democrats to emerge. He deliberately took a back-seat role during former President Joe Biden’s term.\n\nObama, who has previously criticized President Donald Trump’s deployment of federal agents to US cities, called the actions of immigration enforcement agents in Minnesota “deeply concerning and dangerous.”\n\nThe sweeping immigration enforcement operation in Minnesota, which saw the deployment of roughly 3,000 federal agents, has beenhallmarked by numerous videosshowing federal agents’ aggressive tactics and confrontations with the public.\n\n“It is important for us to recognize the unprecedented nature of what ICE was doing in Minneapolis, St. Paul, the way that federal agents — ICE agents — were being deployed, without any clear guidelines, training, pulling people out of their homes … tear-gassing crowds simply who were standing there, not breaking any laws,” Obama said.\n\nHe added that American citizens should be commended for engaging in “peaceful protests and shining a light on the sort of behavior that, in the past, we’ve seen in authoritarian countries and we’ve seen in dictatorships, but we have not seen in America.”\n\nThe killings of protestersRenee GoodandAlex Prettiin January at the hands of immigration enforcement agents in Minneapolis prompted outrage in the city and across the nation. The Trump administration this weekannounced it is endingits monthslong immigration enforcement surge in Minnesota.\n\nObama,who wrote a column in Januarysaying Pretti’s death should be “a wake-up call” that America’s core values are “under assault,” praised the response of protesters in Minnesota.\n\nProtesters have largely adopted a strategy of civil disobedience in Minnesota, which has includedalerting their communitiesof the presence of immigration agents using whistles, car horns and shouting, and recording encounters with agents.\n\n“That kind of heroic, sustained behavior in subzero weather by ordinary people is what should give us hope,” Obama said in the latest interview.\n\nThe interview was Obama’s first since Trump’s social media account earlier this month posted and then deleteda racist video depictingthe former president and former first lady Michelle Obama as apes in a jungle. Cohen, while mentioning the video, asked Obama how America can reverse the decline of civil discourse.\n\nThough Obama didn’t directly address Trump’s post, he said, “There’s this sort of clown show that’s happening in social media and on television,” adding that people “who used to feel like you had to have some sort of decorum and a sense of propriety and respect” appear to not be showing “any shame about this.”\n\nTrump has refused to apologize for the video, blaming a staffer for the mistake and insisting he hadn’t seen the final frames of the video which contained the offensive content.\n\n“I think it’s important to recognize that the majority of the American people find this behavior deeply troubling,” Obama said. “It is true that it gets attention. It’s true that it’s a distraction.”\n\nHe argued that America can restore “norms, rule of law (and) decency” by saying “enough,” something he said he’s now “seeing across the board.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/us/minneapolis-immigration-draw-down",
      "text": "conduct in Minnesota"
    },
    {
      "url": "https://www.youtube.com/watch?v=uI-hgSE5QIw",
      "text": "interview with liberal podcaster"
    },
    {
      "url": "https://www.cnn.com/2025/10/31/politics/barack-obama-donald-trump",
      "text": "reneging on his long-standing strategy of minimizing"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/01/09/us/dhs-immigration-crackdown-ice-arrests-protests-vis/",
      "text": "hallmarked by numerous videos"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/us/renee-nicole-good-minneapolis-ice-shooting-hnk",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/alex-pretti-minneapolis-ice-shooting-invs",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "announced it is ending"
    },
    {
      "url": "https://barackobama.medium.com/a-wake-up-call-for-every-american-ec0115195303",
      "text": "who wrote a column in January"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/us/teenage-brothers-ice-watchers-minneapolis",
      "text": "alerting their communities"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/donald-trump-obamas-apes-truth-social",
      "text": "a racist video depicting"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/obama-minnesota-ice-operation-dictatorships",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/politics/obama-minnesota-ice-operation-dictatorships",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0eea53e46d86745715ff842e09699f693b9c993abf7cb6626a72d0f5c3b16d3f",
  "scraped_at": "2026-02-15T07:10:48.170904+00:00"
}