{
  "url": "https://lite.cnn.com/2026/02/20/business/tariff-prices-supreme-court-ruling",
  "title": "What the Supreme Court’s tariff ruling means for the prices you’re paying | CNN Business",
  "date": "2026-02-23T07:37:33.576735+00:00",
  "authors": [
    "Matt Egan",
    "David Goldman",
    "CNN"
  ],
  "text": "Source: CNN\n\nNow that theSupreme Court has taken awaya significant chunk of President Donald Trump’s tariff-wielding authority, what does that mean for your prices?\n\n“Nothing,” said Stephanie Roth, chief economist at Wolfe Research.\n\nThat’s because Trump has other tariff levers to pull. The Supreme Court noted other authorities remain available to Trump, including the laws that permitted the administration to raise significant tariffs on steel, aluminum and other imports — all of which remain in place.\n\nAnd many of the tariffs that the Supreme Court overturned can be replaced with other tariffs. Trump on Friday announced he would do just that, planning toslap a 10% global tariffon imports under Section 122 of the 1974 Trade Act, a different authority that was not struck down by the high court.\n\nAnd even if the administration is ultimately required to refund companies that paid the overturned tariffs (a question that remains unsettled), that doesn’t mean you’ll get a refund for the higher prices you paid for sneakers, furniture or other items that grew more expensive because of Trump’s policies.\n\n“Companies are highly unlikely to start trimming their prices as a result,” Roth said. “Walmart is not going to give you a check for the 15% tariff on sneakers you bought from them four months ago.”\n\nEconomists don’t expect the Supreme Court decision to be a game-changer forconsumer prices— especially because Trump made clear he’s not retreating.\n\n“Companies are always reluctant to lower prices. Now Trump has given them a perfect excuse not to,” said Scott Lincicome, vice president of general economics and trade at the Cato Institute.\n\nTrump’s tariffs added $1,000 in tax expenses for the average US household in 2025, according to the conservative-leaning Tax Foundation.\n\nBut the future remains unclear. Trump officials haven’t decided yet how they plan to rebuild his tariff agenda.\n\nThe effective tariff rate was roughly 10% before the Supreme Court’s ruling and currently sits at around 4.5%, said Erica York, vice president of federal tax policy at the Tax Foundation. That could rise back above 10% if Trump applies Section 122 tariffs at 10% globally without exemptions for the 150-day limit.\n\nBut she noted that many companies paid Trump’s tariffs and didnotpass the bulk of the tariff costs on to consumers. So even if the effective tax rate falls, prices aren’t likely to sink for consumers because of the ruling Friday.\n\n“There won’t be a dramatic overnight change in prices,” York said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
      "text": "Supreme Court has taken away"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26",
      "text": "slap a 10% global tariff"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26?post-id=cmlv4xvew0000356u9qn5bi69",
      "text": "consumer prices"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/business/tariff-prices-supreme-court-ruling",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/business/tariff-prices-supreme-court-ruling",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0f5a6deb9006c8159e1080f02e3b54bb23c61c2eac6c8979036208a73a81218b",
  "scraped_at": "2026-02-23T07:37:33.576747+00:00"
}