{
  "url": "https://lite.cnn.com/2026/02/10/politics/ice-hearing-immigration-takeaways",
  "title": "Four takeaways from today’s House testimony on immigration | CNN Politics",
  "date": "2026-02-12T21:32:09.552463+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nWith the Trump administration’s mass deportation push underintense scrutiny, the heads of Immigration and Customs Enforcement, Customs and Border Protection, and US Citizenship and Immigration Services faced tough questions during a congressional committee hearing on Tuesday.\n\nICE Acting Director Todd Lyons, CBP Commissioner Rodney Scott and USCIS Director Joseph Edlow spent more than three hours testifying in front of the House Homeland Security Committee.\n\nLyons and Scott faced tough questions about last month’s shootings ofRenee GoodandAlex Prettiin Minneapolis by officers under their command. Both said the shootings were being investigated — and committed to sharing the results of those investigations with Congress — but otherwise, they largely declined to comment about the shootings because of the active probes.\n\nEdlow, meanwhile, largely avoided scrutiny during the hearing.\n\nHere are the takeaways from the hearing:\n\nThe committee repeatedlybrought upthe killings of Pretti and Good in Minneapolis by federal agents last month. Lyons and Scott, both of whom lead agencies whose officers were involved in the shootings, declined to say much about them, citing active investigations. They repeated versions of that line in response to multiple questions from Democratic lawmakers.\n\nNeither Scott nor Lyons mentioned the killings — which have caused a widespread backlash against Trump’s immigration enforcement efforts — in their opening statements.\n\nBut both told the committee’s chairman, Republican Rep. Andrew Garbarino, that they would commit to providing Congress the results of both of those investigations after they are completed.\n\nSome of the strongest lines of questioning came from Rep. Eric Swalwell, who brought up Lyons’previous commentsthat he sought to build a deportation system that was as efficient as Amazon.\n\nSwalwell asked Lyons whether Amazon has ever shot a mother in the face or an ICU nurse in the back — references to Good and Pretti. Lyons responded no.\n\nSwalwell then asked Lyons whether he would be open to apologizing to Good’s family for the way she was characterized by Trump administration officials as a terrorist almost immediately after her death.\n\n“I welcome the opportunity to speak to the family in private,” Lyons responded, “but I’m not going to comment on any active investigation.”\n\nLyons refused to answer whether the way the Trump administration characterized both Good and Pretti was wrong.\n\nAdolf Hitler’s murderous Third Reich wasrepeatedly invokedduring the hearing, as Democrats used it as a comparison for everything ranging from Border Patrol officialGregory Bovino’s attireto the tactics used by federal authorities during their immigration crackdown.\n\nLyons was asked by Rep. Dan Goldman, a Democrat, if he knew if “other regimes in the 20th century required similar proof of citizenship?”\n\nLyons responded that various “nefarious” regimes did so.\n\n“Is Nazi Germany one?” Goldman asked. Lyons said “yes,” and then tried to clarify his answer before Goldman cut him off.\n\nLyons told Goldman that his line of questioning was wrong and encouraged him to visit a Holocaust museum to see what Nazism looked like.\n\n“To say that the men and women of ICE are Gestapos is wrong,” he added.\n\nScott confirmed there were open investigations into the conduct of CBP officers but provided no further details. CNN previouslyhas reportedthat video taken in cities across the country which are facing immigration crackdowns have shown agents shoving protesters, shooting non-violent people with less-lethal weapons and spraying chemical irritants into the inside of vehicles.\n\nLyons, meanwhile, declined to discuss aspects of any possible internal investigations, including whether any of his officers have been fired for their conduct. Lyons and Scott were asked about several specific incidents, but both declined to provide much information or insight into what took place.\n\nFollowing the killings of both Pretti and Good, there was bipartisan condemnation of the way both ICE and Border Patrol handled the incidents which led to their killings, and how top officials in the administration handled the public backlash.\n\nBut during the hearing, both sides seemed firmly dug in on their side of the aisle. While the committee’s Republican chairman referenced Good and Pretti — and had the heads of the agencies which killed them commit to releasing investigations into their killings to Congress — few other Republicans mentioned them.\n\nInstead, Republicans accused Democrats of fomenting hate and threats against ICE, criticized the policies of so-called “sanctuary cities,” frequently promoted the “worst of the worst” immigrants which DHS says they have arrested, and blamed previous presidential administrations for current issues with the nation’s immigration system.\n\nThe hearing proved that both Democrats and Republicans remained firmly entrenched in their own positions as the debate over the Department of Homeland Security’s budgetdrags on.\n\nDuring one notable exchange, Rep. LaMonica McIver, a Democrat who last year was charged with impeding federal officers outside of a New Jersey detention facility, asked Lyons whether he was a religious man. Lyons responded that he was.\n\nShe then asked Lyons if he thought he was going to hell. That question was shut down by the committee’s chairman.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/judges-contempt-justice-department-minnesota",
      "text": "intense scrutiny"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/us/renee-nicole-good-minneapolis-ice-shooting-hnk",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/us/alex-pretti-shooting-trump-administration-narrative",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-epstein-files-02-10-26?post-id=cmlgufrjj00003b6pe1dmane0",
      "text": "brought up"
    },
    {
      "url": "https://www.cnn.com/2025/09/22/politics/artificial-intelligence-immigration-enforcement",
      "text": "previous comments"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-epstein-files-02-10-26?post-id=cmlgug559000m3b6prwfb6jb9",
      "text": "repeatedly invoked"
    },
    {
      "url": "https://www.cnn.com/2026/01/25/politics/gregory-bovino-minneapolis-immigration-crackdown",
      "text": "Gregory Bovino’s attire"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/01/09/us/dhs-immigration-crackdown-ice-arrests-protests-vis/index.html",
      "text": "has reported"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-epstein-files-02-10-26?post-id=cmlgrqhkp00003b6ps1b0nipv",
      "text": "drags on"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/ice-hearing-immigration-takeaways",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/ice-hearing-immigration-takeaways",
      "text": "Cookie Settings"
    }
  ],
  "hash": "0fc08f382f04076d491e82b962321678967d5be4b5d093a98aab22dcb9a60c16",
  "scraped_at": "2026-02-12T21:32:09.552477+00:00"
}