{
  "url": "https://lite.cnn.com/2026/02/09/politics/us-military-oil-ship-boarding-indian-ocean",
  "title": "US military boards sanctioned oil tanker in the Indian Ocean after pursuit from the Caribbean | CNN Politics",
  "date": "2026-02-11T16:41:13.271802+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nUS military forces boarded a sanctioned oil tanker in the Indian Ocean after tracking the ship from the Caribbean Sea, the Pentagon said Monday.\n\nThe Pentagon’s statement on social media did not say whether the ship was connected to Venezuela, which faces US sanctions on its oil and has relied on a shadow fleet of falsely flagged tankers to smuggle crude into global supply chains.\n\nHowever, the Aquila II was one of at least 16 tankers that departed the Venezuelan coast last month after US forces captured then-President Nicolás Maduro, said Samir Madani, co-founder of TankerTrackers.com. He said his organization used satellite imagery and surface-level photos to document the ship’s movements.\n\nAccording to data transmitted from the ship on Monday, it is not currently laden with a cargo of crude oil.\n\nThe Aquila II is a Panamanian-flagged tanker under US sanctions related to the shipment of illicit Russian oil. Owned by a company with a listed address in Hong Kong, ship tracking data shows it has spent much of the last year with its radio transponder turned off, a practice known as “running dark” commonly employed by smugglers to hide their location.\n\nUS Southern Command, which oversees Latin America, said in an email that it had nothing to add to the Pentagon’s post on X. The post said the military “conducted a right-of-visit, maritime interdiction” on the ship.\n\n“The Aquila II was operating in defiance of President Trump’s established quarantine of sanctioned vessels in the Caribbean,” the Pentagon said. “It ran, and we followed.”\n\nThe US did not say it had seized the ship, which the US has done previouslywith at least seven other sanctioned oil tankerslinked to Venezuela.\n\nSince the US ouster of Maduro in a surprise nighttime raid on Jan. 3, the Trump administration has set out to control the production, refining and global distribution of Venezuela’s oil products. Officials in President Donald Trump’s Republican administration have made it clear they see seizing the tankers as a way to generate cash as they seek to rebuild Venezuela’s battered oil industry and restore its economy.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/politics/oil-tanker-seizure-caribbean",
      "text": "with at least seven other sanctioned oil tankers"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/us-military-oil-ship-boarding-indian-ocean",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/us-military-oil-ship-boarding-indian-ocean",
      "text": "Cookie Settings"
    }
  ],
  "hash": "10f011cd639887606bfa7220c154d2b2b2f50dbea874caad578d80f78070dfb7",
  "scraped_at": "2026-02-11T16:41:13.271814+00:00"
}