{
  "url": "https://lite.cnn.com/2026/02/14/europe/viktor-orban-eu-hungary-election-intl",
  "title": "Viktor Orbán says the EU is Hungary’s real threat ahead of April election | CNN",
  "date": "2026-02-15T07:11:04.811669+00:00",
  "authors": [],
  "text": "Source: AP\n\nThe real threat facing Hungary is not Russia but theEuropean Union, Prime MinisterViktor Orbánsaid in a speech to supporters on Saturday, as his nationalist party ramps up an anti-EU campaign ahead of national elections.\n\nWith only eight weeks until the April 12 vote, Orbán and his Fidesz party are facing their most serious challenge since the right-wing populist leader retook power in 2010.\n\nMost independent polls show Fidesz trailing the center-right Tisza party and its leader, Péter Magyar, even as Orbán has campaigned on the unsubstantiated premise that the EU would send Hungarians to their deaths in neighboring Ukraine if his party loses.\n\nIn his speech on Saturday, Orbán compared the EU to the repressive Soviet regime that dominated Hungary for over 40 years last century, and dismissed the belief of many European leaders that Russian President Vladimir Putin poses a threat to the continent’s security.\n\n“We must get used to the idea that those who love freedom should not fear the East, but Brussels,” he said, referring to the EU’s de-facto capital in Belgium.\n\n“Fear-mongering about Putin is primitive and unserious. Brussels, however, is a palpable reality and a source of imminent danger,” he said “This is the bitter truth, and we will not tolerate it.”\n\nOrbán has been a firm opponent of military and financial aid for Kyiv since Russia launched its full-scale invasion nearly four years ago, and has maintained close relations with Moscow while adopting a combative posture toward Hungary’s EU and NATO partners, which he portrays as warmongers.\n\nIn December, he said it was “unclear who attacked whom” when tens of thousands of Russian forces poured across Ukraine’s borders in February 2022.\n\nHungary’s government has long been at odds with the EU, which has frozen billions of euros in funding to Budapest over concerns that Orbán has dismantled democratic institutions, eroded judicial independence and overseen widespread official corruption. In return, Orbán has increasingly acted as a spoiler in EU decision-making, routinely threatening to veto key policies like providing financial support for Ukraine.\n\nAs the elections approach, he has increasingly portrayed the Tisza party as a puppet created by the EU to overthrow his government and serve foreign interests, claims that Tisza has firmly denied. Magyar, the party’s leader, has pledged to repair Hungary’s strained relations with its Western allies, revive the stagnant economy and return the country to a more democratic track.\n\nOn Saturday, Orbán accused multinational corporations like banks and energy companies of profiting off the war in Ukraine, and conspiring with his political opposition to defeat him in the election.\n\n“It is crystal clear that in Hungary the oil business, the banking world and the Brussels elite are preparing to form a government,” he said. “They need someone in Hungary who will never say no to Brussels’ demands.”\n\nIf his party wins a fifth-straight majority in the election, Orbán promised to continued in his aim of ridding Hungary of entities that he argues infringe on the country’s sovereignty.\n\nHe credited US President Donald Trump, who has endorsed him ahead of the election, with creating an environment where “fake nongovernmental organizations and bought-and-paid-for journalists, judges and politicians” can be expelled.\n\n“The new president of the United States has rebelled against the global business, media and political network of liberals, thus improving our chances,” he said. “We, too, can go a long way and expel foreign influence from Hungary, along with its agents, that limit our sovereignty.”\n\n“The Brussels repressive machine is still operating in Hungary. We’ll clean it up after April,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/europe/munich-security-conference-merz-rubio-intl",
      "text": "European Union"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/europe/orban-hungary-right-wing-campaign-election-intl",
      "text": "Viktor Orbán"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/viktor-orban-eu-hungary-election-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/europe/viktor-orban-eu-hungary-election-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "118368f6bc1b70ffa865777e9aed670af2ccbcdcb001cb6e1d1f9b5f1cd8306b",
  "scraped_at": "2026-02-15T07:11:04.811682+00:00"
}