{
  "url": "https://lite.cnn.com/2026/02/15/politics/doj-epstein-files-prominent-people",
  "title": "Justice Department lists hundreds of prominent people named in Epstein files in letter to Congress | CNN Politics",
  "date": "2026-02-16T07:34:17.819619+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Department of Justice on Saturday sent Congress a list of “politically exposed persons” in the millions offiles releasedrelated to its probes into convicted sex offender Jeffrey Epstein.\n\nThe six-page letter, a copy of which was obtained by CNN, includes the names of many prominent figures who appear in the files, regardless of the context, and does not specify the degree to which the people were linked to or in contact with Epstein. The letter is signed by Deputy Attorney General Todd Blanche and addressed to top members on the House and Senate Judiciary Committees.\n\nThe DOJ was compelled to produce the list by the Epstein Files Transparency Act passed by Congress. CNN has reached out to the DOJ for more details about the list it sent to lawmakers.\n\nWhile some of the people on the list have well-documented ties to the convicted sex offender, others are not known to have ever personally interacted with Epstein. The list includes presidents, business leaders and government officials, in addition to cultural icons who have died, such as Princess Diana, Elvis Presley and Michael Jackson.\n\nIt also mentioned prominent individuals who have previously been linked to Epstein, includingPresident Donald Trump, formerPresident Bill Clinton, former Trump adviserSteve Bannon, former White House CounselKathy Ruemmlerand billionaire business magnateLes Wexner.\n\nNo one on the list, other than Epstein and his accomplice Ghislane Maxwell, have ever been charged in connection with Epstein’s crimes.\n\nThe letter to Congress also includes newly named prominent individuals – some of whom were merely featured in news articles and newsletters and do not appear to be linked directly to Epstein or to have communicated with him.\n\n“Names appear in the files released under the Act in a wide variety of contexts,” the DOJ letter states. “For example, some individuals had extensive direct email contact with Epstein or Maxwell while other individuals are mentioned only in a portion of a document (including press reporting) that on its face is unrelated to the Epstein and Maxwell matters.”\n\nRep. Ro Khanna, a co-author of the law that forced the files’ release, said the DOJ is “purposefully muddying the waters on who was a predator and who was mentioned in an email” by releasing the list of more than 300 people.\n\nRepublican Rep. Nancy Mace, a vocal ally of Epstein survivors, slammed the DOJ in a Saturday night social media post, claiming there are “missing names on the list disclosed this evening.”\n\nAs in its previous letters to Congress, the DOJ lists reasons for redacting information in the files that go beyond what the law passed by Congress requires, including documents showing deliberative process, work product and attorney-client communications that would be privileged.\n\n﻿The department has come under heavy criticism from Epstein victims and members of Congress since the files were released over its inconsistent redactions of names and details in the millions of released documents.\n\nSome members of Congress whoviewed unredacted versionsof the documents later said that the Justice Department was protecting powerful men, prompting them toun-redact additional namesin the files.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/jeffrey-epstein-files-release-doj",
      "text": "files released"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/new-documents-trump-epstein",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/epstein-files-clintons",
      "text": "President Bill Clinton"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/world/bannon-epstein-take-down-pope-francis-latam-intl",
      "text": "Steve Bannon"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-golman-sachs-epstein-ties-invs-vis",
      "text": "Kathy Ruemmler"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "Les Wexner"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/unredacted-epstein-files-doj-congress",
      "text": "viewed unredacted versions"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "un-redact additional names"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/doj-epstein-files-prominent-people",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/politics/doj-epstein-files-prominent-people",
      "text": "Cookie Settings"
    }
  ],
  "hash": "11c598607b0411816100c3e9393652f21b6dab8e7dcf82073681185c9581f894",
  "scraped_at": "2026-02-16T07:34:17.819647+00:00"
}