{
  "url": "https://lite.cnn.com/2026/02/16/style/adidas-tang-jacket-chinese-new-year-trend-intl-hnk",
  "title": "Adidas ‘Tang’ jacket: Why the Chinese New Year collection has gone viral | CNN",
  "date": "2026-02-18T07:32:55.783559+00:00",
  "authors": [
    "Stephy Chung, CNN"
  ],
  "text": "Source: CNN\n\nEveryLunar New Year, brands release zodiac animal-themed merchandise and items in the lucky color red. This year, there’s one product that has cut through all the noise: the Adidas Chinese Track Top.\n\nIt wasn’t explicitly marketed for the festive season, but has been unofficially dubbed the “Chinese New Year” or “Tang” jacket on TikTok and Instagram, where it’s been going viral over the past few months after the latest version debuted at Shanghai Fashion Week.\n\nInitially only sold in China, and then a handful of Asian markets before becoming available in Europe in February, they have since become a holy grail among Gen Z — and emblematic of young people’s growing embrace of all things China.\n\nThe jacket’s nickname notes its resemblance to the Tang suit, a historic garment tracing back to China’s Qing dynasty, with an earlier iteration, the “ma gua,” worn by horse riders from the mid 17th century. They share some key design details: ornamental, knotted toggles, known as frog buttons or “pankou,” and a standing Mandarin collar.\n\nOnevideotitled “POV: your dad just came back from China,” which shows a man handing the tops out to family members from a suitcase, has been watched over 2.6 million times;anotherof a young woman walking the streets in a dark gray version has raked in over 1 million views across TikTok and Instagram. “Flew to China for this viral jacket. Soo worth it,” reads the accompanying caption.\n\nCNN called Adidas stores in several major Chinese cities to find the jackets were either completely sold out or only available in certain colors. Online resellers like StockX now carry them for as much as $400.\n\nIt’s not the first time the German sportswear giant has riffed on Chinese aesthetics, and the success of their latest jackets isn’t just due to the classic formula of hype and scarcity. They’ve have dropped at a fascinating intersection of identity, internet culture and even geopolitics.\n\nIn recent years, young people in China have championed the “xinzhongshi,” or “new Chinese style,” trend, which contemporizes traditional design and reflects wearers’ rising confidence in their national and cultural identity. The term has been used as a marketing tool on the country’s lucrative e-commerce platforms and has played out on its streets, where modern takes on centuries-old garments like the “mamianqun,” or horse-face skirt, have become an increasingly common sight. Chinese fashion designers like Samuel Gui Yang have meanwhile been subtly weaving “Chineseness” into their designs for over a decade, often to exquisite effect.\n\nThe Adidas jacket arrives “during the continuing rise of the New Chinese Style, and many longstanding questions and answers about how to express modern Chinese identity in fashion,” said Sarah Cheang, a design historian at the UK’s Royal College of Art. Cheang added that the design offers a refreshing alternative to “stereotypical dragon motifs,” with its resemblance to Tang suits helping to “move the associations away from aggression and Chinese mythology, and slightly more towards Chinese traditions of contemplation, scholarship and more internal balance practices such as tai chi.”\n\nAdidas says the jacket was created by its Shanghai-based design team targeting Chinese consumers as part of a wider strategy to design in — and for — the country’s domestic market. The company has also worked on Chinese New Year collaborations with homegrown designers, such as Gui Yang, and celebrities like the Canada-born Hong Kong actor and singerEdison Chen. (Sales figures suggest its localizationeffortsare paying off: Adidas reported a10% increasein China revenues in 2024, a significant turnaround from a36% dropin sales in the country in 2022).\n\nBut regardless of who the jacket was intended for, its quintessentially Chinese aesthetic has resonated globally. The buzz has coincided with the viral meme “You met me at a very Chinese time in my life,” part of a wider “Chinesemaxxing” trend that sees Gen Z posting their appreciation for aspects of Chinese culture, food, wellness and technology. The phenomenon appears to reflect disillusionment with the perceived instability and decline of the US as a superpower at a time when China’s standing in the world, and subsequent soft power, grows.\n\n“It’s hitting at the right moment with this ‘becoming Chinese’ trend in the West and this overall shift towards a positive image of China and Chinese culture,” said Bohan Qiu, founder of Shanghai-based creative, PR and brand consultancy agency Boh Project. The jackets are “the perfect armor, or piece of fashion, to tie this trend together.”\n\nSocial media users have also been poking fun at how popular the jackets are among the Asian diaspora. In a humorousTikTok video, Toronto-based content creator Chris Zou says he bought three and recounts — while wearing his burgundy one — the moment when he visited China and realized that “all the people who are buying and wearing these jackets out here in public, are not even Chinese — they’re like Singaporeans, Malaysians, Americans, Australians.”\n\n“Does wearing this jacket make me look like a foreigner?” he recalled asking locals, to which they replied: “Um, you kinda just look like an overseas Chinese who is desperately trying to reconnect with their roots.”\n\nElsewhere, in askitwidely shared on Instagram and viewed over 400,000 times,Sam LiandQuentin Nguyen-Duyplay two young Asian Americans heading to Asia to “reconnect with their roots.” The duo — who had to borrow jackets from friends, since they were sold out in every Adidas store they visited in Taipei, Taiwan, where they were filming — are seen smoking cigarettes while squatting and saying “Ni-howdy” to passersby as they bumble through the city attempting to tap into local culture.\n\nNguyen-Duy told CNN the jacket was an essential prop, as “it’s the best visual representation…of Asian Americans trying to become more Asian, as the years go on, in kind of a performative way.”\n\n“For me, it was seeing my (Asian) friends who grew up in America, whether it’s San Mateo or San Francisco, the Bay Area or upstate New York… doing the unboxing and saying, in a Californian accent, ‘Hey guys, check out this new, viral, Mandarin-style jacket,” laughed Li, who is Chinese American. “I thought it was this interesting dichotomy of someone who is in a lot of ways, very American, experiencing Asian culture but through Adidas.”\n\nFun aside, Nguyen-Duy believes international interest emerged because “an incredibly recognizable brand” has “taken Chinese design and blended it in a very mainstream and accessible way.”\n\nQiu echoed the sentiment, calling the jacket “a door-opening item that will lead more people to want to discover Chinese style.” He added that some designers in China have already moved beyond incorporating traditional Chinese design to what he called the “next phase” — a deeper approach to making clothes grounded not just in Chinese heritage but also philosophy.\n\n“Pankou” fastenings are only “cracking the surface.”\n\n“There’s an infinite amount of references one can take from Chinese design and dressing, because it has such a long history. All the dynasties have different design elements and techniques and way of clothes-making.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/travel/chinese-lunar-new-year-2026-guide-intl-hnk",
      "text": "Lunar New Year"
    },
    {
      "url": "https://www.instagram.com/reel/DSp9JkBEb5Z/?igsh=MXN2anhpbzNlcGU5ZQ%3D%3D",
      "text": "video"
    },
    {
      "url": "https://www.instagram.com/reel/DSANDChkam-/?igsh=dW5jazhrZTZwZG15",
      "text": "another"
    },
    {
      "url": "https://www.cnn.com/2024/06/16/style/new-chinese-style-gen-z-intl-hnk",
      "text": "xinzhongshi"
    },
    {
      "url": "https://www.cnn.com/2024/06/16/style/new-chinese-style-gen-z-intl-hnk",
      "text": "Chineseness"
    },
    {
      "url": "https://news.adidas.com/originals/adidas-originals-x-clot-by-edison-chen--channel-the-spirit-of-the-horse-for-chinese-new-year-2026/s/317567bc-971b-40b1-ac38-75721435caaf",
      "text": "Edison Chen"
    },
    {
      "url": "https://daxueconsulting.com/market-research-on-adidas-in-china/",
      "text": "efforts"
    },
    {
      "url": "https://report.adidas-group.com/2024/en/group-management-report-financial-review/business-performance-by-segment/greater-china.html",
      "text": "10% increase"
    },
    {
      "url": "https://www.reuters.com/business/retail-consumer/china-turnaround-challenge-dwarfs-adidas-yeezy-debacle-2023-05-05/",
      "text": "36% drop"
    },
    {
      "url": "https://www.tiktok.com/@storiesofcz/video/7595340365222169863?lang=en",
      "text": "TikTok video"
    },
    {
      "url": "https://www.instagram.com/reel/DUBgUOTgfzk/?igsh=MWFtend5eWhjeDhhNg==",
      "text": "skit"
    },
    {
      "url": "https://www.instagram.com/thesamlitv?igsh=MTA5ZnVld29hODdlYw==",
      "text": "Sam Li"
    },
    {
      "url": "https://www.instagram.com/quentin_nguyenduy?igsh=M2VqbjRiNDU5Ym11",
      "text": "Quentin Nguyen-Duy"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/style/adidas-tang-jacket-chinese-new-year-trend-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/style/adidas-tang-jacket-chinese-new-year-trend-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1260a0cc3425e271c9c58cd24457c1192dd6223aaeda35d4354a3ebd2de710e2",
  "scraped_at": "2026-02-18T07:32:55.783570+00:00"
}