{
  "url": "https://lite.cnn.com/2026/02/17/politics/epstein-ranch-new-mexico-house-committee",
  "title": "New Mexico lawmakers pass measure aimed at investigating Epstein’s Zorro Ranch | CNN Politics",
  "date": "2026-02-18T07:31:09.945518+00:00",
  "authors": [
    "Kaanita Iyer, CNN"
  ],
  "text": "Source: CNN\n\nNew Mexico’s House of Representatives has approved creating a bipartisan special committee to investigate the ranch that the late sex offenderJeffrey Epsteinowned in the state.\n\nThemeasure, which passed Monday, directs the committee, called the Truth Commission, to look into the “allegations of criminal activity” on the property — known as Zorro Ranch — and decide whether other “legislative action” is required. The committee has the authority to “compel the attendance of witnesses” and to “issue subpoenas.”\n\n“[T]he house of representatives is concerned that the failure to investigate the alleged criminal activity at Zorro ranch and the risk of potential consequences of that activity continue to affect the safety and welfare of the state and that continued legislative inaction threatens public confidence in state government,” the measure reads.\n\nThe measurepassed with 62 votes, with no members in opposition. Eight lawmakers were excused from voting.\n\nThe committee’s creation is the latest call for transparency and further investigation in the aftermath of the US Department of Justice’s release of a trove ofEpstein files, which has sent shockwaves across several industries after revelations of the late financier’s ties withprominent figures.\n\nUS Rep. Melanie Stansbury of New Mexico applauded the passage of the measure Tuesday, saying in a meeting with the measure’s co-sponsors, “New Mexico is acting where the federal government is failing to do so.”\n\n“For many, many years, there were allegations of sexual assault and abuse that happened at Zorro Ranch here in New Mexico, which is one of multiple properties that Jeffrey Epstein held, and those crimes were never fully investigated — neither by local authorities nor the FBI,” said Stansbury, a Democrat.\n\nState Rep. Marianna Anaya, one of the bill’s co-sponsors, told CNN it is “a relief” that the measure passed, especially in a bipartisan manner, and added that the committee is prepared to hold the state accountable.\n\n“We really find that it’s our responsibility as current lawmakers to make sure that we not only investigate but that we hold people accountable — not just Jeffrey Epstein himself, but those who enabled him, as well as institutions that failed these survivors. So even if it means holding the state accountable, we think that it’s necessary,” the Democratic lawmaker said.\n\nAnaya, who was approached by another co-sponsor in September about creating the commission, stressed that the committee’s power to subpoena will be “really critical.”\n\n“So in addition to investigating the physicalities of the property itself, we are also partnering with our New Mexico Department of Justice to make sure that survivors can come forward, witnesses can come forward, in a way in which is taken seriously unlike years previous,” Anaya said.\n\nBefore the committee is defunct on January 1, 2027, it must submit at least two reports — one to state House leadership on or before July 31 and one to all House members on or before December 31, according to the measure text.\n\nAmong the US Justice Department’s latest release of millions of pages of documents related to Epstein is a2019 emailsent to Eddy Aragon, the host of a local radio show, that alleged that “somewhere in the hills outside the Zorro, two foreign girls were buried on orders of Jeffrey and Madam G.”\n\n“Both died by strangulation during rough, fetish sex,” the email claimed. The unverified allegations came from someone who claimed they were a former employee at the ranch. The sender of the email was redacted by the DOJ. It’s not clear that those allegations have been investigated by law enforcement.\n\nAccording to the file, Aragon forwarded the email four days later to a redacted email address.\n\nReached by CNN on Tuesday, Aragon said he believes the email was sent to him by someone who worked on the ranch but wouldn’t disclose who he thought that person was. Aragon also said he has tried to contact the email address but that his messages bounced back.\n\nThe radio host added that he went to the local FBI office with the email and forwarded it to a local FBI agent. Aragon said since then, he hasn’t been contacted by law enforcement officials regarding the email.\n\nIt was this email that prompted Stephanie Garcia Richard, New Mexico’s commissioner of public lands, to send aletterlast week to the state’s Department of Justice and the first assistant US attorney of New Mexico to investigate the claims.\n\nGarcia Richard told CNN that Epstein’s ranch included state lands that were leased. The hills behind the ranch, referred to in the 2019 email, are state land, she said, adding that to her knowledge, the allegation has never been investigated.\n\n“So knowing or thinking that no investigation had been done, I renewed my calls for investigation based on this particular allegation,” Garcia Richard said. She added that she first offered to cooperate with any investigation in 2019 — when she took office and the year that Epstein was indicted on charges of sex trafficking and later died by suicide while awaiting trial — but “there has not been any investigation on the state land portions of the ranch, nor the private land portions of the ranch that I’m aware of.”\n\nCNN has reached out to the FBI to ask whether it followed up on the email and investigated the allegation.\n\nGarcia Richard shared with CNN that since her letter, she was contacted by the special investigative office of the state DOJ for “background information” on state lands and her agency’s processes and documents it released in 2019.\n\n“I’m very hopeful that they will move forward on something. I’m not sure what,” she said.\n\nGarcia Richard also told CNN that she is “very supportive” of the Truth Commission and that her agency is “committed to granting access to state land, partnering with them in any way possible.”\n\nThe New Mexico Department of Justice last week asked US Deputy Attorney General Todd Blanche in a letter to share the unredacted 2019 email and all information related to the identity of the sender.\n\nThe state DOJ told CNN on Tuesday it has yet to receive a response to the letter.\n\n“While we have not yet received a response to our letter sent last Friday, we are reviewing all appropriate avenues to investigate the allegations raised, as well as any additional ones that may emerge,” state DOJ spokesperson Chelsea Pitvorec said. “We also continue to engage with Truth Commission leadership to ensure coordinated communication and meaningful participation in the ongoing fact-finding mission.”\n\nCNN has reached out to the US Justice Department to ask whether it plans to comply with the request and for additional comment.\n\nThe ranch — which Epstein bought in 1993, according to the text of the House measure — was purchased in 2023 by the family of Don Huffines, a former Texas state senator who is running to be the state’s comptroller.\n\nHuffines said onsocial mediaMonday that “proceeds from the sale benefited the victims” of Epstein and that the ranch is being rebuilt into a Christian retreat.\n\nHuffines added that while he has not been contacted by law enforcement officials, he will fully cooperate if they do reach out.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Jeffrey Epstein"
    },
    {
      "url": "https://www.nmlegis.gov/Sessions/26%20Regular/resolutions/house/HR01.pdf",
      "text": "measure"
    },
    {
      "url": "https://www.nmlegis.gov/Sessions/26%20Regular/votes/HR01HVOTE.pdf",
      "text": "passed with 62 votes"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Epstein files"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/epstein-files-musk-lutnick-branson-emails",
      "text": "prominent figures"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00067066.pdf",
      "text": "2019 email"
    },
    {
      "url": "https://www.nmstatelands.org/wp-content/uploads/2026/02/Letter-to-USDOJ-NMDOJ-re-Epstein-Final-2-10-26.pdf",
      "text": "letter"
    },
    {
      "url": "https://x.com/DonHuffines/status/2023598880340738116?s=20",
      "text": "social media"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/epstein-ranch-new-mexico-house-committee",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/epstein-ranch-new-mexico-house-committee",
      "text": "Cookie Settings"
    }
  ],
  "hash": "12e768543959eb261bf0ec594812205f7f92d278f17c92e30bcacf8a6b1e6cdd",
  "scraped_at": "2026-02-18T07:31:09.945530+00:00"
}