{
  "url": "https://lite.cnn.com/2026/02/27/politics/texas-senate-primary-trump-visit",
  "title": "Senate GOP candidates in Texas rally with Trump, but leave without an endorsement | CNN Politics",
  "date": "2026-03-01T07:07:25.819859+00:00",
  "authors": [
    "Kevin Liptak"
  ],
  "text": "Source: CNN\n\nWhen President Donald Trump arrived at the deepwater port here Friday to talk about his energy agenda, the three Republicans locked in a bitter battle for Texas’ Senate seat might have hoped for a surprise: an endorsement.\n\nIt never came. Trump, who has declined to back a candidate in the hotly contested Senate primary, praised the candidates from stage. At one point, he told reporters he’d “pretty much” decided who to back.\n\nBut when it came time to speak, Trump withheld the coveted prize, despite concerns among some senior Republicans the increasingly ugly contest is sapping resources ahead of tough general election.\n\n“They’re in a little race together,” he observed after rattling off the names of the candidates: incumbent Sen. John Cornyn, Texas Attorney General Ken Paxton and US Rep. Wesley Hunt. “It’s going to be an interesting one, right?”\n\nTrump’s neutral stance did not stop the candidates from racing to Corpus Christi in the final days of the contest to join the president, hopeful he may tip his hat in race-altering fashion. Trump, after all, has a flare for last-minute drama.\n\nThe hasty reshuffling of the trio’s campaign schedules underscores how much the race has become centered on Trump, and each candidate’s perceived proximity to him.\n\nCornyn, an establishment conservative seeking a fifth term, will fly on Air Force One with Trump Friday. The incumbent has aired television ads broadcasting his support for the president’s agenda — looking to project total alignment with Trump, despite their sometimes cool relationship. Cornyn was initially skeptical of Trump’s comeback bid after the 2020 election.\n\nPaxton, meanwhile, helped lead legal efforts to overturn the results of that contest after Trump lost, engendering goodwill in some corners of the president’s orbit. Heearned the endorsementof Turning Point Action, an affiliate of the influential conservative non-profit Turning Point USA founded by the late political activist Charlie Kirk, who had close ties to the Trump administration.\n\nBut Paxton has been plagued by ethics questions, including adultery accusations levied by his wife Angela Paxton, a state senator and longtime political adviser. Cornyn released a scathing attack ad seizing on some of the allegations this week.\n\nSome top Republicans worry Paxton’s political, legal and personal baggage could put the Senate seat in jeopardy if he wins the primary — and have repeatedly voiced those concerns to Trump. Some senior Republicans fear it could cost the party $200 million to defend the seat if Paxton emerges as the nominee.\n\nHunt was an early backer of Trump’s comeback bid and delivered a prime-time speech at the Republican National Convention in 2024. But polls show him trailing the other two candidates, who have higher name recognition in Texas.\n\nThe lack of a clear winner and blurred record of loyalty has led to a rare bout of political indecisiveness for Trump, who says he’s friends with all three.\n\n“I like all three of them, actually,” he told reporters earlier this month. “Those are the toughest races. They’ve all supported me. They’re all good. You’re supposed to pick one, so we’ll see what happens. But I support all three.”\n\nAnd Trump’s refusal to endorse in the race could contribute to further pain and uncertainty for his party. If no candidateclears the 50% benchmark, then it would head to a late May runoff between the top two finishers. That means drawing down more valuable resources that the GOP won’t have for the fall campaign.\n\nThis story and headline have been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/09/politics/ken-paxton-turning-point-endorsement-texas-senate",
      "text": "earned the endorsement"
    }
  ],
  "hash": "12fe26c822a6acab9a16ff910c4ab1ca1bf8db20c4571412f528448b86a846c2",
  "scraped_at": "2026-03-01T07:07:25.819871+00:00"
}