{
  "url": "https://lite.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
  "title": "FBI Director Kash Patel celebrates with US men’s hockey team after Olympic win | CNN Politics",
  "date": "2026-02-23T07:35:36.773931+00:00",
  "authors": [
    "Paula Reid",
    "Katelyn  Polantz",
    "CNN"
  ],
  "text": "Source: CNN\n\nFBI DirectorKash Patelcelebrated with the US men’s hockey team in Milan after their historicgold medal winover Canada on Sunday, according to a video obtained by CNN.\n\nPatel, a longtime hockey fan, posted on social media multiple times from the event, but the video offers an extended look into his celebration in the team’s locker room. The FBI director appeared to chug a beer before raising the bottle in the air, spraying it across the locker room.\n\nPatel, wearing a white USA shirt, joined the players in singing along to Toby Keith’s “Courtesy of the Red, White and Blue,” with one team member draping a gold medal around his neck.\n\n“For the very concerned media - yes, I love America and was extremely humbled when my friends, the newly minted Gold Medal winners on Team USA, invited me into the locker room to celebrate this historic moment with the boys,” he laterposted on Xin response to media inquiries about the video.\n\nAccording to the FBI, Patel was in Italy for multiple official engagements, traveling to Milan on a Justice Department jet, as is required for the FBI director. On Saturday, hepostedthat he had a “Great visit with the Milan Joint Operations Center, a 24/7 interagency operation with international partners to support the Winter Olympics and Paralympic Games.”\n\nThe lifelong hockey player appeared exuberant in the video as he celebrated the US’ first gold medal in men’s ice hockey in 46 years, since the 1980 “Miracle on Ice.”\n\n“Unity, Sacrifice, Attitude- what it takes to be the best in the world. These men live and breathe it,” hewrote on Xfollowing the game. “Now Team USA are gold medal champions, legends standing on the shoulders of giants. Thank you for representing the greatest country on earth, in the greatest game ever created.”\n\nInanother videoreshared by the White House’s Rapid Response X account, Patel holds up a phone so Trump could congratulate players on their win and invite them to his State of the Union address Tuesday.\n\n“We’ll get Kash or we’ll get the military to get you guys,” the president said as they discussed transportation to Washington, DC, with Patel affirming, “I’m on it. I’m f*cking on it.”\n\nTeam USA bested Canada on the final day of the Olympic Games when the New Jersey Devils’ Jack Hughes, who lost a tooth courtesy of a high stick, scored a game-winning goal in 3-on-3 sudden death overtime.\n\nHelmets, gloves and sticks went flying in the aftermath of the 2-1 win and players hoisted the jersey ofJohnny Gaudreau, the NHL star killed in 2024 when he and his brother were fatally struck by a driver while riding bikes.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/13/politics/kash-patel-fbi-leadership-concerns",
      "text": "Kash Patel"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/sport/team-usa-johnny-gaudreau-hockey-gold-medal",
      "text": "gold medal win"
    },
    {
      "url": "https://x.com/Kash_Patel/status/2025736412125855918",
      "text": "posted on X"
    },
    {
      "url": "https://x.com/FBIDirectorKash/status/2025262392490233874",
      "text": "posted"
    },
    {
      "url": "https://x.com/Kash_Patel/status/2025663993205936176",
      "text": "wrote on X"
    },
    {
      "url": "https://x.com/RapidResponse47/status/2025764775859224649?s=20",
      "text": "another video"
    },
    {
      "url": "https://www.cnn.com/2024/08/30/sport/johnny-gaudreau-nhl-player-death-spt-intl",
      "text": "Johnny Gaudreau"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1318a13c0d37672a5845ee6b71e3d5a1194acf039f1eb324a60111ad840f5534",
  "scraped_at": "2026-02-23T07:35:36.773944+00:00"
}