{
  "url": "https://lite.cnn.com/2026/02/08/business/housing-congress-affordability-costs",
  "title": "Congress isn’t waiting on Trump to lower housing costs | CNN Business",
  "date": "2026-02-11T16:40:54.989854+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPresident Donald Trump has vowed to tackle the housing affordability crisis, but the White House has offered few details about its plans.\n\nNow, a bipartisan group in Congress is moving forward with its own solution.\n\nOn Monday, the House of Representatives passed a bill, called the Housing for the 21st Century Act, aimed at addressing high housing costs and the shortage of affordable housing by reforming zoning and reducing federal barriers to construction.\n\nA similar bill in the Senate with bipartisan support is expected to get a vote in a few weeks.\n\nAdvocates have said the package of bills is the most significant housing reform passed in more than a decade.\n\nIn a statement, David Dworkin, the president of the National Housing Conference, a non-profit focused on affordable housing, celebrated the House bill’s passage.\n\n“The housing shortage did not happen overnight. We got into this crisis one unit at a time, and we will get out of it the same way — one unit at a time, through a range of coordinated strategies that expand supply, reduce costs, and improve access to affordable homes,”\n\nDworkin said. “There is no magic wand to fix this crisis, but the Housing for the 21st Century Act is an important step forward.\n\nThe bill’s passage comes as Washington faces pressure to address the high cost of living, and housing has emerged as a pain point. In recent years, surging home prices and persistently elevated mortgage rates have put homeownership out of reach for millions of Americans. A New York Times/Siena University poll last month showed that more than half of registered voters surveyed said the cost of housing has gotten so high that it has become unaffordable.\n\nIn the years since the 2008 financial crisis, homebuilding has lagged, creating a housing shortage that has pushed prices higher as demand far outstrips supply across much of the country. An additional three to four million homes need to be built to close the gap, according to an October estimate from Goldman Sachs.\n\nCongress’s package aims to tackle the housing shortage directly, and the legislation is nearing the finish line.\n\nThe Senate’s ROAD to Housing Act — led by South Carolina Sen. Tim Scott, a Republican, and Massachusetts Sen. Elizabeth Warren, a Democrat — had passed late last year as part of a broader package but was ultimately stripped from the final bill negotiated with the House. The Senate is expected to vote on a standalone version of its bill in the coming weeks.\n\nThe now-passed House bill was introduced by Arkansas Rep. French Hill, a Republican, as a companion to the Senate’s ROAD to Housing Act.\n\nThe Senate’s bill, led by South Carolina Sen. Tim Scott, a Republican, and Massachusetts Sen. Elizabeth Warren, a Democrat, had passed late last year as part of a broader package but was ultimately stripped from the final bill negotiated with the House\n\nThe House measure is narrower than the Senate’s version, containing 25 provisions compared with the Senate’s 40.\n\nThe White House did not respond to a request for comment on whether Trump would sign a version of the bills into law if they reached his desk, but his administration has previously signaled support for the Senate’s bill.\n\nHere are some key provisions in the bills:\n\nMany housing experts point tolocal zoning and red tapeas the root of the slowdown in homebuilding — something that is difficult for the federal government to address, since each local government makes its own rules.\n\nBut if land-use regulations were relaxed, an extra 2.5 million housing units could be added to the US in the next decade, the Goldman Sachsreportfound.\n\nThe bills include provisions to encourage states and local governments to adopt more pro-housing land use and zoning policies, encouraging them to boost their housing productions.\n\n“State and local governments are directly in charge of what’s built in their jurisdictions,” said Andy Winkler, the managing director of housing and infrastructure policy at the Bipartisan Policy Center. “Both packages are designed to kind of give state and local governments more tools, more guidance and additional flexibility to adopt pro-housing policies.”\n\nThe Senate’s bill would tie some community development grants from the Department of Housing and Urban Development to housing production, offering bonuses to local governments that accelerate homebuilding while reducing funding for those that fall behind.\n\nThe House’s bill, meanwhile, would require recipients of community development grants to report on local policies that restrict housing supply, including zoning laws.\n\nBoth packages would offer money to local governments to design pattern books, which would be housing designs pre-approved by the government to help speed up local construction.\n\nThe bills would also make it easier to expand the supply ofmanufactured homes, which are built in factories and typically faster and cheaper to produce than traditional, site-built houses.\n\nUnder federal law dating back to 1974, manufactured homes must be built on a permanent chassis, a wheeled base that allows them to be transported, similar to traditional mobile homes. In practice, though, most manufactured homes are never moved once they reach their destination.\n\nThe requirement to add wheels adds costs and can limit where these homes are allowed, often confining them to mobile home parks under local zoning rules. Eliminating the rule could reduce the cost of each manufactured home by $5,000 to $10,000,accordingto the Bipartisan Policy Center.\n\nDue to a nearly two-decade-long decline in new construction, the country’s housing stock is aging. According to the latest US Census data, the median age of homes is 40 years old, with nearly half built before 1980. That’s nine years older than the median age of homes in 2005.\n\nMillions of those homes have fallen into disrepair,accordingto a 2023 report from the Harvard Joint Center for Housing Studies.\n\nThe bills would make it easierfor homeowners and landlords to get loans for home repairs and modifications to update older homes.\n\nThe legislation would also make it easier toconvert vacant officesand other unused buildings into apartment buildings, a practice that has grown in popularity since the pandemic-era work-from-home boom.\n\nTrump has addressed the home affordability issue more frequently in recent months and introduced a series of proposals aimed at easing the problem.\n\nLast month, he signed an executive order banninglarge institutional investorsfrom buying single-family homes, a move that experts say won’t significantly increase the supply of homes on the market.\n\nTrump also announced a strategy to lower mortgage rates by having Fannie Mae and Freddie Mac, the two government-sponsored mortgage giants, purchase$200 billion in mortgage bonds. Trump’s allies have also suggested that they may allow savers in 401(k) retirement plans to use the money for down payments on a home purchase penalty-free.\n\nTaken together, Trump’s proposals would likely boost demand in the short-term but do little to ease the chronic shortage of homes for sale, said Daryl Fairweather, Redfin’s chief economist.\n\n“As demand goes up in a supply constrained market; it just results in higher home prices and makes it hard for people down the line to be able to afford homes,” she said.\n\nHowever, Trump has said he doesn’t want to increase the supply of homes too much to protect thewealth of existing homeowners.\n\n“People that own their homes, we’re going to keep them wealthy. We’re going to keep those prices up,” Trump said last month. “We’re not going to destroy the value of their homes.”\n\nBut Winkler said that in many places, adding supply may not cause home prices to fall; rather, it would moderate the rate at which prices continue to climb after skyrocketing over the past few years.\n\n“It’s an age-old problem of housing. You want people to be able to afford it, but we’ve also built-up homeownership in particular as a safe place for your investment,” Winkler said. “Hopefully this would be pushing markets to a more happy medium, not one extreme or another.”\n\nThis story has been updated with additional context and developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/21/business/housing-shortage-building-trump",
      "text": "local zoning and red tape"
    },
    {
      "url": "https://www.goldmansachs.com/insights/articles/the-outlook-for-us-housing-supply-and-affordability",
      "text": "report"
    },
    {
      "url": "https://www.cnn.com/2024/11/11/economy/manufactured-mobile-home-affordable-housing",
      "text": "manufactured homes"
    },
    {
      "url": "https://bipartisanpolicy.org/article/six-deregulatory-proposals-to-improve-housing-affordability/",
      "text": "according"
    },
    {
      "url": "https://www.jchs.harvard.edu/sites/default/files/reports/files/JCHS-Improving-Americas-Housing-2023-Report.pdf",
      "text": "according"
    },
    {
      "url": "https://www.cnn.com/2024/07/17/business/office-building-conversion-to-apartments",
      "text": "convert vacant offices"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/economy/trump-institutional-investors-homebuying",
      "text": "large institutional investors"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/business/mortgage-bonds-trump-purchase-rates",
      "text": "$200 billion in mortgage bonds"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/business/federal-reserve-interest-rates-housing",
      "text": "wealth of existing homeowners"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/business/housing-congress-affordability-costs",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/08/business/housing-congress-affordability-costs",
      "text": "Cookie Settings"
    }
  ],
  "hash": "131a40d6724c8652c341160d2f9ee1e99cf53df168de7fb91df3a7bb69fd0f30",
  "scraped_at": "2026-02-11T16:40:54.989866+00:00"
}