{
  "url": "https://lite.cnn.com/2026/02/16/sport/macclesfield-greatest-fa-cup-upset-soccer",
  "title": "Macclesfield FC: How the greatest FA Cup upset ever is just the beginning | CNN",
  "date": "2026-02-17T07:30:18.627476+00:00",
  "authors": [
    "Patrick Snell, CNN"
  ],
  "text": "Source: CNN\n\nThere’s a reason people so often talk about the magic and romance of the Cup, and given recent events, it’s all still very much alive and well.\n\nDating all the way back to the early 1870s, England’s iconic FA Cup is the oldest national soccer competition in the world.\n\nTraditionally, it pits non-league and lower league teams with the sport’s elite. It’s a chance for potential giant-killers to take down the biggest names from the Premier League, and on January the 10th, we saw just that with sixth-tier Macclesfield shocking FA Cup holder Crystal Palace 2-1 in a result that – as far as league positions are concerned – is now regarded as the biggest upset in tournament history.\n\nMacclesfield, whose team is made up of part-time players, went into that match at tiny Moss Rose – a stadium with a capacity of 5,300 with 2,095 of those seated – 117 places below the Eagles in the English soccer league pyramid, but you simply would have never guessed.\n\n“It’s the stuff that’s sort of your wildest dreams, it’s not supposed to happen to people like us, but it did,” Macclesfield defender Sam Heathcote toldCNN Sportsas he reflected on the result that sent shockwaves across the soccer world and beyond.\n\nWhen he’s not keeping Premier League defenders at bay, Sam is a PE teacher at a school in Altrincham, just a few miles away from Manchester and his return to work that following Monday is one that he’ll never forget.\n\n“You know, it was a bit surreal, back down to planet Earth straight away, I had some of the younger kids coming out with funny comments like they had the dog waving at me on TV, so there was no time to stay on a high horse or anything like that. It was straight back down to planet Earth for me,” Heathcote said.\n\n“I got all embarrassed and shy and I don’t know why because I spend most of my week with the kids, but, yeah, I didn’t expect it, and it was so nice and it’s something that will definitely live long in my memory,” he added.\n\nMacclesfield’s next challenge in the FA Cup is a fourth-round clash with yet another Premier League team, Brentford, in a match that will see the Silkmen once again as overwhelming underdogs when they take to the field of play on Monday evening.\n\n“We’ll obviously go into the game with a lot more confidence than we did against Palace. They might be a couple of places above Palace, but we’ve broken the record before, so why can’t we do it again?” club captain and former highway supervisor Paul Dawson told CNN Sports.\n\nDawson – who now works for a candle-making company – scored the first goal of the match in his club’s history-making win over the Eagles and it’s no surprise he’s still pinching himself in disbelief!\n\n“I’m not going to lie, I can’t really remember it. I’ve watched the highlights about 120 times or something! I don’t remember my celebration, I don’t remember any of it, but yeah, it was a very surreal moment! Honestly, I think I’m still living the dream … I don’t think I’ve come back down to Earth.”\n\nDespite riding the crest of a truly euphoric wave following the historic win over Palace, it’s with collectively heavy hearts that Macclesfield’s players go into their fourth-round tie following the death late last year of one of their own: Former teammate Ethan McLeoddied in a car accidentat just 21 years of age.\n\nMcLeod crashed his vehicle while driving back from a match just a few days before Christmas. Macclesfield manager John Rooney dedicated his team’s amazing win to their former player’s memory as the non-league side’s players continue to be inspired by their late teammate.\n\n“He was the nicest lad you’ve ever met. He had the sweetest smile, he had an infectious personality, and 21 years old, it’s the most tragic thing that can possibly happen, and that boy will be missed and loved forever from everyone at that football club.\n\n“We definitely know that he was watching us and blessing us with that game. It doesn’t get worse in terms of losing a friend like that,” Heathcote told CNN Sports.\n\n“To see (his family) after the game is very emotional, and just to see them with a slight smile on the face of what we’d achieved and, yeah, a really difficult moment over the last month, but it’s brought us all so much closer together, and I’m really proud of everyone at our football club.”\n\nClub captain Dawson added, “It was such a tragic moment, and I’m just glad the boys worked hard, could get the job done, and hopefully, Ethan will be looking down proud of us all.”\n\nThe very fact that Macclesfield as a club is even in business is nothing short of miraculous given the financial hardship the 6th-tier club in North-West England has faced over the years.\n\nSix years ago, close to a century and a half of history came to an end when the club – then called Macclesfield Town – was wound up and all trading stopped. But help was at hand and hope was restored when a local businessman stepped in to purchase the team’s assets leading to a new “Phoenix” club being born.\n\n“I don’t think I’ll be able to say the words that’ll do it justice. Five years ago, the fans of Macclesfield, they didn’t have a football club, they didn’t have a team, andRob Smethursthas come and saved the club, saved the community, and provided a real space that people can go and enjoy the football, have the children playing, come and watch regular lads like me and Paul go and give it all our all,” defender Heathcote reflected.\n\n“Hopefully, they can take a little bit of inspiration from (that win). Anything’s possible and especially to all the people that are local to Macclesfield, I know how much it meant to them and, for us to play a part in that, it’s a lovely feeling to pay back to that football club. It’s been really nice.”\n\nFor at least one weekend in the early part of January, Macclesfield was one of the most talked about clubs in the world. It’s no wonder both Heathcote and Dawson are absolutely relishing their next potential David and Goliath assignment against Brentford. The dream of FA Cup glory is still very much alive.\n\n“Listen, if you’d asked me (if we could win the FA Cup) last week, probably no, in fact, definitely no. If you’re asking me now, why not? It’s Macclesfield. We just beat the holders!\n\n“We’ll keep riding this wave and the dream’s still there so, let’s do it, we might as well, we may as well!”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/sport",
      "text": "CNN Sports"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/c62djz7p5gwo",
      "text": "died in a car accident"
    },
    {
      "url": "https://www.bbc.co.uk/sounds/play/w3ct6wqz",
      "text": "Rob Smethurst"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/sport/macclesfield-greatest-fa-cup-upset-soccer",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/sport/macclesfield-greatest-fa-cup-upset-soccer",
      "text": "Cookie Settings"
    }
  ],
  "hash": "13fe9f4266245c5c4cf17d8d77ebde3d0798665aa60d28166264b242aef5b981",
  "scraped_at": "2026-02-17T07:30:18.627488+00:00"
}