{
  "url": "https://lite.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-photo-police-station-intl",
  "title": "Andrew Mountbatten-Windsor: How that astonishing photo of the former prince leaving police custody was captured | CNN",
  "date": "2026-02-22T07:10:56.454050+00:00",
  "authors": [
    "Lauren Kent, CNN"
  ],
  "text": "Source: CNN\n\nMost days, the country’s top newspapers have a wide range of photos gracing their front pages. But on Friday, every image topping the British front pages was identical:\n\nA snap ofAndrew Mountbatten-Windsor, slouched in the back of a car, looking shell-shocked on his 66th birthday as he left the police station.\n\nOn Thursday, Mountbatten-Windsor became the first member of the UK royal family to bearrestedin modern history, spending more than 10 hours in police custody at a station in the small town of Aylsham, England, about an hour away from his new home on the royal Sandringham Estate.\n\n“The photo gods were on my side yesterday,” said Phil Noble, a senior photographer at Reuters news agency who captured the incredible image.\n\nNoble, based in northern England, drove roughly five hours south to Norfolk on Thursday morning – racing to get there after the news of the arrest broke.\n\nThrough guesswork and some well-placed sources, his two-person team zeroed in what they thoughtmightbe the correct police station,maybe.There are roughly 20 Thames Valley Police stations where the former prince could have been taken, so they had to wait to see.\n\n“This was probably the fourth or fifth police station that Reuters had visited that night,” Noble said. “When I arrived, it didn’t look anything out of the ordinary. There was no cars. There was no increased activity.”\n\n“To be honest, just before he arrived, I’d left to go back to the hotel… and my colleague Marissa messaged me and said, ‘Look, two cars have just arrived I think you should come back,’” Nobel said candidly in a video explaining how he got the shot.\n\nThen the race really began. The Reuters photographer said he “spun the car around, got back, and within a minute of arriving back, the shutters on the garage at the police station came up and two cars left. And one of them, he (Mountbatten-Windsor) was in.”\n\nStakeout photography has a lot of variables, Noble explained. Part of the job is preparation, skill and experience. It also requires a willingness to stand on the side of a British country road in the dark for hours at a time, without knowing if it will lead to anything noteworthy.\n\n“Probably half an hour before I took the photo, I’d done some test shots of other cars leaving the police station, so I had a rough idea of… the camera settings maybe,” explained Noble, who has been working at Reuters for more than 20 years. Before that, he worked in photography at the UK’s Press Association and the Manchester Evening News.\n\n“But it’s still, you know, more than luck than judgment when the car comes out. You’ve got to try and guess where he’s sitting, which side of the car is he? Is he in the front? Is he in the back? Will the flash recycle in time?”\n\nHe took six frames in all, according to Reuters. Two were blank, one was out of focus and two showed police officers. But one captured the extraordinary moment.\n\n“For every car shot that you do, the hit rate is really, really low,” he added. “So last night was, it was one of those, kind of, pinch-me moments where you look at the back of the camera, you’re tired, it’s been a long day… you can’t believe that you’ve got him.”\n\nMountbatten-Windsor wasreleased “under investigation”late Thursday evening. Police have not said what led them to arrest the former prince on suspicion of misconduct in public office, but he previously spent a decade as UK trade envoy starting in 2001. He stepped down in 2011 after coming under fire over his association with convicted sex offender Jeffrey Epstein.\n\nThe former prince has not publicly responded to the latest allegations to emerge after the US Department of Justice﻿ released millions of documents related to Epstein. Mountbatten-Windsor has repeatedly denied all allegations of wrongdoing and said he never witnessed or suspected any of the behavior that Epstein was accused of.\n\nAsked about the photo, Noble said it’s no work of art, but it’s definitely among the most newsworthy he has ever snapped.\n\n“Best photo-photo? It’s probably not. You know, it’s a man shot at night through the back of a windscreen,” Noble said, laughing a bit. “Is that the best photo I’ve ever taken? No. Is it up there with one of the most important? A hundred percent.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/misconduct-public-office-andrew-arrest-explained-intl",
      "text": "arrested"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "released “under investigation”"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-photo-police-station-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-photo-police-station-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1485900d8ad1e60bc70419efa667cfcf50f794a727293d8f9fb72d5dc8dfa4a6",
  "scraped_at": "2026-02-22T07:10:56.454063+00:00"
}