{
  "url": "https://lite.cnn.com/2026/02/09/politics/judge-administrative-stay-unfreeze-ny-infrastructure-funds",
  "title": "Judge gives Trump administration more time to unfreeze billions in funding for NY tunnel project | CNN Politics",
  "date": "2026-02-11T16:33:25.620340+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Trump administration will need to unfreeze more than $16 billion earmarked for a major New York infrastructure project by Thursday unless a federal appeals court allows the government to continue withholding the funds, a federal judge ruled Monday.\n\nJudge Jeannette Vargas in the Southern District of New York denied the administration’s request to pause the temporary restraining order she granted last week, noting that New Jersey and New York had shown there would an “immediate and severe impact” if the long-planned project – connecting the two states through a new rail tunnel beneath the Hudson River – were to shut down.\n\nVargas instead granted a short administrative stay until Thursday at 5 p.m. The administration has until then to unfreeze the funds if it isn’t successful in convincing the Second Circuit Court of Appeals that it should be able to withhold the money.\n\nNew Jersey and New York filed a lawsuit against the Trump administration last week over the freeze, alleging in a complaint that the funding suspension is unlawful.\n\nThe commission in charge of the tunnel project has warned that it will soon have to shut down work and lay off roughly 1,000 workers if the Trump administration does not release the funding it needs.\n\nCNN previously reported that President Donald Trump told Senate Minority Leader Chuck Schumer last month that he was prepared to release the funding if Schumer agreed to rename New York’s Penn Station and Virginia’s Dulles International Airport after him.\n\nTrump told reporters aboard Air Force One on Friday night it was Schumer’s idea to rename Penn Station to “Trump station,” but the New York Democrat immediately dismissed the president’s claim and accused him of lying about the details of their conversation.\n\n“Absolute lie. He knows it. Everyone knows it. Only one man can restart the project and he can restart it with the snap of his fingers,” Schumer wrote on X.\n\nCNN’s Aleena Fayaz, Manu Raju and Adam Cancryn contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/judge-administrative-stay-unfreeze-ny-infrastructure-funds",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/judge-administrative-stay-unfreeze-ny-infrastructure-funds",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1558b1d0ab6021a9db2725f54686b7d76f6947ef9b2d15a69cd83cb0a8d5a70b",
  "scraped_at": "2026-02-11T16:33:25.620353+00:00"
}