{
  "url": "https://lite.cnn.com/2026/02/24/europe/louvre-museum-chief-resignation-jewel-theft-intl",
  "title": "Louvre museum director resigns in wake of ‘heist of the century’ | CNN",
  "date": "2026-02-26T07:32:06.177887+00:00",
  "authors": [
    "Billy Stockwell",
    "Pierre Bairin"
  ],
  "text": "Source: CNN\n\nThe director of the renowned Louvre museum in Paris resigned Tuesday following last year’s “heist of the century” which saw €88m ($100m)worth of crown jewelsstolen.\n\nFrench President Emmanuel Macron said he accepted Laurence des Cars’ resignation, and praised her decision to step down as “an act of responsibility at a time when the world’s largest museum needs both stability and a strong new impetus,” according to the Elysée Palace.\n\nDes Cars hadpreviously offeredher resignation to Culture Minister Rachida Dati after therobberywhich saw thieves break into the museum’s Apollo Gallery, but it was rejected at the time.\n\nChristophe Leribault, an art historian and director ofthe Palace of Versailles, was named as the Louvre’s new chief on Wednesday, the French culture ministry announced.\n\nDati is confident that Leribault will advocate for the museum’s “international relevance” and necessary modernisation, “while preserving the quality of work conditions for its staff,” according to a ministry statement.\n\nAfter the heist, Des Cars admitted that the “absolutely obsolete, even absent, technical infrastructure” to monitor the country’s most valuable treasures was a “terrible observation” for the world’s largest museum.\n\nIn 2024, the Louvre welcomed 8.7 million visitors, with tourists from the United States making up 13% of all guests, second only to the French.\n\n“The President thanked her for her work and commitment over the past few years and, recognizing her undeniable scientific expertise, entrusted her with a mission within the framework of the French G7 presidency, focusing on cooperation between the major museums of the participating countries,” the Elysée said on Tuesday.\n\nThe heist followed aseries of issuesat the venerable institution, which was also hit by strike action last year with workers complaining of unmanageable crowds, understaffing and poor working conditions.\n\nDes Cars became the first female director of the Louvre Museum in its 230-year history, when she took on the role in September 2021.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/world/europe/timeline-louvre-robbery-intl-latam-vis",
      "text": "heist of the century"
    },
    {
      "url": "https://www.cnn.com/2025/10/20/europe/louvre-heist-jewels-recovery-scli-intl",
      "text": "worth of crown jewels"
    },
    {
      "url": "https://www.cnn.com/2025/10/23/europe/france-louvre-director-heist-intl-hnk",
      "text": "previously offered"
    },
    {
      "url": "https://www.cnn.com/2025/10/19/europe/robbery-louvre-paris-france-museum-closure-intl",
      "text": "robbery"
    },
    {
      "url": "https://www.cnn.com/2025/10/19/europe/louvre-jewelry-heist-history-latam-intl",
      "text": "series of issues"
    }
  ],
  "hash": "16350d78e7abcf207c812902f86d4eee9d069813eadcebb7a4f0ccf50a786a4b",
  "scraped_at": "2026-02-26T07:32:06.177898+00:00"
}