{
  "url": "https://lite.cnn.com/2026/02/25/business/retirement-new-savings-plan-trump",
  "title": "What we know about the new retirement savings plan Trump proposed | CNN Business",
  "date": "2026-02-26T07:31:20.614190+00:00",
  "authors": [
    "Jeanne Sahadi"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump in hisState of the Union addressTuesday briefly mentioned his intention to help private-sector workers save for retirement if they don’t have access to an employer-sponsored plan.\n\n“Half of all of working Americans still do not have access to a retirement plan with matching contributions from an employer. To remedy this gross disparity, I’m announcing that next year, my administration will give these oft-forgotten American workers … access to the same type of retirement plan offered to every federal worker. We will match your contribution with up to $1,000 each year,” Trump said.\n\nA White House official said in an email to CNN Wednesday that new details on that proposal will be offered “soon.”\n\nUntil then, here is what to know:\n\nThe good news is that the Trump administration wants to help close the so-called “retirement coverage gap,” which has left behind tens of millions of low- and moderate-income earners who have neither a defined-benefit employer pension nor an easy, subsidized way to save for retirement at work.\n\nThere have been efforts for years to close that gap among lawmakers and retirement policy experts. But exactly how has been a sticking point. Many an idea has come and gone – only to later get resurrected. And, in instances when an idea actually gets implemented – such as thestate-based auto IRAsnow offered by 17 states – it has been limited in its reach because of various political objections.\n\nThe White House official said that Trump’s proposal “can largely be implemented with existing administrative authorities.” Translation: without Congress. That said, the official added that “future legislation can bolster this game-changing plan.”\n\nBefore getting to the complexities of any new savings structure that may be created, the White House confirmed that the match Trump mentioned is theSaver’s Match, which was passed in 2022 and goes into effect next year.\n\nLow- and moderate-income workers who make less than $35,500 (or $71,000 as a married couple) are eligible if they save up to $2,000 a year ($4,000 for couples) in a qualified retirement plan – like a 401(k), IRA or auto IRA. The federal match is worth up to $1,000 ($2,000 for couples).\n\nThe president said private sector workers will have “access to the same type of retirement plan offered to every federal worker.”\n\nThe White House official added that the administration’s new plan would be a “universal, portable” account that would offer “diversified, index‑based, investment options and portfolio choices” with low fees.\n\nFederal workers currently have a 401(k)-style plan known as theThrift Savings Plan, with a diverse mix of very low-cost funds.\n\nWhen he was a senator, Secretary of State Marco Rubio proposed a plan to grant non-federal workers access to the TSP. “But it didn’t go anywhere. And it was unclear how it would work,” said Kim Olson, senior officer for retirement planning at the Pew Charitable Trusts. Plus, there was private sectorpushback.\n\nMeanwhile, Kevin Hassett, prior to becoming Trump’s National Economic Council director, supported a bill called theRetirement Savings for Americans Act, which would offer a TSP-like plan into which eligible workers who don’t have an employer plan would be automatically enrolled.\n\n“Even if there were a reason to do this, it would require legislation,” said Mark Iwry, a former senior adviser to the Secretary of the Treasury during the Obama administration who helped create both the auto IRA and the Saver’s Match.\n\nThat’s why he thinks the White House would like to create a Trump Account for adults.Trump Accountsare a new vehicle created to build savings for eligible children who are US citizens and have Social Security numbers. The accounts are set to launch in July, and Treasury is in the midst of finalizing the rules governing them.\n\nAfter a child turns 18, the Trump Account essentially becomes a traditional IRA. What Iwry hears in the White House description of Trump’s latest proposal is basically an IRA for adults, with diverse, low-cost funds, that would be promoted to anyone working for an employer that doesn’t offer a retirement savings plan. And, like all other IRAs and retirement accounts, it would have the advertised sweetener of the Saver’s Match for lower- and moderate-income workers.\n\nBut in truth, the IRA option already exists for adult savers who can create their own accounts and apply for the match. Studies suggest many won’t do that, however. “Workers without access to a workplace plan are 15 (to) 20 times less likely to save for retirement in any tax-preferred account,” the White House official noted.\n\nSo, if the administration crafts a Trump Account for adults, it may not be the most original option — but it would put the power of the presidency behind an opportunity that has been underutilized.\n\nWhat Iwry hasn’t heard from the White House, at least not yet, is that eligible workers would be automatically enrolled in the new plan. Auto enrollment, for policy experts, is a key feature needed to make meaningful progress in closing the gap in retirement savings for those least likely to amass them on their own. But lawmakers who have opposed auto enrollment in the past typically object to imposing requirements on employers, even if it’s costless to them.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/interactive/2026/02/politics/donald-trump-sotu-address-vis/",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/retirement-auto-ira-business-mandates",
      "text": "state-based auto IRAs"
    },
    {
      "url": "https://www.pew.org/en/research-and-analysis/reports/2025/09/federal-savers-match-coming-in-2027-could-boost-automated-retirement-savings-programs",
      "text": "Saver’s Match"
    },
    {
      "url": "https://www.tsp.gov/",
      "text": "Thrift Savings Plan"
    },
    {
      "url": "https://www.aei.org/economics/addressing-heritage-concerns-regarding-rubio-plan-to-open-up-the-tsp/",
      "text": "pushback"
    },
    {
      "url": "https://www.hickenlooper.senate.gov/wp-content/uploads/2023/10/Retirement-Savings-for-Americans-One-Pager-FINAL-10.19.2023.pdf",
      "text": "Retirement Savings for Americans Act"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/business/parents-trump-accounts-kids-faq",
      "text": "Trump Accounts"
    }
  ],
  "hash": "16429e3103aba5d63aab0b8c63179b2bab92665f0f0be7f0427fa1b5d811ef69",
  "scraped_at": "2026-02-26T07:31:20.614203+00:00"
}