{
  "url": "https://lite.cnn.com/2026/02/17/us/ramadan-muslims-minneapolis",
  "title": "As the federal surge draws down, Minneapolis’ Muslim community is hopeful Ramadan will inspire its road to recovery | CNN",
  "date": "2026-02-19T07:33:18.377919+00:00",
  "authors": [
    "Yahya Salem, CNN"
  ],
  "text": "Source: CNN\n\nThere’s a sense of urgency in Basim Sabri’s voice as he stands in the middle of a banquet hall at his mall in the heart of Minneapolis, directing the flow of busy volunteers and jovially asking his cooks to be patient as he finishes his call with CNN.\n\nSabri’s urgency is understandable, perhaps even necessary. The Islamic holy month of Ramadan is right around the corner, and Sabri is determined to maintain the annual tradition of hosting a Ramadan feast for the Twin Cities community at Karmel Mall – which he has owned for more than two decades – especially in the aftermath of the ongoing federal immigration crackdown.\n\n“I’m not just a landlord, I’m also a very involved person within the community,” Sabri told CNN. “I see the fear, the depression with many tenants, and the anger that this is happening to them.”\n\nHundreds attend the annual gathering, according to Sabri. And given Karmel Mall’s cultural and economic status within Minneapolis’ Muslim community, particularly its Somali population, he said he believes this year’s feast – or iftar – is practically a self-assigned duty to help the community recover spiritually and boost its morale during the holy month.\n\nRamadanis the ninth month of the Islamic calendar. During its approximately 30 days, which start Wednesday in North America, Muslims abstain from food and drinks from dawn until sunset. Ramadan also holds profound spiritual and social significance: It is celebrated as an opportune occasion for observers to congregate to break their fast, pray and practice countless forms of communal support.\n\nHowever, in the aftermath ofOperation Metro Surge, launched by the Trump administration in December with the ostensible purpose of apprehending and deporting undocumented immigrants in Minnesota, the mere notion of congregating is putting a lot of Muslims in the Twin Cities on edge.\n\n“It’s been a very difficult time,” said Khalid Omar, a community organizer and a leader at Dar Al-Farooq Islamic Center. “You can only imagine the weight of the full government being utilized in the state, going against and going after the Somali and Muslim community.”\n\nAt the peak of Operation Metro Surge, about 3,000 immigration officers descended on the North Star State. Federal agents arrested more than 4,000 undocumented immigrants from the beginning of the operation on December 1 through February 4, according to the Department of Homeland Security. The operation also resulted in the killing of two US citizens, the deployment of aggressive tactics by armed, masked DHS agents, and a soaring sense of trepidation permeating Minnesota’s immigrant communities.\n\nMuslims in Minneapolis, estimated now to be more than 100,000, have lived in the city for well over a century, and the city has embraced them. In 2006, Minneapolis elected thefirst Muslim US congressman, and in 2023, it became the first major US city to allow the broadcasting of the Islamiccall to prayerfive times a day, year-round.\n\nHowever, the recent federal aggression,fueled by President Donald Trump’s vitriolcalling Minnesota’s Somali community “garbage,” has seemingly soured that sense of embrace.\n\n“I’m a very proud Muslim … and extremely proud to be a Minnesotan,” said Sabri, who is Palestinian American. “We’re very fortunate to be in Minnesota, and very fortunate to be in America, and Trump is trying to make it difficult for people to even think that they are American.”\n\nMany members of the Muslim community,particularly Somalis, reported an unprecedented disruption to daily life since the start of Operation Metro Surge. Fear of stepping out of their houses, going to work, grocery shopping and even practicing their religion. Foot traffic at restaurants, shops and mosques sharply declined, turning once-lively economic and social hubs into ghost towns, and threatening to cripple the livelihood of an entire community.\n\n“Forty percent of our sales, if not more, were impacted,” said Mohamed Hagi, co-owner of four Minneapolis-area locations of Qamaria, a Yemeni coffee shop chain.\n\nThe 30-year-old Somali American, who also co-owns a Mediterranean restaurant in the same area experiencing similar economic tribulations, described his coffee shops as local melting pots for Muslims and non-Muslims, East Africans and White people. However, during the federal crackdown, they were practically empty.\n\nThe finances of Sabri’s Karmel Mall were also severely dented by the surging DHS presence. Home to 710 stores and vendors, mostly Somali retailers serving Somali patrons, the mall was plastered with anti-ICE posters due to daily raids, according to Sabri. However, declining sales meant Sabri received only about 35% in rent due from retailers – a loss of more than $400,000, according to his company.\n\nNot even mosques were spared the consequences of the aggressive crackdown. Omar reported dwindling congregations at Dar Al-Farooq as worshipers feared being detained, and what he described as federal “harassing” was reported near several local mosques. Faith leaders advised community members to carry their passports or immigration documents to the mosque. At Karmel Mall’s prayer hall, where hundreds worshiped daily, congregations were less than half their usual size, Sabri said.\n\nDespite the bleak reality felt by many Muslims during Operation Metro Surge, they express hope that Ramadan will carry winds of change for the reeling community. They feel it’s perhaps heaven-sent that the start of Ramadan follows Trump’s border czar Tom Homan announcing the monthslong Minnesota operationwould be ending, and many are cautiously optimistic.\n\n“This is the time when we need to lean into our faith more,” said Omar. “Make dua (prayer) for the people that are suffering, the people that felt this atrocity.”\n\nIn preparation for the holy month, Dar Al-Farooq is reiterating protocols for the community should they be confronted by federal agents, as well as boosting its own security by hiring more security personnel and buying enhanced surveillance cameras. The Islamic center and Karmel Mall are coordinating with police to ensure the safety of worshipers and patrons. Omar and Sabri say they are optimistic the spirit of Ramdan will inspire wary worshipers to return to mosques.\n\nHagi, too, says he is hopeful Qamaria’s extended Ramadan hours will entice patrons to return to his coffee shops. Qamaria will be hosting iftars throughout Ramadan followed by Q&As, he said, with the aim of dispelling misinformation about the community and curbing federal fear-mongering. He also intends to host a “coffee with a cop” event to bridge gaps between the community and local law enforcement.\n\nAnd preparations for Ramadan are not exclusive to Muslims. Interfaith leaders are launching several initiatives to show solidarity with the Twin Cities’ Muslim community, such as putting up #BlessedRamadan lawn signs, offering to serve as ICE watchers during Friday prayers, and hosting community dinners, capitalizing on Ramadan coinciding this year with the Christian period of Lent.\n\n“An attack on anyone’s freedom and anyone’s democracy is an attack on us all,” said the Rev. Dr. Jia Starr Brown, a local interfaith leader, drawing inspiration from Pastor Martin Niemöller’s famous words in“First They Came”after World War II.\n\nBut faith alone will not sustain Minneapolis’ road to recovery. Omar and Sabri say they support government bailouts to compensate local businesses for their financial losses during the surge. Last week, Minnesota Gov. Tim Walz proposed a one-time,$10 million emergency relief packagefor small businesses that were impacted.\n\nThose detained during the crackdown are also present in the hearts and minds of the community.\n\n“There are so many who were probably praying with us last Ramadan who may not be praying with us this Ramdan,” said Omar. “The people that are in detention centers … we want them back. We want them back in their homes. We want them back in Minnesota.”\n\nIn the meantime, Sabri said he is already planning his second Ramadan banquet, this time for the Minnesotans who braved the frigid temperatures to protect the immigrant community from DHS with their presence andwhistles.\n\n“Minnesotans have shown big support for the immigrant community. They are amazing people,” Sabri said. “I don’t think there’s any other community in the US that would’ve done what Minnesotans have done. They have a very big heart.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/ramadan-fast-facts",
      "text": "Ramadan"
    },
    {
      "url": "https://www.cnn.com/2025/12/02/us/ice-operation-somali-migrants-minneapolis",
      "text": "Operation Metro Surge"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/01/us/ice-presence-minneapolis-st-paul-vis/",
      "text": "At the peak of Operation Metro Surge"
    },
    {
      "url": "https://www.ag.state.mn.us/office/agbio.asp",
      "text": "first Muslim US congressman"
    },
    {
      "url": "https://apnews.com/article/politics-religion-minneapolis-united-states-ded19bdda3065dea259a8c25842956d4",
      "text": "call to prayer"
    },
    {
      "url": "https://www.cnn.com/2025/12/07/us/somalis-minnesota-trump-immigration",
      "text": "fueled by President Donald Trump’s vitriol"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/us/ice-minnesota-immigration-federal-agents-somali",
      "text": "particularly Somalis"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-12-26?post-id=cmljixqqh0000356pnlqyhlj7",
      "text": "would be ending"
    },
    {
      "url": "https://encyclopedia.ushmm.org/content/en/article/martin-niemoeller-first-they-came-for-the-socialists",
      "text": "“First They Came”"
    },
    {
      "url": "https://mn.gov/governor/newsroom/press-releases/?id=1055-724810",
      "text": "$10 million emergency relief package"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/us/ice-watch-observers-federal-agents",
      "text": "whistles"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/ramadan-muslims-minneapolis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/ramadan-muslims-minneapolis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "165daaae1dd3f97bfadfec5ac69037185cce5b2490c2b60c1a17cc3e898ee4fd",
  "scraped_at": "2026-02-19T07:33:18.377931+00:00"
}