{
  "url": "https://lite.cnn.com/2026/02/19/politics/pete-hegseth-political-speech-christian-convention-nashville",
  "title": "Pete Hegseth rails against ‘Godless left’ in political speech to Christian convention | CNN Politics",
  "date": "2026-02-20T07:27:59.527326+00:00",
  "authors": [
    "Haley Britzky, CNN"
  ],
  "text": "Source: CNN\n\nDefense SecretaryPete Hegsethrailed against what he called the “Godless left” and praised “Western Christian” values and traditions in a headliner speech Thursday night at a Christian communicators conference in Tennessee.\n\n“Under the leadership of President Trump, the military once again supports and trains our troops and tends to their spiritual health. You see, we train our troops, we no longer trans our troops,” Hegseth said to large applause from the crowd at the National Religious Broadcasters 2026 International Christian Media Convention in Nashville.\n\nOne of the first efforts undertaken by the Trump administration after taking office last January wasto ban transgender peoplefrom joining the military, and remove transgender people who were currently serving in uniform.\n\n“Gone is Godless and divisive DEI, gone is gender-bending equity and quotas, gone is climate change worship to a false God. We are one military, one fighting force, one nation under God. We are not in woke we trust, we are in God we trust,” he said.\n\nAlexis Wilkins, a country singer and girlfriend of FBI DirectorKash Patel, sang the National Anthem just before Hegseth’s address.\n\nSince becoming Defense secretary more than a year ago, Hegseth has routinely broken from precedent with past defense secretaries who largely shied away from political commentary in public. On Thursday, he told the convention’s crowd that “the other side is fueled by godless and toxic ideologies, foreign to the western way of life, with tolerant hearts filled with rage and hate.”\n\nThroughout the speech, Hegseth touched on many of his signature culture war talking points, including treatment of transgender service members; climate change; abortion; and the ending of diversity, equity, and inclusion. Hegseth’s address came on the heels of a visit by self-described Christian nationalist preacherDoug Wilsonto the Pentagon for part of the military’s monthly Christian prayer service. Hegseth is the most prominent follower of Wilson’s in the Trump administration.\n\nHegseth mentioned the monthly prayer services on Thursday and said the “left wing shrieks, which means we’re right over the target.”\n\nThe convention on Thursday included a ceremonial color guard from the 101st Airborne Division’s band, according to a release from NRB. Ceremonial support by the military can typically be requested for civic, business or community events. A US Army page for requesting ceremonial support from the Army Military District of Washington, for example, says religious services and events “detrimental to the interests or values of the armed forces” are not authorized for support.\n\nThe 101stAirborne Division did not respond to questions from CNN on Thursday regarding the event.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/us-military-top-universities-tuition-assistance",
      "text": "Pete Hegseth"
    },
    {
      "url": "https://www.cnn.com/2025/05/06/politics/supreme-court-ban-transgender-service-members",
      "text": "to ban transgender people"
    },
    {
      "url": "https://www.cnn.com/2025/09/13/politics/kash-patel-fbi-leadership-concerns",
      "text": "Kash Patel"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/douglas-wilson-pastor-pentagon-service-christian-nationalism",
      "text": "Doug Wilson"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/pete-hegseth-political-speech-christian-convention-nashville",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/pete-hegseth-political-speech-christian-convention-nashville",
      "text": "Cookie Settings"
    }
  ],
  "hash": "165f64bb0b533e56a511e4a7d91ae21bc63fdc1d4a2f28804c1379d14c7d408b",
  "scraped_at": "2026-02-20T07:27:59.527342+00:00"
}