{
  "url": "https://lite.cnn.com/2026/02/17/politics/hillary-clinton-trump-administration-epstein-intl",
  "title": "Hillary Clinton accuses Trump administration of a ‘cover-up’ over its handling of Epstein documents | CNN Politics",
  "date": "2026-02-19T07:32:57.717040+00:00",
  "authors": [
    "Issy Ronald, CNN"
  ],
  "text": "Source: CNN\n\nFormer US Secretary of StateHillary Clintonhas accused the Trump administration of a “continuing cover-up” in the way it has handled the release of millions of documents relating toJeffrey Epstein.\n\n“They are slow-walking it, they are redacting the names of men who are in it, they are stonewalling legitimate requests from members of Congress,” Clinton told the BBC at this weekend’s Munich Security Conference in Berlin.\n\nDeputy Attorney General Todd Blanche has repeatedly defended the Department of Justice’s handling of the files, saying it is “committed to transparency” and “is hiding nothing.”\n\nThe latest batch of documents released by the DOJ contained several references toBill Clinton, offering fresh insights into the sometimes-lewd ways the former president’s staff communicated with Epstein and his longtime associate Ghislaine Maxwell.\n\nHillary Clinton said she and her husband “have nothing to hide.” Bill Clinton has repeatedly denied wrongdoing related to the late sex offender.Previous document dumpsrevealed photos of Bill Clinton alongside Epstein and in a hot tub with someone a DOJ official described as a “victim” of Epstein’s sexual abuse.\n\nBoth Clintons are set to appearfor closed-door depositionsin the House’s Epstein probe later February after months of back-and-forth. They agreed to conditions set by the House Oversight Committee chair only once the chamber was preparing for a vote to hold the couple in contempt for defying a congressional subpoena.\n\nWithout referencing this tussle, Clinton said in the BBC interview that aired Tuesday the couple “are more than happy to say what we know, which is very limited and totally unrelated to their behavior or their crimes.”\n\n“I just want it to be fair, I just want everyone to be treated the same way. That’s not true for my husband and me,” she added, repeating her desire to attend public hearings.\n\n“I think everybody should testify who is asked to testify,” she said.\n\nShe claimed that scrutiny directed toward her and her husband was being used by the administration to “divert attention from President (Donald) Trump.”\n\nTrump, who is mentioned more than 1,000 times in the documents, eventually encouraged Republicans to vote to release the files late last year after initially resisting an effort to make them public.\n\n“I’ve been totally exonerated,” Trump told reporters Monday on Air Force One, adding of the Clintons, “They’re getting pulled in, that’s their problem. We’ll have to see what happens.”\n\nClinton referenced Attorney General Pam Bondi’s testimony in front of the House Judiciary Committee last week as one example indicating the administration has “something to hide.”\n\n“(Bondi) refused to answer questions, she diverted attention away from the matters at hand, she refused to look at survivors,” Clinton said.\n\nHer comments struck a similar tone to those made by her husband’s spokesperson in December. The spokesperson, when calling on the DOJ to release all the files, said that “refusal to do so will confirm the widespread suspicion the Department of Justice’s actions to date are not about transparency, but about insinuation.”\n\nThe DOJ has been heavily criticized by Epstein victims and members of Congress over the department’sinconsistent redactionsof names and details in the millions of released documents.\n\nSome members of Congress whoviewed unredacted versionsof the documents later said that the department was protecting powerful men, prompting them to unredact additional names in the filesand send Congressa list of “politically exposed persons” on Saturday.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/clintons-depositions-epstein-contempt",
      "text": "Hillary Clinton"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/doj-epstein-files-prominent-people",
      "text": "Jeffrey Epstein"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/epstein-files-clintons",
      "text": "Bill Clinton"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/epstein-files-clintons",
      "text": "Previous document dumps"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/clintons-depositions-epstein-contempt",
      "text": "for closed-door depositions"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/redacted-text-jeffrey-epstein-files",
      "text": "inconsistent redactions"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "viewed unredacted versions"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/doj-epstein-files-prominent-people",
      "text": "and send Congress"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/hillary-clinton-trump-administration-epstein-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/hillary-clinton-trump-administration-epstein-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "167f54c1a4c06916dd060826261e6b7f0849b254ea9e4f275de40e5484a63881",
  "scraped_at": "2026-02-19T07:32:57.717056+00:00"
}