{
  "url": "https://lite.cnn.com/2026/02/22/politics/south-texas-midterms-latino-voters-all-over-the-map",
  "title": "A border district in Texas is flashing warning signs for Republicans in the midterms | CNN Politics",
  "date": "2026-02-23T07:36:17.112449+00:00",
  "authors": [
    "John King, CNN"
  ],
  "text": "Source: CNN\n\nDaisy Alcazar is a one-issue voter this midterm year: stopping Donald Trump.\n\n“I don’t think we are going to survive if we don’t speak up this election,” Alcazar said. “We are on fire. We are being burned down to the floor. Our businesses. Our economy.”\n\nAlcazar and her husband own La Pale, a traditional Mexican ice cream and fruit bar shop. They have a storefront in Brownsville and sell through a local grocery chain. “Our life savings are on the line,” she said.\n\nWalk-in sales are down 50%. First, it was inflation’s toll on working families.\n\n“The splurge money,” she said. “We are a luxury item right now.”\n\nThen, the fear factor. Alcazar was one of several small-business owners who told CNN many Hispanic families are afraid to go out for ice cream, or burgers or coffee — especially if the business is Latino-owned — due to fears of being detained by US Immigration and Customs Enforcement.\n\n“We are a target now,” Alcazar said. “And it doesn’t matter if you are documented or undocumented, legal or illegal. … People are afraid to use public transportation because ICE enforcement is literally walking up and down the streets. We cannot normalize this.”\n\nWe visited Alcazar and South Texas as part of our “All Over the Map” project, an effort to track elections and major issue debates through the eyes of experiences of everyday Americans. That there is good reason to visit speaks volumes about President Donald Trump’s midterm political troubles. Alcazar lives in the 34th Congressional District, which was among the big targets when, at Trump’s request, Texas Republicansdrew new US House mapsfor the 2026 midterms.\n\nThe 34th is one of just 13 districts nationwide that Trump carried in 2024 at the same time voters elected a Democrat to the House. Trump won the 34th by a little more than 4 points in 2024, while Democratic Rep. Vicente Gonzalez won by less than 3 points. Had the new lines been in place then, Trump would have won by 10 points.\n\nYet what Texas Republicans thought would be a safe new GOP district — and a 2026 pickup — is a tossup. If Republicans can’t win in a Texas district they drew to their advantage, it’s a safe bet the Democrats will win the House and change the trajectory of the Trump presidency.\n\nFour of the five Democratic-held seatstargeted by Texas Republicansare majority Latino under the new maps. But Trump’s standing among Latinos hasfallen dramaticallynationwide since the start of his second term, outpacing his drop in approval overall.\n\nLouis Sorola knows a lot of Latinos who voted for Trump. He predicts a 2026 backlash.\n\n“Because things have changed in the last year,” said Sorola, a Brownsville attorney who cast his first vote more than 40 years ago for Ronald Reagan but has mostly supported Democrats in recent elections. “We didn’t have the economy in the shape that it is. We didn’t have ICE acting like a Gestapo police force. We didn’t have the tariffs hurting us. We didn’t have a lot of things. We didn’t have the Epstein files in front of us.”\n\nBrownsville is home to the southernmost crossing at the US-Mexico border. Illegal crossings are way down — a promise kept that could be a great political asset for the president and his party in the midterms, particularly in a region with thousands of immigration and border agents and their families. But the immigration issue is instead, at the moment anyway, a clear liability.\n\n“There is a whole argument to make about border security,” said Milton Reyna, a three-time Trump voter who owns a blue-collar bar in Corpus Christi. But Reyna added this: “Being Hispanic, I think that there does need to be some empathy.”\n\nCorpus Christi is the big change on the new map.\n\nThe current 34th includes parts of Hidalgo County along the border. But the 2026 map shifts Hidalgo to a neighboring district and adds a big chunk of Nueces County — the Corpus Christi area.\n\nAs a result, the new 34th has about 63,000 fewer voting-age Hispanic residents, and Nueces leans more Republican than Hidalgo.\n\n“A lot of our customers tend to be, tend to lean further right,” Reyna said. “So, when Trump was elected, we got a surge.”\n\nReyna plans to vote Republican in November but said he would skip the March 3 primaries.\n\n“I think everybody’s a bit exhausted talking about politics,” Reyna said. “I tend to turn the TV off a little bit more than I used to.”\n\nA handful of Reyna’s friends and co-workers were on hand for our interview. A quick chat with them around the bar was telling.\n\nFour of the five were Hispanic. Four voted for Trump.\n\n“I feel like he’s creating a lot of chaos,” said Ramon Herrera, the lone Kamala Harris voter in the group. “It’s a little bit too extreme.”\n\nAll four of the Trump voters said the president was mostly doing a good job.\n\n“What he ran on, he’s addressed,” said Mike Martinez, a Reyna business partner. “He’s been working on it.”\n\nThree of the four, though, voiced at least some reservations about how he gets things done.\n\n“Probably 80% positive to 20% negative,” said Westly Belcher, who owns a few local small businesses.\n\nRichard Contreras said Trump should assert “better control” over ICE.\n\n“Go after the true criminals,” he said. “Leave the abuelos and abuelitas alone.”\n\nNone of the five voiced interest in the March primary and no one raised their hand when asked whether Trump’s endorsement might influence their thinking about the primary.\n\n“He’s lost a little juice just because of the methods, the way he is doing it,” said Contreras, a Corpus Christi real estate agent.\n\nTwo of the Trump voters were open to voting for a Democrat in November.\n\nContreras said divided government might force some compromise in Washington. “Something to think about,” he said. But Contreras also said he had a favorable early impression of GOP candidate Eric Flores — a fellow veteran.\n\nCeleste Montemayor, the bar manager, sounded most open.\n\n“I do think some things need to change,” Montemayor said. “I just think what we are doing may not be working.”\n\nTrump’s 2024 victory over Harris came with increased Latino support. He won 55% of the Texas Hispanic vote in 2024, up from 41% in 2020 and 37% in 2016.\n\nRural Kingsville was a Trump stronghold. It’s among the places to watch as the midterm year plays out.\n\nSteve Martinez is associate pastor at Kingsway Family Church, where the congregation is 80% Hispanic. Martinez says he tries to avoid names and political parties when asked for voting advice.\n\n“I always say biblically what I stand for,” Martinez said. “Congress is a big thing right now. I ask a question: What are your views on homosexuality? What are your views on abortion? You know, that is what is important to me.”\n\nMartinez acknowledged that after Sunday services of late, there are questions about how to square immigration enforcement tactics with Christian values.\n\n“It is hard, yes, to see some of these families separated and to see all that is going on,” Martnez said. “But at the same time, I tell people the law is the law, and we have to abide by it.”\n\nMartinez believes most Christian conservatives will stay loyal to Trump and the GOP.\n\nOutside the church, though, is a reminder that kitchen-table issues often drive voting decisions: A long double line of cars lined up for a church food bank. Some arrived four hours before it opened.\n\n“The need is great,” Martinez said.  Some can’t find jobs. Others are on fixed incomes that don’t keep pace with inflation. Some are large families.”\n\n“People are struggling right now financially,” Martinez said.\n\nAlcazar, the Brownsville ice cream shop owner, said she finds it increasingly difficult to understand Latinos still loyal to Trump and Republicans.\n\n“I don’t know if they thought they were excluded from the brown color that we have,” she said. “I just can’t see how they translate that.”\n\nMore important to her, though, is persuading more Latinos in her community who think politics doesn’t matter to become midterm voters.\n\n“Our voice matters,” she said. “We can make a change. This is the year that the Latino community can show up for their people.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/specials/politics/all-over-the-map",
      "text": "All Over the Map"
    },
    {
      "url": "https://www.cnn.com/2025/08/23/politics/texas-republicans-approve-new-congressional-maps-as-partisan-redistricting-race-escalates",
      "text": "drew new US House maps"
    },
    {
      "url": "https://www.cnn.com/2025/12/14/politics/texas-redistricting-gop-latinos",
      "text": "targeted by Texas Republicans"
    },
    {
      "url": "https://www.cnn.com/2025/11/15/politics/trump-latino-voters",
      "text": "fallen dramatically"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/south-texas-midterms-latino-voters-all-over-the-map",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/south-texas-midterms-latino-voters-all-over-the-map",
      "text": "Cookie Settings"
    }
  ],
  "hash": "169a50f756164ecdf0b1112fc10a8be1926dfc7c453539956fb6c63dfcb2712d",
  "scraped_at": "2026-02-23T07:36:17.112461+00:00"
}
