{
  "url": "https://lite.cnn.com/2026/02/10/politics/jd-vance-x-post-armenian-genocide",
  "title": "Vance’s X account deletes post recognizing Armenian genocide | CNN Politics",
  "date": "2026-02-12T21:32:13.981211+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nVice President JD Vance’s X account posted and then deleted a recognition of the Armenian genocide after he paid his respects at a memorial in the country on Tuesday.\n\nThe original post from the vice president’s account — which said Vance and second lady Usha Vance attended a wreath-laying ceremony “to honor the victims of the 1915 Armenian genocide” — broke from Trump administration policy, which does not use the word“genocide” to refer to the systematic killing and deportation of Armenians in what is now Turkey.\n\nExcept forformer President Joe Biden, US presidents have avoided that term for fear of damaging ties with Turkey, a key regional ally, which is currently playing a mediating role between the Trump administration and Iran.\n\nAn official with the vice president sought to blame the post on staff who are not part of the delegation traveling with Vance.\n\nThe Armenian National Committee of Americacalled the deletion“a denialist action consistent with President Trump’s shameful retreat from honest American remembrance of a crime recognized by all 50 states, the US Congress, the White House, and more than a dozen of our NATO allies.”\n\nVance — the first sitting US vice president or president to visit the country — told reporters the Armenians asked him to visit the site, calling the massacre “a very terrible thing that happened a little over 100 years ago.”\n\nA Vance spokesperson told CNN: “This is an account managed by staff that primarily exists to share photos and videos of the Vice President’s activities. For the Vice President’s views on the substance of the question, I refer you to the comments he made earlier on the tarmac in response to the pool’s question.”\n\nVance said he visited the site “out of a sign of respect, both for the victims, but also for the Armenian government.”\n\n“Obviously, I’m the first vice president to ever visit Armenia. They asked us to visit the site. Obviously, it’s a very terrible thing that happened a little over 100 years ago, and something that was just very, very important to them culturally,” said Vance, who added he also plans to visit important sites in Azerbaijan.\n\nThe White House’s rapid response X account posted — but later deleted —Vance’s comments on visiting the memorial.\n\nAsked about the deleted post on Vance’s account, White House press secretary Karoline Leavitt told reporters there’s been no change to administration policy.\n\n“As for the Armenian tweet that you’re referring to, I would just refer you back to the White House’s message that was issued on Armenian Remembrance Day, and there has been no change to policy at this time,” she said at Tuesday’s press briefing.\n\nThe official VP account laterreposted a postfrom Vance press secretary Taylor Van Kirk that showed the second couple at the wreath-laying and included a photo of Vance’s handwritten note in a guest book.\n\n“In solemn remembrance of the lives lost, we honor the resilience and enduring spirit of the Armenian people,” the vice president wrote.\n\nThe number of Armenians killed has been a major point of contention. Estimates range from 300,000 to 2 million deaths between 1914 and 1923, with not all of the victims in the Ottoman Empire. But most estimates — including one of 800,000 between 1915 and 1918, made by Ottoman authorities themselves — fall between 600,000 and 1.5 million.\n\nWhether due to killings or forced deportation, the number of Armenians living in Turkey fell from 2 million in 1914 to under 400,000 by 1922.\n\nIn 2021, Biden became the first US president toofficially recognizethe massacre as a genocide, with a statement marking its anniversary that said, “Each year on this day, we remember the lives of all those who died in the Ottoman-era Armenian genocide and recommit ourselves to preventing such an atrocity from ever again occurring.” The statement was welcomed by Armenia but condemned by Turkey, which maintains the killings were part of war time and that there were losses on both sides.\n\nLast year, theTrump administrationissued a statement on April 24 commemorating “Meds Yeghern,” an Armenian term, without translating it into English as genocide.\n\n“Beginning in 1915, one and a half million Armenians were exiled and marched to their deaths in the final years of the Ottoman Empire. On this Day of Remembrance, we again join the Great Armenian Community in America, and around the World, in mourning the many lives that were lost,” the statement said.\n\nDuring the first Trump administration, the White Houseasked Republican senatorsto block the unanimous consent request on a resolution recognizing the mass killings of Armenians from 1915 to 1923 as genocide, on the grounds that it could undercut negotiations with Turkey. The resolution passed the House and Senate in 2019.\n\nThis story has been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2021/04/24/politics/armenian-genocide-biden-erdogan-turkey",
      "text": "former President Joe Biden"
    },
    {
      "url": "https://x.com/ANCA_DC/status/2021207063527879023?s=20",
      "text": "called the deletion"
    },
    {
      "url": "https://x.com/VPPressSec/status/2021161790818640365?s=20",
      "text": "reposted a post"
    },
    {
      "url": "https://www.cnn.com/2021/04/24/politics/armenian-genocide-biden-erdogan-turkey",
      "text": "officially recognize"
    },
    {
      "url": "https://www.whitehouse.gov/briefings-statements/2025/04/presidential-message-on-armenian-remembrance-day-2025/",
      "text": "Trump administration"
    },
    {
      "url": "https://www.cnn.com/2019/12/17/politics/trump-administration-armenian-genocide",
      "text": "asked Republican senators"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/jd-vance-x-post-armenian-genocide",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/jd-vance-x-post-armenian-genocide",
      "text": "Cookie Settings"
    }
  ],
  "hash": "16a012ed272ae2371f0112a4dd28061246f1011bb068089cc22169cb785fe450",
  "scraped_at": "2026-02-12T21:32:13.981224+00:00"
}