{
  "url": "https://lite.cnn.com/2026/03/01/europe/pope-leo-conclave-election-book-intl",
  "title": "How Pope Leo was elected: New details of dramatic conclave battle revealed | CNN",
  "date": "2026-03-01T07:06:17.066496+00:00",
  "authors": [
    "Christopher Lamb"
  ],
  "text": "Source: CNN\n\n“Conclave”the movie provides a gripping, if fictional, behind-the-scenes lookinside the secretive electionof a new pope. But last year’s real-life conclave was just as dramatic, with plenty of plot twists, political battles among cardinals and a surprise outcome.\n\nA new book lifts a lid on how, in May 2025,Pope Leo XIVwas elected as the first US-born pope in the Catholic Church’s 2,000-year history. Its authors tell in previously unheard detail how Cardinal Robert Prevost, a low-key Augustinian friar from Chicago, had quietly garnered support from fellow cardinals as the conclave got underway but remained under the radar of wider attention as a serious candidate.\n\nGerard O’Connell, the Vatican correspondent for “America,” a Catholic magazine based in New York, and Elisabetta Piqué, a correspondent for Argentina’s “La Nacion” newspaper and a CNN contributor at the 2025 conclave, describe how an Italian frontrunner faded from contention while providing a breakdown of the voting inside the Sistine Chapel. They also report how the election of Prevost caught many by surprise, including senior figures in the Vatican. For years, the prospect of an American pope had seemed impossible because of the “military, economic and cultural power” of the US, one cardinal told them.\n\nO’Connell and Piqué, a husband-and-wife reporting team, were longtime friends of Pope Francis, who had baptized their two children in Argentina while still a cardinal there and later also married the couple.\n\nThe book, “The Election of Pope Leo XIV: The Last Surprise of Pope Francis,” draws on interviews with numerous cardinals.\n\nUsing those sources, the authors describe how in the tense days leading up to the conclave,a battle took placeinside the College of Cardinals: Should they vote for a pope to continue the legacy and reforms of Francis, or make a course correction? As O’Connell and Piqué set out, with each contributing their own diary-style entries to the book, efforts to elect a pope who would go in a different direction to Francis were thwarted. Leo, while distinct in style from his predecessor and still somewhat inscrutable, could broadly be described as Francis’ choice.\n\nHere are some of the takeaways from the new book.\n\nThe first ballot, O’Connell reports, saw Cardinal Péter Erdö, a Hungarian, gain the greatest number of votes. Erdö is a distinguished church lawyer and was the conservatives’ choice. While support for him was well-organized, it wasn’t necessarily widespread, O’Connell says. In that opening round, “more than 30 candidates got votes but only three received between 20 and 30,” he writes, with the other two contenders being Cardinals Robert Prevost and Pietro Parolin, the Holy See Secretary of State and leading Italian candidate. The next two ballots, however, saw support move swiftly to Prevost while Erdö’s dropped away. The first American pope was elected on the fourth ballot with 108 votes, with Parolin as runner-up, O’Connell says. The book also reveals the fourth ballot had to be repeated as one cardinal accidentally stuck two ballot papers together. (The same thing happened in the 2013 conclave).\n\nThe conclave is a serious, spiritual process in which the cardinals are cut off from the world – surrendering all electronic devices – before they cast their vote in front of the awesome fresco of Michelangelo’s “The Last Judgment.” But the book suggests not everything always went to plan. Voting on the first day was delayed when security officials picked up a cell phone signal inside the Sistine Chapel, O’Connell writes. One of the “older cardinals” realized he had a cell phone in his pocket which he then handed over, a reported scene O’Connell describes as “unimaginable, even for a film.” Then another problem emerged, the book says. With no phones to use as alarms, some cardinals almost overslept in their rooms in the Casa Santa Marta, the guesthouse where they stay for the duration of conclave. The Vatican handed complimentary alarm clocks to each one to make sure they would wake up and get to the Sistine Chapel on time. Some cardinals also complained about the lack of bathroom in the chapel which meant they had to be escorted to an external restroom by a junior cardinal deacon. “It’s like going back to kindergarten,” one told the authors.\n\nIn the run-up to the conclave, following Francis’ death, two cardinals were talked of as frontrunners: Parolin, the Vatican’s chief diplomat, and Cardinal Luis Antonio Tagle, leader of the Vatican’s evangelization office. Parolin was being pushed as a moderate, diplomatic figure who would restore “order” after the turbulent years of Francis, Piqué and O’Connell report. But he lacked grassroots experience in Catholic communities. While Parolin worked closely with Francis, one of his supporters, Cardinal Beniamino Stella, stunned fellow cardinals with a speech at a meeting where he attacked a major Francis reform. The authors reported on the speech in the run-up to the conclave and this, they say, had a negative effect on Parolin’s candidacy. This was compounded by a poor performance at a Mass with large numbers of young people, where Parolin was described as lacking “charisma” and as having “no connection” with the youthful congregation. Tagle, while charismatic and from the Philippines, with one of the largest Catholic populations in the world, was considered not to be a strong enough administrator, the book says. He also suffered harsh social media attacks which damaged his candidacy.\n\nThe authors claim that “more than twenty” cardinals had quietly identified Cardinal Prevost as the most qualified candidate to be pope. They were impressed by his humble, low-profile style and felt he would be the one best placed to continue Francis’ legacy, they write. His missionary experience in Peru, and international experience more broadly, was crucial.\n\nPreviously, because of the US’ global political and economic power, it was widely accepted the cardinals would not choose an American pope. But Prevost was seen as “the least American of the Americans” and the cardinals from Latin America, Piqué reports, felt that “although a ‘gringo,’ (he) is one of us.”\n\nFrancis quietly promoted the man who would become his successor and ensured he was a contender. “Clearly Pope Francis had his sights set on him,” Piqué writes. It was the late pope – the first from Latin America – who laid the ground for Prevost to become a candidate by first appointing him a bishop in Chiclayo, Peru, and then bringing him to Rome to run one of the most important Vatican departments, responsible for appointing bishops. In this high-ranking role, Leo worked closely with cardinals from across the world and it was a sign of the trust Francis had placed in him. The pair had regular one-to-one meetings during which, Piqué says, “surely the two men discussed Church leadership issues beyond the immediate topic at hand (upcoming bishop appointments),” while keen-eyed observers noted that Prevost accompanied Francis on his last two trips abroad.\n\nDespite being an ancient election process steeped in ritual and tradition, and still communicating its results through smoke signals, the conclave was able decisively and swiftly to produce a result. As O’Connell and Piqué show, it also retains the ability to surprise.\n\n“The Election of Pope Leo XIV: The Last Surprise of Pope Francis,” will be published in English by Orbis Books on March 25, 2026.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/04/26/entertainment/conclave-movie-pope",
      "text": "“Conclave”"
    },
    {
      "url": "https://www.cnn.com/2025/04/28/world/conclave-pope-selection-intl-dg",
      "text": "inside the secretive election"
    },
    {
      "url": "https://www.cnn.com/world/pope-leo-xiv-fast-facts",
      "text": "Pope Leo XIV"
    },
    {
      "url": "https://www.cnn.com/2025/05/02/europe/cardinals-conclave-pope-successor-crossroads-intl",
      "text": "a battle took place"
    }
  ],
  "hash": "176d55618854e6cec913bf248acc8de53e4eefd98445ae22525e5449f6b70e89",
  "scraped_at": "2026-03-01T07:06:17.066509+00:00"
}