{
  "url": "https://lite.cnn.com/2026/02/13/politics/trump-racist-video-gop-blowback",
  "title": "Trump privately lashes out at GOP lawmakers over racist video blowback, sources say | CNN Politics",
  "date": "2026-02-14T07:07:05.687530+00:00",
  "authors": [],
  "text": "Source: CNN\n\nHours after refusing to apologize fora racist videoposted to his Truth Social account,President Donald Trumphadn’t let go.\n\nHe spent last weekend complaining to allies about Republicans who had condemned the video depicting the Obamas as apes, questioning the lawmakers’ loyalty and vowing consequences, sources familiar with his comments told CNN.\n\nThe president railed against South Carolina Sen. Tim Scott — the sole Black Republican senator and chair of the Senate GOP’s campaign arm — throughout the weekend at Mar-a-Lago, arguing one of his top congressional allies was out of line to call his White House racist, the sources said.\n\n“The president felt he could’ve handled that matter privately,” a senior Trump administration official told CNN of Scott. “He was like, ‘We work together all the time. He didn’t need to comment publicly.’”\n\nTrump had even stronger words for Alabama Sen. Katie Britt, one of the sources recalled, using expletives to denounce her and declaring that she was dead to him.\n\nBritt’s office slammed that account as “fake news” and touted her strong working relationship with the president, while the White House praised her as “an incredible ally” whom the president has “great respect” for. Scott’s office declined to comment.\n\nBut the episode, which marks one of the starkest GOP breaks from the president ahead of the 2026 midterms, also reflects how such moments have frustrated the commander in chief.\n\nThe White House’s removal of the video, which it had initially defended last week, came nearly 12 hours after it had been online — and only after the blowback from some top Republicans.\n\nJust days later, a handful of GOP lawmakersbucked Trump on a key tariff vote, prompting him to threaten that anyone who votes against his signature economic policy will “suffer the consequences” in primaries. And late last year, Trump, under GOP pressure, was forced to back a vote to compel the release of the Jeffrey Epstein files — an issue he has said the country should move on from.\n\nThe White House argued that Trump remains “the unequivocal leader” of the GOP, with press secretary Karoline Leavitt saying in a statement that he’s “committed to ensuring Republicans remain united against the Democrats who, if given the chance, will destroy our country again through open borders, allowing non-citizens to vote in elections, and horrific economic policy.”\n\nBut last Friday morning, it was Republican lawmakers trying to set the tone for their party by forcefully speaking out against Trump’s late night post.\n\nAs the video was first gaining traction, Scott — who speaks to the president regularly — privately reached out, a source familiar with the matter told CNN. Unable to get ahold of him, he took to X.\n\n“Praying it was fake because it’s the most racist thing I’ve seen out of this White House. The President should remove it,” the senator wrote.\n\nThat got Trump’s attention. He later called Scott — with whom he has a close personal relationship — and told the South Carolina Republican he was planning to have his team remove the post. Just before noon, the White House said a staffer had erroneously posted the video and it was deleted. As he flew to Mar-a-Lago that night, Trump told reporters he hadn’t seen the final frames of the video depicting the Obamas and blamed an unnamed staffer for posting it. “I didn’t make a mistake,” he said.\n\nThe president, as well as many of Trump’s top advisers, have privately asserted that Scott’s response is what led to the story gaining nationwide attention, the sources said.\n\nBut Scott was hardly alone in condemning the video. Britt, who’s working closely with the White House to try to fund the Department of Homeland Security, applauded the post’s removal last week, saying it “should have never been posted to begin with, and is not who we are as a nation.”\n\nThe open criticism caught the attention of far-right activistLaura Loomer, who presented Trump with printouts of the lawmakers’ statements, one of the sources familiar said. Loomer, who has previously succeeded in riling up the president over critical comments made by his perceived allies, posted on X that she was “compiling a list” of Republicans who “attacked” Trump with “false accusations of racism.”\n\nNotably, some of the senators Trump and Loomer were furious with — including Scott and Britt — were also in Palm Beach that weekend for the National Republican Senatorial Committee’s winter retreat. Trump did not meet with the group, but he did invite a select few — such as Sens. Eric Schmitt and Lindsey Graham, who had not criticized him over the video — to join him for golf and attend his Super Bowl party.\n\nBritt’s office defended her support for Trump in a statement.\n\n“This is classic fake news by CNN. Senator Britt has a 100% voting record with President Trump and remains one of his strongest allies in the Senate. Just this week, Senator Britt had a tremendous conversation with President Trump about her leadership as she fights to defend our incredible ICE officers, pass the SAVE America Act, and advance the president’s policies to make America affordable again. Any narrative suggesting otherwise is not only misleading, it is flat out false,” the statement said.\n\nWhile Trump had harsh words for Republicans who spoke out against him, he’s been less critical of the unnamed staffer whom the White House blamed for the debacle, telling reporters on Thursday that he has no plans to discipline the person.\n\nThe president often posts personally on Truth Social — particularly late at night and early in the morning — and he often personally re-posts others’ posts, sources familiar with his social media use previously told CNN.\n\nBut a few close aides — including Natalie Harp, who will sometimes type out posts that are dictated to her, and Dan Scavino, a deputy chief of staff who ran Trump’s social media accounts during his first term — also have access. Harp and Scavino were spotted on Sunday sitting beside the president during his Super Bowl party. Harp also boarded Marine One with the president on Friday as he traveled to Fort Bragg.\n\n“No, I haven’t [taken action against them],” Trump said Thursday, without naming anyone. “That was a video on, as you know, voter fraud, a fairly long video, and they had a little piece, and it had to do with the Lion King. It’s been very well, it’s been shown all over the place long before that was posted.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/donald-trump-obamas-apes-truth-social",
      "text": "a racist video"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/house-republicans-trump-canada-tariff-vote",
      "text": "bucked Trump on a key tariff vote"
    },
    {
      "url": "https://www.cnn.com/2025/08/04/politics/laura-loomer-trump-firings",
      "text": "Laura Loomer"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/trump-racist-video-gop-blowback",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/trump-racist-video-gop-blowback",
      "text": "Cookie Settings"
    }
  ],
  "hash": "17ac90fa360a1885233bbcbc9842b65e2a6f423cb3dbeae2f2414ba08c85477f",
  "scraped_at": "2026-02-14T07:07:05.687541+00:00"
}