{
  "url": "https://lite.cnn.com/2026/02/11/politics/dhs-shutdown-white-house-democrats-ice",
  "title": "Republicans urge Trump to hold firm against Democrats’ DHS demands as clock ticks toward shutdown | CNN Politics",
  "date": "2026-02-12T21:29:42.001372+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nRepublicans’ warning for PresidentDonald Trumpis growing louder with the Department of Homeland Security set to shut down in just days: Don’t feel public pressure to relent on an issue central to his campaign.\n\nEven as the White House has engaged with Democrats over reforms to DHS, a growing chorus of members have urged Trump and his team to play hardball and instead fight for GOP priorities, like cracking down on so-called sanctuary cities in exchange for any Democratic demands on federal immigration enforcement.\n\nOne such appeal came from Missouri Republican Sen. Eric Schmitt, who golfed and watched the Superbowl with the president over the weekend. Schmitt’s view was the president didn’t need to yield to the other party’s demands, even with that critical funding deadline bearing down on Capitol Hill.\n\n“We should not be, in any way, shape or form kneecapping ICE,” Schmitt told CNN. “President Trump ran on this issue. So again, I think this is a home game for us, and if the Democrats want to continue down this road, it’s just a loser for them.”\n\nBolstering Republicans’ resolve if that Trump’s signature policy bill last summer injected DHS with billions for immigration enforcement – enough, they argue, to cover operations for months, if not years, to come. The impact of a shutdown instead would be felt primarily by other program like FEMA and TSA — something they say would make it harder for Democrats to defend their position in a prolonged stalemate.\n\n“I don’t know why we are entertaining policy initiatives on funding bills. If you want to have a debate and they want to put forth this stupid 20-point plan in legislation, let’s have the debate. They’ll lose,” Schmitt challenged. (Democrats have sent the White House a series of demands from requiring the use of body cameras for agents to reining in roving patrols.)\n\nSpeaker Mike Johnson told reporters Wednesday evening that the White House would send over new details to Democrats in their ongoing negotiations.\n\n“I was at the White House 90 minutes ago, talking about that very thing. The White House is sending over a few terms — I don’t know if you’d call it a counteroffer — but they’re in negotiations with Senate Democrats,” Johnson said about the status of the talks.\n\nBut it remains unclear if a deal can come together before funding for DHS expires Friday.\n\nTop Senate Democratic appropriator Patty Murray said Thursday that the caucus would oppose any votes later in the day on a DHS funding stopgap. She and others, she said, were not satisfied by the White House’s latest response.\n\n“We’re still looking at it but no, not today. They have not addressed most of our major concerns at all,” Murray told CNN.\n\nAfter the death of Alex Pretti, the window for a negotiation over the contentious and thorny issue of immigration enforcement tactics appeared to open in Congress, a rare but serious opportunity for lawmakers to find a middle ground on an issue that has befuddled lawmakers for decades. But after two weeks of fraught talks, stalled negotiations and public blaming, both sides appear to be recalcitrant, retreating to their long-held views on the issue.\n\nThe White House had pushed Republicans to fund the rest of the government while negotiating DHS funding separately, but conservatives are newly emboldened that the president can easily weather a partial shutdown with little political cost while blaming Democrats for being soft on immigration enforcement.\n\n“I’ve made clear, I’m not gonna support anything that I think is detrimental to law enforcement,” Sen. Josh Hawley, a Republican from Missouri, recently told reporters on Capitol Hill.\n\nSen. Bernie Moreno said, in his view, “they [Democrats] can take the DHS appropriations bill or they can shut down FEMA, Coast Guard, TSA, Secret Service and CISA. That’s up to them.”\n\n“I wouldn’t offer anything. That’s my point of view,” the Ohio Republican added.\n\nMany Democrats, meanwhile, initially interpreted GOP comments about concerns over ICE tactics as a tacit recognition that the administration may have gone too far in its efforts to ramp up deportations in major cities around the country.\n\nAnd many in the party see the death of Pretti and Renee Nicole Good at the hands of federal agents in Minneapolis as a moment of reckoning requiring them to force significant reforms to US Customs and Immigration Enforcement, even if it risks another prolonged shutdown just months after a historic shutdown yielded little in terms of concessions from the administration.\n\n“It’s really important that Secretary Noem not allow a band of untrained officers – I’m gonna use that term loosely – to terrorize our communities,” Sen. Jacky Rosen, a Democrat from Nevada, said.\n\nNegotiations with the White House are ongoing. Sen. Markwayne Mullin of Oklahoma, a close ally of the president’s, told reporters Wednesday night that GOP leaders had offered Democrats a four-week continuing resolution to keep talks going.\n\nHowever, Senate Minority Leader Chuck Schumer is signaling his members are unlikely to back even a short-term spending bill to fund the agency while talks continue because such little progress has been made.\n\n“We’re 3 days away from a DHS shutdown and Republicans have not gotten serious about negotiating a solution that reins in ICE and stops the violence. Democrats will not support a CR to extend the status quo,” Schumer posted on X Wednesday.\n\nRepublican leaders have suggested they may send members home Thursday for a regularly scheduled week-long recess if a deal to keep DHS funded remains too far out of reach, leaving funds to lapse.\n\nMajority Leader John Thune, for his part, has tried for to maintain the talks are moving in the right direction. But plenty more in his party are skeptical, accusing their opponents of using the funding fight to demonstrate to their liberal base that they’re standing up to Trump’s deportation raids.\n\n“They’re clamoring for a government shutdown,” House Majority Leader Steve Scalise told reporters Tuesday, while another top Republican, Rep. Lisa McClain, said she’s “furious with the Democrats who are so desperate to satisfy their activist base that they would rather shut down FEMA, TSA and even the Coast Guard.”\n\nEven if leaders and the White House were able to get to reach a compromise,it’s not clear that either party would fully accept it given just how polarizing the issue of Trump’s immigration enforcement has become.\n\n“If they make a deal, it’s going to be hard to get the Democrats and the Republicans to vote for it,” Louisiana Sen. John Kennedy said. “I think if you gave Chuck everything he wanted today, he couldn’t deliver the votes from Dems and the Republicans are gonna want a crackdown on sanctuary cities.”\n\nThis story has been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/dhs-shutdown-white-house-democrats-ice",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/politics/dhs-shutdown-white-house-democrats-ice",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1806e15ceb7b15de8dca1639a33774cbf81921674cf9efe61bb78cfcc2a23004",
  "scraped_at": "2026-02-12T21:29:42.001386+00:00"
}