{
  "url": "https://lite.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam",
  "title": "Peru’s leader José Jerí ousted over ‘Chifa-gate’ scandal, as presidential ‘curse’ strikes again | CNN",
  "date": "2026-02-19T07:30:47.476848+00:00",
  "authors": [
    "CNN staff"
  ],
  "text": "Peru’s president has been ousted after being censured by Congress, marking the country’s eighth change of leader in nearly a decade ofpolitical instability.\n\nPeru’s Congress on Tuesday approved a motion of censure against José Jerí by 75 votes to 24 in a move that came just four months after he took office as interim president and two months before an expected general election.\n\nThe vote follows accusations that Jerí had held unofficial meetings with Chinese businesspeople, on one occasion while wearing a hood. The political scandal — dubbed in the country as “Chifa-gate” after the term for Peruvian food with Chinese roots – led the Attorney General’s Office to open an investigation against Jerí.\n\n“The presiding officers declare the office of President of the Congress of the Republic vacant, and consequently, the office of President of the Republic is vacant,” said Fernando Rospigliosi, acting head of Congress.\n\nLegislators on Wednesday picked left-wing lawmaker and former Supreme Court judge José María Balcázar as the interim president to replace Jerí.\n\nJerí, 39, assumed the presidency in October after becoming Speaker of Congress when PresidentDina Boluartewas impeached. Boluarte had led the executive branch since the 2022 impeachment and arrest ofPedro Castillo, who served for a year and a half.\n\nJerí has been accused of misconduct after holding off-the-radar meetings with Zhihua Yang, a Chinese businessman who holds a state-granted concession for one of his companies.\n\nJerí has denied any wrongdoing and said the meetings were “circumstantial.” He has also denied that the businessman had requested any kind of favor or support from him.\n\nThe first meeting, held at a Chinese restaurant in Lima on December 26, sparked controversy after images showed the president entering the establishment wearing a hood. Jerí had another meeting with Yang on January 6 at a Chinese goods store, where he arrived wearing sunglasses. Neither of these meetings was registered in the presidential records.\n\nLast month, the 39-year-old interim president acknowledged the meetings took place and apologized for how they had been conducted.\n\n“I admit my mistake and publicly apologize for entering the way I did, hooded, and for how this has given rise to suspicions and doubts about my behavior and generated the creation of all kinds of unreal stories, which have no basis whatsoever,” he said.\n\nCNN has reached out to Yang and the presidential office for comment.\n\nThe scandal has fueled tensions over one of Peru’s biggest challenges: how to balance relations between China, one of its largest trade partners, and the US, which has warned Lima over China’s growing influence.\n\nLast week, the US Bureau of Western Hemisphere Affairs said it was “concerned” about reports that Peru could be powerless to oversee one of its largest ports, Chancay, which it said was managed by “predatory” Chinese owners.\n\n“We support Peru’s sovereign right to oversee critical infrastructure in its own territory. Let this be a cautionary tale for the region and the world: cheap Chinese money costs sovereignty,” the bureau said.\n\nJerí is just the latest in a long line of the country’s presidents and former presidents who have found themselves embroiled in scandal, in what some commentators have referred to as the “curse” of the Peruvian presidency.\n\nSince the turn of the millennium, no fewer than seven presidents have been brought to trial or faced legal challenges relating to allegations of corruption or human rights abuses. An eighth shot himself dead when police were closing in.\n\nPeru’s notorious political instability is often traced back to the presidency of Alberto Fujimori, who was ousted in 2000 after a scandal involving his intelligence chief andconvictedon charges of corruption, embezzlement and human rights violation.\n\nSince then, the political careers of most of Fujimori’s successors have also ended in disgrace.\n\nAlejandro Toledo, who was elected president after Fujimori, was sentenced to more than 20 years in prison for receiving millions in bribes from the Brazilian construction company Odebrecht. Then came Alan Garcia, who died from a self-inflicted gunshot wound in 2019 as police closed in as part of an investigation also linked to Odebrecht.\n\nOllanta Humala and Pedro Pablo Kuczynski were also ensnared in the Odebrecht scandal, while Martin Vizcarra was ousted on the grounds of “moral incapacity” – accused of taking bribes during his time as governor. Pedro Castillo was taken into custody for the alleged crime ofrebellionand dismissed by Congress after attempting to dissolve it and set up an emergency government, while Boluarte was impeached due to “permanent moral incapacity” following a series of scandals.\n\nAll those accused and convicted have rejected the accusations against them.\n\nPeruvians are expected to head to the polls on April 12 for a general election.\n\nAnalysts say Jerí’s removal shows how Peru’s political system allows Congress to remove presidents with relative ease.\n\nThey point to a clause in the constitution that says Congress can impeach the president if it determines that he or she has “permanent moral incapacity.” Politicians have a tendency to use this as a tool of negotiation and pressure, experts say.\n\nThis represents a “poisoned apple” for democracy in Peru, according to Francisco Guerrero, senior fellow at the Center for US-Mexican Studies at the University of California, San Diego.\n\n“The poisoned apple, the apple that is rotting Peruvian democracy, is based on the idea that the way to get rid of presidents is through impeachment, and the impeachment process is based on a reason that is completely elusive, viscous, fluid, which is this concept of moral incapacity. Who determines the moral incapacity of a president? Well, the legislators themselves. So, we are in a system that I would call one of perverse incentives,” he said.\n\nNatally Soriano, a professor at the School of Social Sciences at Monterrey Institute of Technology, expressed a similar view. She said Peru does not currently have strong political parties, but rather fragmented and personality-driven ones, which “makes negotiation and corruption more dynamic under the same constitution.”\n\nGuerrero says the country should consider changing its laws on the matter.\n\nHowever, Peruvian lawyer and political analyst Iván Lanegra argues that the main problem lies not in the rules but in the behavior of political organizations and their leaders.\n\n“They are actors who have short-term, short-range interests, and therefore the agreements they reach are very precarious, and that makes it difficult for presidents in general to have the possibility of remaining stable in office,” he said.\n\nEither way, most analysts agree that whoever wins the upcoming election will face the same risk of political instability.\n\nWithout broad public support and with more than 30 parties in the race, the next leader will likely lack political power in Congress and will have to negotiate, with all the risks that entails.\n\nThis story has been updated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/05/18/americas/boluarte-nose-surgery-rolex-peru-presidency-intl-latam",
      "text": "political instability"
    },
    {
      "url": "https://www.cnn.com/2025/10/10/americas/peru-president-dina-boluarte-removed-intl-hnk",
      "text": "Dina Boluarte"
    },
    {
      "url": "https://www.cnn.com/peru-sentences-former-president-castillo-latam-hnk-intl",
      "text": "Pedro Castillo"
    },
    {
      "url": "https://cnnespanol.cnn.com/2017/12/27/fujimori-crimenes-violacion-de-derechos-humanos-corrupcion-peculado-y-mas-estos-son-los-crimenes-de-alberto-fujimori",
      "text": "convicted"
    },
    {
      "url": "https://cnnespanol.cnn.com/2022/12/08/caida-abismo-pedro-castillo-maestro-rural-expresidente-detenido-trax",
      "text": "rebellion"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1824c2bc6e98a41698e0c7efb7dac5f6cf32004a3406e0a5b763c9e17a8d423c",
  "scraped_at": "2026-02-19T07:30:47.476862+00:00"
}