{
  "url": "https://lite.cnn.com/2026/02/24/americas/canada-cuba-assist-washington-intl-hnk",
  "title": "Canada plans to assist Cuba as Washington squeezes the island | CNN",
  "date": "2026-02-24T07:31:04.530567+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nCanada said on Monday it plans to provide assistance to Cuba while the islandgrapples with fuel shortagesafter Washington moved to choke off Cuba’s oil supplies.\n\nWashington has escalated a pressure campaign against the Communist-run island and long-time US foe in recent weeks.\n\nUS President Donald Trump’s administration has moved to block all oil from reaching Cuba, including that from ally Venezuela, pushing up prices for food and transportation and prompting severe fuel shortages and hours of blackouts.\n\n“We are preparing a plan to assist. We are not prepared at this point to provide any further details of an announcement,” Canadian Foreign Minister Anita Anand said on Monday, without giving details on what such an assistance will include.\n\nThe UN has warned that if Cuba’s energy needs are not met, it could cause a humanitarian crisis. Canada said last week it was monitoring the situation in Cuba and was concerned about “the increasing risk of a humanitarian crisis” there.\n\nEmboldened by the US military’s seizure of ousted Venezuelan President Nicolas Maduro in a deadly raid in January, Trump has repeatedly talked of acting against Cuba and pressuring its leadership.\n\nWashington and Ottawa have also had tensions under Trump over issues like trade tariffs, Trump’s rhetoric towards Greenland, Ottawa’s attempt to warm ties with Beijing and Prime Minister Mark Carney’s remarks that “middle powers” should act together to avoid being victimized by US hegemony.\n\nTrump has said “Cuba will be failing pretty soon,” adding that Venezuela, once the island’s top supplier, has not recently sent oil or money to Cuba.\n\nThe UN human rights office has said the US raid in which Maduro was seized was a violation of international law. Human rights experts cast Trump’s foreign policy and his focus on exploiting Venezuelan oil and squeezing Cuba as echoing an imperialist approach.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/americas/cuba-us-trump-oil-tourism-intl-latam",
      "text": "grapples with fuel shortages"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/americas/canada-cuba-assist-washington-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/americas/canada-cuba-assist-washington-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1a0504a8ac8b494240dfd97dbefb94e0bd0e06c1b048322dfe7f6a17f15ef25e",
  "scraped_at": "2026-02-24T07:31:04.530581+00:00"
}