{
  "url": "https://lite.cnn.com/2026/02/25/politics/trump-state-of-the-union-cnn-poll-cost-of-living",
  "title": "CNN poll finds Trump’s State of the Union left some viewers unconvinced that he’ll lower cost of living | CNN Politics",
  "date": "2026-02-25T07:31:21.107007+00:00",
  "authors": [
    "Ariel Edwards-Levy",
    "Jennifer Agiesta"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump’sState of the Union addressdrew largely positive marks from a heavily Republican audience, according to aCNN poll conducted by SSRS.\n\nBut it didn’t fully convince significant shares of even that friendly audience that he’s focusing on the nation’s most important problems or that he’ll lower the cost of living.\n\nNearly two-thirds of speech-watchers said they had at least a somewhat positive reaction to Trump’s speech, with a smaller 38% offering a very positive response. That’s a few points cooler thanthe receptionto his address to Congress last year and falls below the ratings for his first-term speeches in CNN polling. It’s similar to the ratings that former President Joe Biden saw during his last year in office.\n\nGood marks from speech-watchers are typical for presidential addresses to Congress, which tend to attract generally friendly audiences that disproportionately align with presidents’ own parties. In CNN’s speech reaction polls, which have been conducted most years dating back to the Clinton era, audience reactions have always been positive.\n\nThe pool of people who watched Trump speak on Tuesday was about 13 percentage points more Republican than the general public.\n\nTrump’s speech seemed to rally some who watched it. In a survey conducted prior to the speech, 54% said they believed his policies would move the country in the right direction; afterward, 64% of the same people said his policies would take the country down the right path. The share who believed Trump has had the right priorities stood at 44% prior to the speech and 54% immediately following its conclusion.\n\nIn the pre-speech survey, a majority of viewers said they most wanted to hear Trump talk about the economy and the cost of living. But nearly half of the audience, 45%, said that, based on Trump’s speech – whichset a recordfor the longest State of the Union address – he was focusing too little on the issue, with 53% saying he’d given the issue the right amount of focus.\n\nSpeech-watchers were about evenly split on whether Trump’s handling of tariffs was an appropriate use of power, or whether it represented an overstep on his part. And just 31% expressed a lot of confidence in the president to make the cost of living more affordable, with 29% saying they had some confidence in him to do so and 40% that they had none at all.\n\nFollowing the address, 62% of speech-watchers said both that Trump’s economic policies and his immigration policies would move the country in the right direction.\n\nWhile the economic numbers are identical to his ratings after last year’s speech, Trump’s numbers on immigration represent an erosion to first-term levels, when the issue stood as one of his most significant political liabilities. The minority of speech-watchers who were dissatisfied with his level of focus on immigration were more likely to say he’d paid the issue too much attention (38%), not too little (6%).\n\nForty-five percent of speech-watchers said they had a lot of confidence in Trump to provide real leadership for the country, and 43% expressed a lot of confidence in him to use US military power responsibly, with 38% saying they were highly confident in him to make the right decisions about Iran.\n\nWhile State of the Union addresses have long been seen as a chance for the president to shift public perception of his efforts, history suggests that the speech is unlikely to have much effect on Trump’s standing with Americans. Annual presidential addresses rarely lead to significant shifts in presidential approval among the broader US public, particularly in recent years.\n\nIna CNN poll of the American publicconducted in the days prior to the address, Trump’s approval rating stood at 36%.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.documentcloud.org/documents/27411442-cnn-poll-conducted-by-ssrs-state-of-the-union-reaction/",
      "text": "CNN poll conducted by SSRS"
    },
    {
      "url": "https://www.cnn.com/2025/03/05/politics/cnn-poll-trump-address-congress",
      "text": "the reception"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/speech-time-length-trump-sotu-vis",
      "text": "set a record"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
      "text": "a CNN poll of the American public"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/politics/trump-state-of-the-union-cnn-poll-cost-of-living",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/25/politics/trump-state-of-the-union-cnn-poll-cost-of-living",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1ba21ea213b7521d5375047ea6529cf176e4eed919205b8486a061335fef6dda",
  "scraped_at": "2026-02-25T07:31:21.107017+00:00"
}