{
  "url": "https://lite.cnn.com/2026/02/17/politics/supreme-court-justices-software-recuse-conflicts",
  "title": "Supreme Court adopts automated recusal software to avoid ethics conflicts | CNN Politics",
  "date": "2026-02-18T07:31:34.931797+00:00",
  "authors": [
    "Tierney Sneed, CNN"
  ],
  "text": "Source: CNN\n\nThe Supreme Court said Tuesday that it will start using software to assist in justices’ decisions to recuse themselves from cases that present a potential conflict of interest.\n\nA brief press release issued by the court described an electronic matching process already used by some lower courts to compare a case’s parties to lists judges assemble of individuals and organizations they have ties to. A 2023 code of conduct statement from the justices said they wereconsideringadopting such a tool themselves.\n\n“This software will be used to run automated recusal checks by comparing information about parties and attorneys in a case with lists created by each Justice’s chambers,” the press release said. “The system was designed and created by the Court’s Office of Information Technology in cooperation with the Court’s Legal Office and Clerk’s Office.”\n\nSpokespeople for the high court declined to answer follow up questions from CNN. The court announced it was embracing the software as it rolled out tweaks to its rules that instructed parties to include their stock ticker symbols in filings to be used by the new software.\n\nGabe Roth, who heads the court reform organization Fix the Court, said Tuesday’s announcement was a positive step, but noted that lower courts have been using similar software since 2007 and questioned why it took more than two years for the justices to embrace the tool they said they were considering in 2023.\n\nThe Supreme Court’s approach to ethics is notoriously opaque, and the 2023 statement came only after an unprecedented scrutiny of lavish trips taken by members of the court — and particularly,Justice Clarence Thomas— that went unreported on financial disclosure forms, despite being subsidized by others. JusticesSonia Sotomayor and Neil Gorsuchhave also been criticized for not recusing in cases that involved the publishing companies that financed their book deals.\n\nThe justices police their own obligations to judicial ethics, with no outside body holding them accountable to the rules that govern the rest of the judiciary.\n\nWhile justices will publicly indicate that they have recused from a case, only some will also give any sort of reason for why they’re doing so.\n\nIt was notable during the confirmation process for Justice Amy Coney Barrett, who then served on the 7th US Circuit Court of Appeals, when she released the list of people, organizations or companies that would present potential conflicts that the appeals court ran against its recusal software.\n\nJustice Ketanji Brown Jackson, the only justice confirmed since, also released the list she had assembled for her former post on the DC US Circuit Court of Appeals. In their confirmation submissions, both jurists had committed to continuing to use their recusal lists to avoid conflicts.\n\nCNN’s Joan Biskupic contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2023/11/13/politics/supreme-court-announcement",
      "text": "considering"
    },
    {
      "url": "https://www.cnn.com/2023/04/07/politics/clarence-thomas-disclosures-supreme-court",
      "text": "Justice Clarence Thomas"
    },
    {
      "url": "https://www.cnn.com/2023/05/04/politics/sonia-sotomayor-neil-gorsuch-book-recusal-supreme-court-cases",
      "text": "Sonia Sotomayor and Neil Gorsuch"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/supreme-court-justices-software-recuse-conflicts",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/supreme-court-justices-software-recuse-conflicts",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1bff42641272cb09ec57f6691d46a9757b0a33e49793002810e273d157b336e3",
  "scraped_at": "2026-02-18T07:31:34.931809+00:00"
}
