{
  "url": "https://lite.cnn.com/2026/02/19/health/cdc-vaccine-advisory-committee-meeting-cancelled-for-next-week",
  "title": "CDC vaccine advisory committee meeting canceled for next week | CNN",
  "date": "2026-02-20T07:28:29.900881+00:00",
  "authors": [
    "Meg Tirrell",
    "Jen Christensen",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US Centers for Disease Control and Prevention’s independent vaccine advisory committee is not going to meet next week as planned, according to a spokesperson for the US Department of Health and Human Services, saying, “Further information will be shared as available.”\n\nThe decision was made based on HHS guidance, according to a person familiar with the situation, who requested anonymity because the information wasn’t yet public. Committee members hadn’t been notified about the meeting’s status as of Wednesday night, according to another source who requested anonymity.\n\nSince 1964, US vaccine recommendations have first gone through this committee of independent advisors called theAdvisory Committee on Immunization Practices, also known as ACIP.\n\nACIP is made up of a group of scientists and medical experts who evaluate the latest research to determine how safe and effective a vaccine is, and it weighs in on who should get the vaccine. The CDC director takes the committee’s advice into consideration when making a decision on whether to recommend a vaccine. Insurance companies and some states make coverage decisions based on this process.\n\nWhile committee members are carefully vetted and are required to disclose industry ties, in June, HHS Secretary Robert F. Kennedy fired all 17 members of ACIP, whom he described as a “rubber stamp for industry profit-taking agendas.” Kennedy then selected new members, many of whom have expressed anti-vaccine views that echo Kennedy’s.\n\nKennedy has taken a number of actions to reshape the United States’ vaccine policy including dropping broad recommendations for Covid-19 and hepatitis B shots last year. This January the government announced it wasslimming downthe number of vaccines the US recommends to protect children. Each move has been met withsharp criticismfrom medical experts and professional associations that say Kennedy has made the changes without scientific proof that such changes were necessary.\n\nThe American Academy of Pediatrics, along with several other medical associations havesued the Trump administrationto stop changes to federal vaccine policy. At a hearing in Boston last Friday,a federal judge also heard arguments from the associations that asked the judge to suspend the ACIP meeting. It’s unclear if the lawsuit had anything to do with the cancelation of the meeting next week.\n\nPresident Donald Trump has been preparing to make health issues a central focus of his midterm election sales pitch.\n\nInside the administration, White House aides have been orchestrating an extraordinary shakeup of Trump’s health department in an attempt to answer broad concerns about the way the department talks about health and to move its focus away from more polarizing topics like vaccines.\n\nWhile no agenda was posted online, ACIP was expected to take up the topic of the Covid-19 vaccines during the now-canceled meeting. Over the years several committee members have incorrectly characterized the vaccines as dangerous.\n\nOne committee member,Dr. Robert Malone, who is currently an adjunct professor at Pennington Biomedical Research Center in Louisiana and an early researcher of mRNA technology,has claimedthat Covid-19 vaccinesmay cause cancer, somethingregulatory agenciescontradict.\n\nMalone may have signaled his intentions to have ACIP suggest removing access to the Covid vaccines whenspeaking on a podcastearlier this year\n\n“If the FDA won’t act, there are other entities that will,” Malonesaid in January. “All I can say is stay tuned and wait for the upcoming ACIP meeting.”\n\nAdam Cancryn contributed to this story.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6342a5.htm",
      "text": "Since 1964"
    },
    {
      "url": "https://www.cdc.gov/acip/index.html",
      "text": "Advisory Committee on Immunization Practices"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/health/childhood-vaccine-schedule-overhaul",
      "text": "slimming down"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/health/vaccine-recommendations-cdc-aap",
      "text": "sharp criticism"
    },
    {
      "url": "https://publications.aap.org/aapnews/news/34142/AAP-co-plaintiffs-seek-to-block-changes-to",
      "text": "sued the Trump administration"
    },
    {
      "url": "https://www.cdc.gov/acip/membership/roster.html#cdc_generic_section_1-robert-w-malone-md",
      "text": "Dr. Robert Malone"
    },
    {
      "url": "https://www.youtube.com/watch?v=UJyriHm1dlo",
      "text": "has claimed"
    },
    {
      "url": "https://www.cnn.com/2025/06/13/health/cdc-new-vaccine-advisers",
      "text": "may cause cancer"
    },
    {
      "url": "https://www.ema.europa.eu/en/human-regulatory-overview/public-health-threats/coronavirus-disease-covid-19/covid-19-medicines/covid-19-vaccines-key-facts",
      "text": "regulatory agencies"
    },
    {
      "url": "https://x.com/EndTribalism/status/2014098027074449438?s=20",
      "text": "speaking on a podcast"
    },
    {
      "url": "https://x.com/EndTribalism/status/2014098027074449438?s=20",
      "text": "said in January"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/health/cdc-vaccine-advisory-committee-meeting-cancelled-for-next-week",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/health/cdc-vaccine-advisory-committee-meeting-cancelled-for-next-week",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1da54f3029166b68e3e5012cdc4cb4295a2f53c63eaa7807b2b3fa264cc7ea23",
  "scraped_at": "2026-02-20T07:28:29.900897+00:00"
}