{
  "url": "https://lite.cnn.com/2026/02/15/europe/rubio-speech-us-europe-relations-latam-intl",
  "title": "Rubio’s message at Munich Security Conference to Europe: Change or get dumped | CNN",
  "date": "2026-02-15T07:10:35.641891+00:00",
  "authors": [],
  "text": "Source: CNN\n\nIt was still a wrecking ball, albeit one wrapped in chocolate and warm fuzzies.\n\nThe febrile applauseUS Secretary of State Marco Rubioreceived at the Munich Security Conference whenhe saidthe US was Europe’s “child” and their fates would always be “intertwined” belied his stark policy message. These were claps of relief and encouragement from a European audience bracing for a mauling like JD Vance’s onslaught last year.\n\nBut Vance’sfalse accusations at last year’s conference– that Europe is suppressing freedom of speech and democracy, and facing civilizational decline – are now enshrined inUS national security strategy. Rubio did not have to do much to sound friendly.\n\nThe United States is prepared to “rebuild” but only according to its values, Rubio said this year, while relentlessly evoking America’s historical links to the continent. Those values include embracing Christianity and a shared cultural heritage, closing borders, and dropping climate crisis policies. The US needs to see a reformed Europe, he told decades-long allies – not justdetails of defense budgets, but a sea change in the continent’s value system.\n\nEurope and the US “belong together,” he also said. But in this couples’ therapy stage of an abusive relationship in decline, the message was clear: change or be dumped.\n\nConference organizers had warned that the world was in an era of “wrecking ball politics” that had left Europe on the sidelines, in a report published right before the conference. Now Rubio was telling liberal centrist foreign leaders that their entire outlook was wrong, echoing the far-right populist opponents who might well unseat them in upcoming elections.\n\nThe top US diplomat’s speechwriters left no room forearlier arguments from key allieson the same Munich stage. A day prior, German Chancellor Friedrich Merz said MAGA’s culture wars were not ones Europe needed to fight. Emmanuel Macron equated territorial sovereignty with the rights of the French to police their own misinformation and democracy.\n\nTwo hours later, Ukraine’s urgent plight – the defining security crisis of Europe’s post-WW2 era - was passionately portrayed byPresident Volodymyr Zelensky, evoking the issue that should have been center stage breaking through the MAGA noise. A leader whose fourth appearance at the conference provided a startling reminder of Ukraine’s boundless ability to survive and adapt to Russia’s brutality, made the most powerful case at the summitfor Europe having its own defense strategy.\n\nZelensky reminded the audience thateveryUkrainian power plant had been hit, and that everykilometer Russia seized cost them 156 lives, by Ukraine’s count. He spoke in English, in a tone that suggested he was less bothered about upsetting US President Donald Trump. He bemoaned the spirit of a peace process that seemed to put pressure for concessions on Ukraine – the four-year-long victim of an invasion – rather than on the aggressor Russia. He also mocked what Moscow has dubbed the “Anchorage spirit” – a term designed to suggest Putin and Trump made a secret deal when they met in Alaska last year.\n\nAs Zelensky spoke, video footage played on the wall behind him showing new Ukrainian technology taking outRussian drones– harsh reality contrasting with the policy wonkery in the room. He brought a purpose and urgency somewhat lacking in the beleaguered European leaders who preceded him.\n\nIt almost served to emphasize Rubio’s point: Europe needs to shape up. His audience perhaps would prefer to replicate Ukraine’s energy and resolve, rather than Hungary’s.\n\nOverall, European leaders’ positive reception of Rubio’s speech reflected how horrifically damaged the transatlantic relationship has been by the past year of turmoil over Ukraine, and month ofarson over Greenland.\n\nThe Danish territory got no mentions in the speech, as negotiations over its fate proceed slowly. Perhaps that sudden ellipsis – the vanishing of a crisis that nearly tore the alliance to shreds weeks earlier – was gift enough.\n\nRubio did mention Ukraine once in the questions that followed his speech and pandered to his audience’s suspicions when he suggested the Trump administration still did not know whether Russia really wanted to make peace. (His boss, US President Donald Trump, has maintained  that Putin wants to make a deal, and that Zelensky should cede diplomatic ground).\n\nThe Europe on show did not inspire. Rather, it seemed to lack the money to make good on its own ambitions, and be drowned out by internal political scandal, or the ticking clocks of leaderships coming to an end. Each year, Munich meets to hear European promises to do more. Each year, startling rises in defense spending seem nearer, but do not bring change.\n\nAt next year’s Munich conference,British Prime Minster Keir Starmermay be gone, Macron’s France will be facing presidential elections, and Trump will have had to weather the midterms. However these races go, it is likely transatlantic squabbling will soak up much of the oxygen. Ukraine can only hope that by that time, a sustainable and just peace has broken out – but more likely, it will have to argue to be heard over another episode in Europe and America’s convoluted, bitter on-off estrangement.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2015/02/20/politics/marco-rubio-fast-facts",
      "text": "US Secretary of State Marco Rubio"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
      "text": "he said"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl",
      "text": "false accusations at last year’s conference"
    },
    {
      "url": "https://www.cnn.com/2025/12/05/politics/trump-national-security-strategy",
      "text": "US national security strategy"
    },
    {
      "url": "https://www.cnn.com/2025/07/21/business/nato-defense-spending-europe-afford-intl",
      "text": "details of defense budgets"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/europe/munich-security-conference-merz-rubio-intl",
      "text": "earlier arguments from key allies"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/world/video/zelensky-putin-war-ukraine-russia",
      "text": "President Volodymyr Zelensky"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/europe/ukrainians-attacks-cold-intl",
      "text": "Ukrainian power plant had been hit"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/europe/russian-drone-strike-toddlers-killed",
      "text": "Russian drones"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/us-greenland-framework-1951-deal",
      "text": "arson over Greenland"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "British Prime Minster Keir Starmer"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/europe/rubio-speech-us-europe-relations-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/europe/rubio-speech-us-europe-relations-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1db84538fc680e9459ca2f58dcc73c975081a1eb2fa6ccce51eece56cf448d18",
  "scraped_at": "2026-02-15T07:10:35.641905+00:00"
}