{
  "url": "https://lite.cnn.com/2026/02/13/tech/openai-political-spending-super-pacs",
  "title": "Why OpenAI says it isn’t spending on SuperPACs | CNN Business",
  "date": "2026-02-15T07:11:30.283813+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAI companyAnthropic announced this week it is giving $20 millionto a political group campaigning for more regulation of the technology – but its main rival, OpenAI, is telling its employees it won’t be making similar donations.\n\nIn a memo to staff on Thursday, OpenAI’s chief global affairs officer Chris Lehane said that while OpenAI allows its employees to “express their ideological beliefs in terms of who they support,” the company itself won’t be making similar moves anytime soon.\n\nOpenAI is not yet contributing to political action committees or 501(c)(4) social-welfare nonprofits because OpenAI wants to retain control of its political spending, Lehane told CNN in an interview.\n\n“We do believe it’s really important that this issue transcends partisan politics,” Lehane said.\n\nThe stakes are especially high this year. Both Anthropic and OpenAI are reportedly mulling what could be blockbuster initial public offerings this year, while Congress is working to craft the rules of the road for industry for the next decade or longer. And as the midterm elections approach, voters are increasingly worried about the consequences of AI development, from energy bills to privacy to job loss.\n\nThough OpenAI is not making super PAC donations, its executives and biggest investors have made major contributions. President and co-founder Greg Brockman and his wife, Anna, have donated $25 million to a super PAC that supports President Donald Trump.\n\nBrockman, as well as several of OpenAI’s top investors, have collectively donated more than $100 million to a bipartisan super PAC called Leading the Future that advocates against state-level AI regulation in favor of a national regulatory framework, which Lehane acknowledged in his memo to staff. The group has alreadypaid for adsopposing New York State Assemblyman Alex Bores, who is running in New York’s 12th congressional district as an outspoken voice for AI guardrails.\n\nLehane said OpenAI supports “a national federal framework and have endorsed bills at both the state and federal level already this year on a range of issues.”\n\nAnthropic was founded with a focus on AI safety and often highlights  the need for regulation in AI development. CEO Dario Amodei regularly writes long essays and gives interviews about the risks posed by AI.\n\nThe company said this week it is donating to the Public First Action super PAC, a bipartisan group that advocates for AI regulation, because they “don’t want to sit on the sideline” while AI regulation is being developed.\n\n“(W)e need good policy: flexible regulation that allows us to reap the benefits of AI, keep the risks in check, and keep America ahead in the AI race,” Anthropicwrotein their announcement. “That means keeping critical AI technology out of the hands of America’s adversaries, maintaining meaningful safeguards, promoting job growth, protecting children, and demanding real transparency from the companies building the most powerful AI models.”\n\nBut Anthropic’s position has placed them in the crosshairs of the Trump administration. David Sacks, the White House’s AI czar, blamed Anthropic last year for “the state regulatory frenzy that is damaging the ecosystem. “Anthropic is running a sophisticated regulatory capture strategy based on fear-mongering,” hewroteon X.\n\nLast year Trumpsigned an executive orderto prevent states from enacting their own laws regulating AI in favor of a single national policy that has yet to be established.\n\nAnthropic and OpenAI’s differing positions on AI regulation are an extension of their longstanding rivalry, which exploded intopublic viewlast week when Anthropic ran a SuperBowl ad about their ad-free chatbot, Claude – just days before OpenAI started showing some users ads in their ChatGPT conversations this week.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.anthropic.com/news/donate-public-first-action?ref=ai-360.online",
      "text": "Anthropic announced this week it is giving $20 million"
    },
    {
      "url": "https://www.cnn.com/2025/12/10/tech/pro-ai-super-pac-launches-first-candidate-ads",
      "text": "paid for ads"
    },
    {
      "url": "https://www.anthropic.com/news/donate-public-first-action",
      "text": "wrote"
    },
    {
      "url": "https://x.com/DavidSacks/status/1978145266269077891",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2025/12/11/tech/ai-trump-states-executive-order",
      "text": "signed an executive order"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/tech/anthropic-openai-super-bowl-ads",
      "text": "public view"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/tech/openai-political-spending-super-pacs",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/tech/openai-political-spending-super-pacs",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1df8b24860f2a2979f40de2e1ddbaa8a007ba35b8235ec6540e12d84d4928737",
  "scraped_at": "2026-02-15T07:11:30.283826+00:00"
}