{
  "url": "https://lite.cnn.com/2026/02/12/us/valentines-day-flowers-long-trip",
  "title": "The long trip your flowers will make before you can say ‘I love you’ this Valentine’s Day | CNN",
  "date": "2026-02-12T21:30:16.199223+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThis Valentine’s Day, your bouquet will likely travel thousands of miles in a jetliner’s cargo and refrigerated truck before it gets to your local florist and ultimately, your sweetheart.\n\nIn the United States, most fresh cut flowers come from Colombia and Ecuador. Roses, chrysanthemums, and carnations are the three most common types of imported flowers.\n\nThe busiest times for shipments are Valentine’s Day and Mother’s Day, when about 30% of all flowers imported from Colombia each year are brought to the US, said Diogo Elias, CEO of Avianca Cargo.\n\nThe Colombia-based airline, and other cargo air carriers, fly massive amounts of flowers each year. For Valentine’s Day 2026, Avianca transported more than 19,000 tons of flowers from Colombia and Ecuador, a 6% uptick from last year.\n\n“Valentine’s Day requires a large-scale operational surge across the air cargo system,” Elias said.\n\nThe airline typically doubles cargo capacity for the holiday, adding nearly 300 flights this season.\n\nMiami International Airport is the primary port of entry for commercial flower stems, processing 88% of all cut flower imports,according to US Customs and Border Protection.Los Angeles International Airport and the land border crossing near San Diego handle most of the rest.\n\nThe agency estimates it will inspect over 1.3 billion stems this year, surpassing last year’s record.\n\n“Every cut flower inspected by CBP is a testament to our vigilance and unwavering commitment to preventing the entry of plant pests and diseases without compromising our agricultural protection,” said Suzette Kelly, acting executive director of CBP’s Agriculture Programs and Trade Liaison, in a news release.\n\nInspectors intercepted more than 600 pests and plant diseases so far this year, the agency said.\n\nOnce the flowers are on US soil, they are packed in refrigerated trucks or loaded onto connecting flights.\n\n“The Valentine’s season represents one of the highest-value periods of the year for the flower export industry,” Elias said. “While shipment values vary by species and market pricing, the seasonal flower trade between Colombia, Ecuador, and the United States represents hundreds of millions of dollars in commercial value.”\n\nConsumers will spend $3.1 billion on flowers for Valentine’s Day this year, according to the National Research Foundation, whichestimates2026 will set new records.\n\nThe Trump administration’s threat oftariffson foreign countries could also play into the increased costs this year. Tariffs start at 10% for Colombia and Ecuador.\n\nOne thing is for certain, regardless of the price or the miles they have to travel - there still will be flowers gifted with love this February 14.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cbp.gov/newsroom/national-media-release/cbp-expects-record-setting-year-cut-flower-inspections",
      "text": "according to US Customs and Border Protection."
    },
    {
      "url": "https://nrf.com/media-center/press-releases/valentine-s-day-spending-expected-to-reach-new-records",
      "text": "estimates"
    },
    {
      "url": "https://www.cnn.com/2025/05/10/business/mothers-day-flowers-tariffs",
      "text": "tariffs"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/us/valentines-day-flowers-long-trip",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/us/valentines-day-flowers-long-trip",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1e6d50108f1d003f3ddfe55e1fa81427c2a7438eb54fdd666187c09a86a28ed4",
  "scraped_at": "2026-02-12T21:30:16.199237+00:00"
}