{
  "url": "https://lite.cnn.com/2026/02/27/us/aviation-mechanic-shortage",
  "title": "Aviation industry is running out of the people who keep planes flying | CNN",
  "date": "2026-02-28T06:58:58.544983+00:00",
  "authors": [
    "Pete Muntean"
  ],
  "text": "Source: CNN\n\nA worldwide shortage of aircraft mechanics is causing delays, cancellations and leading to a push to teach more people how to fix planes.\n\nAt Cincinnati State Technical and Community College in Ohio, enrollment is surging as airlines and cargo carriers scramble to hire trained mechanics. The school now has 185 students in its aviation maintenance program and plans to expand so it can enroll 350, school administrators said.\n\nEmployers are already lining up, said instructor Ken Rohling, who graduated from the same program in 1987 and has worked in the field ever since.\n\n“Basically they come in and say, ‘we will take every one of you when you get your license,’” Rohling said.\n\nThe hiring pressure reflects a widening shortage that is already reshaping air travel. The industry is about 17,000 technicians short in North America, according to new data released Friday by consulting firmOliver Wyman. The projections said another 45,000 technicians are expected to retire over the next decade. The shortfall is projected to peak in 2028, when the deficit could reach as many as 30,000 mechanics.\n\n“It really is a perfect storm,” said Brian Prentice, a partner atthe firm’s transportation and operation practices. “Aircraft are flying longer, demand for travel is high, and we’re losing experienced technicians at the same time.”\n\nThat combination means fewer planes available to fly and Prentice says ultimately airlines just won’t schedule as many flights.\n\nStudents at Cincinnati State say the shortage of workers is the biggest selling point for them.\n\n“To me, it’s job security,” said Taylor Hill, who left a job at an Amazon facility after discovering the program at a career fair.\n\nStarting pay for entry-level mechanics in the Ohio region is now approaching $28 to $30 an hour, she said, far more than many other jobs available without a four-year degree.\n\n“We’re always going to need mechanics,” Hill said. “It’s a good career.”\n\nMany students are already working in aviation while finishing school. Matthew Brown, who works full-time in aircraft parts logistics while attending classes, said the demand is obvious.\n\n“Everything’s booming,” Brown said, noting he estimated that In one shop where he worked, he estimates 70% of its mechanics were over the age of 50.\n\nThe gap did not happen overnight. After the September 11, 2001 terrorist attacks, airlines cut hiring for years, creating what analysts call a “lost generation” of mechanics. Then came the Covid-19 pandemic, when thousands left the industry. At the same time, fewer military technicians—once a major source of civilian aircraft mechanics—are entering the workforce.\n\nThe overall worker shortage means maintenance takes longer and planes spend more time on the ground. Airlines are also keeping jets in service longer, increasing the amount of work required.\n\n“It will drive up costs for airlines,” Prentice said. “And that gets passed on to passengers.”\n\nTraining for mechanics does not end at Cincinnati State. At a nearby GE Aerospace facility, about 4,000 mechanics arrive every year for advanced instruction that’s required before they can work on certain engines. The goal, GE Aerospace says, is consistency and safety across a rapidly growing global fleet.\n\nBack in the Cincinnati State hangar, students just now entering the field say the timing could not be better.\n\n“There’s ample overtime opportunity, ample growth,” Brown said. “Companies will pay you to relocate and pay pretty high wages.”\n\nInstructor Rohling said the new generation is already changing the industry.\n\n“They want to learn,” he said. “They want to work on airplanes.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.oliverwyman.com/index.html",
      "text": "Oliver Wyman"
    }
  ],
  "hash": "1ee43f0f1368b31c905021d17df5993223b7c1e40f83018640b58f4f158e533b",
  "scraped_at": "2026-02-28T06:58:58.544997+00:00"
}