{
  "url": "https://lite.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
  "title": "California avalanche: 8 backcountry skiers killed and 1 missing in Lake Tahoe, the deadliest in state’s recorded history | CNN",
  "date": "2026-02-19T07:30:26.844984+00:00",
  "authors": [
    "Martin Goillandeau",
    "Chris Boyette",
    "CNN"
  ],
  "text": "Source: CNN\n\nEight skiers buried by snow and debris near California’s Lake Tahoe amid dangerous conditions were killed in what is now the deadliest avalanche in the state’s recorded history, authorities said Wednesday.\n\nOne skier is still missing and presumed dead, Nevada County Sheriff Shannan Moon said at a grim news conference.\n\nThe skiers were part of a 15-person group on a three‑day backcountry trip in northern California’s Sierra Nevada mountains. Six of the members were previously rescued with “various injuries,” the sheriff’s office said, and two of them were taken to a hospital for treatment. One has since been released, Capt. Rusty Greene said.\n\n“We did have conversation with the families of the folks that are that are still outstanding and let them know that our mission has went from a rescue to a recovery,” Moon said.\n\nOf the nine skiers who were not rescued, seven are female and two are male, the sheriff’s office said. Their names were not released.\n\nSix of those killed were clients of Blackbird Mountain Guides, which led the trip, and three were “highly experienced members of our guide team,” the company said in astatement.\n\n“We are doing what we can to support the families who lost so much, and the members of our team who lost treasured friends and colleagues,” the statement said. Five clients and one guide survived the avalanche, company added.\n\nMultiple people associated with the Sugar Bowl Academy, a private school and US Ski and Snowboard club, were killed, the school said in astatement.\n\n“Multiple members of the Sugar Bowl Academy community and others with strong connections to Sugar Bowl, Donner Summit, and the backcountry community died in an avalanche on Tuesday,” the statement said, noting the academy is not sharing the names of any victims and survivors “out of respect for the families affected.”\n\n“We are an incredibly close and connected community. This tragedy has affected each and every one of us. The depth of support for the families whose lives have been changed forever reminds us of how special this community is,” Stephen McMahon, executive director of the Sugar Bowl Academy said.\n\nThe spouse of a Tahoe Nordic Search and Rescue team member is also among the dead, Placer County Sheriff Wayne Woo said, adding it’s hitting the team hard.\n\n“This has not only been challenging for our community, it’s been a challenging rescue, but it’s also been challenging emotionally for our team and our organization,” he said.\n\nRecovery efforts Wednesday evening were still hampered by “really horrific conditions,” Moon told CNN’s Anderson Cooper.\n\nThe skiers, who are from multiple states, were on the final stretch of the trip and were returning to the trailhead Tuesday morning when a wave of ice, rocks and debris came crashing down on them.\n\nThe avalanche spanned about a football field’s length of the mountain, according to Chris Feutrier, USDA forest supervisor for the Tahoe National Forest.\n\nIt wasclassifiedas a D2.5 on a five-level scale that measures the destructive potential of moving avalanche debris, according to Moon.\n\n“A two would bury a person. A three would bury a house, and it’s right in the middle of those two,” Moon told CNN.\n\nSome of the survivors, who are four men and two women, said they were trying to go out as a group when someone saw the deluge of snow and yelled, “avalanche,” Greene said. One of the guides was among the survivors, the sheriff said.\n\nThe disaster at Castle Peak set off a dangerous, hourslong rescue effort hampered by whiteout conditions and strong winds from the winter storm roaring through the rugged Sierra Nevada mountains. NOAA’s Weather Prediction Center said 3-4 inches of snow an hour was possible Tuesday.\n\nEmergency crews received reports of the avalanche around 11:30 a.m. Tuesday and about 50 rescuers were deployed, Moon said.\n\nThe six survivors were rescued 11 hours later.\n\n“Eight of the nine additional skiers have been located deceased. We are still looking for one of the members at this time. Due to the ongoing challenges of the weather, the avalanche conditions, the effort remains ongoing, as well as our search for the remaining skier,” Moon said.\n\nThe victims’ bodies were found “fairly close together,” Greene said.\n\nThe area was under the second highest level, a 4 of 5, of an avalanche threat Tuesday. An avalanche warning was in effect for the greater Lake Tahoe area through 5 a.m. Thursday, according to the Sierra Avalanche Center.\n\n“Natural avalanches are likely, and human-triggered avalanches large enough to bury or injure people are very likely,” theNational Weather Service warned. “Traveling in, near, or below backcountry avalanche terrain is not recommended during high avalanche danger.”\n\nRemote, undeveloped and isolated areas of wilderness are often called “backcountry.”\n\nBlackbird Mountain Guides, the company leading the trip, recognized the danger as well, posting areel on Facebookon Sunday about the snow conditions. “This weak layer could lead to some unpredictable avalanches!” it said, adding, “Pay close attention to places where faceting has been particularly strong — avalanches could behave abnormally, and the hazard could last longer than normal … use extra caution this week!”\n\nEarly Sunday, the Sierra Avalanche Center issued an avalanche watch, indicating large avalanches were likely in the next 24 to 48 hours, TheAssociated Press reported.\n\nThe watch was increased to a warning hours before the avalanche hit, and it’s unknown whether the guides knew about the warning before they took off, the AP reported.\n\nWhen asked about the decision to proceed with the trip, Moon said it was up to the company.\n\nAll of the Blackbird guides were American Mountain Guides Association trained or certified in backcountry skiiing, as well as being certified instructors by the American Institute for Avalanche Research, the company said in a statement.\n\n“We’re still in conversation with them on the decision factors that they made, but definitely a heat for everyone,” she said. “So recognizing it’s not just you — that you’re impacting the potential for resources getting deployed somewhere else.”\n\nSnow blankets the roads, ground and treetops in video of the areareleased by the California Highway Patrol. The video warns drivers not to be fooled by the clear sky — the roads remain “covered in ice, cold, and slick.”\n\nBlackbird Mountain Guides updated the number in the group to 11 clients and four guides after initially saying there were 16 people on the trip. But only 11 of the 12 planned guests ended up going, Moon said Wednesday – one had backed out at the last minute.\n\n“The leadership team at Blackbird Mountain Guides remains fully engaged in assisting the Search and Rescue efforts on the ground as we navigate this incredibly difficult situation alongside those involved,” thetour company saidlate Tuesday.\n\nCalifornia Gov. Gavin Newsom called the incident a “horrible tragedy” in a statementon XWednesday.\n\n“We mourn this profound loss,” the governor said.\n\nOn itswebsite, the company advertises the ski trip to the Frog Lake huts for those with an intermediate to advanced skill level.\n\nSkiers navigate the mountain off-trail through steep terrain with the aid of guides, before returning to the huts for dinner, the company says.\n\nThe 9,110-foot Castle Peak is a popular backcountry skiing destination, according to The Associated Press. The huts are near Donner Summit in “truly rugged, wild terrain” – an area that before 2020 was closed to the public for nearly a century.\n\nFollowing the first call for help Tuesday, dozens of first responders approached the scene from multiple directions: Search and rescue teams staged at Boreal Mountain Ski Resort and Tahoe Donner’s Alder Creek Adventure Center, where they were dispatched along with rescue crews from surrounding counties. They approached the scene on skis andsnowcats, with snowmobiles on standby.\n\nAccording to theUtah Avalanche Center, 93% of avalanche victims live if pulled out within 15 minutes. After 45 minutes, only 20% to 30% of victims survive, and after two hours of being buried in the snow, most people don’t make it.\n\nThe stranded skiers were communicating with rescuers through emergency beacons and iPhone SOS signals, including some with the ability to send text messages, officials said.\n\n“One of my personnel was communicating with one of the guides for over a four-hour period, giving information back to the Nevada Sheriff’s Office, coordinating what rescues could be could be permitted,” said Don O’Keefe, chief of law enforcement at California’s Office of Emergency Services, without elaborating.\n\nThe group crafted a makeshift shelter from a tarp, “doing everything they can to survive,” Greene said.\n\nFor safety, everyone in the backcountry should wear emergency beacons or receivers, according to Mike Duffy, an avalanche instructor at Silverton Avalanche School in Colorado.\n\n“You’re sending a signal. When someone gets buried, you switch it to search. You can also pick up that signal and pinpoint the person,” Duffy said. “Having a GPS satellite communicator makes a big difference. You can get a message out and get the rescue teams in there. It takes rescue a long time to get in there.”\n\nIn January, Chris Scott Thomason, 42, of Bend, Oregon, was part of a group of “experienced snowmobilers” returning from Castle Peak when he was killed in an avalanche, according to the Nevada County Sheriff’s Office, despite the group having taken safety precautions, including carrying protective equipment and avalanche beacons/transceivers.\n\nIn 1982, seven people were killed in an avalanche at the Alpine Meadows ski resort, according to data from the Colorado Avalanche Information Center. The area is just over 20 miles southeast of Castle Peak.\n\nPeople touring the backcountry represent the highest number of avalanche fatalities between 1950 and 2025 – 339 deaths, according to theColorado Avalanche Information Center. Snowmobilers have the second highest number, with 310 deaths, and climbers are third with 194 deaths.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://blackbirdguides.com/pages/live-incident-updates",
      "text": "statement"
    },
    {
      "url": "https://www.sbacademy.org/media-statements",
      "text": "statement"
    },
    {
      "url": "https://avalanche.org/avalanche-accidents/#/report/4187d5a2-dbbc-437d-8ac8-8c5dd4d0b1f9",
      "text": "classified"
    },
    {
      "url": "https://forecast.weather.gov/showsigwx.php?warnzone=CAZ072&warncounty=CAC017&firewxzone=CAZ272&local_place1=South%20Lake%20Tahoe%20CA&product1=Avalanche+Warning&lat=38.9416&lon=-119.9772",
      "text": "National Weather Service warned"
    },
    {
      "url": "https://www.facebook.com/reel/896103729865191",
      "text": "reel on Facebook"
    },
    {
      "url": "https://apnews.com/article/california-avalanche-backcountry-skiers-rescue-missing-f7b4a89c38af634e39a152a874db17f0",
      "text": "Associated Press reported"
    },
    {
      "url": "https://www.facebook.com/reel/1268885675121451",
      "text": "released by the California Highway Patrol"
    },
    {
      "url": "https://blackbirdguides.com/pages/live-incident-updates",
      "text": "tour company said"
    },
    {
      "url": "https://x.com/CAgovernor/status/2024206111990226985?s=20",
      "text": "on X"
    },
    {
      "url": "https://blackbirdguides.com/products/frog-lake-huts-private-guiding?variant=49391266070827",
      "text": "website"
    },
    {
      "url": "https://www.truckeedonnerlandtrust.org/frog-lake-huts",
      "text": "truly rugged, wild terrain"
    },
    {
      "url": "https://www.cnn.com/2017/03/17/sport/snowcat-skiing-snowboarding-snow-aspen#:~:text=Snowcat%20drivers%20spend%20two%20ensuring%20the%20piste,prepare%20over%20350%20acres%20of%20skiing%20area.",
      "text": "snowcats"
    },
    {
      "url": "https://utahavalanchecenter.org/education/faq",
      "text": "Utah Avalanche Center"
    },
    {
      "url": "https://avalanche.state.co.us/accidents/us",
      "text": "Colorado Avalanche Information Center"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1f1e8563ada5bf88cd3178b3c4671215ce1a7d852fad976872774ecd6dc60f6e",
  "scraped_at": "2026-02-19T07:30:26.844998+00:00"
}