{
  "url": "https://lite.cnn.com/2026/02/21/politics/china-nuclear-arsenal-new-technology",
  "title": "Exclusive: US intelligence agencies tie Chinese explosive test to push for a completely new nuclear arsenal | CNN Politics",
  "date": "2026-02-21T07:04:21.350665+00:00",
  "authors": [
    "Zachary Cohen",
    "Kylie Atwood",
    "CNN"
  ],
  "text": "Source: CNN\n\nUS intelligence agencies believe that China is developing a new generation of nuclear weapons and has conducted at least one covert explosive test in recent years as part of a broader push to completely transform its nuclear arsenal into the world’s most technologically advanced, according to multiple sources familiar with the US intelligence assessments.\n\nThe US assessment of China’s intention to radically advance its nuclear weapons is fueling debate inside the intelligence community and beyond over whether there has been a shift in Beijing’s thinking on nuclear strategy, the sources said. The investment in its nuclear arsenal is pushing China closer to peer status with Russia and the US and could yield technical capabilities neither of the two dominant nuclear powers currently possess.\n\nChina secretly conducted an explosive nuclear test in June 2020 at the Lop Nur facility, in the country’s northwest – despite a self-imposed moratorium on such activity that has been in place since 1996 – and was planning to do more in the future, according to the sources and recent statements from US officials. While the 2020 test was disclosed publicly by US State Department officials this month, the purpose of the test has not been previously revealed.\n\nEvidence collected as part of a subsequent review of the June 2020 event, has led US officials to conclude the test was motivated by China’s pursuit of next-generation nuclear weapons, the sources familiar said. That includes efforts to develop additional weapons systems capable of delivering multiple, miniaturized nuclear warheads from a single missile.\n\nChina also appears to be developing low-yield, tactical nuclear weapons – something the country has never previously produced – that could be deployed against targets closer to home, including in scenarios where Beijing responds to a potential US defense of Taiwan, the sources added.\n\nChina has been aggressively expanding its nuclear sites, US intelligence officials have previously reported publicly, with analysts suspecting that China might be pursuing new technologies. Now US officials believe there is strong evidence to support that theory – in part – because of what it has learned about the 2020 test.\n\nChina has had a nuclear arsenal since 1964. It has produced warheads faster than any country in the world, although the size of its arsenal trails far behind Russia and the US, which continue to own the lion’s share of the world’s nuclear weapons.\n\nAsked about the US intelligence assessments of its nuclear program, a spokesman for the Chinese Embassy in Washington told CNN that “the United States has distorted and smeared China’s nuclear policy.”\n\n“This is political manipulation aimed at pursuing nuclear hegemony and evading its own nuclear disarmament responsibilities,” Liu Pengyu said. “China firmly opposes such narratives. US allegation about China conducting a nuclear test are entirely unfounded. China opposes any attempt by the United States to fabricate excuses for resuming its own nuclear testing.”\n\nA defense official said that the Pentagon “does not comment on intelligence assessments tied to specific alleged nuclear test events.”\n\nThe Pentagonhas previously suggestedthat China’s efforts to expand and improve its nuclear arsenal could “provide [China] with new options before and during a crisis or conflict to leverage nuclear weapons for coercive purposes, including military provocations against US Allies and partners in the region.”\n\nA 2024 report from the Defense Intelligence Agency also noted that China is seeking to revamp its nuclear arsenal with the US in mind.\n\n“China is undergoing the most rapid expansion and ambitious modernization of its nuclear forces in history—almost certainly driven by an aim for enduring strategic competition with the U.S. and a goal to actualize intensified strategic concepts that have existed for decades but are now being realized,” it states.\n\nHistorically, China has viewed its nuclear capabilities as a means of self-defense and deterring other countries from using or threatening to use their own nuclear weapons against it. China has had a no-first-use policy in place for decades, but the country’s 2023 proposal on global governance does not reference that commitment which has invited speculation that China’s posture could be changing.\n\nAnd until recently, China’s nuclear capability was considered far less advanced than its nuclear rivals. It has conducted far fewer tests from which it could collect data needed to design modernized weapons.\n\n“China’s nuclear weaponeers may lack confidence in the limited nuclear weapons data they collected during only 45 tests, most of which were conducted in the atmosphere and poorly instrumented,” according to Jeffrey Lewis, an arms control expert at the Middlebury Institute of International Studies.\n\nThat, US officials believe, is one of the primary reasons why China would resume explosive testing.\n\n“They have a brand new generation of weapons for which they have no database,” said one of the sources familiar with the matter.\n\nAs part of that modernization push, China has been investing heavily in maneuverability and survivability, multiple sources told CNN, noting Beijing has long feared the US could potentially wipe out its entire force before it can shoot back – or at least inflict enough damage to effectively neuter it.\n\nUS officials also believe China has had concerns over the reliability of its own systems, which contributes to the urgency surrounding its modernization efforts and fueled investment in technologies to ensure its nuclear warheads can hit their intended target.\n\nTwo sources noted that China appeared increasingly paranoid about a potential US attack during the same timeframe as that June 2020 nuclear test. In the lead-up to the 2020 US presidential election in November of the same year, Chinese officials even reached out to then-Chairman of the Joint Chiefs Mark Milley because they were concerned about an “October surprise,” the sources said.\n\nWhile those tensions ultimately subsided, China has taken steps in the years since to not only update its nuclear forces but also sought to modernize its entire military.\n\nChina’s nuclear ambitions have reemerged as a topic of intrigue in recent weeks after State Department officials revealed new details about, what they allege, was an explosive test carried out at the Lop Nur facility in June 2020 – disclosing the exact date, location and related seismic data about the event to support their conclusion. The connection to China also using the test to modernize its arsenal became clear in the follow-on study of the test, particularly given the seismic magnitude, a former senior official told CNN.\n\nAssistant Secretary of State Christopher Yeaw told an event at the Hudson Institute think tank in Washington this week the June 2020 event measured an “explosion” of magnitude 2.75.\n\n“I’ve looked at additional data since then. There is very little possibility I would say that it is anything but an explosion, a singular explosion,” said Yeaw, adding that the data was not consistent with mining blasts.\n\n“It’s also entirely not consistent with an earthquake,” said Yeaw, a former intelligence analyst and defense official who holds a doctorate in nuclear engineering. “It is … what you would expect with a nuclear explosive test.”\n\nEarlier this month, Under Secretary of State for Arms Control Thomas DiNanno also publicly accused China of having secretly carried out an explosive nuclear test in 2020 and suggested the US had obtained intelligence indicating Beijing planned to carry out more.\n\n“I can reveal that the U.S. Government is aware that China has conducted nuclear explosive tests, including preparing for tests with designated yields in the hundreds of tons. The PLA (People’s Liberation Army) sought to conceal testing by obfuscating the nuclear explosions because it recognized these tests violate test ban commitments,”DiNanno saidduring a February 6 speech.\n\nCNN has since learned that additional intelligence collected by the US after the June 2020 event served as a key piece of the puzzle as experts have argued that the seismic data is not, on it’s own, enough to definitively conclude it was a nuclear test or understand why it was carried out.\n\nWhenasked about the allegationof secret nuclear testing earlier this month, Liu, the spokesperson for the Chinese Embassy in Washington, DC, said China “follows a policy of ‘no first use’ of nuclear weapons and a nuclear strategy that focuses on self-defense, and adheres to its nuclear testing moratorium.”\n\n“We stand ready to work with all parties to jointly uphold the authority of the Comprehensive Nuclear Test-Ban Treaty and safeguard the international nuclear disarmament and non-proliferation regime,” he said.\n\n“It’s hoped that the US will earnestly abide by its obligations under the Treaty and its commitment to a moratorium on nucleartesting and take concrete actions to uphold the international nuclear disarmament and non-proliferation regime, as well as global strategic balance and stability,” he told CNN.\n\nThe timing of the Trump administration’s decision to reveal details about an alleged test that took place nearly six years ago is also notable as it comes as the US is insisting China join any new nuclear arms agreement, overtures Chinese leader Xi Jinping has so far resisted, sources said.\n\nTrump has suggested the US could resume explosive testing of its own.\n\nUltimately, China has more to gain from conducting explosive tests than the US, raising questions about why the State Department took the rare step of disclosing specifics about the event from June 2020 at this point, multiple sources said.\n\nThat move suggests the Trump administration is concerned about public diplomacy with Beijing – particularly ahead of the president’s upcoming trip to the country in April, one source familiar with discussions between the two countries noted.\n\nBut current US officials also noted that the Trump administration is determined to draw China into a nuclear deal, suggesting that the revelation of a slice of what the US knows about their current efforts could pressure them into discussions.\n\n“The old arms control paradigm is collapsing as China races to grow its nuclear arsenal,” said Alex Gray, former NSC chief of staff and now senior fellow at the Atlantic Council. “The Administration is grappling with not just Russian strategic weapons but a much more concerning Chinese nuclear expansion. Unless we can negotiate an arms control framework that encompasses Beijing, the US doesn’t need to mindlessly adhere to outdated arms control nostrums that don’t capture the threats of today and tomorrow.”\n\nThe rapid growth and modernization of the PLA also serves as a fulfilment of Xi’s more than decade-old promise to transform the world’s largest armed forces into a world-class military.\n\n“This is a reflection of China’s sweeping global ambitions … this is one of the clearest signals of that of almost anything that China is doing,” one of the sources added, noting Beijing’s actions must inform how the US prepares for future conflicts.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://media.defense.gov/2022/Oct/27/2003103845/-1/-1/1/2022-NATIONAL-DEFENSE-STRATEGY-NPR-MDR.PDF",
      "text": "has previously suggested"
    },
    {
      "url": "https://www.state.gov/releases/under-secretary-for-arms-control-and-international-security-affairs/2026/02/statement-to-the-conference-on-disarmament",
      "text": "DiNanno said"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/us-china-nuclear-weapons",
      "text": "asked about the allegation"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/china-nuclear-arsenal-new-technology",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/politics/china-nuclear-arsenal-new-technology",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1f32f936a04f9809d8418a430805a7c8058f7e0fe104df8c8806106e137d943c",
  "scraped_at": "2026-02-21T07:04:21.350679+00:00"
}