{
  "url": "https://lite.cnn.com/2026/02/23/politics/sotu-address-prep-trump",
  "title": "Trump faces a skeptical public and myriad challenges ahead of State of the Union address | CNN Politics",
  "date": "2026-02-24T07:31:32.149717+00:00",
  "authors": [
    "Adam Cancryn, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump on Tuesday night will get his highest-profile opportunity to convince skeptical Americans that his policies are working — and that a promised economic golden age is right around the corner.\n\nBut ahead of a State of the Union address meant to mark the unofficial start of the midterm campaign, even Trump seemed unconvinced he had a shot at changing many minds.\n\n“If I came up with a cure for cancer, they would say he should have done it years ago,” he complained during a White House event Monday. “There is not a thing I can do where these people are going to give me credit.”\n\nThe primetime address comes amid a particularly troublesome stretch for the president, who faces an array of challenges at home and pressing questions abroad. In polling, Trump is as unpopular as ever, battered by Americans’ anxiety over the cost of living and dissatisfaction with his approach to addressing it. His 36% approval rating is down from 48% last February, according toa CNN pollreleased Monday that showed his lowest-ever approval rating with independents — just 26%.\n\nThe administration is struggling to build public awareness of its key accomplishments or momentum in Congress for its future ambitions. At the same time, Trump, who has proclaimed himself the “peace president,” ismulling yet more strikeson a foreign nation. Then there is the administration’s messy handling of theJeffrey Epstein files, thepartial government shutdown,backlashover a Minnesota immigration crackdown that led to the fatal shootings of two US citizens, and — in a poorly timed twist for Trump — theSupreme Court’s rulinginvalidating the tariffs at the center of the White House’s economic agenda.\n\nThose headwinds have formed an ominous backdrop for a speech that Trump’s allies and advisers hope he’ll use to rally Americans behind an optimistic vision for the country — yet that they worry will get bogged down in the president’s brand of score settling and grievance.\n\n“Trump has but one note, which is rage,” said Matthew Bartlett, a GOP strategist and first-term Trump official. “I’m not sure that’s somehow going to change, or that he’ll find some sort of pitch-perfect tone for the American worker.”\n\nAhead of Tuesday’s address, White House aides have focused on a more nuanced midterm pitch that balances touting Trump’s first-year accomplishments with previewing an aggressive agenda still to come. They’ve concluded the president’s political challenges are primarily a messaging problem, people familiar with the internal discussions said, making the State of the Union one of several key opportunities to shift Americans’ mood on his agenda and the economy overall.\n\n“If there’s not a sense we’re making people feel better about the economy, making their lives more affordable, we’re not going to win,” said one of the people.\n\nTrump’s speech is expected to focus heavily on highlighting the economy’s overall strength, while making the case that Americans will eventually see it reflected in their bank accounts as the administration’s policies take effect.\n\nWhite House officials are relying in particular on tax provisions that Republicans passed as part of last year’s “big, beautiful bill” that they’ve predicted will result in people getting larger-than-anticipated tax refunds this year.\n\nTrump is also likely to boast about policies he’s proud of, such as the elimination of certain taxes on tips and overtime, and the investment commitments made by various corporations and countries since he took office.\n\nAnd despite the GOP’s slim margins in Congress, Trump is expected to press lawmakers to take up legislation addressing major affordability areas such as health care and housing. The president has already called for codifying drug price agreements his administration negotiated with more than a dozen pharmaceutical companies, and for passing a more sweeping health care bill centered on redirecting certain Obamacare subsidies to individual enrollees.\n\nThose initiatives, like his populist push to bar big institutional investors from the housing market, have received a muted response on Capitol Hill. But Trump advisers have stressed the need to offer a substantial vision that shows Americans the administration is still working to alleviate their biggest concerns — and one that can be compared directly with the agenda Democrats are fleshing out.\n\nBut even as Trump has worked closely with aides to refine his rhetoric in recent weeks, he’s continued to show flashes of frustration with his grim political situation.\n\nAt an event in Georgia last week meant to test-drive his message on crucial affordability issues, Trump ticked off a list of accomplishments he argued were already benefiting the area’s businesses and residents. Then, he veered sharply off message.\n\n“What word have you not heard over the last two weeks? Affordability,” he said. “Because I’ve won. I’ve won affordability.”\n\nTrump more recently spent the last few days publicly fuming over the Supreme Court’s verdict on his tariff powers, leveling attacks on both the decision and the six justices who supported it, including two he appointed.\n\nIn a flurry of social media posts, he has vowed toreconstitute a trade regimethat’s potentially harsher than before, despite warnings within his own party it would push up prices and fuel even greater economic uncertainty.\n\n“Any Country that wants to ‘play games’ with the ridiculous supreme court decision, especially those that have ‘Ripped Off’ the U.S.A. for years, and even decades, will be met with a much higher Tariff, and worse, than that which they just recently agreed to,” Trump wrote in a Monday post.\n\nDespite Trump’s sustained polling declines, his advisers have been buoyed by Democrats’ inability to rebuild their brand, arguing they may need only to effectively portray the midterms as a choice between the two competing visions.\n\nTrump is likely to lean into that contrast between the two parties on Tuesday on a range of issues, talking up his push for a voter ID measure that he’s claimed has broad public support, touting progress on crime and the southern border, and portraying his various foreign entanglements as part of a push to reestablish American dominance around the world. After overseeing the ouster of Venezuela’s president last month, Trump will travel to the Capitol this week amid deliberations over attacking Iran.\n\nOn Monday, Trump indicated that lengthy agenda could take a while to get through.\n\n“We have the greatest economy we’ve ever had. We have the most activity we’ve ever had,” he said. “It’s going to be a long speech, because we have so much to talk about.”\n\nYet for the sizable proportion of voters still unconvinced about the greatness of the economy Trump is eager to celebrate, a chief worry remains how long they’ll stay tuned in.\n\nDespite the spectacle surrounding the State of the Union, it rarely makes a lasting dent in the nation’s broader political dynamics, Bartlett said, or in the president’s own trajectory.\n\n“Second-term presidents historically lose credibility,” he said. “And they never get it back.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
      "text": "a CNN poll"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/us-iran-strike-options-trump-military",
      "text": "mulling yet more strikes"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Jeffrey Epstein files"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "partial government shutdown"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/us/minneapolis-shootings-federal-officers-accountability",
      "text": "backlash"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "Supreme Court’s ruling"
    },
    {
      "url": "https://www.cnn.com/politics/trump-agenda-bill-provisions-timeline-vis",
      "text": "big, beautiful bill"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "reconstitute a trade regime"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/sotu-address-prep-trump",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/sotu-address-prep-trump",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1f6da9c6c5877166cd66d54af0c2a5786708f2d89952976649731bfee3cf3525",
  "scraped_at": "2026-02-24T07:31:32.149730+00:00"
}