{
  "url": "https://lite.cnn.com/2026/02/24/politics/tony-gonzales-affair-allegations",
  "title": "Republican Rep. Tony Gonzales says he will not resign amid affair allegations | CNN Politics",
  "date": "2026-02-25T07:32:16.900247+00:00",
  "authors": [
    "Manu Raju",
    "Sarah Ferris",
    "Alison Main"
  ],
  "text": "Source: CNN\n\nEmbattled Republican Rep. Tony Gonzales told CNN on Tuesday he would not resign amid allegations that he had an affair with a senior staffer who later died by suicide, while he declined to answer repeated questions about whether the accusations are true.\n\nThe Texas Republican would not say whether he had an affair with the staffer or whether he sent sexually explicit text messages that appeared to show him pressuring his staffer to share images of herself.\n\n“I am not going to resign. I work every day for the people of Texas,” Gonzales told CNN when pressed whether he had a relationship with his staffer or on whether the text messages were real. He has previously said he’s beingblackmailed.\n\n“There will be an opportunity for all the details and facts to come out,” Gonzales said. “What you’ve seen is not all the facts. And there will be ample time for all of that to come out.”\n\nThe Texas Republican — who is one week out from a difficult primary fight that could end his tenure in Congress — is facingmounting callsfrom his GOP colleagues to step down after reports surfaced of his alleged affair.\n\nHe faces a fellow Republican, Brandon Herrera, in a primary on March 3 — a rematch of 2024’s close election.\n\nGonzales’ comments to CNN are his first public remarks since news reports about lewd text messages he was alleged to have sent to the staffer. They included one exchange, provided to CNN by the staffer’s husband, that showed Gonzales asking for a “sexy pic.”\n\nGonzales is set to speak later with Speaker Mike Johnson about the matter, which is also being investigated by an internal House ethics commission.\n\n“I’m not going to talk about our prior conversations. We haven’t spoken yet but I will,” Johnson told CNN when asked about what he plans to say to Gonzales.\n\nJohnson had earlier conceded the accusations were “very serious” and said he urged the San Antonio Republican to address them with his constituents directly. He insisted, however, that the investigations should play out.\n\n“There are serious accusations, and it must be taken seriously, and I’ve told him he’s got to address that with his constituents and, and he’s in the process of doing that,” Johnson previously told CNN.\n\nOn Tuesday, House Majority Leader Steve Scalise echoed the speaker, calling the allegations “serious” while highlighting the ongoing investigation.\n\nMeanwhile, Reps. Lauren Boebert of Colorado, Nancy Mace of South Carolina, Anna Paulina Luna of Florida, Thomas Massie of Kentucky and Tim Burchett of Tennessee have called for Gonzales’ resignation, and still others have urged him to drop his reelection bid.\n\n“I just think he should resign for the good of the Republican Party frankly,” Massie told CNN on Tuesday.\n\nLuna said calls to wait for the results are investigations are not necessary, describing the case as “self-explanatory.”\n\n“If I had the votes tomorrow, I’d kick him out of office,” she told CNN. “I do not think that he deserves a place up here, and I think that his voters should consider that.”\n\nCNN’s Annie Grayer contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
      "text": "blackmailed"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/tony-gonzales-affair-allegations-mike-johnson",
      "text": "mounting calls"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/tony-gonzales-affair-allegations",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/tony-gonzales-affair-allegations",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1f9043179c2b1485b292c7ea44699d62440602eb63dff0b71fe52bc66098df50",
  "scraped_at": "2026-02-25T07:32:16.900259+00:00"
}