{
  "url": "https://lite.cnn.com/2026/02/24/business/epstein-democrat-bob-kerrey",
  "title": "Democrat quits clean energy firm over Epstein links | CNN Business",
  "date": "2026-02-25T07:32:25.176298+00:00",
  "authors": [
    "Matt Egan"
  ],
  "text": "Source: CNN\n\nFormer US Senator Bob Kerrey has resigned from the board of directors of a Nebraska clean-energy startup amid controversy over his ties to convicted sex offender Jeffrey Epstein.\n\nKerrey, a Democrat who also served as Nebraska’s governor in the 1980s, joins agrowing list of business leaderswho have decided to step down due to scrutiny over their links to the disgraced financier.\n\nIn a phone interview on Tuesday, Kerrey confirmed that he decided to resign from the board of Monolith to avoid damaging the clean energy company’s fortunes.\n\n“I don’t want to mess up this company’s capacity to be successful. So, I resigned,” Kerrey told CNN.\n\nKerrey has come under fire after the millions of Epstein files the US Justice Department released revealed the former US Senatorarranged to meetwith Epstein on at least two occasions in thesummer of 2013for lunch and dinner.\n\nThose meetings occurred years after Epsteinpled guilty in 2008to procuring a minor for prostitution. Kerrey hasn’t been accused of criminal wrongdoing related to Epstein.\n\nThe correspondence with Epstein occurred when Kerrey was wrapping up his tenure as president emeritus of The New School, a progressive university in New York, where he waspresident from 2001 until 2010. Student newspaper The New School Free Press firstreportedKerrey’s meetings with Epstein.\n\n“Did I have a meeting with Jeffrey Epstein in 2013? The answer is yes, I did,” Kerrey told CNN.\n\nKerrey explained he met with Epstein at the time for the purpose of supporting a university.\n\n“I am willing to accept it was a lack of moral judgment. But the stories and files are misleading,” Kerrey said, adding that any suggestion he did Epstein a favor “isn’t true.”\n\nIn a statement to CNN, The New School spokesperson Amy Malsin said the university has reviewed information related to Kerrey’s correspondence with Epstein.\n\n“Those interactions appear to have been limited and were unrelated to the activities of The New School,” the spokesperson said. “We regret that any member of our community had any association with Mr. Epstein, whose crimes were reprehensible.”\n\nA Monolith spokesperson confirmed Kerrey resigned but offered no further details because it was “an internal governance matter.”\n\nTheNebraska Republican Partylast week called on all Nebraska political candidates and organizations to immediately return contributions received from Kerrey.\n\n“Kerrey’s repeated presence in these records, including multiple documented meetings, reflects a staggering failure of judgment and moral responsibility,” Mary Jane Truemper, chairman of the Nebraska Republican Party, said in a statement last week.\n\nKerrey said he embraces the idea of candidates returning his donations to charity and urged Republicans to do the same.\n\n“We need moral clarity. There’s almost an absence of moral clarity – especially in conversation about the so-called Epstein files,” Kerrey said. “If Republicans are morally outraged by what I did, they need to be morally outraged at others who met with Epstein and might be in their party.”\n\n“There were crimes against these children. That needs to be the focus of attention, not on some meetings that took place 15 years ago,” Kerrey said.\n\nBased in Nebraska, Monolith describes itself as a leader in “advanced, more sustainable” US manufacturing. The company hasdevelopeda process to use renewable electricity to produce carbon black, a material used in tires and ammonia.\n\nKerrey said Monolith is raising capital and attempting to get permits to be involved in the construction of data centers.\n\nKerrey said he will no longer be involved with Monolith but is remaining at Allen & Co., a New York boutique investment bank.\n\nThis story has been updated to clarify the communications between Kerrey and Epstein.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/business/epstein-files-ceo-resign",
      "text": "growing list of business leaders"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA02136120.pdf",
      "text": "arranged to meet"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA02130566.pdf",
      "text": "summer of 2013"
    },
    {
      "url": "https://www.cnn.com/2024/07/01/us/jeffrey-epstein-grand-jury",
      "text": "pled guilty in 2008"
    },
    {
      "url": "https://www.newschool.edu/pressroom/pressreleases/2013/Emeritus.htm",
      "text": "president from 2001 until 2010"
    },
    {
      "url": "https://www.newschoolfreepress.com/2026/02/08/department-of-justice-files-show-links-between-the-new-school-and-jeffrey-epstein/",
      "text": "reported"
    },
    {
      "url": "https://ne.gop/2026/02/19/negop-calls-on-nebraska-democrat-candidates-to-return-bob-kerrey-donations-following-epstein-file-revelations/",
      "text": "Nebraska Republican Party"
    },
    {
      "url": "https://carbonblack.monolith-corp.com/",
      "text": "developed"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/business/epstein-democrat-bob-kerrey",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/business/epstein-democrat-bob-kerrey",
      "text": "Cookie Settings"
    }
  ],
  "hash": "1fa0a72fceda8a95c7971871112d1a327290899fe71f57493a764cb1662148c9",
  "scraped_at": "2026-02-25T07:32:25.176310+00:00"
}