{
  "url": "https://lite.cnn.com/2026/02/12/politics/doj-monitoring-lawmaker-epstein-files-searches",
  "title": "House speaker condemns Trump Justice Department monitoring of lawmakers’ Epstein document review | CNN Politics",
  "date": "2026-02-12T21:29:25.584858+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAttorney General Pam Bondi obtained Democratic Rep. Pramila Jayapal’s search history of the unredactedJeffrey Epstein filesand even President Donald Trump’s most powerful ally in Congress has a problem with it.\n\nHouse Speaker Mike Johnson on Thursday said the Justice Department’s tracking of lawmakers’ search history was inappropriate, a rare rebuke from the Republican who is usually in lockstep with the administration.\n\n“I think members should obviously have the right to peruse those at their own speed and with their own discretion and I don’t think it’s appropriate for anybody to be tracking that,” Johnson told CNN. “I will echo that to anybody involved in the DOJ.”\n\nJohnson’s comments come after photographs of Bondi’s notes during a Wednesday congressional hearing revealed the Justice Department is tracking which documents lawmakers are reviewing in the unredacted Jeffrey Epstein files, prompting some on Capitol Hill to sound the alarm.\n\nCNNfirst reportedthe apparent surveillance from a photo taken of Bondi’s notes during her testimony, which included Jayapal’s “search history” of the documents, with a list of which files the congresswoman had searched.\n\nJayapal told CNN she did not know the Justice Department had surveilled her search until CNN contacted her Wednesday for comment on the matter.\n\n“I think everyone should be concerned about this. It’s a violation of our separation of powers,” Jayapal said. “We should be able to look at any document we want and not feel like it’s going to be surveilled or used against us in any way. And this was just so obviously egregious.”\n\nWhen Johnson initially called the allegation of DOJ tracking lawmakers’ search history “unsubstantiated” on Wednesday, Jayapal, who is close with the speaker from his days serving on the Judiciary panel, immediately called him to explain what happened.\n\n“I said, ‘Mike, it’s real. That’s my search history exactly in the order that I searched it,’” Jayapal told CNN of her conversation with Johnson.\n\nLawmakers have been scheduling times this week to go into a Justice Department building in Washington, DC, to review unredacted versions of the files and have since pressured the Justice Department tounredactthe names of individuals who were at one time considered as co-conspirators in Epstein’s crimes.\n\nLawmakers have not been allowed to bring phones or members of their staff into the building to review the documents and are limited to four computers set up with the unredacted files.\n\nWhen Jayapal went into the room to view the unredacted Epstein files, a Justice Department employee logged her into one of the four computers available for lawmakers, the lawmaker said.\n\nDuring the duration of her time in the room, Jayapal said DOJ staffers remained with her, and at one point one of the employees sat directly behind her, able to view her computer screen. Even though lawmakers were allowed to bring in notes with them, Jayapal said she was instructed to only take notes on the pads of paper the Justice Department provided her.\n\nA department spokesperson said in a statement to CNN that “DOJ has extended Congress the opportunity to review unredacted documents in the Epstein files. As a part of that review, DOJ logs all searches made on its systems to protect against the release of victim information.”\n\nRepublican firebrand Nancy Mace has also spoken out about the monitoring of lawmakers’ searches, writing on social media Wednesday that “DOJ is tracking the Epstein documents Members of Congress search for, open, and review.”\n\n“I was able to navigate the system today and I won’t disclose how or the nature of how; but confirmed the DOJ is TAGGING ALL DOCUMENTS Members of Congress search, open and review,” she said.\n\nIn the aftermath, Jayapal said the Justice Department needs to create a “completely different process” for lawmakers to review the unredacted files without fear of their search history being saved or used against them.\n\nThe congresswoman said wants to know why the DOJ set it up in such a way that a lawmaker’s search history could be reviewed in the first place.\n\nRepublican Rep. Thomas Massie of Kentucky said the most “charitable” explanation for tracking members’ search history was that DOJ wanted to “improve their service” by helping members find the most frequently sought-after documents. But Massie said that charitable view is undercut by Bondi carrying with her a list of Jaypal’s search terms at the hearing “where she clearly was prepared with oppo resesarch” and brought “flash cards with insults” to try to “embrass” the members.\n\n“I think it’s kind of creepy that they were hoping to divine some line of attack based on our search histories,” Massie said.\n\nMassie has also criticized the DOJ for having certain redactions in files that lawmakers were supposed to be able to view in an unredacted form. That makes it impossible, he argued, for Congress to access all FBI files in the millions of pages released by the Justice Department.\n\nThe law, passed by Congress and co-authored by Massie and Democratic Rep. Ro Khanna, limited which redactions DOJ could make, including personal information of victims and materials that would jeopardize an active criminal investigation. But as CNN previously reported, some redactions described by the lawmakers did not line up with the law.\n\nThe Justice Department is also required to give Congress a privileged log explaining why certain redactions were made by February 15.\n\nThe surveillance is reminiscent of theCIA’s efforts to spyon Senate intelligence committee staffers who were conducting oversight into the CIA’s interrogation and torture tactics that occurred in the wake of the 9/11 attack.\n\nIn March of 2014, Senator Dianne Feinstein, who chaired the intelligence committee, said she believed the CIA could have acted illegally in monitoring a standalone computer network in northern Virginia used by staffers to access classified CIA material.\n\nThe Justice Department ultimately declined to investigate the matter despite a referral from the Inspector General.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Jeffrey Epstein files"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/pam-bondi-house-hearing-02-11-26?post-id=cmli7mnhx001u3b6ptdafvy1y",
      "text": "first reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/redacted-text-jeffrey-epstein-files",
      "text": "unredact"
    },
    {
      "url": "https://www.cnn.com/2014/07/31/politics/cia-spying-senate-apologize",
      "text": "CIA’s efforts to spy"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/doj-monitoring-lawmaker-epstein-files-searches",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/doj-monitoring-lawmaker-epstein-files-searches",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2043d5df0fd2bcd212c5cd6b72af5f0199da9ac2fa6daa3c79bf2b25b868a910",
  "scraped_at": "2026-02-12T21:29:25.584870+00:00"
}