{
  "url": "https://lite.cnn.com/2026/02/24/science/artemis-2-roll-back-launch-date",
  "title": "NASA’s most anticipated mission in decades has another problem | CNN",
  "date": "2026-02-25T07:32:39.605265+00:00",
  "authors": [
    "Jackie Wattles"
  ],
  "text": "Source: CNN\n\nEfforts to get NASA’s historic moon mission off the ground have stalled once again, as engineers navigate a new issue with the rocket set to propel four astronauts on an unprecedented path.\n\nThe agency announced Saturday that it had detected a problem with flow of helium, a gas that’s used to pressurize fuel tanks and clean out propellant lines, in the upper part of the Space Launch System, or SLS, moon rocket. Now, the space agency must roll the rocket back off the launchpad and into the nearby Vehicle Assembly Building, or VAB, for servicing as soon as Wednesday — a move that effectively takes the possibility of a March launch date off the table.\n\nThe decision represented an abrupt reversal from Friday, when agency officials — on the heels of a fueling test called a wet dress rehearsal — expressed confidence in the potential for a March 6 liftoff. NASA leaders characterized the test, which concluded Thursday, as a success, saying launch controllers had appeared to solve a series ofhydrogen fuel leaksthat cropped up during an earlier rehearsal in early February.\n\nThe helium problem came as a surprise, arising after NASA had wrapped up the latest wet dress Thursday. And launch controllers still aren’t certain what caused the hangup, though NASA Administrator Jared Isaacman said that in any case the issue must be addressed off the launchpad.\n\nNASA is now targeting no earlier than April to launch the mission, called Artemis II.\n\n“The quick work to begin preparations for rolling the rocket and spacecraft back to the VAB potentially preserves the April launch window, pending the outcome of data findings, repair efforts, and how the schedule comes to fruition in the coming days and weeks,” the space agency said in a Mondayblog post.\n\nNASA previously identified April 1, 3, 4, 5, 6 and 30 as potential launch days, though during anews conferencelast Friday agency officials revealed they were assessing potential dates in May and June as well.\n\nWhen the mission does take off, it’s slated to carry NASA’s Reid Wiseman, Victor Glover and Christina Koch and Canadian Space Agency astronaut Jeremy Hansen on a 10-day slingshot trip around the moon, marking the first time humans have traveled to deep space since the Apollo program ended in 1972.\n\nThere are numerous open questions about the feasibility of an April launch date for the mission.\n\nAre there other issues hiding in the data that engineers haven’t yet uncovered? How long will it take to find and address the helium problem? And will rolling the rocket back and forth aggravate NASA’s notorious hydrogen issues?\n\nNASA officials seemed on Friday to think that they had a handle on the SLS rocket’s hydrogen leaks, a notorious problem that has plagued the Artemis program since pre-launch testing for an uncrewed 2022 test flight called Artemis I. Because hydrogen is the lightest element in the universe, it tends to leak out of anything intended to contain it. And after hydrogen seepage plagued the first wet dress rehearsal for Artemis II in early February, the space agency worked to replace two seals around the rocket’s propellant lines in an attempt to better confine the fuel.\n\nThose efforts had appeared to pay off when NASA moved into the second wet dress rehearsal on Thursday.\n\nStill, NASA said that although it had fixed the hydrogen issue, officials weren’t sure why there was some unexpected moisture near the seals that technicians replaced.\n\n“Where it came from, I’m not entirely sure,” said Artemis launch director Charlie Blackwell-Thompson during the Friday news conference. And she said the hydrogen leaks more broadly were still a bit of a puzzle.\n\n“We didn’t have one thing that we could point to where we said this was absolutely it,” Blackwell-Thompson said of the issue. “We had a number of contributing things, but certainly changing out the seals addressed the problem, because we had absolutely an incredible performance.”\n\nThen, the helium problem took mission teams right back to the drawing board. Helium gas wasn’t flowing into the upper rocket. And no one was sure why.\n\nHelium serves an important role. It’s ideal for cleaning fuel lines and pressurizing tanks because it stays gaseous even at the super-cold temperatures of the rocket’s propellants — liquid hydrogen and liquid oxygen — and helium is inert, meaning it won’t cause any volatile chemical reactions.\n\nBut the helium issue forced engineers to use “a backup method” to keep the rocket in a safe configuration because it helps flush out explosive cryogenic fuels. As of Monday, NASA had not yet revealed why the gas had suddenly stopped flowing.\n\nNASA Administrator Jared Isaacman said in a post on social media that potential causes of the helium problem included a faulty filter located between ground equipment and the rocket, a misbehaving valve on the rocket, or an issue related to a “quick disconnect umbilical,” which is a line that is designed to rapidly detach from the rocket during takeoff. The latter two scenarios might be most likely, however, as such issues have come up before. A valve, Isaacman noted, led to helium issues in thelead up to the Artemis Iuncrewed test flight in 2022.\n\n“Regardless of the potential fault, accessing and remediating any of these issues can only be performed in the VAB,” Isaacman said.\n\nHowever, rolling the rocket off the launchpad and back to the VAB also raises a new slate of questions about how the hardware will fare during the 8-mile round trip, which takes hours to complete each way.\n\nLaunch officials previously said that the process of moving the rocket into position may be causing some of the hydrogen leaks. The slow yet grueling rollout procedure involves inching the 3.5 million-pound rocket and spacecraft on a “crawler” or mobile platform and can put stress and strains on the massive vehicle.\n\n“That rollout environment is very complicated,” said Amit Kshatriya, NASA’s associate administrator, during a February 3news conference.\n\nEven after the helium issue is solved, NASA might need to put the SLS rocket through another wet dress rehearsal.\n\nIn a Monday email, a NASA spokesperson said launch controllers will review what additional tests may be needed after the rocket returns to its launchpad.\n\nWhether during the next wet dress rehearsal or on launch day, mission controllers must once again keep hydrogen leaks under control — if the recently replaced seals begin to show their signature fickleness after the journey back out to the launchpad.\n\nIf additional issues arise during any of these steps, it could take the potential April launch windows off the table as well. And a monthslong delay wouldn’t be unheard of. Notably, in the lead-up to the 2022 Artemis I mission, the SLS rocket was taken off the launchpad three times and ultimately launched about eight months after its initial rollout.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/science/artemis-2-nasa-hydrogen-leaks",
      "text": "hydrogen fuel leaks"
    },
    {
      "url": "https://www.nasa.gov/blogs/missions/2026/02/22/nasa-to-rollback-artemis-ii-rocket-spacecraft/",
      "text": "blog post"
    },
    {
      "url": "https://www.youtube.com/watch?v=rayK1pwhzEs",
      "text": "news conference"
    },
    {
      "url": "https://www.cnn.com/2022/04/14/world/nasa-artemis-wet-dress-third-attempt-scn",
      "text": "lead up to the Artemis I"
    },
    {
      "url": "https://www.youtube.com/watch?v=ST0CvbLEdwE",
      "text": "news conference"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/science/artemis-2-roll-back-launch-date",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/science/artemis-2-roll-back-launch-date",
      "text": "Cookie Settings"
    }
  ],
  "hash": "20e74b601f8bfba71bf7a01df6151eb40284a2971743a56b2c1f6e3c9ae4b579",
  "scraped_at": "2026-02-25T07:32:39.605276+00:00"
}