{
  "url": "https://lite.cnn.com/2026/02/17/sport/tony-clark-mlbpa-baseball-future",
  "title": "Tony Clark resigns as MLB players union leader after inappropriate relationship with sister-in-law discovered, source says | CNN",
  "date": "2026-02-19T07:30:49.539580+00:00",
  "authors": [
    "Hannah Keyser, CNN"
  ],
  "text": "Source: CNN\n\nTony Clarkresigned abruptly this week as the executive director of the Major League Baseball Players Association after allegations of personal misconduct came to light.\n\nAfter an outside firm was retained in response to federal investigations, Clark was discovered to have had an inappropriate relationship with a subordinate who is also his sister-in-law, sources confirmed to CNN Sports.\n\nThe players union put out astatement Tuesday nightannouncing Clark’s departure and reaffirming that “the strength of this union is – and will always be – the solidarity of our membership.”\n\nThe statement did not offer an explanation for the sudden departure of Clark, who led the union in the last two cycles of collective bargaining. Clark was expected to lead the players in another contentious negotiation with the owners following the 2026 season, but he was also the subject of multiple ongoing federal investigations.\n\nESPN first reported Tuesdaythat Clark’s resignation was prompted due to an inappropriate relationship with his sister-in-law, who was hired as a union employee in 2023.\n\nThe timing of the resignation shocked players and union staff. Clark was scheduled to start his annual tour of spring training camps on Tuesday. More critically, the current CBA is set tio expire on December 1 of this year, at which point it seems likely that the owners will lock out the players.\n\nRhetoric ahead of CBA negotiations is often heightened and heated, but owners have been building a case in the court of public opinion that a salary cap is necessary for competitive balance amid growing disparities in team spending. For players, a salary cap has long been a non-starter and the issue could lead to a protracted work stoppage.\n\nClark, 53, is a former player who ascended to the union’s executive director role in 2013 following the death of Michael Weiner. But more recently, Clark’s tenure has been marred by dissent and distractions.\n\nThere was an attempt to oust lead negotiator Bruce Meyer in 2024. Clark stood by Meyer, and the players who had fomented the failed coup were later voted off the executive subcommittee.\n\nIn 2025, it was revealed that Clark and the MLBPA were subjects of a federal investigation regarding revenue from licensing agreements. At the time, Clark and the MLBPA hired separate lawyers,according to reports.\n\nLater,ESPN reportedthat Clark was also the subject of an investigation into a youth baseball initiative by the MLBPA that appeared to be enriching executives.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/04/business/baseball-salary-cap-2027",
      "text": "Tony Clark"
    },
    {
      "url": "https://x.com/MLBPA/status/2023951448254673141/photo/1",
      "text": "statement Tuesday night"
    },
    {
      "url": "https://www.espn.com/mlb/story/_/id/47954830/sources-tony-clark-resign-mlbpa-executive-director",
      "text": "ESPN first reported Tuesday"
    },
    {
      "url": "https://www.nytimes.com/athletic/6401524/2025/06/03/tony-clark-mlbpa-lawyers-federal-probe/",
      "text": "according to reports"
    },
    {
      "url": "https://www.espn.com/mlb/story/_/id/46770967/feds-probe-profit-venture-mlb-players-association-sent-millions",
      "text": "ESPN reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/tony-clark-mlbpa-baseball-future",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/sport/tony-clark-mlbpa-baseball-future",
      "text": "Cookie Settings"
    }
  ],
  "hash": "21433aa5cc403cda3737e850ff209c0a22df146ff926d40208ad1e8616580f12",
  "scraped_at": "2026-02-19T07:30:49.539593+00:00"
}