{
  "url": "https://lite.cnn.com/2026/02/19/politics/epstein-files-trump-response-andrew-arrest",
  "title": "Analysis: Trump administration’s downplay of the Epstein files proved rash by Andrew’s arrest and other probes | CNN Politics",
  "date": "2026-02-20T07:28:52.086714+00:00",
  "authors": [
    "Analysis by Aaron Blake, CNN"
  ],
  "text": "Source: CNN\n\nIn mid-2025, when the Trump administration suddenly felt compelled todownplay the Jeffrey Epstein files,officials said they didn’t have enough evidence to prompt any additional investigations of third parties.\n\nThe memo didn’t just say there wasn’t evidence tochargeanyone else, mind you; it said there wasn’t even evidence toinvestigate“uncharged third parties.”\n\nThat broad assertion in anunsigned FBI memohas proved to be a rather rash conclusion — most recently and emphatically byThursday’s arrest of Andrew Mountbatten-Windsor, the former Prince Andrew, in the UK.\n\nWhile we only know at this stage that Andrew was arrested on suspicion of “misconduct in public office,” the Thames Valley Police previously said they were looking at claims that Andrew shared sensitive information with Epstein while serving as the UK’s trade envoy in the early 2000s. Andrew has denied all allegations of misconduct related to Epstein, and his name appearing in the files is not evidence of wrongdoing.\n\nAnd there’s more than just Andrew’s arrest on the international stage. The Epstein files that the administration were ultimately forced to release have proven to be of great interest in Europe, where we’ve seen a criminal charge against another high-profile figure and investigations in at least three other countries besides the UK.\n\nWe have yet to see where these investigations lead. The laws in European countries are also different than in the United States. And in some cases, the investigation is not necessarily linked to sexual misconduct — allegations that can be notoriously difficult to prove.\n\nBut it’s become clear that authorities in other countries see plenty of potential misconduct unearthed by the files in a way American authorities initially claimed they didn’t, and it’s leading toa reckoning across the pond.\n\nIt’s also worth noting that the FBI memo’s assurance has wobbled even domestically.\n\nDespite the assurance that nothing warranted further investigation, Attorney General Pam Bondi nonetheless announced in November that the Justice Department wouldinvestigate Epstein’s relationships with prominent Democratslike Bill Clinton. The announcement came after Trump called for such probes. Bill Clinton has repeatedly denied wrongdoing related to Epstein.\n\nFast forward to last week, when Bondi signaled during testimony to the House Judiciary Committee that more investigations were happening.\n\nAsked “whether another individual will be indicted and prosecuted,” Bondi replied: “We have pending investigations in our office.”\n\nJay Clayton, the US attorney for the Southern District of New York, seemed tothrow some cold wateron Bondi’s comments Wednesday, suggesting there were no active investigations. But Bondi has now said there were Epstein-related investigations twice since the FBI assured the public that there was no evidence to warrant them.\n\nThose assurances went beyond the memo, too. In testimony to the House in September, FBI Director Kash Patel said DOJ had released “all credible information.”\n\nPatel added that there were “no investigative leads that were credible to prosecute and investigate any others.” And he suggested the Obama and Biden administrations had agreed with that assessment.\n\nIt’s fair to point out that Bondi and Patel are only responsible for enforcing domestic law, and that could have been what the FBI statement was referencing.\n\nStill, Bondi’s confirmations of further domestic investigations are awkward in that context. She’s also repeatedly said things about the Epstein files thatseemed convenient in the moment, regardless of how true they were. (Think: supposedly having the Epstein client list on her desk.) There is little evidence of robust investigations involving Bill Clinton or anyone else.\n\nAt the very least, the developments of the past few weeks betray the very different views on Epstein accountability between the US and Europe. Prosecutors in the UK and Norway especially seem to feel compelled to hold the powerful accountable, while the Trump administration’s animating principle since the middle of 2025 has been “time to move on” — a view most bluntly conveyed by the president himself, who keeps calling the Epstein files a “hoax.”\n\nThe problem with that latter approach is that, in your haste to assure there’s nothing to see here, you can miss something quite substantial. And when you’re forced to release the files you tried so hard not to release, that evidence can undermine your hard-and-fast claims about what it said.\n\nThat breeds distrust regarding any future assertions you make about the files — a persistent problem the Trump administration hasn’t been able to shake.\n\nThecontrasting levels of accountabilityacross the Atlantic threatens to add to those difficulties.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/07/24/politics/trump-epstein-files-pivot-timeline",
      "text": "downplay the Jeffrey Epstein files,"
    },
    {
      "url": "https://www.justice.gov/opa/media/1407001/dl",
      "text": "unsigned FBI memo"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26",
      "text": "Thursday’s arrest of Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/trump-epstein-maxwell-clemency-analysis",
      "text": "a reckoning across the pond"
    },
    {
      "url": "https://www.nationalreview.com/2025/11/is-bondi-saying-her-dojs-prior-exhaustive-epstein-review-was-a-sham/",
      "text": "investigate Epstein’s relationships with prominent Democrats"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-18-26?post-id=cmlsm67wr00093b6pi12knzkb",
      "text": "throw some cold water"
    },
    {
      "url": "https://www.cnn.com/2025/07/07/politics/bondi-epstein-files-client-list-suicide-memo",
      "text": "seemed convenient in the moment"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26#cmltjd4gh00003b6pkorguo7v",
      "text": "contrasting levels of accountability"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/epstein-files-trump-response-andrew-arrest",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/epstein-files-trump-response-andrew-arrest",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2149323510b54108056fa1f177853f53239972cb127713f1c2cd9de5abdae42e",
  "scraped_at": "2026-02-20T07:28:52.086727+00:00"
}