{
  "url": "https://lite.cnn.com/2026/02/27/politics/slover-trump-medal-of-honor-state-of-the-union",
  "title": "The mad dash to award the Maduro raid pilot the Medal of Honor in time for the State of the Union | CNN Politics",
  "date": "2026-03-01T07:07:44.423803+00:00",
  "authors": [
    "Haley Britzky",
    "Alayna Treene"
  ],
  "text": "Source: CNN\n\nWhen President Donald Trump visited Fort Bragg, North Carolina, earlier this month, the commander of the elite Army Delta Force responsible for carrying out the operation to seize Venezuela President Nicolás Maduro made clear there was one man in particular who deserved the highest military honor: Chief Warrant Officer 5 Eric Slover.\n\nSlover, an Army special operations pilot, was guiding his MH-47 helicopter to a landing in Caracas when the aircraft was “immediately” fired upon by multiple machine guns at close range, according to the citation that would eventually accompany that honor. The cockpit was hit by 15 armor-piercing rounds, four of which hit Slover in the leg.\n\nSlover maintained control of the helicopter to ensure the safety of the Special Forces soldiers on board as they exited the aircraft to complete the mission.\n\nThe commander told Trump that Slover should receive the Medal of Honor for his actions, according to an official familiar with the matter. Trump was quickly convinced and signaled to the team he was going to do just that, two senior White House officials told CNN.\n\nLess than two weeks later, Slover, who sustained serious injuries during the operation,  stood stoically during the State of the Union address as the recognizable light blue ribbon of the Medal of Honor was secured around his neck, the medal gently placed in the center of the tie on his dress uniform.\n\nThe speed at which the Medal of Honor was approved is highly unusual. Approval for the award can take years due to the intensely bureaucratic process for consideration. There is also sometimes dispute about whether or not to award the medal, a senior White House official said, and in this case, “the president made the decision and the entire team worked together to execute.”\n\nThe award was expedited at the direction of Trump, who was eager to make the announcement at the State of the Union — an address his team had carefully crafted to include inspiring stories to engage the audience, the officials said.\n\nTwo sources familiar with the situation said that all official paperwork and processes were followed for Slover’s medal, but at a much faster timeline, helped along by military leaders’ willingness to support it and make the recommendations in-person. One of the sources acknowledged the process was “blazing fast” but said verbal approvals and briefings pushed things along as the paperwork caught up. An Army spokesperson said Friday that the service is “incredibly proud” of Slover and also said that “all statutory requirements” for the award were followed.\n\nA Trump official tasked with expediting the process for Slover worked furiously in the days following the president’s visit to Fort Bragg to rush the paperwork through, the senior White House officials said. The camera-ready moment in which Trump called for the medal to be given to Slover was written into the first draft of his speech, one of the officials said. However, it wasn’t clear until Tuesday, the day Trump was delivering his address, whether the White House could complete the process in time.\n\n“The White House and the Pentagon were proud to work expeditiously at the President’s direction to ensure this great American hero received the award he most certainly deserves,” White House Press Secretary Karoline Leavitt told CNN.\n\nStill, Slover had to agree to be featured in such a public event. The physical toll of the operation to seize Maduro has been significant; Trump said during the address that Slover was hit “very badly in the leg and hip” by armor-piercing rounds that “shred(ded) his leg.” While Slover stood tall while he was being honored, when Trump’s speech began moving on, Lt. Gen. Jonathan Braga, commander of Joint Special Operations Command, appeared to lean forward and help Slover sit back into a wheelchair sitting behind him.\n\nThe second source familiar with the situation said that his physical recovery pending, Slover wants to continue his career as an operational pilot, though it’s unclear if that will be possible, both physically and as those working with special operations typically take great lengths to avoid being publicly recognized. That calculus undoubtedly weighed on him as a soldier who has spent his career in the shadows, engaged in covert operations, but who was suddenly thrust under a national spotlight.\n\nSlover is “incredibly humble and stoic,” the second source familiar said, and someone who “has never and would never have the expectation of getting this medal for his actions.” The fanfare, they said, is not something he has sought or, frankly, enjoys.\n\n“In his eyes this is what he signed up to do,” the source said. “He’s honored to have received this, but this is just what he would have done whether there was a medal at the end or not.”\n\nThere have been discussions about holding another more private ceremony with Trump and Slover’s family and friends, who traditionally participate in events when a Medal of Honor is awarded, the second source familiar with the situation said. Trump also said Tuesday that 10 other soldiers from the mission will receive awards, though it’s unclear what those will be or when that ceremony would be held.\n\nThe White House is holding a Medal of Honor ceremony on Monday honoring service members from several conflicts, though the listed recipients do not include service members who participated in the recent Venezuela operation.\n\nWhile details of Slover’s service are scarce, likely given the sensitive nature of the units he has been assigned to and his deployments, the awards he has received paint a picture of a challenging career.\n\nSlover enlisted in the Army in 2005, and attended Warrant Officer Candidate School and flight school, becoming a Chinook pilot. Army warrant officers are considered the ultimate experts in their craft, and it’s rare for a soldier to make it to the rank of CW5 as Slover has; only three to four percent of warrant officers rise to that level, the Armysaid in 2023.\n\nA list of his awards provided by Army Special Operations Command shows that he has received two Distinguished Flying Crosses —  one with a valor device and one without — a highly prestigious medal given to service members for heroism in an aerial fight. The “V” for valor device denotes acts of heroism “above what is normally expected,” according to the medal’s criteria, “while engaged in direct combat with an enemy of the United States.”\n\nSlover has also received the Bronze Star with one oak leaf cluster, a Purple Heart, the Meritorious Service Medal with one oak leaf cluster, and more.\n\nOn January 3, he was flying an MH-47 — the Special Operations variant of the CH-47 Chinook helicopter — during the operation in Venezuela, dubbed Operation Absolute Resolve. According tothe official citationfor his Medal of Honor, Slover “skillfully led the helicopter through a dense jungle valley in a mountainous region” and “near insurmountable surface to air threats.”\n\nTrump, telling the story of Slover’s heroism at the State of the Union, said that after landing the helicopter safely, Slover told his co-pilot who was also wounded to take over, saying, “I’m about to pass out.”\n\n“Chief Warrant Officer Five Slover’s heroic actions undoubtedly saved countless America lives and ensured the complete and overwhelming success of the mission,” the citation says. “His gallantry under fire and extraordinary valor are in keeping with the highest traditions of military service and reflect great credit upon himself and the United States Army.”\n\nThe recommendation process for the Medal of Honor, according to flow charts onan Army websiteoutlining the details, involve reviews of the valorous action by the service member’s chain of command, a decorations board which determines if the Medal of Honor is warranted or not, consultation with the service chief and service secretary, and finally sending the packet up to the Secretary of Defense who can recommend the award to the president. The president has to give final approval to award the Medal of Honor.\n\nAs the process was expedited with the leaders’ recommendation being taken straight to the president, in person, Slover still had to agree to participate in such a public moment. The second source familiar with the situation said he agreed after speaking with other leaders about it, roughly a week before the State of the Union.\n\nEvery element came together, and on Tuesday evening in the Capitol, Slover stood with the help of a walker and stared straight ahead as Braga, commander of Joint Special Operations Command, placed the nation’s highest medal for military valor around his neck.\n\nAs the crowd applauded and chanted “USA!” Slover nodded and thanked those around him, showing little emotion aside from a brief moment with his wife, when he smiled down at her and squeezed her hand.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.army.mil/article/263117/afc_warrant_officer_achieves_cw5_rank",
      "text": "said in 2023"
    },
    {
      "url": "https://www.cmohs.org/recipients/eric-a-slover",
      "text": "the official citation"
    },
    {
      "url": "https://www.army.mil/medalofhonor/steps.html",
      "text": "an Army website"
    }
  ],
  "hash": "21ddf172b53a51dd555d52735edfb725e213e00459b51aeed765e48ae355102b",
  "scraped_at": "2026-03-01T07:07:44.423814+00:00"
}