{
  "url": "https://lite.cnn.com/2026/02/18/entertainment/bad-bunny-leading-role-porto-rico",
  "title": "Bad Bunny takes on a leading role in Residente’s directorial debut, ‘Porto Rico’ | CNN",
  "date": "2026-02-19T07:31:06.068063+00:00",
  "authors": [
    "the Associated Press"
  ],
  "text": "Puerto Rican artists Residente andBad Bunnyare teaming up to tell the story of their home in an original historical drama.\n\nRené Pérez Joglar, the Grammy winner known professionally as Residente, will make his directorial debut with “PORTO RICO,” filmmakers and producers said Wednesday. Bad Bunny, the artist born Benito Antonio Martínez Ocasio, is set to lead a starry cast which currently includes Viggo Mortensen, Javier Bardem and Edward Norton.\n\n“I have dreamed of making a film about my country since I was a child. Puerto Rico’s true history has always been surrounded by controversy,” Residente said in a statement. “This film is a reaffirmation of who we are — told with the intensity and honesty that our history deserves.”\n\n“PORTO RICO” is being described as an “epic Caribbean Western and historical drama” inspired by true events. Residente co-wrote the script with Alexander Dinelaris, the Oscar-winning screenwriter behind “Birdman.”\n\nIt will mark the first leading role for Bad Bunny, who has appeared in several supporting roles in movies recently including “Happy Gilmore 2” and “Caught Stealing,” and who recently made waves with his historicSuper Bowl halftime performance, whichhighlighted Puerto Rican culture and history.\n\nThe film has a bevy of power players behind it, including Oscar-winning Mexican filmmaker Alejandro G. Iñárritu, who is executive producing, and backing from Live Nation Entertainment. No details were available about when the film might shoot or be released.\n\nNorton signed on to produce as well, saying in a statement that the film “sits in a tradition of films we deeply love, from ‘The Godfather’ to ‘Gangs of New York,’ that both thrill us with visceral drama and iconic characters and eras while also forcing us to face up to the shadow story under the American narrative of idealism.”\n\nHe added: “Everybody knows what a poet of language and rhythm René is. Now they’re going to see what a visual visionary he is as well. And bringing him and Bad Bunny together to tell the true story of Puerto Rico’s roots is going to be like a flame finding the stick of dynamite that’s been waiting for it.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/entertainment/bad-bunny-nfl-super-bowl-halftime-show",
      "text": "Bad Bunny"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/entertainment/bad-bunny-america-super-bowl-liam-ramos",
      "text": "Super Bowl halftime performance"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/entertainment/bad-bunny-grammy-wins-us-latinos",
      "text": "highlighted Puerto Rican culture and history."
    },
    {
      "url": "https://www.cnn.com/2026/02/18/entertainment/bad-bunny-leading-role-porto-rico",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/entertainment/bad-bunny-leading-role-porto-rico",
      "text": "Cookie Settings"
    }
  ],
  "hash": "226ab51945c76027b026cc5adf8efb97ce8df5c78c4d524a0f70a559a3f79b01",
  "scraped_at": "2026-02-19T07:31:06.068076+00:00"
}