{
  "url": "https://lite.cnn.com/2026/02/19/style/lovestory-cbk-costumes-lotw",
  "title": "Love Story: John F Kennedy Jr & Carolyn Bessette: The costumes are great, actually! | CNN",
  "date": "2026-02-20T07:28:58.141522+00:00",
  "authors": [
    "Rachel Tashjian, CNN"
  ],
  "text": "Source: CNN\n\nDid you know there is a special way to wear a black turtleneck that only one chilly blonde in the history of the world knew about? And that no one will ever figure out how to wear a turtleneck that way again?\n\nOf course, this isn’t true — anyone with a head can look fabulous in a black turtleneck. But the cult of quiet-luxury propriety that has sprung up around the late Carolyn Bessette Kennedy (also known as CBK) protects the fit of her cords and the length of her sweaters like sacred laws.\n\nAlthough an influential dresser in her lifetime, the publicist and wife of John F. Kennedy Jr has acquired near-mythical fashion icon status in the decades since her death. Her style is treated as neither intuitive nor simplistic, even though friends and fashion designers describe those qualities as essential to her appeal. While she may have thrived at throwing on jeans and button-ups or wearing the plainest Yohji Yamamoto dress to an uptown gala, anyone hoping to emulate her must adhere to a strict code of rules or suffer public shaming.\n\nUnsurprisingly, CBK fans were dismayed when photos from producer Ryan Murphy’s drama miniseries “Love Story” — the latest offering from his factory of big, camp recreations of pop cultural traumas, this one focusing on the glitzy tragedy of the two Kennedys, who died in a plane crash in 1999 — appeared online last year.Her hair was the wrong blonde, her Birkin deflated, her coat cheaply fitted. This did not bode well for the show’s pre-Valentine’s Day premiere, and since the first three episodes dropped last Thursday, official reviews of the show have been negative, if perhaps a bit overblown.\n\nBut the costumes? Not so bad. Pretty great, actually!\n\nZero in on a slip dress that Bessette Kennedy (played with ravishing spunk by Sarah Pidgeon) wears on her first date with America’s Prince and premiere himbo people-pleaser, John F. Kennedy, Jr. (Paul Anthony Kelly, who looks the part, which is most of the job). The slip dress was a Carolyn calling card — the perfect mix of casual and sensual. It makes an impact with very little effort. She looks undone, the opposite of how her mother-in-law Jackie attired herself, with her crisp taste for Gucci and Halston, and yet she admonishes Kennedy for showing up 20 minutes late. Her slip dress and his tardiness show us that the two have a very different idea of what constitutes effort — that’s intelligent costuming.\n\nThe team behind “Love Story” didn’t get here immediately, and the CBK stans were right to call out those early images. But after the backlash, Murphy’s team regrouped and hired a new costume designer, Rudy Mance, an alumni of other Murphy trifles including “Feud: Capote vs. The Swans.” Mance consulted author Sunita Kumar Nair, whose fashion biography of Bessette Kennedy has become an encyclopedia for women who parlay CBK authority into minor internet fame. The duo went to great pains to source pieces from the brands and collections Bessette Kennedy wore, including Prada coats and shoes and her favored Levi denim cut. The work paid off (in the first available episodes, at least).\n\nBessette Kennedy was an exacting dresser insofar as she knew what made her feel comfortable. While many of her formal looks present her as bracingly refined, a shield against the unforgiving paparazzi and gossip columns, the show highlights a slovenly streak that heightened her appeal — the unbrushed hair, the wrinkled clothes pulled from a pile on a chair, the ability to make sweatpants look sophisticated.\n\nIn the first episode, she commutes to work in a black turtleneck and cropped capris, hemmed just above the ankle to show off the square-toed shoes that Prada, in the early 1990s, had just turned from unflattering to secretly cool. The outfit shows us that Bessette Kennedy (then just Bessette) had the knowledge of fashion’s latest shifts, if not the budget to blow thousands of dollars at Barneys, and the intelligence to show it off without fanfare.\n\nIn a later episode, she wanders downtown with her maybe-boyfriend, the Calvin Klein underwear model Michael Bergin, wearing a navy sweater and sweatpants. A white shirt with wrinkled collar and cuffs pokes out, suggesting a half-hearted attempt to look a little more put together. These are the narrative details of great costuming; not one-to-one replicas, but looks that capture the spirit, priorities and instincts of the person onscreen.\n\n“The Crown” and the marketing frenzy of red carpet dressing have taught us that the only way to conjure a long-gone figure is to copy their look precisely. Technology and photography have trained us to expectexactitude. “Love Story” does something better.\n\nBessette Kennedy gave no interviews, so the clothes are essential to widening our understanding of who she was, and what happened to her throughout her marriage (at least according to this heavily fictionalized account). She had a natural sense of freedom that, under media pressure, dissipated into something cold and hard, as if putting the most effort into the most pared- back clothes could help her survive.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/06/18/style/carolyn-bessette-kennedy-ryan-murphy",
      "text": "Her hair was the wrong blonde, her Birkin deflated, her coat cheaply fitted"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/style/lovestory-cbk-costumes-lotw",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/style/lovestory-cbk-costumes-lotw",
      "text": "Cookie Settings"
    }
  ],
  "hash": "227179f72af6a18b310c513a09e154e1abe53e95cc4e5c44b8492c1700f14bcb",
  "scraped_at": "2026-02-20T07:28:58.141535+00:00"
}