{
  "url": "https://lite.cnn.com/2026/02/12/asia/bangladesh-election-results-rahman-bnp-win-intl-hnk",
  "title": "Bangladesh election results: Tarique Rahman’s BNP wins big in historic parliamentary vote | CNN",
  "date": "2026-02-13T07:30:49.451097+00:00",
  "authors": [],
  "text": "Source: Reuters\n\nThe Bangladesh Nationalist Party won a landslide parliamentary election on Friday, local TV stations showed, securing a resounding mandate in a pivotal vote that is expected to restore political stability in the South Asian nation.\n\nThe parliamentary election held on Thursday was Bangladesh’s first vote since the2024 Gen Z-driven uprisingthat toppled long‑time premier Sheikh Hasina.\n\nA clear outcome had been seen as crucial for stability in the Muslim-majority country of 175 million after months of deadly anti-Hasina unrest disrupted everyday life and hit major industries, including the apparel sector in the world’s second-largest garment exporter.\n\nIt was also thefirst national electionto follow recent revolts led by the under-30s that have cropped up through the wider region. Nepal is set to hold a vote next month.\n\nOpinion polls had given BNP an edge and the party lived up to the forecasts, with the coalition it dominates winning 209 seats to secure an overwhelming two-thirds majority in the 300-member Jatiya Sangsad, or House of the Nation, Jamuna TV showed.\n\nSoon after it won a majority in the overnight vote-count, the party thanked and congratulated the people and called for special prayers on Friday for the welfare of the country and its people.\n\n“Despite winning the national parliamentary election by a large margin of votes, no celebratory procession or rally shall be organised by BNP,” the party said in a statement and urged people to pray at mosques, temples, churches and pagodas across the country.\n\nThe BNP is led by top prime ministerial contender Tarique Rahman, the 60-year-old son of former Prime Minister Khaleda Zia and former President Ziaur Rahman.\n\nIts campaign promises included financial aid for poor families, a 10-year limit for an individual to remain prime minister, boosting the economy by measures including foreign investments, and anti-corruption policies.\n\nShafiqur Rahman, the head of BNP’s main rival, the Islamist Jamaat-e-Islami, conceded defeat, with his party-led alliance on just 68 seats. Rahman said Jamaat would not engage in the “politics of opposition” for the sake of it. “We will do positive politics,” he told reporters.\n\nThe National Citizen Party (NCP), led by youth activists who were instrumental in toppling Hasina and was a part of the Jamaat-led alliance, won just five of 30 seats it contested.\n\nDespite the landslide result, the election had been seen as Bangladesh’s first truly competitive vote in years. Hasina’s Awami League party, which ruled the country for more than 15 years until her ousting, was barred from contesting.\n\nTurnout appeared on track on Thursday to exceed the 42% recorded in the last election in 2024. Local media reported that more than 60% of registered voters were expected to have cast ballots.\n\nMore than 2,000 candidates - including many independents - were on the ballot, and at least 50 parties contested seats, a national record. Voting in one constituency was postponed after a candidate died.\n\nAlongside the election, a referendum was held on a set of constitutional reforms, including establishing a neutral interim government for election periods, restructuring parliament into a bicameral legislature, increasing women’s representation, strengthening judicial independence and introducing a two-term limit for the prime minister.\n\nThere was no official word on the outcome of the referendum. Leading local newspaper the Daily Star reported that 73% of the nearly 296,000 votes cast in the referendum said ‘Yes’ and the rest said ‘No’.\n\nHasina is in self-imposed exile in long-term ally India, which has frayed ties between Dhaka and New Delhi and opened the window for China to expand its influence in Bangladesh.\n\nIn a statement sent after polling stations closed, Hasina denounced the election as a “carefully planned farce”, held without her party and without real voter participation. She said Awami League supporters had rejected the process.\n\n“We demand the cancellation of this voterless, illegal and unconstitutional election … the removal of the suspension imposed on the activities of the Awami League, and the restoration of the people’s voting rights through the arrangement of a free, fair, and inclusive election under a neutral caretaker government,” she said.\n\nOpponents of Hasina say that elections under her rule were frequently marred by boycotts and intimidation.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/08/06/asia/bangladesh-protests-hasina-resignation-explainer-intl-hnk",
      "text": "2024 Gen Z-driven uprising"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/world/video/bangladesh-election-gen-z-rhea-mogul-hnk-digvid",
      "text": "first national election"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/asia/bangladesh-election-results-rahman-bnp-win-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/asia/bangladesh-election-results-rahman-bnp-win-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2273168d9d49fa7879e9901987cbeb2fdd43fce234c606c96d6de6bff0735359",
  "scraped_at": "2026-02-13T07:30:49.451109+00:00"
}