{
  "url": "https://lite.cnn.com/2026/02/28/entertainment/connor-storrie-snl-hockey-accents",
  "title": "Connor Storrie welcomes Olympic hockey players on ‘SNL’ – from both the US men’s and women’s teams | CNN",
  "date": "2026-03-01T07:06:10.861727+00:00",
  "authors": [
    "Dan Heching",
    "Alli Rosenbloom"
  ],
  "text": "Source: CNN\n\nUS women’s hockey team gold medalists Megan Keller and Hilary Knight skated by some ongoing drama related to the US men’s hockey team when they appeared on the latest episode of “Saturday Night Live.”\n\nThe episode, hosted by “Heated Rivalry” star Connor Storrie, took place days after theUS men’s hockey team won goldat the Milan-Cortina Winter Olympic Games, going on to draw ire for partying with FBI director Kash Patel and subsequently facing backlash for laughing during a call with President Trump after hejokedhe would be “impeached” for not inviting the US women’s hockey team,who also won gold, to the White House.\n\nThe women’s team later declined Trump’s invitation to attend the State of the Union, citing scheduling conflicts, while the men’s team did show up.\n\nStorrie welcomed brothers Jack and Quinn Hughes on the stage first during hisopening monologueon Saturday, with the pair donning their gold medals and some missing teeth.\n\n“We’ve been so busy playing, we haven’t had time to see your show yet,” Jack Hughes said, before his brother chimed in to joke, “It’s about hockey, right?”\n\nKeller and Knight, also donning their gold medals, then walked out on stage after Storrie said he hoped “somehockey players” watched “Rivalry,” winking at the fact that much of the show’saudiencehas been women drawn to the gay romance aspect.\n\n“Don’t worry,” said Keller. “We saw your show.”\n\nKeller and Knight went on to poke fun at the Hughes about how the women were originally supposed to appear on “SNL” alone, but “we thought we’d invite the guys too,” and reminded the audience that the women’s hockey team won gold just “two whole Olympics ago,” after the men mentioned their team last won gold over 40 years ago.\n\nThe appearance by the athletes all appeared to be in good fun, with no mention of the controversy surrounding the men’s team’s reaction to Trump’s remarks.\n\n“My show speaks to people who are not always represented in hockey,” Storrie said at the end of his monologue. “So this is really great to have actual hockey legends here tonight.”\n\nStorrie’s debut appearance on “SNL” was akin to a decisive slap shot on the ice, a milestone he celebrated alongside his “Rivalry” costar Hudson Williams, who made a surprise appearance during a sketch that took place… at the Rockefeller Center ice rink.\n\nThe episode featured moments where Storrie exercised his considerate foreign accent skills, which fans of “Rivalry” — theromantic hockey-set seriesthat has turned Storrie and Williams into the hottest male screen sirens of the moment — already knew quite well. The actor, who portrays surly Russian hockey captain Ilya Rozanov in the show, is in no way, shape or form Russian, and learned to speak the language rather flawlessly in justthree weeks before filming.(This tweetsums up just how much of a quick study he is.)\n\n“Selfishly, I just love Russian language. I love any opportunity to do an accent, learn a new skill, and this had all of it,” he toldOutin November of the role.\n\nAmere nine months ago, Storrie was working as a server at aCulver City, Los Angeles restaurant, and almost got fired the day he found out he landed one of the leads in “Heated Rivalry.”\n\nIt’s a part of Storrie’s story that he touched on during his opening monologue on Saturday, saying that since he was plucked from that restaurant to star on “Rivalry,” his life has “totally changed.”\n\n“I’ve only technically been a professional actor for like, six months now, but on the other hand, I’ve been preparing for this my entire life,” he said. “On one hand, I’m totally surprised and humbled that this is happening to me, and on the other hand, this was my destiny,” he added dramatically.\n\nAside from blowing the lid off of what was previously thought of as permissible with what can be shown onscreen when it comes to gay sex, “Rivalry” has changed the cultural conversation in relation to portrayals of masculinity, consent and the potential for the romance genre in the streaming age.\n\nBefore “Heated Rivalry,” which (of course) has been renewed for a second season, Storrie was probably best known for a small but pivotal role in 2024’s “Joker: Folie a Deux.”\n\nAlong with Williams and their “Heated” costar François Arnaud, he has been just about everywhere recently, from theGrammystoannouncing the Actor Award nominationstoParis Fashion Weektohobnobbing with acclaimed Hollywood directors. And no one is tired yet.\n\nMumford & Sons served as the musical guest during Storrie’s episode of “Saturday Night Live,” with a special appearance by Hozier.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://us.cnn.com/sport/live-news/milan-winter-olympics-results-highlights-medals-02-22-26?post-id=cmlxyjvbx000b356s8onjhi2w",
      "text": "US men’s hockey team won gold"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/sport/video/usa-mens-hockey-team-controversy-locker-room-trump-call-digvid",
      "text": "joked"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/sport/video/usa-womens-hockey-gold-medal-interview-vrtc",
      "text": "who also won gold"
    },
    {
      "url": "https://x.com/latenightercom/status/2027968453118988489",
      "text": "opening monologue"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/health/why-therapists-like-heated-rivalry-wellness",
      "text": "audience"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/health/why-therapists-like-heated-rivalry-wellness",
      "text": "romantic hockey-set series"
    },
    {
      "url": "https://www.teenvogue.com/story/inside-heated-rivalry-the-gay-hockey-romance-series-changing-queer-tv-exclusive#:~:text=Storrie%2C%20a%20Texas,experience%2C%E2%80%9D%20he%20says.",
      "text": "three weeks before filming."
    },
    {
      "url": "https://x.com/Y0URLILAC/status/1994303751394316393?s=20",
      "text": "This tweet"
    },
    {
      "url": "https://www.out.com/gay-tv-shows/heated-rivalry-connor-storrie-hudson-williams-interview",
      "text": "Out"
    },
    {
      "url": "https://people.com/connor-storrie-says-he-almost-got-fired-from-his-job-as-a-waiter-the-day-he-landed-his-heated-rivalry-role-11885458",
      "text": "mere nine months ago"
    },
    {
      "url": "https://secretlosangeles.com/heated-rivalry-connor-storrie-waiter-restaurant/",
      "text": "Culver City, Los Angeles restaurant"
    },
    {
      "url": "https://www.elle.com/culture/celebrities/a70222036/connor-storrie-francois-arnaud-grammys-2026-after-party-photos/",
      "text": "Grammys"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/entertainment/sag-award-nominations-actors#:~:text=Despite%20what%20your%20group%20text%20may%20believe%2C%20the%20return%20of%20Connor%20Storrie%E2%80%99s%20mustache%20is%20not%20the%20biggest%20storyline%20of%20Wednesday%20morning%E2%80%99s%20Actor%20Award%20nominations.",
      "text": "announcing the Actor Award nominations"
    },
    {
      "url": "https://www.vogue.com/article/connor-storrie-and-francois-arnaud-paris-style",
      "text": "Paris Fashion Week"
    },
    {
      "url": "https://www.out.com/celebs/connor-storrie-luca-guadagnino",
      "text": "hobnobbing with acclaimed Hollywood directors"
    }
  ],
  "hash": "22dc55452dc33163465b10bb63b7e6b262b6825cc4ca3a9968d5f56e8df1c119",
  "scraped_at": "2026-03-01T07:06:10.861740+00:00"
}