{
  "url": "https://lite.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
  "title": "King Charles ‘ready to support’ police as they assess claim his brother, Andrew, shared confidential material with Epstein | CNN",
  "date": "2026-02-11T16:41:11.238190+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nKing Charles stands ready to support British police as they assess a report that Andrew Mountbatten-Windsor allegedly shared confidential material with the late sex offender Jeffrey Epstein during the former prince’s role as UK trade envoy.\n\nThe latest tranche of Epstein files released by the US Justice Department, which have sparkedrenewed scrutinyof the disgraced royal, appear to show Mountbatten-Windsor sent confidential material to Epstein in 2010.\n\nGraham Smith, the chief executive of British anti-monarchist group Republic, said Monday he had reported Mountbatten-Windsor to police for “suspected misconduct in public office and breach of official secrets.”\n\nOn Monday, Thames Valley Police told CNN, “We can confirm receipt of this report and are assessing the information in line with our established procedures,” a spokesperson for the police force said.\n\nLater Monday, a spokesperson for Buckingham Palace said King Charles had “made clear, in words and throughunprecedented actions, his profound concern at allegations which continue to come to light in respect of Mr Mountbatten-Windsor’s conduct.”\n\n“While the specific claims in question are for Mr Mountbatten-Windsor to address, if we are approached by Thames Valley Police we stand ready to support them as you would expect,” the spokesperson said.\n\nMountbatten-Windsor has previously denied any wrongdoing over his ties to Epstein. He has not publicly responded to the latest allegations. CNN has contacted him for comment.\n\nThe former prince is among several prominent figures inBritish public lifeto have faced growing backlash in recent days over ties to Epstein.Peter Mandelson, the former UK ambassador to the US, quit the UK’s House of Lords last week after the latest files appeared to show he leaked market-sensitive government information to Epstein in the wake of the 2008 financial crisis.\n\nBritish police raided two properties linked to Mandelsonon Friday as part of an investigation into misconduct in public office. CNN has been unable to contact Mandelson’s representative. Mandelson has previously said he was “wrong to believe (Epstein) following his conviction and to continue my association with him afterwards.”\n\nMountbatten-Windsor became trade envoy in 2001 but stepped down a decade later after coming under fire over his association with Epstein. The former prince said at the time his position was “no longer necessary to the work that I do today and, more importantly, in the future.”\n\nIn October 2010, Epstein emailed the royal asking for details about an upcoming trip to Asia, according to DOJ files. In response, Mountbatten-Windsor sent Epstein a brief itinerary setting out his travel plans for various destinations, including Vietnam, Singapore and Hong Kong.\n\nThen, after the trip concluded, Mountbatten-Windsor forwarded “visit reports” to Epstein, initially sent to the former prince by his then-special adviser Amit Patel. The overseas visit is listed in a financial report published by the royal family.\n\nTrade envoys are not civil servants in the UK, but the role carries a “duty of confidentiality in relation to information received,” a terms of appointment document published by the British parliament in 2023 said.\n\nThis information “may include sensitive, commercial, or political information shared about relevant markets/visits,” the document said. “This duty of confidentiality will continue to apply after the expiry of their term of office.”\n\n“In addition, the Official Secrets Acts 1911 and 1989 will apply,” the document added. It is unclear whether the information Mountbatten-Windsor shared was commercially or politically sensitive.\n\nThe former prince has for years attempted to avoid questions about his links to Epstein. He told theBBC’s Newsnightprogram in 2019 he had gone to New York in 2010, after Epstein was convicted as a sex offender, to break off contact with him.\n\n“I went there with the sole purpose of saying to him that because he had been convicted, it was inappropriate for us to be seen together,” he said.\n\nIn December 2010, Mountbatten-Windsor appears to have sent Epstein what he called a “confidential brief” regarding investment opportunities related to the reconstruction of Afghanistan’s Helmand province, where British troops were operating at the time, DOJ documents show.\n\nThe former prince said in the email to Epstein he would be “very interested in your comments, views or ideas as to whom I could also usefully show this to attract some interest.”\n\nIn another email in December 2009, Mountbatten-Windsor told Epstein he spent a weekend in Paris with an “interesting American family Bank who are after some help in the Middle East; a gap in their geographic coverage.”\n\nLater that evening, Epstein replied, asking “which Middle East country are you strongest.”\n\nThe latest revelations come shortly after Mountbatten-Windsor moved out of his longtimeWindsor home, just outside of London, amid the swirling Epstein scandal.\n\nOn Monday, a Kensington Palace spokesperson said the Prince and Princess of Wales have been “deeply concerned” by thetrove of new documents, without naming Mountbatten-Windsor directly.\n\n“Their thoughts remain focused on the victims,” the spokesperson said.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/world/andrew-virginia-giuffre-photo-intl",
      "text": "renewed scrutiny"
    },
    {
      "url": "https://www.cnn.com/2025/10/17/uk/prince-andrew-gives-up-royal-titles-latam-intl",
      "text": "unprecedented actions"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "British public life"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/europe/peter-mandelson-epstein-ties-britain-intl-latam",
      "text": "Peter Mandelson"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/uk/uk-police-searching-peter-mandelson-linked-properties-intl",
      "text": "British police raided two properties linked to Mandelson"
    },
    {
      "url": "https://www.cnn.com/2019/11/16/uk/prince-andrew-jeffrey-epstein-bbc-interview",
      "text": "BBC’s Newsnight"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/europe/andrew-mountbatten-windsor-moves-royals-epstein-intl-hnk",
      "text": "Windsor home"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/epstein-files-musk-lutnick-branson-emails",
      "text": "trove of new documents"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "22f685793f3a19750ab32ad51c7eac2c2c5232e1bec315b3c955b5a0bea2ac2f",
  "scraped_at": "2026-02-11T16:41:11.238203+00:00"
}