{
  "url": "https://lite.cnn.com/2026/02/12/politics/doj-antitrust-chief-fired",
  "title": "Justice Department’s antitrust chief has been fired, sources say | CNN Politics",
  "date": "2026-02-12T21:29:33.690439+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nGail Slater, who ran the antitrust division for the Justice Department for nearly a year, was forced out by the Trump administration this week, two people familiar with the matter told CNN.\n\nSlater, whosuggested in a post on X Thursdayshe was leaving on her own, had been at odds with Attorney General Pam Bondi and the West Wing for months, the sources said. Her ouster as the antitrust chief was viewed as a long time coming, and it remains to be seen who fills her role on a permanent basis.\n\nBondi issued tepid praise of Slater in a statement Thursday.\n\n“On behalf of the Department of Justice, we thank Gail Slater for her service to the Antitrust Division which works to protect consumers, promote affordability, and expand economic opportunity,” the attorney general said.\n\nAs its name suggests, the Justice Department’s anti-trust division enforces US antitrust laws, pursuing civil or criminal cases against companies with an eye on promoting competition. In recent years, it has pursued cases against Apple andGoogle, and inside the department, Slater was known to be pushing the administration to be aggressive on tech companies, whose leaders often have the ear of Trump.\n\nSen. Elizabeth Warren said in a statement that the ouster “looks like corruption.”\n\n“A small army of MAGA-aligned lawyers and lobbyists have been trying to sell off merger approvals that will increase prices and harm innovation to the highest bidder,” the Massachusetts Democratic said. “Every antitrust case in front of the Trump Justice Department now reeks of double-dealing — Ticketmaster’s stock is already surging. Congress has a responsibility to unearth exactly what happened and hold the Trump administration accountable.”\n\nThe friction between Slater and President Donald Trump’s White House had been clear for months. In December, Trump issued a “full and unconditional pardon” for Oak View Group co-founder Tim Leiweke, who was indicted by his own Justice Department — in a case led by Slater — earlier in 2025.\n\n“As outlined in the indictment, the Defendant rigged a bidding process to benefit his own company and deprived a public university and taxpayers of the benefits of competitive bidding,” Slater said in a statement at the time.\n\nSlater said in her Thursday post on X: “It is with great sadness and abiding hope that I leave my role as AAG for Antitrust today. It was indeed the honor of a lifetime to serve in this role.”\n\nThe anti-trust division is expected to play a critical role in assessing Netflix’s Warner Brothers Discovery’s deal to sell the Warner Bros. studio and HBO to Netflix, which Paramount is trying to stop by appealing straight to shareholders with its own bid. (CNN is owned by Warner Brothers Discovery.)\n\nIn an NBC interview last week, Trump said, “I’ve decided I shouldn’t be involved. The Justice Department will handle it.” But Paramount CEO David Ellisonreturned to the White House last week to meet privately with Trump, two sources familiar with the matter told CNN.\n\nThis story was updated with additional reporting. CNN’s Evan Perez contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/gailaslater/status/2021979193949716727",
      "text": "suggested in a post on X Thursday"
    },
    {
      "url": "https://www.cnn.com/2025/09/02/tech/google-antitrust-ruling-chrome-android",
      "text": "Google"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/media/david-ellison-trump-paramount-netflix-wbd",
      "text": "returned to the White House last week to meet privately with Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/doj-antitrust-chief-fired",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/doj-antitrust-chief-fired",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2342bcd3da2155fda1e9121108374ebb4bd80aad9f98811b9b7a5f2572af2ae1",
  "scraped_at": "2026-02-12T21:29:33.690452+00:00"
}