{
  "url": "https://lite.cnn.com/2026/02/11/entertainment/james-van-der-beek-death",
  "title": "James Van Der Beek, ‘Dawson’s Creek’ star, has died | CNN",
  "date": "2026-02-12T21:30:22.335007+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nJames Van Der Beek, the soft-eyed actor whose boyish good looks and earnestness landed him the leading role in ’90s teen drama “Dawson’s Creek” and catapulted him to stardom, has died. He was 48.\n\nThe actor died Wednesday, according to a statement posted to hisverified Instagram.\n\n“He met his final days with courage, faith, and grace,” the statement said. “There is much to share regarding his wishes, love for humanity and the sacredness of time. Those days will come. For now we ask for peaceful privacy as we grieve our loving husband, father, son, brother, and friend.”\n\nHis representative Whitney Tancred also confirmed the news when reached by CNN.\n\nVan Der Beekannounced in November 2024that he was living with stage 3 colorectal cancer.\n\nFollowing his death, Van Der Beek’s wife Kimberly, with whom he shared six children, shared a link via social media to aGoFundMe campaign, asking for support because Van Der Beek’s illness left the family in “financial strain.”\n\n“The costs of James’s medical care and the extended fight against cancer have left the family out of funds,” the campaign page states. “They are working hard to stay in their home and to ensure the children can continue their education and maintain some stability during this incredibly difficult time.”\n\nBorn in 1977 in Cheshire, Connecticut, Van Der Beek was the eldest of three children. He caught the acting bug in middle school, and when he was 15, he told his mother he wanted to audition professionally.\n\n“She didn’t hold me back,” he oncerecounted. “She took me to NYC, and she walked me through it.”\n\nSoon after, he was cast in an off-Broadway play, “Finding the Sun,” and later won an academic scholarship to Drew University in New Jersey.\n\nMore roles followed, including the role of Rick Sanford in the 1995 film “Angus,” followed by a bit part in “I Love You, I Love You Not” starring Claire Danes.\n\nAfter taking some time off from college to travel, Van Der Beek auditioned for the starring role in “Dawson’s Creek,” which would make him a star.\n\nSpeaking to Larry King, Van Der Beek once explained how he initially wrote off the prospect of playing Dawson Leery, an impressionable New England teen and film freak coming of age alongside his childhood friends. The characters were written as 15 year olds. When the actor auditioned, he was already 20.\n\n“Then they called me back and wanted to fly me out here to test in LA, at which point I read the script and really loved it,” he said, going on to recount how he read for various studio heads along with the creator of “Dawson’s Creek,” Kevin Williamson.\n\nVan Der Beek explained that he later found out that certain executives didn’t want him for the role, but that Williamson “had to put his foot down and say, ‘Listen, I created this guy, I know this guy, this kid is this guy!’”\n\nThe nighttime WB teen soap, which ran for six seasons from 1998 until 2003, also starred Katie Holmes, Joshua Jackson and Michelle Williams, and helped launch their careers.\n\nVan Der Beek also found success on the big screen in 1999’s “Varsity Blues,” 2001’s “Texas Rangers” and “The Rules of Attraction” in 2002. He was also a contestant on “Dancing with the Stars” for Season 28 in 2019.\n\nThe “Dawson’s” cast stayed close over the years, last coming together for a fundraising effort in New York City in the fall.\n\nVan Der Beek had been scheduled to appear alongside his castmates at that“Dawson’s Creek” reunion, but had to to pull out of the event due to a stomach bug.\n\nHe appeared virtually, thanking Williams, who organized the event – which benefitted the nonprofit F Cancer and Van Der Beek – and the entire cast.\n\n“I have been looking forward to this night for months and months ever since my angel Michelle Williams said she was putting it together,” Van Der Beek said at the time, as seen in a videoshared on social media by the podcast “Back To You, Bob!”“I can’t believe I’m not there.”\n\nOn Wednesday, costar Busy Philipps, who appeared at the reunion, wrote Van Der Beek was “one in a billion and he will be forever missed.”\n\n“I am just so so sad,” she said. “He was my friend and i loved him and i’m so grateful for our friendship all these years.”\n\nIn recent months, Van Der Beek was open about the financial burden his treatment had put on his family. He participated in a live auction in December that featuredmemorabiliafrom his “Dawson’s Creek” and “Varsity Blues” roles.\n\nThe tributes for Van Der Beek quickly poured in Wednesday following the news of his passing.\n\nHolmes mourned Van Der Beek in a poignant, handwritten letter posted to herInstagramaccount, praising her “Dawson’s Creek” co-star’s “compassion” and “selflessness.”\n\n“I formed some words with a heavy heart. This is a lot to process. I am so grateful to have shared a piece of James’ journey,” Holmes said in the post, alongside a photo of the letter, which was addressed to the late actor.\n\n“Thank you. To share space with your imagination is sacred - breathing the same air in the land of make believe,” she wrote, describing memories of laughter, “conversations about life,” and “adventures of a unique youth.”\n\n“Dancing With the Stars” pro Emma Slater, who competed as Van Der Beek’s partner on their season, wrote in the comments of the Instagram post announcing his death that he “is and will always be family to me.”\n\n“Love you so much James. The man that you are, you can be proud of,” she wrote. “So grateful that I got to be there to say goodbye to you.”\n\nActress Stacy Kiebler shared a recent photo of herself with Van Der Beek onher Instagram page, writing a heartfelt tribute to the man who she called “a gift” and recalling her visit with him during his “final days.”\n\n“In these past days, you taught me more about being present than any book ever could,” she wrote. “Your presence was a bright light in my life, and in so many others. And while your physical body may no longer be here, I know your spirit is doing big things. I feel it already.”\n\nKevin Smith remembered Van Der Beek by recalling the times he called upon the actor to appear in his cult films, including 2001’s “Jay and Silent Bob Strike Back” and 2019’s “Jay and Silent Bob Reboot.”\n\n“James didn’t just lend us his name and celebrity, he came to PLAY, making memorable moments in forgettable films,” Smith wrote onhis Instagram page. “One of the best things you can do for a person is dream their dreams with or for them - so I’ll always remember #jamesvanderbeek as the generous, funny, warm, self-effacing superstar who twice helped me make my dreams come true, 18 years apart.”\n\nVan Der Beek had remained active on his social media until relatively recently, sharing variousobservations on his lifeand how special and important his role as a father was to him.\n\nOn his 48th birthday last March, Van Der Beekshared a candid testimonial videoand said that while becoming a father was the “ultimate” for him in terms of how he defined himself, coming “nose to nose with death” had forced him to challenge ideals he’d previously held.\n\n“If I am just a too-skinny weak guy alone in an apartment with cancer, what am I? And I meditated and the answer came through – I am worthy of God‘s love, simply because I exist,” he said. “And if I’m worthy of God‘s love, shouldn’t I also be worthy of my own? And the same is true for you.”\n\nThis story has been updated with additional information.\n\nCNN’s Alli Rosenbloom contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.instagram.com/p/DUoR_x4EkTm/?igsh=eG1lcGMxYmZvNWx4",
      "text": "verified Instagram"
    },
    {
      "url": "https://www.cnn.com/2024/11/03/entertainment/james-van-der-beek-colorectal-cancer",
      "text": "announced in November 2024"
    },
    {
      "url": "https://www.gofundme.com/f/support-for-james-van-der-beeks-family?attribution_id=sl:1188b5a8-9054-4800-ae93-a99d4b0ade23&lang=en_US&ts=1770839009&utm_campaign=man_sharesheet_dash&utm_content=amp17_tb&utm_medium=customer&utm_source=copy_link",
      "text": "GoFundMe campaign"
    },
    {
      "url": "https://www.tiktok.com/@vanderjames/video/7341051052986240298?lang=en",
      "text": "recounted"
    },
    {
      "url": "https://www.youtube.com/watch?v=Hjjb-P5W4EU",
      "text": "Speaking to Larry King"
    },
    {
      "url": "https://www.cnn.com/2025/09/23/entertainment/james-van-der-beek-dawsons-creek-reunion",
      "text": "“Dawson’s Creek” reunion"
    },
    {
      "url": "https://www.instagram.com/backtoyoubobpod/?hl=en",
      "text": "shared on social media by the podcast “Back To You, Bob!”"
    },
    {
      "url": "https://www.cnn.com/2025/11/13/entertainment/james-van-de-beek-auction",
      "text": "memorabilia"
    },
    {
      "url": "https://www.instagram.com/p/DUplHUFgemh/?hl=en",
      "text": "Instagram"
    },
    {
      "url": "https://www.instagram.com/p/DUoWzv7jyfu/",
      "text": "her Instagram page"
    },
    {
      "url": "https://www.instagram.com/p/DUoVReOEkBW/",
      "text": "his Instagram page"
    },
    {
      "url": "https://www.instagram.com/p/DTjOhl4jl_f/?hl=en",
      "text": "observations on his life"
    },
    {
      "url": "https://www.instagram.com/vanderjames/reel/DG9aMcDOnrJ/?hl=en",
      "text": "shared a candid testimonial video"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/entertainment/james-van-der-beek-death",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/entertainment/james-van-der-beek-death",
      "text": "Cookie Settings"
    }
  ],
  "hash": "23a48563467c288c00a5517132dd4bc9220dcf00344b880fc56ba4d2ac3c5f33",
  "scraped_at": "2026-02-12T21:30:22.335021+00:00"
}