{
  "url": "https://lite.cnn.com/2026/02/26/politics/trump-mamdani-meet-washington-white-house",
  "title": "Mamdani shows up to Trump meeting with a major New York City housing pitch — and props | CNN Politics",
  "date": "2026-02-28T07:00:48.977637+00:00",
  "authors": [
    "Kaitlan Collins",
    "Katherine Koretski"
  ],
  "text": "Source: CNN\n\nNew York City Mayor Zohran Mamdani arrived at the White House Thursday with a game plan in mind and props in hand. During his last sit down with President Donald Trump in November, the two leaders ended their meeting by agreeing on at least one thing: “Let’s build stuff together.”\n\nGiven the president’s nostalgia for construction and development in his beloved hometown, Mamdani brought visual elements to help make his case for the biggest federal investment in housing in 50 years, according to a person familiar with the meeting. That pitch included a project with 12,000 units, Joe Calvello, chief spokesperson for the mayor, told CNN.\n\nMamdani also brought along a copy of the front page of the New York Daily News from 1975 with former President Gerald Ford’s face plastered across the front and the headline: “Ford to City: Drop Dead.” He had created a mock-up of another version of the same front page, this one bearing Trump’s face and the headline: “Trump to City: Let’s Build.”\n\nThe mayor wanted to show Trump a visual demonstration of what it looks like when the federal government ignores the biggest city in the country — and what it could look like if they didn’t, the source said.\n\nThe president was enthusiastic about the idea, according to Calvello. Trump was later seen grinning in an image that Mamdani posted to social media with both papers.\n\nDuring the meeting, Mamdani also brought up ICE detaining Columbia student Elmina Aghayeva, who is from Azerbaijan, after federal immigration agents allegedly used deception to gain entry into a campus residential building. He provided Trump and chief of staff Susie Wiles with a list of other students whose cases he wanted them to also consider dismissing.\n\nTrump phoned Mamdani shortly after he left the White House to inform him Aghayeva had been released.\n\nCNN has reached out to the White House. The student later posted on social media that she’d been released.\n\nTrump had mentioned the mayor in his State of the Union address, calling him a “nice guy.” Mamdani responded during a Wednesday press conference, saying that whenever the two speak, it always focuses on how to keep the city moving forward. Calvello said the meeting was scheduled prior to Trump’s State of the Union address on Tuesday.\n\nThursday’s meeting was not announced in advance by either leaders’ office, but Trump had asked Mamdani to come back with big ideas following their first meeting in November, Calvello said.\n\nCNN had reported earlier in the day that the two were set to meet, according to two people familiar with the plans, and that they expected to discuss housing, according to one of those people.\n\nThe New York Postfirst reportedthat Mamdani was traveling to Washington.\n\nDuring their last meeting, Trumpheaped praise on Mamdani, suggesting he and the man he often falsely referred to as a “communist” during the mayoral campaign actually had quite a bit in common. The two talked real estate, debated complicated zoning code and mulled over how to get a utility giant to bring down electricity rates, among other topics.\n\nThis headline and story have been updated with additional developments.\n\nGloria Pazmino contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://nypost.com/2026/02/26/us-news/nyc-ny-politics-live-updates-on-zohran-mamdani-governors-race-more/",
      "text": "first reported"
    },
    {
      "url": "https://www.cnn.com/2025/11/23/politics/trump-mamdani-meeting-immigration-details-discussion",
      "text": "heaped praise on Mamdani"
    }
  ],
  "hash": "24323059c46b301432a4886accd429363d888e4b57b5602d6ef507fe5c4f43db",
  "scraped_at": "2026-02-28T07:00:48.977650+00:00"
}