{
  "url": "https://lite.cnn.com/2026/02/14/politics/white-house-ballroom-rendering-east-wing",
  "title": "Architect submits most-detailed renderings so far for White House ballroom | CNN Politics",
  "date": "2026-02-15T07:10:54.464741+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe most-detailed renderings yet of President Donald Trump’sWhite House ballroomproject were briefly made available Friday, showing the massive scale of the planned 89,000-square-foot space.\n\nThe renderings from Shalom Baranes Associates — which were posted by the National Capital Planning Commission on its website and then swiftly taken down — show the new East Wing could span approximately one street block, significantly longer than the West Wing. It also appears to be more than half the length of the Treasury Building, which it would be next to.\n\nCNN has reached out to the NCPC, the planning agency for federal land that must approve the project; the architecture firm; and the White House regarding why the proposal was removed from the website and for additional comment.\n\nThe project is facing a legal challenge from the nation’s top historical preservation group, with a federaljudge expressing deep skepticismlast month over Trump’s authority to construct the ballroom without express authorization from Congress. Yet, construction is moving ahead, with Trump claiming earlier this week that theproject is ahead of scheduleand within budget. The White House has said the ballroom would beprivately funded.\n\n“When completed, it will be the finest Ballroom ever built anywhere in the World, one that has been sought by Presidents for over 150 years — and now they are getting THE BEST!” Trump posted on Truth Social, adding that future presidential inaugurations — which are traditionally held in the US Capitol — could be held in the ballroom.\n\nThe National Capital Planning Commission is set to meet next on March 5 to discuss the proposal. Trump has appointed loyalists to the NCPC, as well as to theCommission of Fine Arts, the other organization that must review the ballroom plans.\n\nDemolition of the East Wingbegan in October, making way for Trump’s 15-year ambition to construct an event space on the White House grounds that expands the building’s entertaining capacity — but that also resemblesthe gilded spacesof his private clubs.\n\nThe most recent estimate for the cost of the ballroom is $400 million. Private donors for the project include prominent companies, such as Apple, Amazon, Lockheed Martin, Microsoft, Google, Coinbase, Comcast and Meta.\n\nTheWhite House hiredShalom Baranes Associates as the new architect for the ballroom construction in December, with sources previously telling CNN  there were disputes between the president and the architect originally contracted for the project.\n\nThe expansion will feature a ballroom of approximately 22,000 square feet, which can accommodate 1,000 seated guests, and the overall size will be roughly 89,000 square feet, the new architecttold the NCPClast month.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/politics/east-wing-ballroom-national-capital-planning-commission-trump",
      "text": "White House ballroom"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/judge-skeptical-white-house-ballroom-trump",
      "text": "judge expressing deep skepticism"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-epstein-files-02-10-26?post-id=cmlh02xnv00003b64hfed6p54",
      "text": "project is ahead of schedule"
    },
    {
      "url": "https://www.cnn.com/2025/10/23/politics/ballroom-donors-white-house-trump",
      "text": "privately funded"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/politics/ballroom-commission-fine-arts-trump",
      "text": "Commission of Fine Arts"
    },
    {
      "url": "https://www.cnn.com/2025/10/20/politics/white-house-east-wing-ballroom-construction",
      "text": "began in October"
    },
    {
      "url": "https://www.cnn.com/2025/03/16/politics/oval-office-gold-decor-trump",
      "text": "the gilded spaces"
    },
    {
      "url": "https://www.cnn.com/2025/12/04/politics/ballroom-trump-architect-white-house",
      "text": "White House hired"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/politics/east-wing-plans-ncpc-west-wing-colonnade",
      "text": "told the NCPC"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/white-house-ballroom-rendering-east-wing",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/politics/white-house-ballroom-rendering-east-wing",
      "text": "Cookie Settings"
    }
  ],
  "hash": "248d0d72121bb585e460da384d10ae66b2220d2d385b13ab7bb9adc5087257a2",
  "scraped_at": "2026-02-15T07:10:54.464753+00:00"
}