{
  "url": "https://lite.cnn.com/2026/02/18/politics/carter-camacho-man-capitol-shotgun-court-appearance",
  "title": "Man accused of charging Capitol with shotgun said he wanted to speak to member of Congress, prosecutors say | CNN Politics",
  "date": "2026-02-19T07:31:08.133103+00:00",
  "authors": [
    "Holmes Lybrand, CNN"
  ],
  "text": "Source: CNN\n\nThe 18-year-old accused of running up to the US Capitol with a loaded shotgun on Tuesday told officers he wanted to talk to a member of Congress, according to the criminal complaint filed against him.\n\nThe man from Georgia, Carter Camacho, made his initial appearance in federal court Wednesday on a charge of unlawfully possessing a firearm on US Capitol grounds. Camacho did not enter a plea and will remain behind bars while awaiting a detention hearing in early March.\n\nThe defendant appeared in court wearing the same military fatigues he was arrested in on Tuesday, when prosecutors say a Capitol Police officer saw the shotgun he was carrying and ordered him to drop the weapon and get down on the ground.\n\nThe criminal complaint against Camacho does not shed light on his direct intentions but says that when asked by Capitol Police, he said “he was just there to talk to a Member of Congress.”\n\nProsecutors say images included in the court documents show Camacho running up to the Capitol with the shotgun in both hands before being stopped by Capitol Police.\n\nAccording to the complaint, as Camacho approached the Capitol, an officer asked him what he was carrying. Camacho held up the shotgun in his right hand. He was then ordered to lie on the ground and “immediately complied,” the complaint says.\n\n“The shotgun was loaded with seven rounds in the tube and one in the chamber,” the complaint states, noting that “the safety was off” and “an additional 17 rounds of ammunition were located in a carrier attached to the stock of the shotgun.”\n\nCamacho was not on Capitol Police’s radar before they encountered him on the steps of the Capitol, the law enforcement agency said.\n\nIn addition to the apparent body armor he was wearing, a gas mask and Kevlar helmet were found in the car he drove and parked nearby, according to Capitol Police. A fixed-blade knife was also located 40 feet from the car and in the path Camacho took to the Capitol, they said.\n\nThe 18-year-old said in court that he will be in his second semester in college. Sporting a narrow beard, Camacho sat rigid during the hearing, nodding along as the federal judge informed him of his rights, answering “OK” and “yes, your honor” when asked if he understood.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/carter-camacho-man-capitol-shotgun-court-appearance",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/politics/carter-camacho-man-capitol-shotgun-court-appearance",
      "text": "Cookie Settings"
    }
  ],
  "hash": "24a06d9a3bb7e5ef3a403cd9af136e3f3d9c1b131f13e9510df9e6eb7aa0e595",
  "scraped_at": "2026-02-19T07:31:08.133116+00:00"
}