{
  "url": "https://lite.cnn.com/2026/02/21/politics/tariffs-ruling-supreme-court-trump-gop",
  "title": "Supreme Court gives Trump and the rest of the GOP a political gift | CNN Politics",
  "date": "2026-02-22T07:09:26.507169+00:00",
  "authors": [
    "Analysis by Aaron Blake, CNN"
  ],
  "text": "Source: CNN\n\nThe Supreme Court on Friday dealt President Donald Trump perhaps the most significant rebuke of his second term. The justices, including two of the president’s appointees,struck down Trump’s signature economic policy: his global tariffs.\n\nIn the long run, the court might have saved him from himself — at least politically.\n\nSome Republicans are outright praising the decision, and you can bet more are happy behind the scenes.\n\nThat’s because, while the decision is clearly a major setback for Trump’s agenda, it also strips him of tools that seemed to cause short-term economic damage to the country, and that wereclearlydoing short-term political damage to Trump’s party.\n\nThis is not the end of the tariffs story. Trump quickly signaled he’d launch 10% global tariffs under a different authority (which he said Saturday he wasupping to 15%). He even claimed on Friday that the Supreme Court’s decision had actually made his ability to levy trade penalties “stronger,” somehow.\n\nBut that’snot actually true. Trump’s tariff powers have been significantly curtailed. And while Republicans have been happy to let him try to do things on his own, even when those things were powers delegated to Congress by the Constitution, this setback could also lead to some soul-searching in the GOP about whether to continue entertaining Trump’s trade gambits.\n\nWhether any of them seize on this apparent opportunity to deescalate is the big question.\n\nIt was fortuitous that the Supreme Court’s decision came Friday. Just 90 minutes before it landed, the Bureau of Economic Analysis announced the gross domestic product had grown at just a 1.4% annualized rate in the fourth quarter. That made 2025 the second-worst year for GDP growth since 2016.\n\nLast year was alsoone of the weakest jobs yearsin decades. And there is, of course, the inflation that finally dropped a bit in January butremains stubborn.\n\nIn other words, the stock market aside, the economy isn’t doing great.\n\nIt’s not clear how much the stagnancy is due to tariffs, specifically. But the uncertainty surrounding them and the extra costs they’ve created have clearly put a damper on an economic picture that wasn’t great to begin with.\n\nAt the very least, they gave Americans a reason to blame Trump for economic hardships. Trump voluntarily took ownership of a struggling economy, using a method that economists widely predicted would cause more problems, at least in the near term.\n\nIt’s not difficult to see why that cost Trump and the GOP. And cost them it did.\n\nSince Trump announced the global tariffs back on April 2, his net economic approval rating in Nate Silver’s averages hasgone from plus-6 to minus-12.\n\nAnd a CNN poll last month showed Americansdisapproved of Trump on tariffs, 62%-37%. Even 25% of Republican-leaning voters disapproved.\n\nIn an often-confusing press conference Friday afternoon, Trump pointed to how Justice Brett M. Kavanaugh’s dissent suggested Trump could simply move on to different tariff authorities.\n\nAnd there aresome available. Trump quickly seized on one of them, announcing the 10% global tariffs under Section 122 of the Trade Act of 1974.\n\n“Now I’ll go the way I could have gone originally, which is even stronger than our original choice,” Trump claimed.\n\nBut that’s not true.\n\nWhile there are multiple options available, there’s a reason Trump chose the initial path he did. If the court permitted him to wield tariffs under emergency authority, it would have given him much greater flexibility to quickly implement huge tariffs and make changes — often to punish or cajole other countries.\n\nAbout the only limit was that Congress could vote to invalidate the emergencies. But vocal opposition to the tariffs didn’t come close to hitting a veto-proof majority.\n\nBy contrast, Section 122 limits tariffs to 15% and to a period of 150 days — after which Congress needs to extend them. Given majorities of both chambers have voted against Trump’s tariffs recently, that seems unlikely.\n\nAnd it’s not even clear Trump can use this section, given it requires some kind ofinternational payments problem.\n\nOther tariff authorities require more of a process before the tariffs can be implemented.\n\nIndeed, Chief Justice John Roberts in a footnote directly took issue with Kavanaugh’s claim.\n\n“The cited statutes contain various combinations of procedural prerequisites, required agency determinations, and limits on the duration, amount, and scope of the tariffs they authorize,” Roberts said.\n\nTrump has pitched tariffs as revitalizing American manufacturing and giving him great leverage to craft trade deals with other countries. But the shorter shelf life and lower ceiling under Section 122 and more extensive processes involved in the alternatives means he has to confront limitations he wouldn’t have otherwise. And other countries will know he faces those restrictions, lessening his leverage.\n\nIt’ll be interesting to see if Trump decides it’s even worth it to try to truly go big on tariffs again, given those constraints.\n\nIt will also be interesting to see if this might embolden the many tariff-skeptical but quiet congressional Republicans who want to turn the page on this chapter.\n\nMany Republicans have spent the last year holding their noses (and tongues) as Trump imposed tariffs. Those tariffs, after all, ran afoul of the GOP’s longstanding attempts to brand itself as the party of free markets and free trade.\n\nBut the ruling is a major setback for Trump’s go-it-alone approach that could imperil his other efforts. In his concurrence, Justice Neil Gorsuch seemed to plead with Congress to start handling these matters with legislation.\n\nAnd we’re now in a midterm election year, when the potential cost of these tariffs looms large. Even before the Supreme Court’s decision to strike down the first round of tariffs, we started to see somesigns of waning patiencewith this portion of Trump’s agenda. Some of these Republicans might reason they gave Trump a chance to make it work, and now it’s time to move on.\n\nIndeed, on Friday we saw relatively few Republicans criticize the court like Trump did.\n\nThat doesn’t mean they’re going to suddenly break with Trump en masse on this subject. And Trump is a proud man who surely doesn’t want to be seen as capitulating to the Supreme Court or pressure from his party.\n\nBut if he does keep trying to go big on tariffs, he could be looking a (political) gift horse in the mouth.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26",
      "text": "struck down Trump’s signature economic policy: his global tariffs"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-21-26?post-id=cmlwjccny000m3b6slgkq44f8",
      "text": "upping to 15%"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26#cmlva9fnh00003b6rmtvzc61j",
      "text": "not actually true"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/economy/us-jobs-report-final-december",
      "text": "one of the weakest jobs years"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/economy/us-inflation-cpi-consumer-prices-january",
      "text": "remains stubborn"
    },
    {
      "url": "https://www.natesilver.net/p/trump-approval-ratings-nate-silver-bulletin",
      "text": "gone from plus-6 to minus-12"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/politics/trump-economy-first-year-cnn-poll",
      "text": "disapproved of Trump on tariffs, 62%-37%"
    },
    {
      "url": "https://www.cnn.com/2025/05/31/economy/trump-tariff-alternatives",
      "text": "some available"
    },
    {
      "url": "https://www.law.cornell.edu/uscode/text/19/2132",
      "text": "international payments problem"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/republicans-congress-trump-legislative-branch",
      "text": "signs of waning patience"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/tariffs-ruling-supreme-court-trump-gop",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/politics/tariffs-ruling-supreme-court-trump-gop",
      "text": "Cookie Settings"
    }
  ],
  "hash": "24d368d2fa44d60e2feae45d1afa5e9398f017d0e10c645f8404e8a96e68301d",
  "scraped_at": "2026-02-22T07:09:26.507186+00:00"
}