{
  "url": "https://lite.cnn.com/2026/02/19/investing/oil-gold-prices-us-iran-tensions",
  "title": "Oil prices jump and gold hits $5,000 as tensions ramp up between Iran and the US | CNN Business",
  "date": "2026-02-20T07:28:25.865132+00:00",
  "authors": [
    "John Towfighi, CNN"
  ],
  "text": "Source: CNN\n\nOil prices jumped Thursday to their highest level in nearly seven months and investors snapped up safe havens like gold, as tensions between the United States and Iran continue to flare.\n\nBrent crude, the global benchmark, rose 1.86%, to $71.66 per barrel. US crude rose 1.9%, to $66.43 per barrel. Oil prices extended gains after rising more than 4% Wednesday and posting their biggest single-day jump since October.\n\nGold, usually considered a haven amid uncertainty, rose 2% Wednesday and reclaimed $5,000 a troy ounce. Gold prices wavered and rose 0.2% Thursday.\n\nUS and Iranian envoys met inGenevain recent days for negotiations on Iran’s nuclear program. US Vice President JD Vance on Tuesday said Iranian negotiators did not acknowledge some of President Donald Trump’s “red lines” in negotiations.\n\nThe negotiations come as the United States has moved military assets closer to the Middle East. The prospect of conflict in Iran has stoked nerves about potential disruptions to the global oil supply and a corresponding surge in oil prices.\n\n“The renewed geopolitical tension between the US and Iran is now clearly feeding into prices,” Daniela Hathorn, senior market analyst at Capital.com, said in a note.\n\nGold in recent weeks has tradedmore like a meme stock than a safe haven, with enormous volatility and swings in prices. But the rising tensions in the Middle East sparked a fresh bid for haven assets, lifting the metal’s price above the $5,000 threshold.\n\nWhen tensions are brewing between the United States and Iran, the spotlight turns to theStrait of Hormuz. The narrow waterway off the coast of Iran is a critical chokepoint for the flow of the global oil supply.\n\nAbout 20 million barrels of oil flow through the strait every day, according to the US Energy Information Administration, which is equivalent to 20% of global oil consumption.\n\n“The latest move [in oil prices] signals a market strengthening an already notable geopolitical risk premium as the world’s most important oil artery once again sits within striking distance of a conflict,” Ole Hansen, head of commodity strategy at Saxo Bank, said in a note.\n\nIran in recent days said itpartially closed the Strait of Hormuzfor planned naval exercises, according to Iranian media.\n\nMarkets tend to shrug off geopolitical tensions. However, that dynamic begins to shift when geopolitical conflict can directly impact the global oil market, which influences consumer prices and business decisions across the globe.\n\nVenezuela, for example, is not a significant enough player in the global oil market for theUS’ capture of Nicolás Maduroto cause market jitters. But investors begin to grow wary with Iran, due to its proximity to the key chokepoint for the global market.\n\n“In energy markets, probabilities matter, especially when the potential disruption involves a major oil producer and a critical global transit route,” Hathorn at Capital.com said.\n\n“Oil markets are starting to price in higher risk as Iran remains a major producer, and more importantly, sits at the heart of the Strait of Hormuz,” she said. “Even limited disruption or credible threats to shipping lanes could cause an immediate supply shock.”\n\nThe Strait of Hormuz is key to Iran’s oil exports, and disruption to the flow of oil would hamper Iran’s exporting business in addition to countries like China that source much of their oil from Iran.\n\nThe prospect of conflict in Iran raises fears about shocks to oil supply, which could send prices soaring. Higher oil prices can raise consumer prices and contribute to inflation.\n\n“More immediately, strikes on Iran would risk causing oil prices to jump and threaten to boost inflation in much of the world, reducing the pace or number of interest rate cuts by major central banks,” analysts at Capital Economics wrote in a note.\n\nUS stocks ended the day lower Thursday. The Dow fell 268 points, or 0.54%. The S&P 500 fell 0.28%. The tech-heavy Nasdaq Composite dropped 0.31%.\n\n“Given that inflation and affordability are front and center for the White House right now, we’d have to think that protecting the flow of oil through the Strait of Hormuz is a priority, meaning that the priority is a diplomatic solution, and if that is not possible, then a military plan that protects the flow of oil as much as possible,” Dennis Follmer, chief investment officer at Montis Financial, said in a note.\n\nWhen conflict between Israel and Iran flared in June and the United States carried outstrikes on Iran nuclear sites, oil prices jumped higher. Similarly, there were fears about Iran moving to close the Strait of Hormuz – but they never materialized. After the US’ strikes and as conflict settled, oil prices turned lower.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/world/video/geneva-diplomatic-talks-ldn-digvid-vrtc",
      "text": "Geneva"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-iran-talks-02-17-26?post-id=cmlr27zqc00003b64sk8mhonx",
      "text": "red lines"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/markets/gold-prices-meme-stocks",
      "text": "more like a meme stock than a safe haven"
    },
    {
      "url": "https://www.cnn.com/2025/06/23/business/strait-of-hormuz-iran-israel-explainer-intl-hnk",
      "text": "Strait of Hormuz"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-iran-talks-02-17-26?post-id=cmlqfx1qp00143b6nxe9oivvk",
      "text": "partially closed the Strait of Hormuz"
    },
    {
      "url": "https://www.cnn.com/world/live-news/venezuela-explosions-caracas-intl-hnk-01-03-26",
      "text": "US’ capture of Nicolás Maduro"
    },
    {
      "url": "https://www.cnn.com/2025/06/21/middleeast/nuclear-sites-iran-us-bombs-wwk-intl",
      "text": "strikes on Iran nuclear sites"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/investing/oil-gold-prices-us-iran-tensions",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/investing/oil-gold-prices-us-iran-tensions",
      "text": "Cookie Settings"
    }
  ],
  "hash": "257b50e9ba9f0e20d22ea03cda994ec0e0edfbcf76c22248d843ab81cadf69e9",
  "scraped_at": "2026-02-20T07:28:25.865145+00:00"
}