{
  "url": "https://lite.cnn.com/2026/02/19/us/immigration-doctors-ice-health-care",
  "title": "The immigration crackdown is impacting health care across the nation, doctors warn | CNN",
  "date": "2026-02-20T07:29:06.218444+00:00",
  "authors": [
    "Lauren Mascarenhas, CNN"
  ],
  "text": "Source: CNN\n\nAs the Trump administration continues its immigration crackdown across the US, health care providers warn the impact of federal agents in health care settings – and the looming threat of immigration enforcement they’ve instilled nationwide – is presenting a barrier to care that could have a lasting impact on the health of communities.\n\nWith many people unable or afraid to access care, some providers say they are seeing a decline in patient numbers they haven’t seen since the Covid-19 pandemic – this time providing care while potentially dealing with federal agents in tactical gear.\n\nDoctors are already seeing the impact on appointments, vaccination numbers and even basic nutrition, and they’re worried the long-term health consequences could be serious.\n\nIn the Twin Cities, which saw a huge influx of federal immigration agents this year that sent the region into a state of chaos and resistance, armed ICE agents have been seen lining the hallways, accompanying patients in their custody, a senior physician at a large hospital in the Twin Cities told CNN. The doctor asked to remain anonymous out of concern that he or his hospital would be targeted.\n\n“As doctors, I think our job is to take care of the patient in front of us, and we’re not involved in immigration enforcement,” the doctor said. “Until last month, that had never been a part of my job description.”\n\nBut then, patients began entering his hospital under the custody of federal immigration agents.\n\nIn January, the Trump administrationrescinded a Biden-era policythat banned immigration enforcement actions in “sensitive areas,” like schools, places of worship and hospitals.\n\n“The Trump Administration will not tie the hands of our brave law enforcement, and instead trusts them to use common sense,” a Department of Homeland Securityspokesperson saidin a statement at the time.\n\nGenerally, federal immigration agents are allowed in health care settings where other members of the public are permitted, like waiting rooms, but need a warrant to access private patient areas.\n\n“ICE does not conduct enforcement at hospitals—period. We would only go into a hospital if there were an active danger to public safety,” DHS Assistant Secretary Tricia McLaughlin told CNN in a statement. “Of course, if we have a detainee we need to take to the hospital for medical care, we have officers accompany them for their monitoring, safety of the staff, and the public. This is standard procedure for all law enforcement agencies.”\n\nBut doctors say that the presence of these agents in health care settings can be disruptive and intimidating.\n\nThe Twin Cities hospital has provided care to patients who come in under ICE custody, including those recently who have had head injuries, injuries from being assaulted and those who have fainted, the doctor said. In general, the hospital has always instructed its providers not to make comments or notes about a patient’s immigration status on notes or other materials that can be accessed, the doctor explained.\n\nAllindividually identifiable health information, including demographic data is protected in all forms under federal HIPAA policy.\n\n“Over the last six weeks, ICE agents have repeatedly asked for protected health information on our patients, and that’s been really confrontational at times,” the doctor said.\n\nThe agents asked for daily medical updates, whether patients had the cognitive ability to understand paperwork that was given to them and details about discharge dates and plans. When the doctors and nurses refused, the agents would turn to nursing assistants or other ancillary staff who weren’t trained to handle those requests, the doctor said.\n\nIt’s standard practice not to share that kind of patient information with any members of law enforcement, and the persistent requests from ICE officers likely reflects a “lack of standardized training or even understanding of what protected health information is” among those agents, the doctor said.\n\n“We’ve never had law enforcement ask for protected health information, so these are new policies that need to be created and then staff that need to be educated in a very short timeframe,” the doctor said.\n\nDHS did not respond to questions about whether ICE agents who accompany patients into health care settings are trained in HIPAA laws.\n\nProviders in Chicago, Los Angeles and Dallas also told CNN that they’ve recently had to educate staff on how to manage interactions with and requests from immigration authorities.\n\nOn one occasion, after refusing to provide protected health information to an ICE agent, the doctor at the Minnesota hospital said the armed agent got his superior at DHS on the phone and asked the doctor to provide his full name for their records.\n\n“Those are scary experiences to be in, and the intimidation feels really real in those moments,” the doctor said.\n\n“Ideally, clinicians should not be placed in adversarial roles for following the law,” he added.\n\nMany of the hospital’s patients who were accompanied by ICE agentsover the last month or so came in after being injured while in custody or during the process of being detained, the doctor said. Because agents aren’t allowed in patients’ rooms under hospital policy, they would sit or stand outside the rooms, “which can be very disruptive towards the rest of our care that we’re trying to provide in the hospital,” the doctor said. He personally observed ICE agents yelling in the hallways of his facility, he added.\n\nThe situation left some members of the hospital’s diverse staff visibly uncomfortable, the doctor said.\n\n“There were multiple reports at our hospital of ICE agents asking staff where they were from,” he added.\n\nWithout naming doctors or patients due to HIPAA guidelines and privacy concerns, CNN asked DHS to comment on the ICE encounters the doctor described.\n\nIn response, McLaughlin said in a statement, “When the media refuses to give names, it makes it impossible to provide details on specific cases or even verify any of this even happened or that the people even exist. If you can’t do your job, we can’t do ours.”\n\nEach day patients under ICE custody were in his hospital, the Twin Cities doctor saw staff or nurses crying “from just the existential fear of what’s going on and the sad stories from our patients that we were caring for.” He said the emotional strain on staff is reminiscent to what he saw during the Covid-19 pandemic.\n\n“It’s really hard to provide good care when you’re scared for yourself and scared for your patient and what comes next for them,” the doctor said.\n\nThough DHS announced an end to the surge in Minnesota on February 12, the doctor told CNN he is still seeing the same decline in patient numbers.\n\nThe doctor’s observations have been echoed by other providers in the area.\n\nA group of Minnesota doctors gathered at the state Capitol last month to warn that a medical crisis was unfolding in their community amid DHS’ surge in enforcement.\n\nThe doctors described receiving reports of ICE agents staking out medical clinics in immigrant neighborhoods and following patients into hospitals and exam rooms.\n\n“I have never seen this level of chaos and fear in health care for patients and for our health care teams,” Dr. Roli Dwivedi, former president of the Minnesota Academy of Family Physicians, who said she has practiced in Minnesota for more than 19 years, said at the capitol.\n\nDwivedi said she saw a mother and son being forcibly separated in her clinic parking lot. After the son experienced a seizure, he was sent to the hospital while his mother was sent to a detention center in Texas, Dwivedi said.\n\n“Our places of healing are under siege,” Dwivedi said. “When a clinic like this is treated like a tactical zone, who would feel safe enough to go to the health care facilities?”\n\nAnd it isn’t just playing out in traditional health care settings.\n\nIn St. Paul, there have been at least two instances in which DHS agents impeded emergency medical personnel who were trying to treat and transport patients, Jeramiah Melquist, Assistant Chief of Operations with the St. Paul Fire department, told CNN.\n\nBoth of those incidents were referenced by St. Paul Mayor Kaohly Her in a lawsuit brought by the state of Minnesota against DHS.\n\nIn November, emergency personnel were transporting a patient on a stretcher, who had been detained by ICE agents.\n\nThe agents tried to argue with St. Paul Fire staff about whether the person was actually hurt, at which point the fire chief stepped in to inform them that it was his department’s duty to transport the patient to a higher level of care at the emergency room, Melquist said. Eventually the ICE agents entered the medic vehicle and rode with the patient to the hospital, he said.\n\nAfter the first incident, St. Paul Fire and DHS staff met to discuss how operations would work going forward, Melquist said, and his department set up a protocol where a district chief and EMS chief would be sent out on all calls with known or possible ICE involvement. During that meeting, “ICE apologized for their interference and assured SPFD leadership that they would not be denied the ability to provide medical care again,” the lawsuit states.\n\nBut a second incident occurred on January 10, when a family member of a person detained by ICE experienced a medical emergency related to a heart condition. Melquist said agents impeded St. Paul Fire staff who were trying to take the patient to the hospital.\n\n“ICE agents directly impeded (the Saint Paul Fire Department) from providing medical care to an individual experiencing a cardiac arrest,” the mayor wrote in a statement accompanying the lawsuit.\n\nIn emergency medical situations, “seconds count,” Melquist said.\n\nDHS did not respond to CNN’s request for comment about both St. Paul incidents, which included dates, agency names and details.\n\nEven without armed federal agents standing between providers and their patients, doctors say the fear of immigration enforcement is enough to keep people from accessing the care they need.\n\nDespitean end to the Minnesota surgein immigration enforcement announced by DHS, the community is still feeling the consequences of the operation, Dr. Brian Muthyala, a Twin Cities physician who provides care at Hennepin Healthcare and M Health Fairview, told CNN.\n\n“It may seem from somebody who’s outside of Minnesota or outside of the Twin Cities that everything is sort of returning back to normal, but that is far from the case,” he said.\n\nThat’s had a direct impact on patient numbers, Muthyala said.\n\n“People aren’t going to clinic. People aren’t coming to the ER. People aren’t getting surgeries. We have significant no show rates in our obstetrics clinics, our prenatal clinics, our pediatric clinics, our acute care clinics. This is Metro wide,” he said.\n\nWhile the consequences of skipping routine medical care may not always be immediate, Muthyala said providers are worried about the downstream impact all of this will have on the health of the community.\n\nPeople are also skipping trips to the grocery store or drug store, which can have a trickle-down impact on health, Muthyala said.\n\n“If you’re food insecure, if you can’t get good nutrition, if you’re skipping meals, if you’re skipping medication, spreading out medications to last longer – all that’s going to impact your health, separate from the very real trauma that families are experiencing,” he said.\n\nWhen asked for comment on claims that the surge of federal immigration agents is harming the health and wellbeing of the communities they enter, the DHS assistant secretary pointed to “violent agitators.”\n\n“If anyone is impeding Americans from making appointments or picking up prescriptions, its [sic] violent agitators who are blocking roadways, ramming vehicles, and vandalizing property,” McLaughlin told CNN in a statement.\n\nThe decrease in health care utilization isn’t just bad for patients, Muthyala said. It’s also bad for business at a time when hospitals and clinics across the nation arealready struggling financially.\n\n“Systems plan to see X number of patients, and when they don’t come, that has a real financial impact on the bottom line of clinics and hospitals,” Muthyala said. “We saw that during Covid, and we’re starting to see some of that now.”\n\nWhere patients aren’t going to the doctor, some providers have decided to bring the care to them.\n\nSt. John’s Community Health, a network of school-based clinics, health centers and mobile clinics in Los Angeles observed a marked decline in patients last summer as the administration carried out an immigration enforcement surge in the region, president and CEO Jim Mangia told CNN.\n\n“When the ICE raids began pretty intensely over the summer, we saw our no-show rates go from about an average of about 8% a day to over 30-35% a day,” Mangia said.\n\nThe health network adapted its street medicine program, which serves people experiencing homelessness, and trained doctors, nurses and medical assistants to work as home-visit teams, going directly to people’s homes who had missed appointments or were too afraid to leave. They dubbed the programHealthcare Without Fear.\n\nBut people weren’t just afraid to go to the doctor. The home visit teams found that patients were skipping trips to the grocery store too, so they started bringing bags of food and other essentials to patients in their homes.\n\nAbout 20-25% of the patients St. John’s serves are undocumented, Mangia estimated.\n\nSt. John’s provides affordable or free medical, dental and behavioral health services, Mangia said, and the families they see are often low-income.\n\nOne of St. John’s patients is Doris, a 58-year-old who came to the US from El Salvador in 2021. She asked CNN to withhold her last name over fears that she would be targeted by federal immigration authorities.\n\nHer fears over immigration authorities like ICE finding her have left her shaking every time a car passes by or she sees a police officer, Doris told CNN through a St. John’s translator.\n\nLately she’s been experiencing back pain and increased stress due to her fears over immigration authorities, she said. She tries not to leave her home unless she has to, but she is comfortable seeing her regular provider at St. John’s.\n\n“We’ve been serving this community since 1964,” Mangia said. “We have a long-standing reputation of serving everyone, regardless of immigration status. And so, you know, we built the trust with our patients.”\n\nThe network regularly runs practice drills with its providers, Mangia said, where they practice what they would do if ICE agents attempted to enter a facility, like moving all patients into exam rooms.\n\nThat training came in handy in July, when dozens of federal immigration agents in tactical gear marched through Los Angeles’MacArthur Park, where St. John’s was running a street medicine clinic nearby.\n\n“They surrounded us with military vehicles and screamed and cursed at our staff and our patients to leave,” Mangia said. “They took out their guns and pointed them in the face of some of our staff and threatened them.”\n\nICE agents have also called the clinic and requested protected health information, Mangia said.\n\nDHS did not provide a direct response to CNN’s request for comment on Mangia’s account of his staff’s encounter with agents in MacArthur Park or his claim that ICE agents called the clinic to request protected health information. In July, DHS told CNN that the agency does not comment on ongoing operations.\n\nAfter the surge in immigration enforcement in Los Angeles subsided, Mangia said St. John’s appointments rates returned to normal, but “there’s a constant fear and worry in the community that the ICE raids will intensify again. A lot of patients are obviously very concerned.”\n\nIn Dallas, immigration enforcement is impacting the county’s vaccination numbers, according to Dallas County Health and Human Services Department director Dr. Philip Huang.\n\nProviders and community outreach staff in Dallas say they’ve specifically heard concerns from patients about whether their personal information could be shared with immigration authorities.\n\nAround back-to-school time every August, health providers in Dallas are used to seeing lines of patients out the door to get routine immunizations, Huang said, but not this year.\n\nDallas County clinics administered 9,578 vaccines in August 2025, compared with 16,412 vaccines in August 2024, Huang said. Among Hispanic patients specifically, the number of vaccines administered dropped by over half, he noted.\n\nThat means a large number of school-age children skipped their vaccinations in the same year that themeasles outbreak in West Texasclaimed the lives oftwo children who were not vaccinatedagainst the disease.\n\nAfter whooping cough vaccinations declined in Dallas County over the last year, the preventable disease spiked to the highest numbers of infections officials have seen in over a decade, Huang said.\n\nIn Illinois, Chicago Department of Public Health Commissioner, Dr. Olusimbo Ige, says providers have seen a similar decrease in vaccine uptake – specifically among communities that have been targeted by DHS for immigration enforcement – with some 2025 vaccine clinics canceled and others seeing a 72% decline in attendance.\n\n“We have talked directly to providers and community members, and they are afraid,” Ige told CNN.\n\nThis respiratory season, the city of Chicago has seen the highest levels of emergency department visits and hospitalizations from flu since 2022.\n\n“These are the real implications of people not being able to access preventative care,” Ige said.\n\nLike other doctors across the nation, Ige said she’s concerned that fewer patients seeking preventative care will result in a surge in complications and emergency cases, which are often a bigger burden on the health care system and more costly for individual patients.\n\nIge said Chicago has been working hard to reverse that trend, reiterating messages to the community that patients’ personal health information will not be shared.\n\n“Chicago is a welcoming city. We don’t ask about immigration status, and therefore we cannot share that data, because we do not collect that data,” Ige said. “So as a result of that, we have seen better utilization at our clinics.”\n\nIn recent years, policies implemented inTexasandFloridarequiring hospitals to ask patients whether they’re in the US legally have prompted backlash and concern that more people will be deterred from seeking care.\n\nAnd last year, an agreement between theCenters for Medicare and Medicaid Services and the DHSallowed some personal data from Medicaid enrollees to be shared with ICE officials.\n\n“We’ve had a lot of patients calling and asking about that, particularly when it was disclosed that the state had shared some of that data with the federal government,” Mangia, from St. John’s Health, said.\n\nBut multiple doctors said that when it comes to directly sharing patient info or discharge dates with immigration authorities, staff are trained to abide by HIPAA laws.\n\n“We would never do that,” the doctor working at the Twin Cities hospital told CNN.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.dhs.gov/news/2025/01/21/statement-dhs-spokesperson-directives-expanding-law-enforcement-and-ending-abuse#:~:text=According%20to%20a%20DHS%20Spokesperson%2C%20criminals%20will,humanitarian%20parole%20program%20to%20a%20case%2Dby%2Dcase%20basis",
      "text": "rescinded a Biden-era policy"
    },
    {
      "url": "https://www.dhs.gov/news/2025/01/21/statement-dhs-spokesperson-directives-expanding-law-enforcement-and-ending-abuse#:~:text=According%20to%20a%20DHS%20Spokesperson%2C%20criminals%20will,humanitarian%20parole%20program%20to%20a%20case%2Dby%2Dcase%20basis",
      "text": "spokesperson said"
    },
    {
      "url": "https://www.hhs.gov/hipaa/for-professionals/privacy/laws-regulations/index.html#what",
      "text": "individually identifiable health information"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "an end to the Minnesota surge"
    },
    {
      "url": "https://www.aha.org/costsofcaring",
      "text": "already struggling financially"
    },
    {
      "url": "https://www.sjch.org/grocery-assistance",
      "text": "Healthcare Without Fear"
    },
    {
      "url": "https://www.cnn.com/2025/07/07/us/video/la-ice-macarthur-park-sweep-los-angeles-immigration-digvid",
      "text": "MacArthur Park"
    },
    {
      "url": "https://www.cnn.com/2025/08/18/health/texas-measles-outbreak-declared-over",
      "text": "measles outbreak in West Texas"
    },
    {
      "url": "https://www.dshs.texas.gov/news-alerts/measles-outbreak-2025",
      "text": "two children who were not vaccinated"
    },
    {
      "url": "https://apnews.com/article/texas-immigration-hospital-health-care-abbott-florida-aeee92d7515a18b492c737b3657569ab",
      "text": "Texas"
    },
    {
      "url": "https://www.ap.org/news-highlights/spotlights/2024/florida-hospitals-ask-immigrants-about-their-legal-status-texas-will-try-it-next/",
      "text": "Florida"
    },
    {
      "url": "https://apnews.com/article/immigration-medicaid-trump-ice-ab9c2267ce596089410387bfcb40eeb7",
      "text": "Centers for Medicare and Medicaid Services and the DHS"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/immigration-doctors-ice-health-care",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/us/immigration-doctors-ice-health-care",
      "text": "Cookie Settings"
    }
  ],
  "hash": "25c41f3903876254143fe55005fd3fd9abd3c8a8582b75b0d22783945fb23673",
  "scraped_at": "2026-02-20T07:29:06.218459+00:00"
}