{
  "url": "https://lite.cnn.com/2026/02/23/politics/womens-hockey-usa-trump-sotu",
  "title": "US women’s hockey team declines Trump’s State of the Union invite, citing scheduling | CNN Politics",
  "date": "2026-02-24T07:31:49.288907+00:00",
  "authors": [
    "Betsy Klein, CNN"
  ],
  "text": "Source: CNN\n\nThe gold medal-winning US Olympic women’s hockey team has declined an invitation to President Donald Trump’s State of the Union address, citing scheduling issues.\n\nThe invite came after Trump regaled the US men’s team by phone Sunday as the players celebrated their historic Olympic victory, even offering to send a military plane to bring them to Washington, DC.\n\n“We’re giving the State of the Union speech on Tuesday night. I could send a military plane or something, if you would like to. It’s the coolest night. It’s the biggest speech,” the president — over a speakerphone held by FBI Director Kash Patel in the locker room — said to raucous cheers and shouts of “we’re in.”\n\nTrump added: “I must tell you, we’re gonna have to bring the women’s team — you do know that.” If they weren’t invited, the president said, “I do believe I probably would be impeached, OK?”\n\nMembers of the team laughed. The moment — and the players’ response —prompted significant backlash on social media.\n\nBoth the men’s and women’s hockey teams were formally invited to attend Trump’s address Tuesday, according to a spokesperson for the women’s team. It is not clear whether the male athletes will follow through on the plans, but the women have declined the invitation.\n\n“We are sincerely grateful for the invitation extended to our gold medal-winning U.S. Women’s Hockey Team and deeply appreciate the recognition of their extraordinary achievement,” the team spokesperson said in a statement.\n\n“Due to the timing and previously scheduled academic and professional commitments following the Games, the athletes are unable to participate. They were honored to be included and are grateful for the acknowledgment.”\n\nThe men’s team, which was traveling back to the US from Italy, did not immediately respond to CNN’s inquiry on whether they would attend the speech. The White House did not respond to CNN’s request for comment.\n\nBoth American teams secured Olympic gold in extraordinary games against Canada, the women 2-1 in overtime on Thursday and the men in their own 2-1 overtime win Sunday.\n\nJack Hughes, who scored the men’s game-winning goal, said one of his first thoughts was women’s team star Megan Keller.\n\n“The first person I thought of was Megan Keller, who had the gold medal goal the other night,” the New Jersey Devils centersaid in an interviewmoments after his win, recalling running into Keller in the Olympic cafeteria after the women’s victory.\n\n“I saw her in the (cafeteria), and I just said how happy and proud I am of their group and that was one of my first thoughts, was her.”\n\nNeither Olympic team has much time to soak in their victories as they return to their professional and college-level hockey teams. The Professional Women’s Hockey Leagueresumesits season Thursday, and the National Hockey League resumes onWednesday.\n\nThe women’s team most recently won gold in PyeongChang during Trump’s first term. They wereamong the athletesinvited to the White House in April 2018 as part of a broader Olympic celebration. The men’s win was the first since the 1980 “Miracle on Ice.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.facebook.com/reel/845190435202813",
      "text": "said in an interview"
    },
    {
      "url": "https://www.thepwhl.com/en/schedule",
      "text": "resumes"
    },
    {
      "url": "https://www.nhl.com/schedule",
      "text": "Wednesday"
    },
    {
      "url": "https://www.cnn.com/2018/04/27/sport/us-winter-olympics-white-house-no-show-lindsey-vonn-gus-kenworthy",
      "text": "among the athletes"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/womens-hockey-usa-trump-sotu",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/womens-hockey-usa-trump-sotu",
      "text": "Cookie Settings"
    }
  ],
  "hash": "26099b424af4567e7a7349643d818e232068e88b2a81378ce11538e055611ba4",
  "scraped_at": "2026-02-24T07:31:49.288921+00:00"
}