{
  "url": "https://lite.cnn.com/2026/02/24/economy/tariff-refunds-consumers",
  "title": "You paid for tariffs — but you won’t get a slice of tariff refunds | CNN Business",
  "date": "2026-02-25T07:32:45.983914+00:00",
  "authors": [
    "Elisabeth Buchwald"
  ],
  "text": "Source: CNN\n\nThe government is on the hook to refund $134 billion – and counting – worth of tariff revenue collected from President Donald Trump’s most sweeping tariffs, which wererendered illegalby the Supreme Court last week.\n\nHow much of that will consumers, who paid for steep tariffs via higher prices, get back?\n\nAlmost certainly nothing.\n\nThat’s because consumers paid for tariffs indirectly: They’re mostly not the ones making the actual paymentto the government. When – and perhaps if – any funds are returned, they’ll go to what’s known as the importer of record, i.e., the party that paid the initial tariff bill. Think: Costco, Walmart, Target, etc.\n\nFor now, refunds are largely theoretical.The Trump administration and the Supreme Court have givenlittle clarityabout how they would be processed. The only thing you can be sure of is that it will be a lengthy process, with Trump telling reporters on Friday that it could take up to five years to accomplish.\n\nBusinesses ate the bulk of the tariff cost themselves. But they passed some of that expense on to you. Consumers covered around a one-quarter of their tariff bills through higher prices charged, according toresearchpublished by the Harvard Business School’s Pricing Lab.\n\nIn total, the Tax Foundation estimates tariffs increased the average American household’s tax payments by $1,000 last year.\n\nFacing pressure from voters to improve affordability, the Trump administration has for months been floating$2,000 tariff rebate checksto help defray the cost of tariffs borne by consumers.\n\nThose rebate checks, which would require approval from Congress, would not be refunds on tariff payments – they’re effectively stimulus checks to help boost the economy that’s been harmed by the higher border taxes. It’s not clear if the Supreme Court’s decision jeopardized those potential rebate checks.\n\nWhat is clear: The vast majority of consumers haven’t paid tariff costs directly, so the Trump administration doesn’t owe them tariff refunds.\n\nDemocrats are ramping up the pressure on the White House over tariff refunds.\n\nIn a letter to President Donald Trump, Sens. Elizabeth Warren, Peter Welch and Cory Booker say tariff refunds should go to consumers and small businesses have been “illegally cheated out of their hard-earned money.”\n\nThe Democrats say Trump’s “inability or unwillingness” to provide tariff refunds represents a “giveaway to giant corporations that amounts to theft from the middle class.”\n\nThe White House did not respond to a request for comment on the letter, which was shared first with CNN.\n\nCostco is one of the thousands of businesses thatsued the US governmentahead of the Supreme Court verdict, in an effort to secure a refund. Treasury Secretary Scott Bessent mused in an interview last month that Costco’s customers likely wouldn’t see a cent of any potential refunds the company gets. Regardless, more companies are likely to follow Costco’s example, with FedEx on Monday filing a case against the Trump administration, marking the first major corporation to do so after the Supreme Court ruling.\n\nNothing prevents businesses from doling out a portion of refunds they secure to customers. But given they probably would have paid handsome legal fees to get them and that they shouldered the majority of the tariff costs, it’s more or less a pipe dream.\n\nConsumers may see relief in other forms, though.\n\nWhile David Suk, CEO of The Baby’s Brew, a portable baby bottle warmer, is skeptical he’ll see any amount of the $80,000 in tariff payments his company made since Trump’s sweeping tariffs took effect last year, in the event he does, he plans to lower prices.\n\nIf he gets any money back, it wouldn’t represent the overall cost of tariffs, since that also includes substantial front-loading he did to get ahead of tariffs and premiums to expedite production.\n\n“It couldn’t possibly be a one-to-one ratio in terms of giving back (tariff refunds). As much as I would love to be able to do that, it’s just not feasible,” Suk told CNN. All of the company’s products are manufactured in China, and as tariff rates were lowered on Chinese goods at various points last year, he started slashing prices.\n\n“You’re sort of trying to make these business decisions to make sure that you can stay in business, which is the real risk, and make your customers happy.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "rendered illegal"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
      "text": "little clarity"
    },
    {
      "url": "https://www.pricinglab.org/files/TrackingTariffs_Cavallo_Llamas_Vazquez.pdf",
      "text": "research"
    },
    {
      "url": "https://www.cnn.com/2025/11/10/economy/tariff-rebate-check-proposal-what-to-know",
      "text": "$2,000 tariff rebate checks"
    },
    {
      "url": "https://www.cnn.com/2025/12/02/business/costco-sues-us-tariff-refunds-intl",
      "text": "sued the US government"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/economy/tariff-refunds-consumers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/economy/tariff-refunds-consumers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2617959f2cdcf7cafdfbbb5a50872c1a226cdec010e75c0fa7f92e71f02b8713",
  "scraped_at": "2026-02-25T07:32:45.983924+00:00"
}