{
  "url": "https://lite.cnn.com/2026/02/23/americas/el-mencho-mexico-jalisco-cartel-profile-intl-hnk",
  "title": "Who was Nemesio ‘El Mencho’ Oseguera Cervantes, the feared leader of Jalisco New Generation Cartel? | CNN",
  "date": "2026-02-24T07:32:27.084705+00:00",
  "authors": [
    "From CNN en Español's Gonzalo Zegarra",
    "Rocío Muñoz-Ledo"
  ],
  "text": "Source: CNN\n\nNemesio“El Mencho”Oseguera Cervantes was a feared Mexican drug lord and the leader of a ruthless cartel accused of masterminding efforts to push fentanyl into the United States.\n\nOnce a police officer, Oseguera went on to become one of the world’s most wanted fugitives, with the United States alone offering a $15 million bounty for information leading to his arrest.\n\nOseguera, who formed and led the Jalisco New Generation Cartel (CJNG), was an elusive figure who had been considered Mexico’s most powerful cartel boss since Sinaloa kingpin Joaquín “El Chapo” Guzmán was arrested last decade.\n\nBorn in July 1966 in the western state of Michoacán, Oseguera later moved to the US and was deeply involved in drug trafficking from the 1990s, according to the US Drug Enforcement Administration (DEA). In 1994, he was convicted in California for conspiracy to distribute heroin and served three years in a US prison.\n\nAfter he returned to Mexico, he worked as a police officer in the western state of Jalisco but soon resumed his criminal activities, building his influence in the shadowy world of narcotics and rising to become the head of one of the country’s most powerful and ruthless criminal empires.\n\nWanted by authorities in Mexico and the US, Oseguera or “El Mencho” kept a low profile – so much so that only a handful of photographs of him exist.\n\nHis death on Sundayin a Mexican military operation in Tapalpa, in the western coastal state of Jalisco, has triggered widespread unrest across parts of the country.\n\nOseguera had a long career in brutality before forming CJNG. For a time, he served as chief of hitmen, or key enforcer, for the Milenio Cartel, before overseeing security and operational violence for the famed Sinaloa Cartel, whose former leader Guzmán is serving a life sentence in a US prison.\n\nAccording to the DEA, CJNG emerged in the 2010s from the remnants of the Milenio Cartel, which splintered amid a power vacuum after its leader Óscar Nava Valencia was captured in 2009.\n\nOseguera built the group with Abigael González Valencia, leader of Los Cuinis – a family-based cartel operating in Michoacán, which served as the financial and logistical arm of CJNG and oversaw its “diverse network of money laundering operations,” according to the DEA.\n\nBut it was only through marriage to Abigael’s sister, Rosalinda González Valencia, that Oseguera gained real influence in the new entity.\n\n“In reality, El Mencho reached the cartel’s leadership through a strategy of diplomacy via marriage,” public security analyst David Saucedo told CNN en Español. “He was indeed the chief of hitmen for ‘Nacho’ Coronel (a Sinaloa Cartel leader), but he lacked the lineage that Rosalinda, his wife, possessed,” Saucedo added.\n\nThe burgeoning cartel quickly grew its sphere of influence to claim a significant presence across Mexico and became a key player in the global drug trade.\n\nIt is a brutally violent operation responsible for assassination attempts on Mexican government officials and homicides against rival trafficking groups and Mexican law enforcement officers, according to the US State Department.\n\nThe cartel demonstrated its firepower in May 2015, when it responded to a security operation with simultaneous roadblocks across several municipalities and shot down a military helicopter. Three soldiers were killed in the clashes.\n\nThe following year, the gang was credited with abrazen kidnapping of Guzman’s sonfrom a trendy restaurant in Puerto Vallarta. He was released a week later.\n\nIt wasn’t long before the DEA added El Mencho to its most wanted list.\n\nCJNG is heavily involved in the production and trafficking of methamphetamine and fentanyl, with links to suppliers of chemical precursors in China, and controls several seaports for importing chemicals, according to US authorities.\n\nThe cartel is “a key supplier of illicit fentanyl” to the US, reaping “billions of dollars in profit,” as well being one of the main suppliers of cocaine, according to the DEA.\n\nThe group has contacts in over 40 countries, including the Americas, as well as in Australia, China and Southeast Asia, according to the US State Department.\n\nMexico had been under pressure from US President Donald Trump to do more to limit the flow of drugs to the US.\n\nThe US designated CJNG as a terrorist organization in February 2025, and Oseguera had already been indicted multiple times in the United States, including being charged in 2022 with conspiracy to manufacture and distribute methamphetamine, cocaine and fentanyl for importation into the United States.\n\nThe death of “El Mencho” on Sunday has created turmoil across the country. But it won’t necessarily cripple the JNGC’s multi-billion drug trade.\n\nThe DEA says the gang is structured like a franchise business, and according to Eduardo Guerrero, director of Mexican consulting group Lantia Intelligence, it is composed of around 90 organizations.\n\n“This fragmentation has meant that you’ll need a more complex, more sophisticated strategy to weaken and dismember them,” Guerrero told CNN earlier this year.\n\nThe Mexican military and police, backed by US intelligence and equipment have tried taking out kingpins before. But others emerged to take their place, and tons of drugs continued to flow over the US border.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
      "text": "“El Mencho”"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
      "text": "His death on Sunday"
    },
    {
      "url": "https://www.cnn.com/2016/08/22/world/mexico-el-chapo-son-freed",
      "text": "brazen kidnapping of Guzman’s son"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/el-mencho-mexico-jalisco-cartel-profile-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/americas/el-mencho-mexico-jalisco-cartel-profile-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "26e76bd17f30559590b16cadfc329af28cb439af98c5e8a0f7c7ef48fe8e1838",
  "scraped_at": "2026-02-24T07:32:27.084717+00:00"
}