{
  "url": "https://lite.cnn.com/2026/01/28/entertainment/star-search-beyonce-britney-aaliyah-skeleton-crew",
  "title": "The history of ‘Star Search,’ where Britney and Beyoncé lost big | CNN",
  "date": "2026-02-17T07:30:51.770825+00:00",
  "authors": [
    "Alli Rosenbloom, CNN"
  ],
  "text": "Source: CNN\n\n“America’s Got Talent,” “The Voice,” “American Idol” — would any of them exist without “Star Search?” The iconic staple of ’80s and ’90s television laid the groundwork for today’s ubiquitous talent competition shows, with one big exception: When it came to crowning big stars, it had a tendency to get things wrong.\n\nEveryone from Britney Spears to Justin Timberlake to Aaliyah appeared on the show — and lost, as did future 35-time Grammy winnerBeyoncé, whocompetedin 1993 as part of an all-girls group called Girls Tyme.\n\n“Can you believe it?” William Pilipchuk, lead singer of rock group Skeleton Crew, which bested Girls Tyme in a moment immortalized on Beyoncé’s single “***Flawless,” told CNN. “I’m the only singer that beat Beyoncé in a contest on national television.”\n\nThe band’s guitarist Scott Christy recalled going backstage after the judges advanced their all-male, all-acoustic rock band to the next round over the preteens of Girls Tyme.\n\n“There were tears,” Christy told CNN. “It was horrible. I just felt bad.”\n\nNow, “Star Search” is back, this time on Netflix, with actor Anthony Anderson as host. The new incarnation – the second reboot after CBS’s failed 2003 attempt – is buzzier, bigger, live and flashier. But its somewhat nonsensical pairings remain, as in a recent episode that featured a trapeze artist duo going up against a trainer doing a dance routine with her dog.\n\nThe revival is off to aslow start. It remains to be seen who, if any, of the first batch of contestants – which which includes several magicians and a singing comic, among others – will become America’s next big star. But as the winners and losers of the past know, the results of “Star Search” often have little to do with what they find after.\n\nSinger and songwriterKatrina Woolvertonhad her chance at stardom in 1989. Heron-screen competitionin the junior vocalist category was a 10-year-old singer who belted a version of “My Funny Valentine.” Her name was Aaliyah.\n\nIn an interview with CNN, Woolverton remembered Aaliyah as having a “quiet manner about her” and that she was “a little more reserved but incredibly talented.”\n\nWoolverton wound up besting Aaliyah and went on to become the round one junior vocalist champion. The loss didn’t keep Aalyiah down. Just five years later, she released her debut album, “Age Ain’t Nothing but a Number.”\n\nWoolverton’s music pursuits panned out differently. After the show, she received offers from record labels but ultimately left the music industry after facing some adversity at home, opting to focus on her education instead. She eventually returned to music as an EDM artist, which is her focus today.\n\nAaliyah, meanwhile, went on to release three studio albums following her debut, spawning five top 10 hits that charted on theBillboard Hot 100.Widely regarded as one of the most promising artists of her time, her untimelydeathin a plane crash in 2001 cut short her meteoric rise.\n\nAaliyah’s death hit Woolverton hard.\n\n“There’s no sweetness in that victory because she’s not here anymore,” said Woolverton. “I always thought I’d have the chance to cross paths with her and congratulate her and just tell her, ‘I was so proud of you to see that you did it.’”\n\nMega fame didn’t findSkeleton Crewafter “Star Search,” but the band didn’t do too bad for themselves. They got a record deal and had a chance to tour in support of artists like Foreigner and Kenny Loggins.\n\nThey only found out later that their success came from what one of the most influential artists of the century once called a “defining moment” of her childhood.\n\nBeyoncé directly addressed her loss, alongside Kelly Rowland, LaTavia Roberson and LeToya Luckett, 30 years after it happened,sayingin 2013: “You’re never too good to lose, you’re never too big to lose, you’re never too smart to lose. It happens. And it happens when it needs to happen and you need to embrace those things.”\n\nThe same year, she featured footage of the moment in hermusic videofor “***Flawless.”\n\nSkeleton Crew reached out after the single dropped, and Pilipchuk admits he still has a “bitter taste” that he never got a reply from Beyoncé or her team.\n\nSkeleton Crew disbanded in 1995, and Pilipchuk and Christy now perform in a band called The Crystal Set.\n\nPilipchuk insists he is still largely unfazed by the fact that he and Skeleton Crew have any connection to Beyoncé’s meteoric rise.\n\nChristy has a softer view, crediting the experience as “the gift that keeps on giving back to us.”\n\n“It just brings a smile to my face now,” he said.\n\nThe original “Star Search” debuted on CBS with famed TV personality Ed McMahon as the host in 1983 and aired until 1995. Considered the first talent competition reality show, it featured head-to-head match-ups in categories including solo and group vocalist, comedy, spokesmodel and dance.\n\nNetflix’s updated version nods to its predecessor with its voting, allowing for judges Chrissy Teigen, Jelly Roll and Sarah Michelle Gellar to hand out up to five stars. The live format also lets viewers act as the fourth judge by voting in real time.\n\nForMarty Thomas, a Broadway vet who competed against Britney Spears in 1992’s junior vocalist competition, the experience on the show was so profoundly positive that he hopes the revival captures some of that magic for its new slate of young stars.\n\n“When you’re rebooting something like ‘Star Search’ that so many people hold such a soft spot in their heart for from the ‘80s, I really hope they’re able to at least strive to capture a little of that innocence and that reality,” Thomas told CNN, fresh off a string of cruise ship performances.\n\nInnocence is a good word for it. After competing against one another on “Star Search,” Thomas, Spears and their families went on to become friends in the years that followed. He and Spears even attended the same performing arts school in New York City, and he was part of the pop singer’s life until the mid-2000s, bearing witness to her meteoric rise.\n\nUltimately, he observed, her rejection on “Star Search” did not have that much of a negative impact “beyond breaking her heart.”\n\nIf anything, Thomas continued, the experience just “strengthened her resolve to keep working harder and try new things.”\n\n“Star Search,” of course, isn’t the only reality competition show to reject greatness (here’s looking at you,Jennifer Hudson, EGOT).\n\nThe reboot is, however, leaning into that notion that even if you lose, you win.\n\nPerhaps Anderson put it best when he bid farewell to the trainer and her dog after the trapeze artists knocked them out, saying, “now the whole world knows who you are.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/30/entertainment/beyonce-net-worth-billionaire-forbes-hnk",
      "text": "Beyoncé"
    },
    {
      "url": "https://www.youtube.com/watch?v=jfSQWch877c",
      "text": "competed"
    },
    {
      "url": "https://deadline.com/2026/01/star-search-netflix-ratings-1236698865/",
      "text": "slow start"
    },
    {
      "url": "https://katrinawoolverton.com/home-2/",
      "text": "Katrina Woolverton"
    },
    {
      "url": "https://www.youtube.com/watch?v=yRQ10XnpPgc",
      "text": "on-screen competition"
    },
    {
      "url": "https://www.billboard.com/artist/aaliyah/",
      "text": "Billboard Hot 100."
    },
    {
      "url": "https://www.cnn.com/2016/08/25/entertainment/aaliyah-death-anniversary",
      "text": "death"
    },
    {
      "url": "https://www.skeletoncrewmusic.com/",
      "text": "Skeleton Crew"
    },
    {
      "url": "https://www.youtube.com/watch?v=cIv1z6n3Xxo&list=UUuHzBCaKmtaLcRAOoazhCPA",
      "text": "saying"
    },
    {
      "url": "https://www.youtube.com/watch?v=IyuUWOnS9BY",
      "text": "music video"
    },
    {
      "url": "https://www.instagram.com/martythomaslovesyou/?hl=en",
      "text": "Marty Thomas"
    },
    {
      "url": "https://www.cnn.com/2022/06/13/entertainment/jennifer-hudson-tonys-egot",
      "text": "Jennifer Hudson, EGOT"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/entertainment/star-search-beyonce-britney-aaliyah-skeleton-crew",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/01/28/entertainment/star-search-beyonce-britney-aaliyah-skeleton-crew",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2730d4ae3c04d6e72f804bacf0d4173b9c2ce2426fe677504d46b72a07145828",
  "scraped_at": "2026-02-17T07:30:51.770838+00:00"
}