{
  "url": "https://lite.cnn.com/2026/02/10/politics/judges-contempt-justice-department-minnesota",
  "title": "Judges are regularly threatening contempt charges against the DOJ in immigration cases | CNN Politics",
  "date": "2026-02-11T16:33:13.226323+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIn some two dozen cases stemming from President Donald Trump’s immigration crackdown in Minnesota that CNN has reviewed,federal judgesappointed to the bench by Democrats and Republicans have had to use terms like “contempt” and “noncompliance” to get the government’s attention to respond to court orders.\n\nTo date, it doesn’t appear that any judge in the District of Minnesota has held an agency official or Justice Department attorney in civil contempt of court or imposed sanctions in cases related to Operation Metro Surge. But the sheer number of threats is significant.\n\nMany of the punishment threats have arisen in cases where judges concluded that an immigrant was unlawfully arrested and must immediately be released. Other compliance issues have bubbled up when Immigration and Customs Enforcement releases a noncitizen with certain conditions that they weren’t subject to prior to their arrest, enraging a judge who never gave permission to impose such constraints.\n\n“This is clearly not tenable,” Judge Laura Provinzino, an appointee of former President Joe Biden, told one top government attorney late last month. “I can’t continue to have (federal prosecutors) violating really important orders … If somebody should be released, that has to happen.”\n\nThe potential punishments highlight the smoldering tension between the federal judiciary, which has had to handle scores of cases brought by immigrants claiming they were unlawfully detained in recent weeks, and the lawyers defending the Trump administration’s operation, who often have little insight into the actions of their agency clients or the ability to sufficiently keep up with the pace of litigation.\n\nOften, a judge is the one ordering the government to “show cause,” or explain, why the court should not hold lawyers or agency officials in contempt. But in some instances, attorneys representing immigrants swept up in the enforcement blitz have asked the judge to impose sanctions when compliance issues have occurred.\n\n“It’s very rare for federal government officials to face contempt sanctions in court,” said David Cole, a Georgetown Law professor who served as the legal director of the American Civil Liberties Union. “And yet, it’s become almost routine under this administration.”\n\nThe various contempt threats are “about putting pressure on the government to comply with the court order,” Cole said. “Once they obey the court order, the purpose of those sanctions is over.”\n\nIndeed, though some of the punishment threats are still looming over the government, in case after case, the issue has fizzled out after DOJ attorneys on the frontlines of Trump’s Operation Metro Surge rectified problems identified by the court.\n\nNatalie Baldassarre, a Justice Department spokesperson, insisted in a statement to CNN that the administration “is complying with court orders” and attacked the judges taking issue with the government’s actions in Minnesota.\n\n“If rogue judges followed the law in adjudicating cases and respected the government’s obligation to properly prepare cases, there wouldn’t be an ‘overwhelming’ habeas caseload or concern over DHS following orders,” she said. “The level of illegal aliens currently detained is a direct result of this administration’s strong border security policies to keep the American people safe.”\n\nMore than 400 cases were brought in Minnesota last month by immigrants who were arrested amid Operation Metro Surge. CNN reviewed a subset of them that were highlighted by the chief judge of the state’s federal court as he chided the administration for violating nearly 100 judicial edicts.\n\n“The extent of ICE’s noncompliance is almost certainly substantially understated,” Judge Patrick Schiltz recently wrote in a scornful order that included a list of 74 cases in which his colleagues on the bench had found violations. “ICE has likely violated more court orders in January 2026 than some federal agencies have violated in their entire existence.”\n\nThe problem was on full view last weekwhen Julie Le, one of the attorneys managing the government’s ballooning caseload, unloaded on a federal judge in St. Paul about how it’s like “pulling teeth” to get agencies to correct errors made in some cases.\n\n“Fixing a system, a broken system, I don’t have a magic button to do it. I don’t have the power or the voice to do it,” Le said. “I only can do it within the ability and the capacity that I have.”\n\nUS District Judge Jerry Blackwell, a Biden appointee, had hauled Le and one of her colleges into court to explain why they shouldn’t be held in contempt for repeated violations of court orders in a handful of cases.\n\n“Continued detention is not lawful just because compliance with release orders is administratively difficult or because an operation has expanded beyond the government’s capacity to execute it lawfully,” Blackwell told the two lawyers.\n\nBlackwell didn’t announce a decision from the bench, and Le has subsequently left her temporary post in Minnesota, which she took on in early January.\n\nIn the cases reviewed by CNN, judges have similarly skewered the administration over its compliance problem, even as they’ve stopped short of imposing a punishment.\n\nJudge John R. Tunheim, an appointee of former President Bill Clinton, said late last month that the government had “willfully violated” two of his orders in the case of a Salvadoran national who was challenging his detention.\n\nAfter officials failed to bring the man back from another state where he was being detained to have a bond hearing, as Tunheim ordered, the judge directed the government to instead fly him back to Minnesota and release him immediately upon his arrival.\n\nThe man wasn’t returned to Minnesota until January 28, four days after he was supposed to land back in the state. But the judge ultimately rejected a request by his attorneys to find the government in contempt and impose sanctions against it for the repeated violations.\n\n“Although the (government) willfully violated the court’s orders,” Tunheim wrote in a brief order, he said he appreciated the communication from DOJ and its efforts to comply. “The court therefore declines to impose any sanctions.”\n\nIn another case, a judge laid bare a dire situation facing a Mexican national caught up in the immigration crackdown as he moved toward potential contempt proceedings.\n\nJudge Donovan Frank had raised the possibility of a contempt showdown if immigration officials didn’t provide assurances that they had complied with his order to release the man, who had been detained by agents and subsequently brought to a local hospital with life-threatening injuries. The cause of the man’s injuries were unknown, according to the judge, who said that hospital records reflected that the man told its staff “he was dragged and mistreated by federal agents.”\n\nOn January 23, the Clinton appointee ordered ICE agents to unshackle the man from his hospital bed and leave the facility, where they had been positioned in an apparent effort to keep him detained.\n\nBut four full days passed without an update from the government, prompting Frank on January 28 to threaten officials with contempt proceedings if they didn’t provide assurances that the man had been released. The issue was ultimately diffused after the government told the court that it had complied with its order.\n\nMeanwhile, in a different courtroom on January 28, Provinzino grilled a high-ranking official in the federal prosecutor’s office in Minneapolis about why his office had regularly violated orders from her and made clear that if she saw any further compliance issues, the top federal prosecutor in the state would need to personally appear before her to explain why he shouldn’t be held in contempt.\n\nThe judge had called the hearing after saying that repeated demands from her for information about a detainee she had ordered released went unanswered. The man, a Mexican national, had also remained in custody 26 hours after he was supposed to have been let out.\n\n“You would just happen to be, I think, the seventh one in the office who’s violated one of my orders,” she told Assistant US Attorney Friedrich Siekert. “What steps are you putting in place or is the United States Attorney’s Office and ICE putting in place to ensure compliance on a prospective basis?”\n\nSiekert told the judge that part of the issue was due to the fact that his office simply didn’t have the resources needed to manage the hundreds of cases brought since the immigration blitz began.\n\n“The civil division does not have the resources to handle this right now,” he said.\n\nAnd in the case of a man referred to in court papers as “Juan,” Judge Susan Nelson, an appointee of former President Barack Obama, noted that the government blew past her deadline for his release by five days. She said she would hold a contempt hearing if compliance wasn’t eventually achieved, but after those plans were announced, the man was released and the judge said the hearing was “no longer necessary.”\n\nAt least one of the Trump appointees overseeing cases in Minnesota is also grappling with compliance issues in the cases they’re handling. Judge Eric Tostrud is weighing a request from attorneys for a Mexican national for compensatory sanctions in his detention case. The judge has raised the possibility of holding a hearing over the request in the coming weeks.\n\nFor Schiltz’s part, the appointee of former President George W. Bush had summoned the head of ICE, Todd Lyons, before him last month to explain why he shouldn’t be held in contempt for violations of orders in cases he’s overseeing.\n\nDays before the hearing was set to take place, Schiltz backed down from his threat after an immigrant detainee was finally released from custody, as the judge had ordered. But the judge made clear that he wasn’t completely lifting the contempt threat.\n\n“The court warns ICE that future noncompliance with court orders may result in future show-cause orders requiring the personal appearances of Lyons or other government officials,” Schiltz wrote in the January 28 order.\n\nDavid Wilson, an immigration attorney in Minneapolis whose firm has been handling hundreds of cases stemming from Operation Metro Surge, including many where compliance issues have arisen, said that Schiltz’s 4-page broadside against the government represented a “boiling point” for a visibly frustrated court system.\n\n“There’s clearly a fire burning behind the building,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/federal-judges-trump-immigration-credibility",
      "text": "federal judges"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/prosecutor-job-sucks-minnesota-hold-me-in-contempt",
      "text": "The problem was on full view last week"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/judges-contempt-justice-department-minnesota",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/judges-contempt-justice-department-minnesota",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2795f259422f59760afb69aaedb191d15bb9fe7dbffc7583b4a7179da8be9534",
  "scraped_at": "2026-02-11T16:33:13.226337+00:00"
}