{
  "url": "https://lite.cnn.com/2026/02/22/asia/pakistan-strikes-afghanistan-militant-camps-intl-hnk",
  "title": "Pakistan launches airstrikes against Afghan-based ‘militants’ it blames for cross-border attacks | CNN",
  "date": "2026-02-24T07:33:19.214064+00:00",
  "authors": [
    "Sophia Saifi, CNN"
  ],
  "text": "Source: CNN\n\nPakistan said Sunday it carried out airstrikes on militant camps across the border in Afghanistan, in a serious test of an uneasy peace between the neighbors.\n\nPakistan’s information ministry said its military conducted “intelligence-based, selective operations” against seven camps belonging to militants it blames for a recent series of deadly attacks on its soil. The strikes targeted thePakistani Taliban– also known as Tehrik-e-Taliban Pakistan (TTP) – and its affiliates, as well as a group associated with the Islamic State.\n\nAfghanistan’s Ministry of Defense confirmed the strikes in a statement, calling them a “blatant violation of Afghanistan’s national sovereignty” and a “clear breach” of international law.\n\nThe strikes took place in civilian areas in the eastern Afghan provinces of Nangarhar and Paktika, targeting a religious seminary and “multiple civilian homes,” the ministry said.\n\nWomen and children were among the 18 people killed, Sayed Tayeb Hamad, a senior police official in Nangarhar, said on Afghan state television. The bodies of the victims were still being dug out from under the rubble on Sunday morning, according to state media reports.\n\nThe airstrikes came after a month of deadly attacks within Pakistan, the most recent being the killing of two soldiers, including a lieutenant colonel, by militants in the country’s northwest on Saturday, officials said.\n\nEarlier this month, dozens of people werekilled by a suicide blastin a Shia mosque in Pakistan’s capital Islamabad.\n\nPakistan’s information ministry said on Sunday that the country had “conclusive evidence” that the February attacks were carried out by militants at the “behest of their Afghanistan based leadership and handlers.”\n\nThis new escalation will test the delicate ceasefire that has been in place between the neighboring countries since last October, after theytraded their deadliest fire in years.\n\nDozens of civilians were killed and wounded in theskirmishes that broke out along their disputed, 1,600-mile border.It culminated in Afghanistan launching retaliatory attacks after Pakistan conducted airstrikes on its capital Kabul.\n\nIslamabad has long accused Kabul of harboring the TTP, which Kabul denies.\n\nIn a November interview with CNN, Pakistan’s Defense Minister Khawaja Asif said Pakistan wanted to “take out” the TTP’s leadership in Afghanistan, stating that it would employ “whatever means are available to us.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2016/01/20/asia/pakistan-taliban-profile-2016",
      "text": "Pakistani Taliban"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/asia/islamabad-pakistan-mosque-explosion-intl",
      "text": "killed by a suicide blast"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/asia/pakistan-afghanistan-attacks-intl-hnk",
      "text": "traded their deadliest fire in years."
    },
    {
      "url": "https://www.cnn.com/2025/10/11/asia/firefights-pakistan-afghanistan-border-intl-hnk",
      "text": "skirmishes that broke out along their disputed, 1,600-mile border."
    },
    {
      "url": "https://www.cnn.com/2026/02/22/asia/pakistan-strikes-afghanistan-militant-camps-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/asia/pakistan-strikes-afghanistan-militant-camps-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "27b0b9c235b152f30489b882e21e9cbb02c42fe83269ed391f975f4759dc1084",
  "scraped_at": "2026-02-24T07:33:19.214077+00:00"
}