{
  "url": "https://lite.cnn.com/2026/02/27/politics/kamala-harris-jasmine-crockett-texas-senate-primary",
  "title": "Kamala Harris is backing Jasmine Crockett in Texas’ Senate Democratic primary | CNN Politics",
  "date": "2026-03-01T07:07:40.290458+00:00",
  "authors": [
    "Arlette Saenz"
  ],
  "text": "Source: CNN\n\nFormer Vice President Kamala Harris recorded a robocall encouraging voters to support Rep. Jasmine Crockett in the Democratic primary for Senate in Texas, a source familiar with the matter said.\n\n“This is Kamala Harris, and I’m calling to encourage you to please go vote for my friend Jasmine Crockett in the Democratic primary today, Friday, February 27, or on Election Day, Tuesday, March 3,” Harris said in one of the calls shared with CNN.\n\n“Texas has the chance to send a fighter like Jasmine Crockett to the United States Senate. Jasmine has the experience and record to hold Donald Trump and his billionaire cronies accountable,” she added. “It’s time to turn Texas blue.”\n\nThe former vice president taped a similar robocall to be released on Tuesday.\n\nHarris’ decision to wade into the Democratic primary comes as Crockett is engaged in an increasingly heated and contentious race against state Rep. James Talarico.\n\nThe Texas Tribunewas first to reporton Harris’ robocalls in support of Crockett.\n\nCrockett, who was a co-chair of Harris’ 2024 presidential campaign, is a friend and longtime mentee of Harris. The congresswoman spoke at the 2024 Democratic National Convention in support of Harris, and sought advice from the former vice president before launching her Senate campaign in December, a source familiar with the matter said.\n\nHarris’ team spoke with the congresswoman’s campaign about how the former vice president could be helpful in the final stretch of the campaign, the source said.\n\nHarris has not weighed in on many Democratic contests, but when she has, it has been for candidates with whom she shares personal connections.\n\nHarris backed New Orleans Mayor Helena Moreno in her campaign in 2025. Moreno served as a co-chair of Harris’ first presidential campaign in 2019. Harris has also endorsed Dan Koh, a White House aide during her time as vice president, in his run for Congress in Massachusetts’ 6th Congressional District.\n\nAt the DNC in 2024, Crockett spoke of how Harris counseled her when she arrived in Congress, saying “When I first got to Congress, I wasn’t sure I made the right decision.”\n\n“She saw right through me. She saw the distress. I immediately began crying,” Crockett said. “And the most powerful woman in the world wiped my tears and listened. She then said, among other things, ‘You are exactly where God wants you.’”\n\nHarris wrote about Crockett in her memoir, saying she was among the “younger talents” in the party she wanted to help.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.texastribune.org/2026/02/27/kamala-harris-jasmine-crockett-robocall-texas-senate-democratic-primary/",
      "text": "was first to report"
    }
  ],
  "hash": "27eedb85c656c1f3142bfc931f19a0e89004d9f480d5292c6e8718bf675ccfaa",
  "scraped_at": "2026-03-01T07:07:40.290468+00:00"
}