{
  "url": "https://lite.cnn.com/2026/02/25/health/casey-means-surgeon-general-senate-hearing",
  "title": "Casey Means: Takeaways from surgeon general nominee’s Senate confirmation hearing | CNN",
  "date": "2026-02-27T07:17:09.622537+00:00",
  "authors": [
    "Sarah Owermohle"
  ],
  "text": "Source: CNN\n\nDr. Casey Means, the president’s nominee for surgeon general, believes the US is a “nation with a broken heart” reckoning with unprecedented amounts of chronic illness and mental illness. But during a lengthy confirmation hearing on Wednesday, she said vaccine policy would not be her priority.\n\nAt one point, she sparred with a senator over the benefits of flu vaccination, dodging repeated questions on whether she thinks it’s effective against hospitalization and death.\n\nMeans was interrogated by senators from both sides of the dais about her positions on vaccines, abortion and contraception and pesticides. She also fielded questions about her qualifications, conflicts and even her personal use of psychedelic mushrooms.\n\nMeans, abest-selling author, wellness influencer and Stanford medical graduate,testified for more than two hoursbefore the Senate Health, Education, Labor and Pensions Committee on Wednesday, nearly four months after her initial hearing was postponed for the birth of her child.\n\nShe was an early ally of now-Health and Human Services Secretary Robert F. Kennedy Jr.’s “Make America Healthy Again” campaign and has several important backers within the Trump administration.\n\nAlong with her brother Calley, who serves as an adviser to Kennedy at the US Department of Health and Human Services, Means has championed healthy eating, limited pharmaceutical use and alternative remedies. Means is also aco-founder of a health tech company, Levels, that connects glucose monitors to a health tracking app on users’ phones.\n\nMeans’ influence made the 38-year-old a recognizableearly advocate of the MAHA movement. President Donald Trump selected Means to be surgeon general in May, the same day the White Housewithdrew its nominationof Dr. Janette Nesheiwat.\n\nIn her opening remarks Wednesday, Means described the “unraveling” of mental and physical health” in the United States and “a society losing its mind” to dementia and depression.\n\n“As a physician, I have always been inspired that the root of the word healing means to return to wholeness,” she told senators. “Nothing is more urgent than restoring wholeness for Americans, physically, mentally and societally.”\n\nMeans said she would push to address root causes of chronic illness through nutrition, steering away from “frankenfoods made in factories,” and said she wants to focus the health care system on understanding “why we are sick and not just reactive sick care.”\n\nAdvocates and some former officials have criticized Means’ nomination because the surgeon general is typically a physician with clinical experience; Means dropped out of her medical residency program, and her Oregon medical license is inactive. Means acknowledged on Wednesday that her license is not active and she cannot write a prescription. She said she has no plans to reactivate her license.\n\nHere are highlights from the roughly two-and-a-half hour hearing.\n\nMeans’ vaccine views were a common theme throughout the hearing, with both Democrats and Republicans questioning her stance on the childhood vaccine schedule and certain immunizations under new scrutiny by Kennedy appointees, such as the hepatitis B vaccine.\n\nThe nominee had a tense back and forth with Virginia Democratic Sen. Tim Kaine over the benefits of flu vaccination.\n\nKaine asked repeatedly whether Means, a Stanford-trained physician, would agree that flu vaccination reduces the risk of hospitalization and death.\n\nMeans appeared unwilling to comment on the specific advantages of flu immunization, stating instead that she believes “vaccines save lives” and “I support the CDC guidance on the flu vaccine.” The US Centers for Disease Control and Prevention’s childhood vaccine schedule recently changed to say that flu vaccination should be based on “shared clinical decision-making,” which means people who want one must consult with a health care provider.\n\nKaine pressed repeatedly: “This is an easy one, doctor.”\n\nMeans eventually said that “at a population level, I certainly think that [flu vaccines could reduce risk].”\n\nThis year’s record-breaking flu season has the highestrates of doctors’ visitsin the US in more than two decades.\n\nSeveral senators including Republicans Bill Cassidy, chairman of the committee, and Lisa Murkowski questioned Means’ stance on the hepatitis B vaccine, which had been recommended for all infants at birth until recent changes by the Trump administration.\n\n“I think it is an important vaccine, a lifesaving vaccine. I also think that parents’ autonomy needs to be respected,” Means told Cassidy.\n\nHowever, she also sought to assure the chairman that vaccine policy would not be a priority for her as surgeon general.\n\n“I wanted to back up and broadly just reassure you that this is not an issue that I intend to complicate, or bring an agenda on vaccines. This is not the core of my issue,” Means said.\n\nOngoing controversy over the Trump administration’s actions on pesticides, and Means’ stance on it, was evident in the hearing Wednesday.\n\nLast week, Trumpsigned an executive orderto protect the national supply of glyphosate, a widely used herbicide commonly known as Roundup. The decision inflamed many MAHA advocates who have pressed for more stringent regulation or even bans.\n\nMeans, like Kennedy, has long suggested that exposure can lead to health issues.\n\nThe nominee was first questioned on the topic by Ohio Republican Sen. Jon Husted, who argued, next to a large poster board image of an ear worm destroying an ear of corn, that reducing glyphosate use would harm the national food supply.\n\nThe nominee said she understands that this is a complex issue and that widespread pesticide use cannot be changed overnight. Farmers, she said, are in an “impossible situation.”\n\nLater in the hearing, Massachusetts Democrat Sen. Ed Markey interrogated her conviction to pesticide action, arguing that Trump’s order represented a reversal for advocates like Means and Kennedy.\n\n“I am not in any way backing away from this issue. It is a core passion my life,” Means replied. “We must study these chemicals to understand their effect. I’m very gravely concerned about the health impacts of these chemicals.”\n\nShe added that she believes the administration is acting in “good faith” to reduce pesticide usage and that she understands the executive order to be about national security, or using US supply of the chemical rather than imports.\n\nAs surgeon general, Means would not have authority over pesticides. But surgeons general can commission reports on the research surrounding health issues, as past officials have done on tobacco, alcohol and mental health challenges.\n\nMeans declined early in the hearing to take a firm stance on limiting the abortion pill mifepristone to in-person prescribing by a doctor.\n\nSenate Republicans havecalled on the Trump administrationto reverse a Biden-era decision to allow mifepristone prescriptions through telehealth. The policy change allowed physicians to send the pill through the mail, sometimes circumventing restrictive state abortion bans.\n\nCassidy, who led a hearing on the topic last month, pressed the nominee on whether she believes mifepristone should be prescribed remotely.\n\nMeans told the committee that mifepristone policy was outside the purview of the surgeon general’s office.\n\n“But I do believe that every patient needs to have a very thorough conversation with their doctor before taking any medication,” Means said. “Unfortunately, in our current health care system, because of how overburdened doctors are, this often doesn’t happen, whether it’s in person or online.”\n\nDemocrats, meanwhile, questioned the nominee on her stance on birth control, which she has characterized in podcast interviews as potentially harmful to long-term health.\n\nMeans said she believes birth control should be widely accessible but repeated that patients should discuss risks and benefits with their doctors.\n\n“I want those women, and I know you do too, to be able to have a thorough conversation with their doctor and know whether they are at higher risk for side effects,” she said.\n\nDemocrats also repeatedly questioned the nominee’s medical experience and her potential conflicts of interests.\n\nMeans dropped out of her medical residency program months before completion, a decision she has described as disillusionment with the health care system and its incentives.\n\nOn Wednesday, Democrats questioned the status of her medical license. Means said that it is inactive because she is not currently seeing patients but that she has unique experiences to bring to the surgeon general role.\n\n“I have completed extremely thorough medical training, and I have the ability to use these experiences to communicate excellent public health information,” she said.\n\nAs a wellness writer and influencer, Means hadendorsed various wellness productsincluding nutrient tests, smoothies and supplements.\n\nThose included ENERGYbits, a supplement company that sponsored her now-dormant newsletter, and Daily Harvest, a smoothie subscription service thatmarketed a collection curated with Means.\n\nWisconsin Sen. Tammy Baldwin, a Democrat, also asked Means about accepting $10,000 from Genova Diagnostics, which markets products to test personal nutrient levels. Means appeared in a Genova video posted in October, months after her nomination to serve as surgeon general.\n\nBaldwin pointed out that in 2020, the company agreed with the US Justice Department to pay $43 million for charging unnecessary tests.\n\nMeans said that she was unfamiliar with that settlement but that “there’s a particular test that they make about nutrient quality that I find very compelling.”\n\nMeans told the committee she has worked closely with government ethics officials to eliminate conflicts of interest and has always been transparent about when she was paid to endorse a product.\n\nMaine Republican Sen. Susan Collins questioned Means abouther stance on psychedelic drugs, drawing from a passage in Means’ 2024 book, “Good Energy,” where she discussed using psilocybin, or psychedelic mushrooms, during her mother’s illness and subsequent death from pancreatic cancer.\n\n“When it comes to psychedelic therapies for mental health issues, I think science is still emerging,” Means said, emphasizing that she would follow the evidence. “I do believe that there is exciting work being done in this area that needs to continue, on psychedelic therapies for PTSD in veterans, for mental health issues.”\n\nKennedy has also shown interest in the potential of psychedelic therapies and last year in the HHS general counsel office hired a lawyer who has worked on access to psychedelics and cannabis for medical research.\n\nYet Collins seemed most concerned about what Means’ stance could mean for illicit drug use.\n\n“What I would say as a private citizen is in many cases different than what I would say as a public health official, joining a team where the purpose of this role is to communicate, absolutely, the best evidence-based science to the American people,” Means said.\n\nCorrection:A previous version of this story incorrectly identified Sen. Tammy Baldwin’s state.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/10/15/politics/casey-means-rfk-trump-surgeon-general",
      "text": "best-selling author, wellness influencer and Stanford medical graduate"
    },
    {
      "url": "https://www.cnn.com/2025/06/06/health/casey-means-surgeon-general-online",
      "text": "co-founder of a health tech company"
    },
    {
      "url": "https://www.cnn.com/2025/10/15/politics/casey-means-rfk-trump-surgeon-general",
      "text": "early advocate of the MAHA movement"
    },
    {
      "url": "https://www.cnn.com/2025/05/07/health/trump-surgeon-general-nesheiwat-means",
      "text": "withdrew its nomination"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/health/us-flu-cases-tracking-maps-vis",
      "text": "rates of doctors’ visits"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/health/maha-trump-glyphosate-health",
      "text": "signed an executive order"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/march-for-life-abortion-pill-mifepristone-lawsuit",
      "text": "called on the Trump administration"
    },
    {
      "url": "https://www.cnn.com/2025/06/06/health/casey-means-surgeon-general-online",
      "text": "endorsed various wellness products"
    },
    {
      "url": "https://daily-harvest.com/collections/metabolic-health-collection?srsltid=AfmBOorGwAvnRP3VatigangPjYHRceM05jStj6yINCca-LRrvpdetRGo",
      "text": "marketed a collection curated with Means"
    },
    {
      "url": "https://www.cnn.com/2025/05/15/health/casey-means-psychedelic-therapy",
      "text": "her stance on psychedelic drugs"
    }
  ],
  "hash": "27fb3904f2f2c04acffc0ba08d607af8172406d3aa8c7b8a824ea11510d25174",
  "scraped_at": "2026-02-27T07:17:09.622551+00:00"
}