{
  "url": "https://lite.cnn.com/2026/02/25/politics/ice-polling-places-midterms",
  "title": "ICE won’t be at polling places for midterms, Trump appointee tells state election officials | CNN Politics",
  "date": "2026-02-27T07:17:11.667767+00:00",
  "authors": [
    "Tierney Sneed",
    "Sean Lyngaas",
    "Marshall Cohen"
  ],
  "text": "Source: CNN\n\nA Donald Trump appointee at the Department of Homeland Security told state election officials from around the country Wednesday that federal immigration agents won’t be deployed to polling places during the 2026 midterms, according to multiple sources on the call.\n\nThe comments, made by DHS officialHeather Honeyduring an hour-long phone call organized between secretaries of state and officials at various federal offices, come after immigration enforcement surges in Minneapolis and elsewhere promptedgrowing worryamong election officials that ICE agents could be used to intimidate voters.\n\n“I’ll believe it when I see it,” one source on the call said of Honey’s pledge that ICE won’t be at polling places this November.\n\nResponding to questions from CNN, a DHS official said in a statement, “ICE is not planning operations targeting polling locations. ICE conducts intelligence-driven targeted enforcement, and if an active public safety threat endangered a polling location, they may be arrested as a result of that targeted enforcement action.”\n\nOther remarks by Honey, who has deep ties to theelection denial communitythat challenged Trump’s 2020 defeat, concerned Democratic election officials on the call, sources on the call told CNN.\n\nThere was silence from federal officials when Maine Secretary of State Shenna Bellows asked that they make a public statement affirming state sovereignty over election administration. Trump has continued to call for more federal control, includingcontroversial commentslast month that Republicans should “nationalize the voting.”\n\nDemocrats were also frustrated how Honey, according to sources on the call, handled a discussion of a system of immigration data known as SAVE that the administration is urging states to use to find non-citizens on their voter rolls, although the system is known to berife with false positives.After Honey spoke at length to encourage the states to vet their voter rolls with SAVE, Honey struggled with questions about how long the federal government retained voter registration data that states input into the system.\n\nBellows told reporters after the call that she appreciated the federal government reminding election administration offiicals what role it does have to play in elections – such as investigating threats against election officials.\n\n“What wasn’t reassuring was political statements by political appointees from the Trump administration … urging the states to participate in the faulty SAVE system,” Bellows said.\n\nThe call, held by officials from the Justice Department, FBI, DHS and the Election Assistance Commission, was a chance for federal and state election officials to share information on election administration and security procedures ahead of the midterms. It is normally a routine gathering that has occurred numerous times since 2016, when Russia’s efforts to influence that election prompted the federal government to step up security assistance to states.\n\nBut the Trump administration’s appointment of political officials at DHS, the Justice Department and the White House who have questioned the results of the 2020 election that Trump lost has made some election officialswaryof outreach from the administration.\n\nOther sources said the federal government was slow in its outreach to election officials.\n\n“If this call was to help prepare election officials for the coming elections, statewide primaries start next week, so this is a strange time for the feds to introduce themselves,” one source on the call said. “Election officials have been preparing for the 2026 elections since December 2024 - where have the feds been for the last 15 months?”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/10/24/politics/2020-election-deniers-power-trump-administration",
      "text": "Heather Honey"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/trump-elections-midterms-democrats-secretaries-of-state",
      "text": "growing worry"
    },
    {
      "url": "https://www.cnn.com/2025/10/24/politics/2020-election-deniers-power-trump-administration",
      "text": "election denial community"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/trump-nationalize-elections-constitution-clause",
      "text": "controversial comments"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/trump-voter-roll-audit-push",
      "text": "rife with false positives."
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/fbi-state-election-officials-worries",
      "text": "wary"
    }
  ],
  "hash": "285a18279f5de92644cf70bb8b2b9855e4b7f71104b0bb85e4fd80f9d5ae8f32",
  "scraped_at": "2026-02-27T07:17:11.667782+00:00"
}