{
  "url": "https://lite.cnn.com/2026/02/16/business/retirement-auto-ira-business-mandates",
  "title": "Where businesses must offer employees a retirement plan | CNN Business",
  "date": "2026-02-17T07:31:02.113937+00:00",
  "authors": [
    "Jeanne Sahadi, CNN"
  ],
  "text": "Source: CNN\n\nMore than 50 million USprivate-sector employeesdon’t have access to a workplace retirement savings plan like a 401(k).\n\nBut agrowing number of states are now requiring most private-sector employers to provide what are known as “auto IRAs” if they don’t already offer a workplace plan. Each employee gets their own retirement account, with automatic contributions made from their paychecks.\n\nOregon was firstin 2017. Today, a total of 15 states have an active auto-IRA program, and two others are in the process of implementing theirs,according to the Pew Charitable Trusts. Plus, eightstates are weighing legislation this year to create their own auto-IRA programs.\n\nThere is now $2.79 billion in nearly 1.2 million funded auto IRA accounts as of January 31, according to the latest data from theGeorgetown Center for Retirement Initiatives. That counts assets across 12 state programs; it does not include the three states that opened programs in the past several months.\n\nNew York is one of those three states. Itsplanopened in October. Employers have until March 18 to register if they have 30 or more employees; until May 15 if they have 15 to 29; or July 15 if they employ 10 to 14 people.\n\nThe only employers exempt from New York’s mandate are those with fewer than 10 employees or those that have been in business less than two years. Several other states have tighter exemptions, such as businesses with five or fewer employees, according to Kim Olson, Pew’s senior officer for retirement planning.\n\nState-based auto IRAs areRoth IRAs. The accounts are funded with after-tax money, which then compounds tax free.\n\nEmployers automatically deduct a small portion of yourpaycheck — usually 3% or 5% — and invest it in, most typically, atarget-date fundbased on your anticipated year of retirement.\n\nEmployers then automatically increase﻿ your contributions by 1% of your paya year until the contributions reach between 8% and 10%, depending on state rules. You also may choose to increase or decrease your contributions yourself (or even opt out).\n\nThere is usuallyno cost to employers to enroll their workers in the plan, and matching employer contributions are not permitted in Roth IRAs. Employers also don’t assume fiduciary duty — meaning they don’t have to worry about selecting solid, low-cost investments and making other decisions in the best interest of plan participants. That duty usually resides with a state board overseeing the program, Olson said.\n\nBut starting in 2027, workers may qualify for a federalSaver’s Matchworth up to $1,000 a year. That match — equal to half of your retirement contributions up to $2,000 — will be deposited directly into your Roth IRA.\n\nThe Saver’s Match replaces a current non-refundable tax credit for low- and moderate-income workers who save for retirement in a workplace plan or IRA. Tax credits reduce a person’s tax liability dollar for dollar but don’t directly add to savings accounts. And, because the current savings tax credit is non-refundable, it may not help lower-income workers who don’t have much, if any, income tax liability.\n\nIt’s hard for most people to save enough for retirement without also getting a pension from their job — and most private sector employeeswill notget one.\n\nAuto IRA mandates won’t solve retirement insecurity. But they can give those who participate a leg up.\n\nFor one thing, Olson noted, it provides savings a person wouldn’t have otherwise. If low- and moderate-income workers can consistently contribute to an auto IRA over the years, it may grow to a point where it allows the worker to take Social Security a little later than planned. And that canincrease their monthly benefit checkfor the rest of their lives.\n\n“Will it be enough (for a fully secure retirement)? No,” Olson said. “But this is a way to get people in the door to start investing.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cri.georgetown.edu/states/state-data/current-year/",
      "text": "Georgetown Center for Retirement Initiatives"
    },
    {
      "url": "https://newyorksecurechoice.com/employers?utm_source=paidsearch&utm_medium=google&utm_campaign=statewide&utm_term=english&utm_content=rsa&gad_source=1&gad_campaignid=23052377746&gbraid=0AAAABBi_BmKGQV5ehTK0jT9SfA6F_cieG&gclid=EAIaIQobChMIhduv84PXkgMVclhHAR1-IxGEEAAYASAAEgI35PD_BwE",
      "text": "plan"
    },
    {
      "url": "https://www.irs.gov/newsroom/401k-limit-increases-to-24500-for-2026-ira-limit-increases-to-7500",
      "text": "Roth IRAs"
    },
    {
      "url": "https://www.cnn.com/2023/12/02/success/target-date-funds-401k-explained",
      "text": "target-date fund"
    },
    {
      "url": "https://www.pew.org/en/research-and-analysis/reports/2025/09/federal-savers-match-coming-in-2027-could-boost-automated-retirement-savings-programs",
      "text": "Saver’s Match"
    },
    {
      "url": "https://www.cnn.com/2023/09/07/success/pensions-retirement-savings-explained",
      "text": "will not"
    },
    {
      "url": "https://www.ssa.gov/pubs/EN-05-10147.pdf",
      "text": "increase their monthly benefit check"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/retirement-auto-ira-business-mandates",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/business/retirement-auto-ira-business-mandates",
      "text": "Cookie Settings"
    }
  ],
  "hash": "297338e76f51aee98d61ede735f0f65b43fdbf7520d8171f6be982d36b8e297e",
  "scraped_at": "2026-02-17T07:31:02.113951+00:00"
}