{
  "url": "https://lite.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
  "title": "Mexico’s most-wanted drug leader killed in military operation as clashes erupt and US tourists told to shelter in place | CNN",
  "date": "2026-02-24T07:32:41.655483+00:00",
  "authors": [
    "Fidel Gutierrez",
    "Mitchell McCluskey",
    "CNN"
  ],
  "text": "Source: CNN\n\nNemesio “El Mencho” Oseguera Cervantes, the powerful and long-pursued head of the Jalisco New Generation Cartel and one of the world’s most-wanted traffickers,died following a Mexican military operationon Sunday, handing the country a consequential victory as it looks to show tangible results to the Trump administration.\n\nOseguera, a former police officer, led the Jalisco New Generation Cartel, or CJNG, as it became one of the “most powerful and ruthless criminal organizations” inside Mexico, according to the US Drug Enforcement Administration.\n\nViolence erupted in several states in Mexico after security forces from multiple federal branches of Mexico’s military carried out the operation in the town of Tapalpa in the western state of Jalisco. Officials said suspected members of organized crime unleashed a wave of violence following the operation, torching buses and businesses while clashing with security forces.\n\nThe US State DepartmenturgedAmerican nationals in parts of Mexico to “seek shelter and remain in residences or hotels” until further notice.\n\nMexico’s Secretariat of National Defense said that US authorities provided “complementary information” that supported the operation. A US defense official confirmed that an interagency US task force “played a role” in the operation. However, the precise role that the US played is still unclear.\n\nSince itsestablishmentin January, the Joint Interagency Task Force-Counter Cartel has regularly worked with the Mexican military through US Northern Command to combat cartel operations along the US-Mexico border, the US official said.\n\n“However, I want to emphasize that this was a (Mexican military) operation, so the success is theirs,” the official noted.\n\nDuring the raid, CJNG members traded fire with the government forces, resulting in four gang members being killed at the scene, the defense ministry said.\n\nOsegeura and two others were seriously injured and died as they were being transported via aircraft to Mexico City, according to the ministry.\n\nThree Mexican military personnel were also injured in the operation and transferred to a hospital in Mexico City for treatment.\n\nMexican President Claudia Sheinbaum lauded the work of the agencies involved in the mission.\n\nMexico’s various state governments are working in “full coordination” to address the disorder, Sheinbaum said on Sunday, adding that “activities are proceeding normally” in most of the country.\n\n“We work every day for the peace, security, justice, and well-being of Mexico,” she said.\n\nThe military operation triggered a series of violent events across the state of Jalisco, which is scheduled to host four matches of the 2026 soccer World Cup in June, before spreading to other states such as Michoacán and Guanajuato.\n\nSuspected members of organized crime groups set buses on fire, blocked roads in the area, and clashed with authorities, Jalisco Governor Pablo Lemus Navarro reported.\n\nVideo obtained by CNN showed multiple fires burning and plumes of smoke rising across Puerto Vallarta, a resort town popular with US tourists on Mexico’s west coast.\n\nAs a result of the violence, several airlines, includingDelta Air Lines,Alaska Airlines,American AirlinesandAir Canada, cancelledflightsto Puerto Vallarta and Guadalajara, leaving some tourists temporarily stranded.\n\nFootage captured at major airports and verified by CNN showed distant smoke and panicked travelers.\n\nAt Guadalajara’s international airport, travelers took cover near a jetway and sprinted through the terminal.\n\nAnother video showed a large group of people being escorted by uniformed employees across the tarmac of Puerto Vallarta’s main airport.\n\nAmid the flight cancellations, Mexico’s Federal Civil Aviation Agency reported that the airports of Guadalajara, Puerto Vallarta and Tepic had resumed normal operations on Sunday afternoon.\n\nDuring the military operation, Lemusurgedresidents to remain in their homes and said that public transportation services in Jalisco would be suspended “until the situation is under control.”\n\nThe governor stated that the violence has spread to at least five states and urged the public to avoid traveling on highways.\n\nThe Michoacán Public Security Secretariat reported that efforts are underway to restore traffic flow following the road blockades.\n\nMeanwhile, the Guanajuato Security and Peace Secretariat reported fires at pharmacies and convenience stores in different parts of the state.\n\n“No injuries have been reported, but there has been property damage,” the statement added, announcing the deployment of a security operation in coordination with the Army, the National Guard and municipal police.\n\nCarlos Navarro, 54, a US-Mexico dual citizen, was traveling to visit family in a small town in his home state of Jalisco as the operation unfolded.\n\nWhile waiting for a connecting bus in Guadalajara, he was informed that the service was canceled due to a bus being set on fire.\n\nNavarro took refuge in a nearby Walmart, where panicked employees permitted him to stay even as an evacuation was underway.\n\n“You hear about it, but it’s very different to hear it on the news than to experience it firsthand,” he told CNN, “It’s very difficult because it makes you very sad. It makes you very sad because I love my country.”\n\nOseguera worked for CJNG as it splintered off from the Milenio Cartel, eventually rising through the ranks to lead the criminal enterprise.\n\nUnder his leadership, CJNG expanded its power and control in Jalisco and the surrounding area.\n\nMexican authorities long sought to apprehend Oseguera for his involvement in the cartel.  In 2018, Mexico’s Attorney General’s Officeoffered30 million pesos ($1.7 million USD) for information leading to his arrest.\n\nOseguera was also wanted by US authorities, who offered a bounty of up to $15 million for information leading to his arrest.\n\nThe US Justice Department charged Oseguera in 2022 with leading the effort to manufacture and distribute fentanyl for importation into the US.\n\nA Justice Department indictment of Oseguera said his organization is active in the Mexican states of Jalisco, Colima, and Veracruz, and has a presence elsewhere.\n\nIn 2025, Oseguera wassanctionedand classified as a Specially Designated Global Terrorist by the US Department of State.\n\nIn a post on X, Deputy Secretary of State Christopher LandaudescribedOseguera’s death as a “great development for Mexico, the US, Latin America, and the world.”\n\nHe added that he is watching the chaotic scenes in Mexico “with great sadness and concern.”\n\nSheinbaum has previously cast doubt on the strategy of targeting cartel kingpins, warning that decapitating criminal organizations can fracture them into rival factions and ignite new cycles of violence. Yet security remains a persistent vulnerability for her administration.\n\nOver the past year, Sheinbaum has come under intensifying pressure from US President Donald Trump, as he threatensmilitary interventionandhigher import tariffsif Mexico fails to demonstrate concrete gains in curbing drug trafficking.\n\nShortly after the US capture of ousted Venezuelan leader Nicolás Maduro, Trump suggested that he could expand his military campaign to Mexican drug trafficking groups.\n\nSheinbaum has rejected the notion of US strikes in Mexico, characterizing them as a violation of Mexico’s sovereignty and territorial integrity.\n\nInstead, she haspursueda direct approach to combating organized crime by increasing cooperation with US security partners.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/live-news/mexico-el-mencho-killed-travel-chaos-02-23-26-intl-hnk",
      "text": "died following a Mexican military operation"
    },
    {
      "url": "https://mx.usembassy.gov/security-alert-update-ongoing-security-operations-u-s-mission-mexico-february-22-2026/",
      "text": "urged"
    },
    {
      "url": "https://www.northcom.mil/Newsroom/News/Article/Article/4381245/joint-interagency-task-force-counter-cartel-jiatf-cc-established/",
      "text": "establishment"
    },
    {
      "url": "https://www.delta.com/us/en/advisories/other-alerts/jalisco-mexico-civil-unrest",
      "text": "Delta Air Lines"
    },
    {
      "url": "https://www.alaskaair.com/content/advisories/travel-advisories",
      "text": "Alaska Airlines"
    },
    {
      "url": "https://www.aa.com/i18n/travel-info/travel-alerts.jsp",
      "text": "American Airlines"
    },
    {
      "url": "https://x.com/AirCanada/status/2025633731227095116",
      "text": "Air Canada"
    },
    {
      "url": "https://www.cnn.com/travel/flight-canceled-delayed-what-to-do",
      "text": "flights"
    },
    {
      "url": "https://x.com/PabloLemusN/status/2025601125991252186",
      "text": "urged"
    },
    {
      "url": "https://www.gob.mx/fgr/prensa/comunicado-873-18-ofrece-pgr-recompensa-de-30-millones-de-pesos-por-informacion-que-conduzca-a-la-detencion-de-ruben-oseguera-cervantes",
      "text": "offered"
    },
    {
      "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/06/sanctioning-cjng-leaders-as-specially-designated-global-terrorists",
      "text": "sanctioned"
    },
    {
      "url": "https://x.com/DeputySecState/status/2025648742049947797",
      "text": "described"
    },
    {
      "url": "https://www.cnn.com/2025/02/18/politics/cia-drone-missions-mexico-drug-cartels/index.html",
      "text": "military intervention"
    },
    {
      "url": "https://www.cnn.com/2025/04/03/americas/mexico-praises-preferential-us-tariffs-treatment-latam-intl/index.html",
      "text": "higher import tariffs"
    },
    {
      "url": "https://www.cnn.com/2025/02/12/americas/analysis-sheinbaum-mexico-trump-tariff-cool-head-intl-latam/index.html",
      "text": "pursued"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2974d4924c1cae989623f8c471e024d101c7bf0803fb596ead9cdd40cb2a0da5",
  "scraped_at": "2026-02-24T07:32:41.655497+00:00"
}