{
  "url": "https://lite.cnn.com/2026/02/25/us/nancy-guthrie-reward-strategy",
  "title": "Nancy Guthrie investigation: The strategy behind the new $1 million reward | CNN",
  "date": "2026-02-27T07:16:15.243878+00:00",
  "authors": [
    "Chelsea Bailey"
  ],
  "text": "Source: CNN\n\nAs the search for Nancy Guthrie stretches into its fourth, desperate week, her family has offered up to a million dollars for information leading to her return.\n\nThe staggering reward is, in some ways, a tacit admission that the investigation is entering a new phase as DNA evidence that once seemed promising hits roadblocks, and investigators acknowledge they still do not have a suspect in the kidnapping case.\n\nEven as she said her family is “blowing on the embers of hope” that the 84-year-old will make it safely home, Savannah Guthrie acknowledged a sobering truth:\n\n“We also know that she may be lost. She may already be gone,” Guthrie said in her video Tuesday announcing the reward. “But we need to know where she is.”\n\nThe tragic admission, coming more than a week after Guthrie’s last appeal to her mother’s captors, sparks questions as to why investigators and the family chose to wait weeks to put forward such a large and enticing reward. CNN spoke to law enforcement experts and analysts about the possible strategy behind the timing of such a compelling offer – and why it could portend a tragic turn in the investigation.\n\nIn the weeks since Guthrie’s disappearance, thousands of tips have poured into the investigation’s hotline. But the tide began to ebb in recent days, and the Pima County 911 supervisor told CNN the number of credible tips had begun to slow.\n\nThen, the Guthrie family offered their million-dollar reward.\n\nSince the details of the reward were made public, the FBI told CNN investigators have received more than 750 credible tips – among a total of about 23,000 tips collected since the beginning of the investigation.\n\nAnd while the number is significantly lower than the thousands of calls the tipline received earlier in the investigation, experts say that could be by design.\n\n“This reward is designed to prompt somebody within the suspect’s orbit” to come forward, Jonathan Wackrow, a former Secret Service agent who served under President Obama, said.\n\n“It’s not the suspect themselves that the messaging is focused on, it’s this broader orbit of associates – potentially friends, family, co-conspirators – really for them to break their silence.”\n\nSomeone with a personal connection to Guthrie’s abductor may not have been tempted by the prior $200,000 reward for information, but the prospect of up to a million-dollar payout could mitigate some of the risk of contacting law enforcement, Wackrow said.\n\nA source close to the family told CNN the Guthries were willing to put forward a similar reward earlier in the investigation, but there was concern such a large amount could inundate the call center tasked with sifting through tips.\n\nThere are a number of reasons why law enforcement may have advised the Guthries to wait before making such a large offer, CNN senior law enforcement analyst Josh Campbell said.\n\n“Time is of the essence in a kidnapping case, and bogging down investigators with a mountain of false leads could have slowed their effort as they sorted fact from fiction,” he said.\n\nAnd, he added, early in an investigation, the goal is to open a line of communication with the abductor and bring the case to a fast and safe resolution.\n\n“It can be very counterproductive to simultaneously appeal to the abductor to do the right thing, while at the same time encouraging people who might know the abductor to turn on him with the incentive of a million-dollar reward.”\n\nThe FBI’s crisis negotiators, Campbell said, would have likely been trying to find a balance between enticing people with direct knowledge of the kidnapping to come forward and not angering an abductor and inadvertently causing harm to the victim.\n\nSources close to both the Guthries and the investigation tell CNN the family has continued to work in lock step with authorities, and the new reward was offered in consultation with law enforcement.\n\nIndeed, Savannah Guthrie’s language around the reward appeared to align with how the FBI framed its previous offers – with one key distinction.\n\nIn recent weeks, the FBI hasofferedpayouts for information “leading to the location of Nancy Guthrie and/or the arrest and conviction of anyone involved in her disappearance.”\n\nBut now, after acknowledging that her mother may be “dancing in heaven,” Savannah said her family is offering up to a million dollars for “any information that leads to her recovery.”\n\nThe subtle shift in language indicates the Guthrie family’s reward does not hinge on an arrest of Nancy’s captors. It may also be a reluctant nod to an even worse tragedy.\n\n“This is shifting to acceptance of a whole variety, or a multitude of outcomes including the fact that (Nancy) may now be deceased and they’re looking for closure,” Wackrow said, adding he finds it “shocking” that it took weeks to get to this point in such a high-profile investigation.\n\n“Again, (the $1 million reward) is a tactic; I would have expected it to be earlier on in this investigation, not midway through the fourth week.”\n\nCNN’s Josh Campbell, Alisha Ebrahimji, Elizabeth Hartfield and Brian Stelter contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://x.com/FBIPhoenix/status/2022084453699350981",
      "text": "offered"
    }
  ],
  "hash": "2ab7b333ac05958e1946cdf9c6555a22b2eafa359130434d5d6aba7922a185b0",
  "scraped_at": "2026-02-27T07:16:15.243893+00:00"
}