{
  "url": "https://lite.cnn.com/2026/02/17/media/wbd-netflix-paramount-shareholder-vote-bid",
  "title": "Warner Bros. Discovery backs Netflix merger while reopening Paramount talks | CNN Business",
  "date": "2026-02-18T07:31:32.867859+00:00",
  "authors": [
    "Brian Stelter, CNN"
  ],
  "text": "Source: CNN\n\nWarner Bros. Discovery wants to hear Paramount’s “best and final proposal” for the media company, and is opening a brief window for discussions about a bid, while also moving forward with its Netflix merger and urging shareholders to reject Paramount’s current hostile bid.\n\nIf that sounds convoluted, that’s because it is.\n\nWarner Bros. Discovery, or WBD for short, is worth tens of billions of dollars, and the company’s board is trying to ensure it squeezes every possible billion out of its suitors.\n\nSo on Tuesday morning, WBD said it is reopening talks with Paramount, seeking a higher price, while recognizing that Netflix can and likely will match the price.\n\nAnd on Tuesday afternoon, Paramount welcomed the chance to have “good faith and constructive discussions.”\n\nNetflix, for its part, criticized Paramount aggressively on Tuesday, saying that Paramount’s “financing challenges and rapid deleveraging plans pose tremendous risk to the entertainment industry.”\n\nLast December, WBD agreed to sell most of the company, including the Warner Bros. movie studio and HBO, to Netflix. WBD’s cable channels, including CNN, are not part of the sale.\n\nThe deal with Netflix doubled as a rejection of Paramount. But Paramount CEO David Ellison responded by going directly to shareholders with a $30-per-share offer for all of WBD, including CNN.\n\nThat’s the offer WBD is officially opposing. On Tuesday morning, WBDsaid it will hold a special shareholder meetingon March 20 and will recommend voting to approve the Netflix deal, which values the studio and streaming assets at $27.75 per share.\n\nWBD has argued that the sale to Netflix, along with the creation of Discovery Global, a new company housing the cable channels, is the best available option for investors, while calling the Paramount proposaloverly riskyand likening it to a leveraged buyout.\n\nBut there is a big unknown: What is Paramount’s “best and final” offer?\n\nIn negotiating parlance, that’s the most a buyer is willing to pay, and Paramount hasn’t shared its answer.\n\nDuring the initial bidding war for WBD last year, Paramount indicated it was willing to pay more than $30 per share. Last week, according to WBD, a person speaking on Paramount’s behalf told a Warner board member that Paramount would agree to pay $31 per share if the two sides held deal talks.\n\nThe person left some additional wiggle room by indicating that $31 was not the final offer.\n\nAnd so, despite having a signed merger agreement, Netflix has granted WBD a limited waiver to talk with Paramount for the next seven days.\n\n“We seek your best and final proposal,” WBD said in a letter to Paramount’s board on Tuesday morning.\n\nThe rest of the letter, full of financial jargon and legalese, can be translated thusly: It’s time to put up or shut up.\n\nParamount responded Tuesday afternoon by calling the WBD board’s actions “unusual,” but adding, “Paramount is nonetheless prepared to engage in good faith and constructive discussions.”\n\n“At the same time, we will continue to advance our tender offer, maintain our solicitation in opposition to the inferior Netflix merger, and proceed with our intention to nominate a slate of directors at the upcoming WBD annual meeting,” Paramount said.\n\nParamount made some moves in WBD’s direction last week with an amended proposal thatslightly sweetenedthe takeover terms.\n\nHolding talks with Paramount now might unlock even more cash for a company that was barely trading at $10 per share one year ago, before all the sale talk erupted.\n\n“Throughout the entire process, our sole focus has been on maximizing value and certainty for WBD shareholders,” WBD CEO David Zaslav said in a Tuesday press release.\n\nReferring to Paramount by its stock ticker symbol, he said, “Every step of the way, we have provided PSKY with clear direction on the deficiencies in their offers and opportunities to address them. We are engaging with PSKY now to determine whether they can deliver an actionable, binding proposal that provides superior value and certainty for WBD shareholders through their best and final offer.”\n\nParamount has already filed a lawsuit over the merger battle, so WBD’s latest by-the-book move might also be seen as a legal safeguard.\n\nWarner emphasized on Tuesday that its board has not determined that Paramount’s proposal is “reasonably likely to result in a transaction that is superior to the Netflix merger.”\n\nBut they’re going to talk — so it’s not entirely unlikely, either.\n\n“While we are confident that our transaction provides superior value and certainty, we recognize the ongoing distraction for WBD stockholders and the broader entertainment industry caused by PSKY’s antics,” Netflix said in a statement Tuesday morning. “Accordingly, we granted WBD a narrow seven-day waiver of certain obligations under our merger agreement to allow them to engage with PSKY to fully and finally resolve this matter.”\n\nNetflix also accused Paramount of misleading WBD shareholders “about the real risk of their regulatory challenges around the world;” criticized Paramount for “undershooting its financial projections,” and said a Paramount-Warner deal would lead to “consolidation and layoffs.”\n\nNetflix also called out “the foreign funding” supporting Paramount’s bid, which comes in large part from the royal families of Saudi Arabia, Qatar and Abu Dhabi.\n\nThe funding “is already raising serious national security concerns,” Netflix said, predicting close scrutiny by regulators in multiple countries.\n\nAs Rich Greenfield of Lightshed Partners recently said, “the battle for Warner Bros. will make a great ‘Succession’ spinoff series on Netflix” someday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://ir.wbd.com/news-and-events/financial-news/financial-news-details/2026/Warner-Bros--Discovery-Sets-Special-Meeting-Date-of-March-20-2026-and-Unanimously-Recommends-Shareholders-Vote-FOR-Netflix-Merger-Warner-Bros--Discovery-to-Initiate-Discussions-with-Paramount-Skydance-for-Their-Best-and-Final-Offer/default.aspx",
      "text": "said it will hold a special shareholder meeting"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/media/paramount-warner-bros-wbd-offer",
      "text": "overly risky"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/media/paramount-sweetens-bid-warner-bros-netflix",
      "text": "slightly sweetened"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/media/wbd-netflix-paramount-shareholder-vote-bid",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/media/wbd-netflix-paramount-shareholder-vote-bid",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2bf0323d19b9890bc7c1e91f1c529a8581c804fd6906538ef8a070b4b52cf671",
  "scraped_at": "2026-02-18T07:31:32.867871+00:00"
}