{
  "url": "https://lite.cnn.com/2026/02/26/us/texas-ruben-ray-martinez-shooting-grand-jury-hnk",
  "title": "Ruben Ray Martinez: Texas grand jury rejects indictments in fatal shooting of US citizen by federal immigration agent | CNN",
  "date": "2026-02-26T07:30:47.466666+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nA grand jury on Wednesday rejected indictments over thefatal shooting last year of a US citizenby a federal immigration agent during a traffic encounter in Texas, prosecutors said.\n\nThe shooting of Ruben Ray Martinez on March 15, 2025, by a Homeland Security Investigations agent wasn’t publicly disclosed by the Department of Homeland Security until The Associated Press and other media outlets reported it last week. HSI is an investigative unit which falls under US Immigration and Customs Enforcement.\n\nThe Cameron County District Attorney’s Office said in a statement that a grand jury declined to hand up indictments after being presented the case. The office did not provide additional details.\n\nIn a previous statement DHS alleged that the 23-year-old “intentionally ran over” an HSI special agent, causing another agent to fire “defensive shots to protect himself, his fellow agents, and the general public.”\n\nThe shooting would mark the earliest of at least six deadly shootings by federal officers since anationwide immigration crackdownwas launched in President Donald Trump’s second term.\n\nAttorneys for Martinez’s family, who are skeptical of DHS’ account of the shooting, said in a statement Wednesday that because grand jury proceedings are private they don’t know what witness statements or video evidence were presented to the jurors.\n\nThey are calling on the Texas Department of Public Safety to disclose the findings of its investigation so Martinez’s family can “determine for themselves whether ICE’s story is accurate and why Ruben was killed that night.”\n\nThe attorneys cited adraft affidavit from the passenger, Joshua Orta, in the car with Martinez when he was shot. In the draft testimony, Orta reportedly said that Martinez did not hit an officer with his vehicle, that their car was “just crawling” and that a federal agent fired into the driver’s side window without “giving any warning, commands, or opportunity to comply.”\n\nOrta, a key witness to the encounter, died in a car crash last weekend.\n\nMartinez’s family are “proud Americans, strong supporters of law enforcement, and Trump voters. They believe there are honest and decent officers out there,” the statement read.\n\n“They just want to be treated honestly and decently.”\n\nMartinez, who lived in San Antonio, Texas, and Orta were on a Spring Break trip to South Padre Island when he was shot. His death was reported by local media outlets at the time, but authorities did not disclose that the shooting involved a team from HSI.\n\nAn incident report from ICE described the officers’ account of what happened while they were assisting local police redirect traffic around a car accident.\n\nA four-door Ford with a driver and passenger approached officers, who ordered the driver to stop, the report said.\n\nInitially, the driver didn’t respond to commands but eventually came to a stop, and agents surrounded the vehicle, telling those inside to get out, according to the report.\n\nThe driver then “accelerated forward” and struck an HSI special agent “who wound up on the hood of the vehicle,” prompting a HSI supervisory special agent nearby to fire his weapon multiple times through the open driver’s side window, the report said.\n\nThe draft affidavit disputes those details.\n\nIn it, Orta reportedly said that he and Martinez were first approached by a police officer who told them to leave. As they tried turning, another officer approached, slapped the hood and “seemed to be trying to get in front of the car,” it added.\n\nOfficers surrounded the vehicle yelling at them to stop and drawing their guns, the draft affidavit said, adding that Martinez was “only crawling,” and never hit an officer or the gas.\n\nAn officer near the driver side window then pulled his weapon and fired without warning, the draft affidavit said, and Orta recounted hearing Martinez say “I’m sorry” as he slumped backward unconscious.\n\nReyes, Martinez’s mother, told AP last week her son was shot three times.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/20/us/texas-ruben-ray-martinez-shooting",
      "text": "fatal shooting last year of a US citizen"
    },
    {
      "url": "https://www.cnn.com/politics/immigration",
      "text": "nationwide immigration crackdown"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/ruben-ray-martinez-shooting-witness-killed",
      "text": "draft affidavit from the passenger"
    }
  ],
  "hash": "2c1b0e5f5213cbc0ba7a768641615f150563d536e2eebdd01eb1f4768490c3e4",
  "scraped_at": "2026-02-26T07:30:47.466678+00:00"
}