{
  "url": "https://lite.cnn.com/2026/02/13/science/why-humans-have-not-been-back-to-moon",
  "title": "Why haven’t humans been back to the moon in over 50 years? | CNN",
  "date": "2026-02-14T07:07:57.255979+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAs he took his final steps before leaving the moon, Apollo 17 commander Gene Cernan had some poignantclosing words: “We leave as we came, and, God willing, as we shall return, with peace and hope for all mankind.”\n\nIt was December 14, 1972, and Cernan knew his footprints would be the last to impress the lunar soil for a while, because the planned Apollo missions that were supposed to follow— 18, 19 and 20 — had long since been canceled. But he probably wouldn’t have guessed that, over 50 years later, his speech would stand as the last words spoken by a human on the moon.\n\nArtemis II, which NASA is preparing to launch as soon as March after recent testing delays, will perform a lunar fly-by rather than a landing. Still, the mission will mark humanity’s first journey to the vicinity of the moon since Apollo 17.\n\nSo why has it taken so long for astronauts to go back?\n\n“The short answer to that question is political will,” said Teasel Muir-Harmony, a historian of science and technology and the curator of the Apollo Collection at the Smithsonian National Air and Space Museum in Washington, DC. “It takes a whole lot of political will to send humans to the moon. These are extremely complex, really costly, major national investments. It has to be a priority over a sustained period of time.”\n\nIn the years since the Apollo program ended due to budget cuts, there have been a number of other federalinitiatives to send humans to the moon again, Muir-Harmony added. “But what’s happened is that as presidential administrations changed, space priorities for these large-scale programs also changed. And so we just haven’t seen the sustained political will to follow through with a program that will take many years, significant funding and lots of resources in general.”\n\nLes Johnson, a former NASA chief technologist who worked at the agency for over three decades, agreed that rapidly changing political objectives have been a key factor: “Every four to eight years, NASA has its human spaceflight goals and objectives completely, totally, radically altered,” he said.\n\n“When I joined NASA in 1990, we were directed to go back to the moon by then President George H.W. Bush. But when President Clinton took office in 1993, he canceled that. He said, we’re going to make the space station happen — don’t do anything associated with going back to the moon,” Johnson said. “We did that for eight years, and then in 2001 we got George W. Bush, and he said, cancel all this other stuff and let’s focus on going back to the moon. So we did, and a project called Constellation was born, which survived the two terms of the second Bush presidency.”\n\nThe cycle continued with Barack Obama moving NASA’s priorities more toward sampling asteroids, and President Donald Trump coming in and shifting back to lunar goals. Then, after 2020, Joe Biden broke up the pattern.\n\n“He was the first president in my career at NASA who did not change everything,” Johnson said of Biden. “He said, I really didn’t like a lot of what Trump did, but I think going back to the moon is a good idea. Let’s just keep going.” Now, in Trump’s second term, his administration has recently doubled down on returning astronauts to the lunar surface — intent on outpacing China in the new space race.\n\nPolitical hurdles aside, however, moon missions also present a remarkabletechnical challenge. Earth’s natural satellite is roughly a quarter of a million miles (over 400,000 kilometers) away, and over half of all lunar landing attempts have ended in failure. The Artemis program —making use of a rocket and spacecraft that have taken two decades and more than $50 billion to complete—is NASA’s latest and most promising attempt to bring such feats within reach.\n\nMany similarities between Apollo and Artemis are undeniable, including a near match in the mission profile between Apollo 8 and Artemis II, but re-creating the Apollo program today wouldn’t have been a practical — or logical — option.\n\nLong gone are the supply chains and skilled machinists that built the hardware for those mid-20th century moon missions.\n\n“People ask what was wrong with Apollo,” Wayne Hale, a former NASA space shuttle program manager, previously said during a Human Exploration and Operations Committeemeeting. “The thing that was wrong with Apollo was it ended.”\n\nOneoft-mentionedpiece of Apollo lore is that the program’s spacecraft and rockets were controlled by computers less powerful than a modern smartphone. And NASA has put many of those advancements to use, particularly when it comes to therobotic explorationof other worlds.\n\nBut spaceflight — and human spaceflight in particular — is far too complex, dangerous and expensive to directly translate computing advancements to easier, cheaper moon missions.\n\nThe technology regular folks interact with on Earth also has the benefit of being tested by millions of users and improved over decades of mass production.\n\nComplex missions to deep space, however, require multibillion-dollar contracts and years of continuous work toward the same goal — a scenario that has been hard to come by in the years since Apollo as presidential administrations have stopped and started various flagship human exploration programs.\n\nThe Artemis program is the most successful moon program the United States has had in decades, noted Casey Dreier, the chief of space policy at The Planetary Society, a nonprofit exploration advocacy group — “because it still exists.”\n\nAt the technical level, thedifferencesbetween the Apollo and Artemis spacecraft are vast. For starters, Orion’s flight computers are 20,000 times faster and possess 128,000 times more memory than the lone machine that guided Apollo.\n\nThe Orion capsule offers the crew — increased from three to four — more space and opportunities for exercise and entertainment. And a much better toilet. “With the Apollo program, the astronauts had a waste collection device which was like a plastic bag with a rim, and they would stick it upon themselves. Not the most pleasant experience,” Muir-Harmony said.\n\nAboard Orion, which has about a third more habitable space than Apollo, the crew will enjoy the luxury of a real bathroom. “It’s a little room tucked into the spacecraft that they can go inside,” Muir-Harmony said. “It looks like a little closet or a little phone booth. It’s small, but there’s some privacy, which is pretty essential when you have a crew that’s both men and women.”\n\nDuring the Apollo era, she added, the bathroom issue was part of the discussion around whether women should be astronauts. “The Soviet program had a woman fly in space 20 years before the United States did. But some people said that designing bathroom technology for women in space was going to be too complicated,” Muir-Harmony said. “You can debate that, but it is important to think through privacy when you have a crew of both men and women, and so they were able to achieve that with the design of the Orion spacecraft.”\n\nIn-space bathrooms have come a long way since Apollo. The International Space Station, for example, has a comparatively spacious stall for washing and using the toilet. And theSpaceX Crew Dragon capsule, which since 2020 has transported astronauts to and from the orbiting laboratory, has a small private area with a vacuum toilet.\n\nThe goals of the two programs are also markedly different. Apollo already accomplished the one-off “flags and footprints” missions, Hale said.\n\nNow, NASA wants to create the infrastructure that will allow astronauts to live and work at a lunar base — eventually creating a sustainable, permanent human presence on the moon.\n\n“That means the landers that are being developed are designed to remain for longer than a day. They’re meant to be a part of a bigger architecture or system that will eventually have habitats on the moon,” Johnson said, adding that while the upcoming flight of Artemis II is reminiscent of Apollo 8, the programs will diverge dramatically after that.\n\nThe rise of the commercial space industry has helped fuel this decisive push toward revamping moon plans, according to Brian Odom, NASA’s chief historian.\n\n“NASA is now a customer to a private industry where we have SpaceX, Boeing, Blue Origin. That’s an enabling factor that’s helped us,” Odom said.\n\nSpaceX is among the biggest of those partners, and its CEO, Elon Musk, recentlyannounced a dramatic shiftin the company’s focus from prioritizing sending humans to Mars to first building “a self-growing city on the Moon.”\n\nHowever, Odom added, getting back to the moon has always been dependent on a number of pieces falling into place. “Space is very difficult and requires a lot of different things coming together at one time. Commercial commitments, international commitments and now the government — all three working together, is what’s really enabled us to get to this point,” he said.\n\n“It’s been a long road, but going back has always been a strategy, and it’s emerged in a couple of different moments. Now we have the infrastructure in place, we have partners in place — and it’s becoming possible.”\n\nCrucially, prolonged human presence on lunar soil will also benefit from the experience gained through the programs that followed the Apollo era, such as the International Space Station, where humans have had a permanent presence for over 25 years.\n\n“Returning to the moon will require long-term stays on the lunar surface, and thus understanding the effects of space habitation on the human body,” said James W. Head, a research professor of Earth, environmental and planetary sciences at Brown University who worked on the Apollo program.\n\n“And robotic missions flown in the interim, such asNASA’s Lunar Reconnaissance Orbiter, have provided information on where to go and find the resources necessary to support human presence, indicating the possibility of water resources trapped at the lunar poles.”\n\nAnd if world leaders need extra motivation, Head added, they should look to the words of Apollo 16 Commander John Young, who was asked before retiring in 2004 what the point was of spending money to go to the moon. “Earth’s geologic history is pretty clear: It says, quite frankly, that single-planet species don’t last,”Young said.\n\nThe Apollo program had to contend with the deadline imposed by President John F. Kennedy, who in 1961 declared to Congress his goal to land a man on the moon before the decade was out. He wanted to beat the Soviet Union, which had already put a satellite and a man in orbit before the US.\n\n“A critical element to understanding the early space race and why the United States sent humans to the moon was the Cold War context, and the competition for the hearts and minds of the world,” Muir-Harmony said. “The United States was quite worried about Soviet influence, especially in newly established countries. Space exploration was seen as a really important tool of influence internationally.”\n\nToday, the United States considers China to be its archrival, and the government has sought allies to sign onto its vision of the future of lunar exploration with a set of international agreements called the Artemis Accords, which over 60 nations have now joined.\n\nThe nonbinding accords outline a safe, peaceful and sustainable approach to civil space exploration. They build upon the existing 1967Outer Space Treaty, which states that no nation can claim territory in space as its own or use it to harbor weapons of mass destruction. However, theArtemis Accordswere not negotiated multilaterally in the same manner as the Outer Space Treaty, and some analysts argue that they violate some of its principles, for example by allowing commercial mining on the moon.\n\nGoing back to the moon for a long-term presence and building an infrastructure in the lunar environment wouldn’t be sustainable for a single country, Odom said. “I think that’s what makes the Artemis Accords so good — they create a framework for opportunity, but they also double down on the idea that this is for humanity, not just one nation.”\n\nHowever, even though no other country has ever come close to sending a crewed mission to the moon, China also has concrete plans to do so by 2030 — and is not a signatory of the Artemis Accords.\n\n“There may be a perception that the US is in a race with China to the moon,” Odom said.\n\n“Maybe there’s a second space race, but I think that’s always going to be balanced with understanding risk, something that had become problematic in the early years of Apollo, when the idea that you had to do it before the end of the decade became a primary driver, and may have cost the lives of three crewmen,” he added, referring to the Apollo 1 accident in 1967 that killed all three crew members as a fire broke out in the cabin during a launch rehearsal.\n\nSince Apollo, Odom noted, the Challenger and Columbia disasters also cemented a more grounded approach to risk: “We’ve learned so many lessons the hard way, and now those lessons are being applied.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://archive.org/stream/Apollo17/AS17_TEC_djvu.txt",
      "text": "closing words"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/science/nasa-artemis-2-delays-moon-mission-launch",
      "text": "Artemis II"
    },
    {
      "url": "https://www.cnn.com/2024/02/21/world/moon-landing-attempts-challenges-scn",
      "text": "technical challenge"
    },
    {
      "url": "https://www.cnn.com/2023/11/21/world/spacex-nasa-starship-artemis-moon-lander-scn",
      "text": "meeting"
    },
    {
      "url": "https://www.cnn.com/2024/01/13/world/nasa-moon-peregrine-wt-science-newsletter-scn",
      "text": "oft-mentioned"
    },
    {
      "url": "https://www.cnn.com/2014/07/16/tech/innovation/apollo-anniversary-technology",
      "text": "robotic exploration"
    },
    {
      "url": "https://www.nasa.gov/reference/apollo-to-artemis/",
      "text": "differences"
    },
    {
      "url": "https://www.cnn.com/2021/11/01/tech/spacex-crew-dragon-toilet-crew-2-scn",
      "text": "SpaceX Crew Dragon capsule"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/science/elon-musk-spacex-priorities-moon-intl-hnk",
      "text": "announced a dramatic shift"
    },
    {
      "url": "https://www.cnn.com/2025/02/05/science/lunar-grand-canyons-far-side-moon",
      "text": "NASA’s Lunar Reconnaissance Orbiter"
    },
    {
      "url": "https://www.chron.com/news/nation-world/article/Conversation-With-John-Young-1563092.php",
      "text": "Young said"
    },
    {
      "url": "https://www.unoosa.org/oosa/en/ourwork/spacelaw/treaties/introouterspacetreaty.html",
      "text": "Outer Space Treaty"
    },
    {
      "url": "https://www.nasa.gov/artemis-accords/",
      "text": "Artemis Accords"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/science/why-humans-have-not-been-back-to-moon",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/science/why-humans-have-not-been-back-to-moon",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2c9e44146509066fa678b5bf1fa4860476432a33c2a7526d25c93857338798a3",
  "scraped_at": "2026-02-14T07:07:57.255993+00:00"
}