{
  "url": "https://lite.cnn.com/2026/02/25/travel/ski-resorts-united-states-low-key-affordable",
  "title": "As lift ticket prices skyrocket, US skiers are turning to these low-key mountains | CNN",
  "date": "2026-02-27T07:17:56.162331+00:00",
  "authors": [
    "Caroline Tell"
  ],
  "text": "Source: CNN\n\nEvan Glassman has been traveling to Deer Valley in Utah for over a decade, drawn by its meticulously groomed runs, reliable service and convenient four-hour flight from his New York home. That loyalty held for years — until this winter.\n\nThis season, Glassman redirected his annual family ski trip to nearby Solitude Mountain Resort and Brighton Resort — two mountains favored by locals for their steep terrain and lower price points. On peak days, a single-day lift ticket at Deer Valley can reach roughly $340, compared with about $137 at Brighton — a gap of more than $200 per person. Multiplied across several ski days and multiple family members, the difference quickly turns into thousands of dollars.\n\n“I love Deer Valley, but at a certain point, the price changes how you think about the day,” said Glassman. “You’re not just skiing — you’re justifying it the entire time. At Solitude and Brighton, I can ski and enjoy the mountain without overthinking it.” All three resorts are on the Ikon Pass, which brings per-day prices down for those who buy the season passes well in advance. Solitude offers unlimited access on Ikon, while Deer Valley and Brighton offer 7 days of skiing with the pass.\n\nA similar recalibration is underway across mountains on the East Coast. Adam and Lacey Cohen, who ski and snowboard with their daughters from their home outside Boston, had once structured their winters around marquee destinations using the Epic Pass — the multi-resort season pass for mountains owned by Vail Resorts, which also brings per-day prices down substantially. But they grew discouraged by Epic’s hefty price tag of about $1,050 per adult and early commitment deadline.\n\nInstead, they opted for anIndy Pass— a more affordable pass that, at the high end, costs $599 for adults,and offers limited access to independently owned mountains across the United States and abroad. The shift led them to low-key, family-oriented hills like Bolton Valley in Vermont, Saddleback Mountain in Maine and Pats Peak in New Hampshire.\n\n“At these mountains, the day just feels lighter,” Lacey Cohen said. “You don’t feel like you have to be there at 8:30 a.m. and stay until 4 p.m. because you spent so much money. If the kids want a break, that’s fine. You’re not constantly thinking about whether you’re getting your money’s worth.”\n\nThe difference, they said, is not just in price, but in atmosphere. Parking is typically free. Lift lines tend to be short, even on busy weekends. Food can be brought into the lodge.\n\n“You pull into the parking lot and people are actually saying ‘hi’ to you,” Adam Cohen said. “It feels like a skier’s mountain.”\n\nThis growing preference among some skiers for smaller, independent mountains reflects a realignment in American skiing, where companies like Vail Resorts and Alterra Mountain Company have built vast networks of mountains tied together by products like the Epic and Ikon passes.\n\nThese passes offer relative value to skiers who commit early,  but have also led to a sharp rise in walk-up ticket prices. Peak-day window pricing at marquee resorts like Vail, Beaver Creek and Park City now routinely exceeds $300. The economics increasingly favor skiers who buy into the pass ecosystem, and those who don’t are left paying some of the highest day rates in the sport.\n\n“The conglomerates want you to buy the pass, so they hike up the day rate,” Adam Cohen said. “That’s the business model. You lock people in early, and then the people who don’t buy the pass are basically priced out of skiing.”\n\nFor industry insiders, this trajectory is more than a pricing story. It’s a warning sign. The shift toward pass-driven revenue and destination-scale resorts is beginning to reshape who skiing is for, potentially narrowing the pipeline of future skiers. There’s a deep unease about skiing’s long-term health, even outside of climate concerns and catastrophically low levels of snow in the West this season.\n\n“We are absolutely seeing this kind of pushback,” said Phil Pugliese, founder of SkiTalk.com, an online ski forum that draws roughly 250,000 unique visitors per month and more than 15 million views annually. “In the Tahoe region alone, you have Epic owning three major resorts — Heavenly, Northstar, Kirkwood — and Ikon anchored by Palisades Tahoe and Mammoth. That’s a lot of consolidation in one place.”\n\nIn that landscape, he said, smaller mountains such as Tahoe Donner and Mt. Rose are emerging as pressure valves — places that strike a balance between ski area and ski resort.\n\n“They’re not trying to be a destination resort,” said Pugliese, who’ll often test ski products at Mt. Rose near his Reno home. “The big resorts expect you to come for a week and spend your money there. They get you in with a relatively attractive pass price, and then hit you throughout the day. It’s the Disney model: the pass gets you through the gate, and then it’s $28 hamburgers and $14 Gatorades.”\n\nWhile Pugliese worries about the long-term consequences of the pricing around skiing, he appreciates that smaller, local mountains are having their moment. He cites Sundance Mountain in Utah, Grand Targhee in Wyoming and Sunday River Resort in Maine as just a few attractive alternatives for skiers.\n\nFor the Cohens, the appeal of a smaller mountain isn’t about chasing big terrain or steep lines. It’s about keeping skiing integrated into their family life.\n\n“They may not have the most updated infrastructure but they’re big on that old school skier feel,” said Cohen. “I joke that the tagline  should be ‘slow lifts, good vibes.’”\n\nJust 15 minutes apart in Big Cottonwood Canyon,SolitudeandBrightonfunction almost as a paired alternative to Park City. While they are separately ticketed, skiers often choose one based on snow conditions and crowd flow — and it’s entirely feasible to ski from one mountain to the other via the SolBright trail or make the short drive.\n\nWhy it works:Wasatch snow without Wasatch window pricing — and two distinct experiences within one canyon.\n\nSingle-day passes start at approximately $99. Both mountains can be accessed with an Ikon pass.\n\nJust outside Bozeman,Bridger Bowlremains community-owned and fiercely independent. There is no resort village and no luxury real estate corridor — just serious terrain rising sharply from the Gallatin Valley. The Ridge and Saddle Peak terrain offer sustained, technical lines for strong skiers, while lift lines remain manageable even on busy weekends. Walk-up day tickets generally fall well below marquee Montana destinations.\n\nWhy it works:Big terrain, smaller crowds and pricing built for repeat local use.\n\nSingle-day passes start at approximately $84.\n\nReopened under local ownership after years of dormancy,Saddlebackin Maine has quietly become one of New England’s most compelling alternatives. Located in Rangeley, far from Vermont’s busiest corridors, it offers expansive glades, long cruisers and consistent snow with minimal congestion. On peak weekends, lift lines remain surprisingly short compared with larger, more well-known resorts in Vermont.\n\nWhy it works:Big-mountain feel in the Northeast, without destination-resort pricing or pressure.\n\nSingle-day passes start at approximately $60.\n\nIndependent and slightly removed from the Stowe corridor,Bolton Valleyblends ski-in/ski-out lodging with a relaxed, community-driven atmosphere. The terrain favors glades and varied pitches, and the compact base keeps logistics simple.\n\nWhy it works:A practical, lower-stress Vermont option that still delivers strong snow years.\n\nSingle-day passes start at approximately $99.\n\nPerched above Reno and removed from Tahoe’s busiest resorts,Mt. Rosestrikes a balance between terrain and access. It lacks the resort theatrics of nearby Epic- and Ikon-affiliated mountains but delivers wide-open bowls, high elevation snow and comparatively moderate day-ticket pricing. Locals prize its straightforward parking, manageable lift lines, and absence of destination-scale congestion.\n\nWhy it works:Tahoe-area skiing without the Tahoe-area premium.\n\nSingle-day passes start at approximately $139.\n\nLocated on the western side of the Tetons, accessed via Idaho,Grand Targheedelivers consistent snowfall and expansive open terrain without the price tiering of nearby Jackson Hole. The mountain is known for its wide bowls, soft snow and minimal lift-line culture — even on weekends.\n\nThere is lodging at the base, but the atmosphere skews practical rather than aspirational. Powder days are frequent, and the terrain rewards flow rather than competition.\n\nWhy it works:Teton-quality snow and scenery without the Jackson-level daily rates or destination intensity.\n\nSingle-day passes start at approximately $125.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.indyskipass.com/",
      "text": "Indy Pass"
    },
    {
      "url": "https://www.solitudemountain.com/",
      "text": "Solitude"
    },
    {
      "url": "https://www.brightonresort.com/?utm_source=google&utm_medium=paid_search&utm_campaign=br_winter_2025&gclsrc=aw.ds&gad_source=1&gad_campaignid=23191368871&gbraid=0AAAAACoZfaJAle-0nTIME82PYtovYLEQG&gclid=CjwKCAiAwNDMBhBfEiwAd7ti1P3uOXIShPLx36ALv4KXYwP6GnDHGqzucg8YcdFacmnamdcdnBuYSBoCRZ0QAvD_BwE",
      "text": "Brighton"
    },
    {
      "url": "https://bridgerbowl.com/",
      "text": "Bridger Bowl"
    },
    {
      "url": "https://www.saddlebackmaine.com/",
      "text": "Saddleback"
    },
    {
      "url": "https://www.boltonvalley.com/",
      "text": "Bolton Valley"
    },
    {
      "url": "https://skirose.com/",
      "text": "Mt. Rose"
    },
    {
      "url": "https://www.grandtarghee.com/",
      "text": "Grand Targhee"
    }
  ],
  "hash": "2cf16d012e94b8e29c13875bb3d9746e1bfe7020decec0b891c1cfdc2e42027e",
  "scraped_at": "2026-02-27T07:17:56.162346+00:00"
}