{
  "url": "https://lite.cnn.com/2026/02/25/us/word-of-week-noreaster-cec",
  "title": "Word of the Week: Where did this ‘nor’easter’ come from? | CNN",
  "date": "2026-02-26T07:31:51.705967+00:00",
  "authors": [
    "Harmeet Kaur"
  ],
  "text": "Source: CNN\n\nWeather forecasters at the National Weather Service, The Weather Channel and this very news organization had a name for the kind of storm that upended daily life for residents of the Northeast US this week: It was a nor’easter.\n\nA “nor’easter,” or “northeaster,” is a kind of coastal storm featuring strong winds that blow in from the Atlantic Ocean. The storms typically develop offshore between Georgia and New Jersey and then move up the coast, bringing blustery winds and lots of snow in the winter (or heavy rain in other seasons), CNN Meteorologist Mary Gilbert explains. Though these particular storms occur only along the East Coast,a “nor’easter” gets its name not from where it strikes, but from what direction the wind blows — coming out of the northeast as the seaborne storm rotates counterclockwise, sending its wind into the land.\n\nThis week’s storm was also described, in meteorological terms, as a “bomb cyclone” and a “blizzard.” Gilbert says all three words accurately capture aspects of this particular storm, though the latter two have even more serious meanings:A “bomb cyclone” is a rapidly intensifying storm in which air pressure drops at least 24 millibars in 24 hours or less; a “blizzard” is a snowstorm with sustained winds or frequent gusts of at least 35 mph and visibility for one-fourth of amile or less — those conditions must last for at least three consecutive hours for meteorologists to officially consider a storm a blizzard.\n\n“If it meets certain other criteria, then you can add the ‘bomb cyclone’ label or the ‘blizzard’ label,” Gilbert says. “But as a catchall … ‘nor’easter’ for me is the way to go.”\n\nThe phenomenon of a wet, rotating oceanic system pummeling the Northeast produced such legendary storms as the Ash Wednesday storm of 1962, the Blizzard of ‘78 and 1993’s Storm of the Century. These historic storms were all “nor’easters,” but they weren’t necessarily discussed as such at the time. Despite the archaic look of the word, with its folksy apostrophe, the widespread adoption of “nor’easter” is a relatively recent trend.\n\nThe contemporary enthusiasm for “nor’easter” seems to have emerged from a perfect storm of historical, linguistic and journalistic forces. Originally, it was neither meteorologically nor geographically specific. The Oxford English Dictionary’s first citation of the word is from an 1837 translation of Aristophanes by the scholar Benjamin Walsh (“Slack your sheet! A strong nor’-easter’s groaning.”), but “nor’easter” appeared at least a decade earlier in the English newspaper “The Hull Packet and Humber Mercury.”\n\nThe dictionary entry for “nor’east,” as a direction, contains examples dating as far back as 1592. (“North, northeast, Northeast, Nore nore and by Nore-east. I shall never do it,” a character in John Lyly’s play “Gallathea” says in frustration while learning compass points. “Nor’east” also appears in John Davis’ 1595 navigation manual “The Seaman’s Secrets:” “Noreast by North raiseth a degree in sayling 24 leagues.”)\n\nIt’s unclear how exactly “nor’east” gave way to “nor’easter,” and whether it was a sailor or a writer who coined the term. At some point in the mid-19th century, “nor’easter” began appearing in US newspaper articles, though a scan of newspaper archives from the time period indicates that “northeaster” was the more common term. Google Ngrams, which charts the frequency of a term across a corpus of books,suggeststhat it wasn’t until around 2000 that “northeaster” began to decline in favor of “nor’easter.” (“Nor’easter” also bears similarities to “sou’wester,” though that refers to both an oilskin rain coat and a rain hat.)\n\nSo what’s up with the apostrophe and the missing -th? Opponents of the contracted form have argued that “nor’easter” is a misguided attempt to emulate regional dialects or nautical lingo. Locals have noted that residents who still retain the New England accent pronounce the word as “nawtheastah,” making “no’theaster” the more logical contraction.\n\nTom Halsted, writing in a 1999 column forThe Standard-Timesof New Bedford, Massachusetts, observed that sailors didn’t speak this way either: “It’s ‘nor’west’ and ‘sou’west,’ ‘northeast’ and ‘southeast’ — but NEVER ‘nor’east’ (or, god forbid, ‘sou’east.’).”\n\nThe contracted form of “nor’easter” has inspired feelings as strong as the storm’s gusts. Its various detractors have called it “a fake, pseudo-Yankee neologism,” a “festering sore in today’s marine and weather journalism” and “faker to me than the lederhosen at the Biergarten in Walt Disney World.”\n\nOne of those dissenters was the linguist Mark Liberman, who lambasted the wordnumeroustimesover the yearsin his blog Language Log. In 2003, he compared the contracted “nor’easter” to “something like e’en for even and th’only for the only” and suggested that journalists might have made up the term. Jan Freeman, who wrote The Boston Globe’s language column “The Word” from 1997 to 2011, agreed, though she acknowledged that it was probably here to stay. “It’s no more authentic than ‘nucular’ for nuclear or ‘bicep’ for biceps, but it would take a mighty wind, at this point, to blow nor’easter back into oblivion,” shewrotethat same year.\n\nEdgar Comee, a former Navy ship captain from Brunswick, Maine, hated “nor’easter” so much that he waged a one-man campaign, well into his 80s, to eliminate it from the popular lexicon. Any time he heard a TV anchor utter the word or noticed it in print, he’d mail the offender a postcard detailing why he found it so objectionable. “The use of nor’easter to describe a northeast storm is a pretentious and altogether lamentable affectation, the odious, even loathsome, practice of landlubbers who would be seen as salty as the sea itself,” the postcard read, according to a 2005New Yorkerprofile. He told the magazine a few months before he died that he had sent out more than a hundred such admonitions.\n\nDecades on, Comee and his fellow critics seem to have lost the battle against the apostrophe.\n\nIn 2008, Freemanwrotethat while most American newspapers had embraced the contracted “nor’easter,” The Boston Globe and The New York Times had not. But whatever resistance once existed at those news organizations seems to have gone with the wind — this week, both newspapers publishedseveralarticlesabout the latest “nor’easter.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2023/03/13/weather/what-is-a-noreaster-xpn",
      "text": "nor’easter"
    },
    {
      "url": "https://www.cnn.com/weather/live-news/blizzard-snow-nyc-storm-forecast-02-22-26?post-id=cmlxmdroy000f3b6uu18zj2fz",
      "text": "bomb cyclone"
    },
    {
      "url": "https://www.cnn.com/weather/live-news/blizzard-snow-nyc-storm-forecast-02-22-26?post-id=cmlxvcevp00083b6wd57gu8iw",
      "text": "blizzard"
    },
    {
      "url": "https://books.google.com/ngrams/graph?content=nor%27easter%2Cnortheaster&year_start=1800&year_end=2022&corpus=en&smoothing=3&case_insensitive=false",
      "text": "suggests"
    },
    {
      "url": "https://archive.md/WbGRp#selection-295.0-295.37",
      "text": "The Standard-Times"
    },
    {
      "url": "https://archive.md/WbGRp",
      "text": "a fake, pseudo-Yankee neologism"
    },
    {
      "url": "https://soundingsonline.com/news/underway-2/",
      "text": "festering sore in today’s marine and weather journalism"
    },
    {
      "url": "https://itre.cis.upenn.edu/~myl/languagelog/archives/001824.html",
      "text": "faker to me than the lederhosen at the Biergarten in Walt Disney World"
    },
    {
      "url": "https://itre.cis.upenn.edu/~myl/languagelog/archives/000386.html",
      "text": "numerous"
    },
    {
      "url": "https://itre.cis.upenn.edu/~myl/languagelog/archives/001824.html",
      "text": "times"
    },
    {
      "url": "https://languagelog.ldc.upenn.edu/nll/?p=2870",
      "text": "over the years"
    },
    {
      "url": "https://archive.md/6xRS#selection-483.2-495.19",
      "text": "wrote"
    },
    {
      "url": "https://www.newyorker.com/magazine/2005/09/05/noreaster",
      "text": "New Yorker"
    },
    {
      "url": "https://bostonglobe.newspapers.com/image/444169009/?match=1&terms=nor%27easter",
      "text": "wrote"
    },
    {
      "url": "https://www.nytimes.com/2026/02/23/weather/snowstorm-satellite-explained.html",
      "text": "several"
    },
    {
      "url": "https://www.bostonglobe.com/2026/02/22/metro/new-england-noreaster-storm-timeline-blizzard/",
      "text": "articles"
    }
  ],
  "hash": "2d2cd9fae0fbefadd525dc669e3329d6f8a885dfd5cbe03422fc81f19ea29470",
  "scraped_at": "2026-02-26T07:31:51.705980+00:00"
}