{
  "url": "https://lite.cnn.com/2026/02/18/economy/hassett-fed-researchers-disciplined",
  "title": "Kevin Hassett says Fed researchers should be ‘disciplined’ over report that Americans are paying tariffs | CNN Business",
  "date": "2026-02-20T07:28:48.052910+00:00",
  "authors": [
    "Elisabeth Buchwald, CNN"
  ],
  "text": "Source: CNN\n\nNational Economic Council Director Kevin Hassett said Wednesday that researchers at the New York Federal Reserve who produced astudyfinding American businesses and consumers are shouldering 90% of the cost of President Donald Trump’s tariffs should be “disciplined.”\n\n“It’s, I think, the worst paper I’ve ever seen in the history of the Federal Reserve system,” Hassett told CNBC in an interview.\n\n“The people associated with this paper should presumably be disciplined, because what they’ve done is they’ve put out a conclusion which has created a lot of news that’s highly partisan based on analysis that wouldn’t be accepted in a first-semester econ class,” Hassett continued.\n\nThe New York Fed and the Fed Board of Governors declined to respond to CNN about Hassett’s comments.\n\nOn Thursday, Minneapolis Fed President Neel Kashkari voiced concerns. “This is just another step to try to compromise the Fed’s independence,” he said at an event in Fargo, North Dakota.\n\nHassett’s primary concern with the research was, in his view, that it only focused on price-related effects of tariffs and not changes in the volume of imports.\n\nHowever, that’s not entirely true. In assessing the tariff burdens, the authors calculate average duty rates over various periods of time. They define that as “the total monthly tariff revenue divided by the total value of imports in the month,” meaning import volume is taken into consideration. Specifically, they looked at how “global supply chains shifted in response to the higher tariffs.”\n\n“All 12 Reserve Banks have independent research departments that are always studying the economy,” Kashkari said. “That is how we’re trying to get better and learn.”\n\nLike Fed officials who vote on interest-rate decisions, Fed researchers go to great lengths to establish independence from outside political actors. The research they produce helps officials make more informed decisions by having a clearer sense of the state of the economy now and in the future. The researchers, however, do not make policy recommendations.\n\nHassett had been a top contender to replace Fed Chair Jerome Powell, whose term at the helm of the central bank expires in May. However, Trump announced last month that he had nominated former Fed Governor Kevin Warshfor the position, which requires Senate confirmation.\n\nLike Trump, Warsh has been a staunch critic of the Fed and Powell, and has vowed to overhaul many facets of the central bank if confirmed.\n\nHis nomination comes at a time when the Trump administration has staged various attacks on the Fed and its longstanding independence. That includes acriminal inquiryinto Powell and the Fed over a multibillion-dollar renovation of its headquarters andan attemptto fire Fed Governor Lisa Cook over unproven allegations of mortgage fraud.\n\nThis story has been updated with additional developments and context.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://libertystreeteconomics.newyorkfed.org/2026/02/who-is-paying-for-the-2025-u-s-tariffs/",
      "text": "study"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/economy/kevin-warsh-fed-trump-inflation",
      "text": "for the position"
    },
    {
      "url": "https://www.cnn.com/2026/01/11/business/federal-prosecutors-criminal-investigation-federal-reserve-chair-jerome-powell",
      "text": "criminal inquiry"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/supreme-court-lisa-cook-trump-fed-01-21-26",
      "text": "an attempt"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/economy/hassett-fed-researchers-disciplined",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/economy/hassett-fed-researchers-disciplined",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2d5658e94b46abcdbf328193495fee171d10a79cd29a07526ee7af116395da5b",
  "scraped_at": "2026-02-20T07:28:48.052926+00:00"
}