{
  "url": "https://lite.cnn.com/2026/02/28/politics/regime-change-iran-trump",
  "title": "Analysis: Trump launches the regime-change effort in Iran that he pledged to avoid | CNN Politics",
  "date": "2026-03-01T07:06:38.191922+00:00",
  "authors": [
    "Analysis by Aaron Blake"
  ],
  "text": "Source: CNN\n\nIt’s no secret that President Donald Trump’s foreign policy in his second term has been more militaristic.\n\nTrump has floated claiming the Panama Canal, Canada and Greenland for the United States. He launched strikes onseven countries in 2025and even resurrected the US policy of deposing Latin American leaders with the operation in Venezuela. He haskilled more than 150 peopleon alleged drug boats via extrajudicial strikes — whichmight well be war crimes.\n\nBut his new attacks against Iran represent something else entirely.\n\nBy Trump’s own account, these are not limited strikes, but rather a“massive and ongoing” military campaignalongside Israel that he suggests is “war” and warns up-front could cost American lives. While his brief Iran strikes in June were about debilitating the country’s nuclear program, he’s indicated these carry the broader and bigger goal of regime change.\n\n“All I want is freedom for the people,” Trump told the Washington Post shortly after 4 a.m. ET, hours after the first strikes.\n\nBut that’s decidedly not what Trump and his team have promised the American people over the years — or even recently.\n\nIndeed, among all Trump’s military actions, this one is the most contradictory.\n\nThe president has explicitly pitted himself againstregime change in the Middle Eastand argued for a focus that’s close to home.\n\nHe invoked this position often during the 2016 campaign while running against the war in neighboring Iraq and pitching Democratic opponent Hillary Clinton as an irredeemable and “trigger-happy” hawk.\n\n“We must abandon the failed policy of nation-building and regime change that Hillary Clinton pushed in Iraq, Libya, Egypt and Syria,” Trump said at the 2016 Republican National Convention.\n\nHe said toppling regimes without sufficient plans creates “power vacuums that are filled simply by terrorists.”\n\nHe said he would “break the cycle of regime change” and “abandon the policy of reckless regime change favored by my opponent.”\n\nAs recently as 2019, Trump doubled down.\n\n“Our policy of never-ending war, regime change, and nation-building is being replaced by the clear-eyed pursuit of American interests,” Trump said. “It is the job of our military to protect our security, not to be the policeman of the world.”\n\n“GOING INTO THE MIDDLE EAST IS THE WORST DECISION EVER MADE,” he posted on social media that same year.\n\nAnd his administration even this term has sought to downplay regime change.\n\nIna speechin December, Defense Secretary Pete Hegseth promised his department would “not be distracted by democracy-building interventionism, undefined wars, regime change …”\n\nAnd after Trump struck Iran’s nuclear facilities in June, Hegseth specifically assured it wasn’t about regime change.\n\n“This mission was not and has not been about regime change,” Hegseth said.\n\nTo be fair, Trump’s comments on this front sometimes referred toill-considered and hastyregime-change wars, rather than opposing regime change altogether.\n\nStill, the thrust of his and Hegseth’s commentary was clearly that this type of conflict isn’t what the United States should get itself involved in, particularly in the Middle East and particularly absent an ironclad endgame and threat to the United States.\n\nThe administration has donelittle to lay outsuch a substantial strategic plan —or even a consistent justification— for this effort.\n\nAnd Trump has said for months that his June strikes“obliterated” Iran’s nuclear program, suggesting there remained little in the way of a direct threat to the United States.\n\nRegime change in Iran is also contrary to what the Trump team pitched in the 2024 election. Indeed, at times they warned that voting forKamala Harriswould lead to such wars. Trump, they said, was the peace candidate.\n\nThis wasn’t just a casual talking point; Trump and people close to his campaign emphasized it in the closing weeks, pointing to the fact that hawkish Republican former Rep. Liz Cheney was supporting Harris.\n\n“You know, they’re all war hawks when they’re sitting in Washington in a nice building saying, ‘Oh, gee, let’s send 10,000 troops right into the mouth of the enemy,’” Trump said less than a week before Election Day.\n\nTrump adviser Stephen Milleradded on X: “Liz Cheney is Kamala’s top advisor. Liz wants to invade the whole Middle East. Kamala = WWIII. Trump = Peace.”\n\n“A vote for Kamala Harris is a vote for Dick Cheney and a vote for war, war and more war,” Trump’s now-director of national intelligence Tulsi Gabbardsaid. “A vote for Donald Trump is a vote to end wars, not start them.”\n\nThe national Republican Party pitched its ticket asthe “pro-peace” option.\n\nMiller added that “KAMALA WILL SEND YOUR SONS TO WAR.”\n\nNow, Trump is explicitly telling Americans that their sons (and daughters) could die in a regime-change war.\n\n“The lives of courageous American heroes may be lost, and we may have casualties — that often happens in war,” Trumpsaid early Saturday morning. “But we’re doing this not for now; we’re doing this for the future, and it is a noble mission.”\n\nVice President JD Vance also wrote an op-ed in 2023 titled, “Trump’s Best Foreign Policy? Not Starting Any Wars.”\n\nCritics on social media Saturday quickly and widely circulated other Trump comments — ones he posted before all of the above, when Barack Obama was president.\n\n“Remember what I previously said–Obama will someday attack Iran in order to show how tough he is,” Trumpposted in September 2013.\n\nHe addedin Novemberof that year that “Obama will attack Iran because of his inability to negotiate properly-not skilled!”\n\nAndin 2011: “Our president will start a war with Iran because he has absolutely no ability to negotiate.”\n\nThose comments certainly sting today. Obama ultimately did secure a deal with Iran (however good one believes that deal was) and never attacked it. Trump has now attacked Iran repeatedly, including after failing to negotiate his own deal recently.\n\nTrump also wrongly predicted Obama would attack Iran on the eve of the 2012 election.\n\n“Now that Obama’s poll numbers are in tailspin – watch for him to launch a strike in Libya or Iran,” Trumpposted in October 2012. “He is desperate.”\n\nToday, Trump’s own numbers have declined substantially during his first year in office, and Republicans are staring down a difficult midterm election because of that.\n\nIranian Foreign Minister Abbas Araghchiscreenshotted and shared Trump’s 2012 poston Saturday, while calling the attack “wholly unprovoked, illegal, and illegitimate.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cfr.org/articles/guide-trumps-second-term-military-strikes-and-actions",
      "text": "seven countries in 2025"
    },
    {
      "url": "https://www.cnn.com/2025/11/02/politics/timeline-us-strikes-caribbean-pacific-vis",
      "text": "killed more than 150 people"
    },
    {
      "url": "https://www.cnn.com/2025/12/01/politics/boat-second-strike-trump-drug-hegseth",
      "text": "might well be war crimes"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm6a2jfi00003b6rvd3ijnl1",
      "text": "“massive and ongoing” military campaign"
    },
    {
      "url": "https://www.washingtonpost.com/national-security/2026/02/28/trump-iran-war-regime-change-freedom/",
      "text": "All I want is freedom for the people"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/politics/trump-venezuela-america-first-shift",
      "text": "regime change in the Middle East"
    },
    {
      "url": "https://www.cnn.com/2016/09/09/politics/donald-trump-hillary-clinton-shoot-somebody",
      "text": "trigger-happy"
    },
    {
      "url": "https://x.com/realDonaldTrump/status/1181905659568283648",
      "text": "GOING INTO THE MIDDLE EAST IS THE WORST DECISION EVER MADE"
    },
    {
      "url": "https://www.war.gov/News/Speeches/Speech/Article/4354431/remarks-by-secretary-of-war-pete-hegseth-at-the-reagan-national-defense-forum-a/",
      "text": "a speech"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/politics/trump-iran-geneva-talks-middle-east-war-iraq-analysis",
      "text": "little to lay out"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
      "text": "or even a consistent justification"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
      "text": "“obliterated” Iran’s nuclear program"
    },
    {
      "url": "https://x.com/stephenm/status/1852364946195296620",
      "text": "added on X"
    },
    {
      "url": "https://x.com/TulsiGabbard/status/1850856201606824123",
      "text": "said"
    },
    {
      "url": "https://x.com/gop/status/1853537733479686309",
      "text": "the “pro-peace” option"
    },
    {
      "url": "https://x.com/StephenM/status/1848522697392738809",
      "text": "KAMALA WILL SEND YOUR SONS TO WAR"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm60pihp00003b6sojlguzxz",
      "text": "said early Saturday morning"
    },
    {
      "url": "https://www.wsj.com/articles/trumps-best-foreign-policy-not-starting-any-wars-ukraine-russia-war-rocket-nuclear-power-weapons-defense-11675186959",
      "text": "Trump’s Best Foreign Policy? Not Starting Any Wars."
    },
    {
      "url": "https://x.com/realDonaldTrump/status/382923478157910016",
      "text": "posted in September 2013"
    },
    {
      "url": "https://x.com/realDonaldTrump/status/399731975432728576",
      "text": "in November"
    },
    {
      "url": "https://www.axios.com/2020/01/03/trump-iran-war-obama",
      "text": "in 2011"
    },
    {
      "url": "https://x.com/realDonaldTrump/status/255784560904773633",
      "text": "posted in October 2012"
    },
    {
      "url": "https://x.com/araghchi/status/2027724061892043214",
      "text": "screenshotted and shared Trump’s 2012 post"
    }
  ],
  "hash": "2d84cf6e3ffbbd1b52c4ef267b7a309b7cd2b6dd922099fce961de4ce9bfbd35",
  "scraped_at": "2026-03-01T07:06:38.191934+00:00"
}