{
  "url": "https://lite.cnn.com/2026/02/12/politics/trump-pam-bondi-mark-kelly-justice-department-analysis",
  "title": "Analysis: How Trump failed in his latest bid to weaponize justice | CNN Politics",
  "date": "2026-02-12T21:30:35.228397+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nHere’s three things we know about Donald Trump.\n\nHe thirsts for revenge; he’ll stretch the limits of presidential power to enact it; and he never gives up after a defeat.\n\nNo wonder that six Democratic lawmakers, all military and intelligence veterans, are bracing for what comes next despitea grand jury refusing to indict themfor warning service personnel against obeying illegal orders.\n\n“I don’t put anything past them. Donald Trump has a pretty limited … capacity to move on from things, and he doesn’t take bad news well, and he’s got quite, quite the ego,” one of the six, Arizona Sen. Mark Kelly, said Wednesday.\n\nAnother of the six, Michigan Sen. Elissa Slotkin, was asked by CNN’s Anderson Cooper on Wednesday whether she thought the administration may make a new attempt to indict her. She replied: “I wouldn’t be surprised.”\n\nRep. Jason Crow, a former army ranger and paratrooper who deployed to Iraq and Afghanistan, has launched a counterattack by warning of legal action unless the Department of Justice folds its retribution effort. “We are taking names, we are creating lists,” he told reporters Wednesday.\n\nThe lawmakers’ warning to the troops that started the showdown came in the form of a social media video that tipped Trump into a rage. Helambasted the sixas “traitors” guilty of “sedition at the highest levels” who should potentially be eligible for the death penalty. His bid for revenge was backed byDefense Secretary Pete Hegseth, who has launched an effort to lower Kelly’s last rank of captain and clip his retirement pay.\n\nBut it emerged on Tuesday that federal prosecutors in Washington had failed to convince a grand jury to indict the lawmakers. The attempt was the latest blatant example of Trump’s authoritarian bent and weaponizing of the DOJ.\n\nThe synergy of the department and the president’s personal and political goals was also on display on Capitol Hill Wednesday whenAttorney General Pam Bondiattacked and taunted Democrats while declaring Trump “the greatest president in American history.”\n\nTrump makes no secret of his zeal for vengeance and lets no attack go unanswered.\n\n“If you go after me, I’m coming for you,” he wrote on Truth Social in August 2023, defining a life mantra that as president he again has vast powers to enact. And the president told talk show host Dr. Phil McGraw in 2024 that “sometimes revenge can be justified.”\n\nThe failure of the DOJ to secure an indictment was unusual, since the bar for launching a prosecution is quite low. But it was also a remarkable constitutional moment. It’s rare when a president is directly thwarted by citizens in a validation of the republican system. If Trump’s strongman reflexes are to be defied over the next three years, it may take many more small acts of citizenship.\n\n“What was extraordinary was that an ordinary group of American citizens, a grand jury, stood up for the rule of law, stood up to this outrageous abuse of power and of taxpayer dollars,” Democratic Rep. Maggie Goodlander, another of the six, told CNN’s Kasie Hunt on Wednesday.\n\n“That is a win for the Constitution,” said Goodlander, a former intelligence officer in the US Navy Reserve.\n\nMany Americans might question the motives of the six members of Congress in putting out such a video, which was certain to incite Trump. The lawmakers each took turns to read statements warning that Trump’s actions threatened the Constitution. Kelly, a former Navy aircraft carrier pilot and space shuttle astronaut, told service personnel “our laws are clear,” and added, “You can refuse illegal orders.”\n\nFor some, the video represented an unwise decision to embroil the military in a campaign-style stunt. Others worried the video created new political complications for military officers already walking a tightrope with the Trump administration. The video was released amid a series ofUS strikes against alleged drug traffickersin the Pacific and the Caribbean that are taking place on questionable legal and constitutional grounds.\n\nDefenders of the lawmakers, however, view the administration’s response as absurd, since they were simply reminding officers of the Constitution’s requirements — and exercising free speech rights granted to every American. A successful prosecution against lawmakers who oppose the president would deal a devastating blow to democracy by seeming to outlaw criticism of a president by a member of Congress, a separate branch of government.\n\nKelly has alreadytaken legal action, alleging that the Pentagon is infringing his First Amendment rights. Senior US District Judge Richard Leon seemed sympathetic to Kelly’s argument that retired service members in Congress would be hampered in their work if they could not speak out against the Pentagon.\n\n“Is it your position that they’re not supposed to offer their position” on military matters, Leon asked the counsel for the administration in a hearing this month. “How are they supposed to be able to do their job?”\n\nBut this is a White House that doesn’t try to hide its contempt for Congress and its oversight role. It disdains any form of dissent. And it has reshaped the justice system to accommodate Trump’s demands, shattering the wall that has traditionally been intended to exist between the DOJ and the Oval Office.\n\n“You turned the people’s Department of Justice into Trump’s instrument of revenge,” Maryland Rep. Jamie Raskin, the top Democrat on the House Judiciary Committee, told Bondi on Wednesday. “Trump orders up prosecutions like pizza, and you deliver every time.”\n\nThe attempted indictments of the six Democratic lawmakers also raise a darker possibility — that Trump’s second-term prosecutors prefer to present hopeless cases than disappoint a president who demands retribution.\n\nHad they succeeded, it would have sent a message not only that members of Congress can be silenced by a president — but that ordinary citizens would be even more defenseless.\n\nBondi, however, argued on Wednesday that the department had been weaponized against Trump by the Biden administration, referring to cases it pursued charging Trump with 2021 election meddling and with keeping classified documents at his Florida home, and possibly to the Russia investigation in the president’s first term.\n\nThe six Democrats, also including Reps. Chrissy Houlahan and Chris Deluzio of Pennsylvania, are angry their GOP colleagues failed to defend them and their branch of government.\n\nOn Tuesday, House Speaker Mike Johnson said that the lawmakers “probably should be indicted.” He moderated his position slightly on Wednesday while maintaining his criticism of the video. “It’s a very dangerous gambit that they were playing. Should they be sent to jail? Hopefully not. But we need to call it out as being wildly inappropriate,” Johnson said.\n\nSenate Majority Leader John Thune, a South Dakota Republican, also didn’t like the video but drew the line at prosecutions. “That wouldn’t have been my response to that,” Thune said. “I trust our judicial system. That’s the conclusion they arrived at. I think that pretty much lays things to rest, as far as I’m concerned.”\n\nThe administration may not show similar acceptance. In December, for example, a grand jury in Virginia refused to indict another Trump foe —New York Attorney General Letitia James— for alleged mortgage fraud. Federal prosecutors tried again a week later, but with the same result.\n\nBut Trump’s vengeance list keeps growing.\n\nAnother case, against former FBI Director James Comey, whom Trump fired in his first term, was dismissed by a judge who ruled that the prosecutor, former White House aideLindsey Halligan, had been appointed unlawfully.\n\nNumerous people considered by Trump to be enemies are under investigation, including ex-special counsel Jack Smith and California Sen. Adam Schiff. On Wednesday, Republicans on the House Judiciary Committee asked Bondi whether John Brennan, a former director of the CIA who is now a Trump critic, would be indicted. The attorney general said she’d received a referral from the Judiciary Committee on Brennan but could not discuss an ongoing case. However, she added, “No one is above the law.”\n\nCrow is not waiting around. His lawyer Abbe Lowell wrote to US Attorney Jeanine Pirrothreatening legal actionif there was a second attempt to indict his client.\n\n“The baseless and absurd allegations by Donald Trump, followed by your carrying out of the President’s political retribution campaign has already gone too far, and are evidence of yet another abuse of power directed at those who dare speak out and criticize this Administration,” Lowell wrote.\n\nCrow was more direct.\n\n“Every American should be raving pissed that they’re using taxpayer dollars in the public trust of the Department of Justice to go after political opponents, weaponizing their justice system,” Crow told reporters.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
      "text": "a grand jury refusing to indict them"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/video/epstein-files-ghislaine-maxwell-pam-bondi-democrats-gop-donald-trump-jake-tapper-lead",
      "text": "Rep. Jason Crow"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/politics/trump-democrats-seditious-behavior",
      "text": "lambasted the six"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/politics/pentagon-cuts-mark-kellys-retirement-pay-punishment",
      "text": "Defense Secretary Pete Hegseth"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/5-takeaways-pam-bondi-house-testimony",
      "text": "Attorney General Pam Bondi"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/us-strikes-boat-2-killed-1-survivor",
      "text": "US strikes against alleged drug traffickers"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/mark-kelly-hearing-case-challenging-pentagon-punishment",
      "text": "taken legal action"
    },
    {
      "url": "https://www.cnn.com/2025/12/11/politics/justice-department-fails-reindict-letitia-james-second-time",
      "text": "New York Attorney General Letitia James"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/politics/lindsey-halligan-judge-vitriol-charade",
      "text": "Lindsey Halligan"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/pam-bondi-house-hearing-02-11-26?post-id=cmli9wk7b00003b6p5go4m51n",
      "text": "threatening legal action"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/trump-pam-bondi-mark-kelly-justice-department-analysis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/trump-pam-bondi-mark-kelly-justice-department-analysis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2db4de5abfbd891f92a5275eb11795a954772f3ccb2fa422fa1e2bbd4fe2e82f",
  "scraped_at": "2026-02-12T21:30:35.228412+00:00"
}