{
  "url": "https://lite.cnn.com/2026/02/21/middleeast/iran-students-university-protest-intl-hnk",
  "title": "Fresh protests erupt in Tehran as Witkoff says Trump curious why Iran has not yet ‘capitulated’ | CNN",
  "date": "2026-02-24T07:32:22.926948+00:00",
  "authors": [
    "Tim Lister",
    "Farida Elsebai",
    "CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump’s special envoy Steve Witkoff has said that Trump is “curious” as to why Iran has not yet “capitulated” and agreed ⁠to curb ⁠its nuclear program, as rallies have taken place at universities in the Iranian capital, Tehran, for the second day.\n\n“I don’t want to use the word ‘frustrated,’ because he understands he ⁠has plenty of alternatives, but he’s curious as to why they haven’t … I don’t want to use the word ‘capitulated,’ but why they haven’t capitulated,” Witkoff said in an interview on Fox News.\n\n“Why, under this pressure, with the amount of sea power and naval power over there, why haven’t they come ⁠to us and said, ‘We profess we don’t want a weapon, so here’s what we’re prepared to do’? And yet it’s sort of hard to get them to that place,” Witkoff said in an interview recorded on Thursday.\n\nIn response, Iran’s Foreign Minister Abbas Araghchi said in a post on X Sunday: “Curious to know why we do not capitulate? Because we are IRANIAN.”\n\nMeanwhile, Iranian state media reported demonstrations in support of the government andagainst the United States, following anti-regime protests on Saturday.\n\nVerified social media video showed scuffles Sunday between pro- and anti-regime groups at Amirkabir University, where some students chanted for the return of the monarchy.\n\nThe official Fars news agency reported “counter-revolutionary slogans being chanted by some students at Amirkabir University, Sharif University of Technology, and Science and Industry University,” all in Tehran.\n\nHossein Goldansaz, a professor at Tehran university, told the official Mehr news agency that the university was affected by the mourning period for those killed in January’s unrest.\n\n“One of the students’ main points is that we are mourning for the people who lost their lives in these events, those who were our friends,” he said.\n\n“We will allow them to hold their demonstrations on the university and if someone asks us for permission, we will give them permission, provided they respect the red lines,” Goladansaz said.\n\n“Students should be very careful not to lead to violence and I told the students that if this happens, I will not support them in any way,” he added.\n\nStudents held protests at several Iranian universities at the start of a new semester on Saturday, some clashing with pro-government groups, Reuters reported citing local news agencies and posts on social media.\n\nThe protests continued into Monday where some students burned the Iranian flag and others clashed with pro-regime demonstrators, state-affiliated Mehr News Agency said.\n\nThe protests coincided with ceremonies traditionally held after 40 days to mourn those killed by security forces during last month’s anti-government demonstrations.\n\nA video purportedly showed rows of marchers at Tehran’s Sharif University of Technology condemning Supreme Leader Ayatollah Ali Khamenei as a “murderous leader,” and calling for Reza Pahlavi, the exiled son of Iran’s toppled shah, to be a new monarch.\n\nOn Friday, Trump claimed that 32,000 people were killed during last month’s protests, a far higher death toll than has previously been reported.\n\nThe US has been building up its presence in the Middle East in recent weeks, putting increasing pressure on Iran as Trump weighs apotential strike on the country. The USS Gerald R. Ford carrier strike group is currently headed toward the region to join another carrier strike group, with dozens of combat planes also moved to the region.\n\nIranian President Masoud Pezeshkian said in a post on X on Sunday that Tehran remains committed to regional stability while continuing “to closely monitor US actions and have made all necessary preparations for any potential scenario.”\n\nIran ⁠and the United States have differing viewsover sanctions reliefin return for an agreement on Iran’s nuclear program, a senior Iranian official told Reuters on Sunday.\n\nThe official said new talks were planned in early March, after two sessions of indirect talks this month involving Witkoff and Araghchi.\n\nAraghchi said on Friday that he expected to have a draft counterproposal ready within days. On Sunday, he said that he may hold further discussions with Witkoff as soon as Thursday, with another meeting in Geneva. A US official also confirmed talks with Iran were planned for Thursday in Geneva.\n\nAraghchi told CBS’ “Face the Nation” that there was a good chance for a diplomatic solution on Iran’s nuclear program. He said that he was still working on a proposal, with elements that can accommodate the concerns of both sides.\n\nIt was quite possible to “prepare a good text,” he said.\n\n“We continue negotiations, we are working on the elements of a deal and the draft of a text,” Araghchi said.\n\nIran has repeatedly insisted it has a right to enrich uranium, which the US rejects.\n\nWashington has also demanded that Iran relinquish its stockpile of highly enriched uranium (HEU), which the International Atomic Energy Agency estimated at more than 440 kilograms last year.\n\nThe ‌Iranian official told Reuters that Tehran could seriously consider a combination of exporting part of ⁠its HEU stockpile, diluting the purity of its most highly enriched uranium and the establishment of a regional enrichment consortium in exchange for the recognition of Iran’s right to “peaceful nuclear enrichment.”\n\n“The negotiations continue and the possibility of reaching an interim agreement exists,” he said.\n\nThis story has been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/us-iran-strike-options-trump-military",
      "text": "against the United States"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
      "text": "potential strike on the country"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-iran-strikes-nuclear-program-board-of-peace-analysis",
      "text": "over sanctions relief"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/middleeast/iran-students-university-protest-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/middleeast/iran-students-university-protest-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2de230a4c162bd0f4614ccc8cda6d7175cf134b392d4f5c773a875f8db856fab",
  "scraped_at": "2026-02-24T07:32:22.926961+00:00"
}