{
  "url": "https://lite.cnn.com/2026/02/23/uk/peter-mandelson-arrested-gbr-intl",
  "title": "Former UK ambassador to US Peter Mandelson arrested amid Epstein probe | CNN",
  "date": "2026-02-26T07:31:37.244857+00:00",
  "authors": [
    "Peter Wilkinson",
    "Caitlin Danaher"
  ],
  "text": "Source: CNN\n\nThe former UK ambassador to the USPeter Mandelsonwas arrested Monday on suspicion of misconduct in public office, according to London’s Metropolitan Police.\n\nMandelson, a veteran Labour Party politician, has been accused of passing market-sensitive information to convicted sex offender Jeffrey Epstein when he was business secretary in the UK government.\n\nA Metropolitan Police spokesperson said: “Officers have arrested a 72-year-old man on suspicion of misconduct in public office. He was arrested at an address in Camden on Monday, February 23, and has been taken to a London police station for interview.”\n\n“This followssearch warrantsat two addresses in the Wiltshire and Camden areas.”\n\nMandelson was later released on bail, a Metropolitan Police spokesperson said early Tuesday.\n\nMandelson’s lawyers said his arrest was “prompted bya baseless suggestion that he was planning to leave the country and take up permanent residence abroad.”\n\n“Peter Mandelson was arrested yesterday despite an agreement with the police that he would attend an interview next month on a voluntary basis,” the law firm Mishcon de Reya said. His lawyers added that they have asked lawmakers for “the evidence relied upon to justify the arrest.”\n\n“Peter Mandelson’s overriding priority is to cooperate with the police investigation, as he has done throughout this process, and to clear his name,” they added.\n\nThe Metropolitan Police did not comment on Mandelson’s claims surrounding his arrest.\n\nOn Wednesday, Lindsay Hoyle, the UK’s Speaker of the House of Commons, confirmed he had passed information related to Mandelson to the Metropolitan Police. He did not specify what the information was but his comments came after London’sTimes newspapersaid the speaker had reported claims that the former ambassador was a flight risk to police.\n\nAddressing the Commons, Hoyle said to “prevent any inaccurate speculation” he wanted to “confirm that upon receipt of information that I felt it was relevant that I passed it on to the Metropolitan Police in good faith as is my duty and responsibility.”\n\nThe Metropolitan Police later apologized to Hoyle for “inadvertently revealing information” during the investigation.\n\nRevelations from the latest tranche of Epstein files led to Mandelson’s resignation from the Labour Party earlier this month, having quit the House of Lords, the upper chamber of Britain’s parliament, the same week.\n\nThe former politician was fired from his ambassador role inSeptemberby British Prime Minister Keir Starmer following a previous release of Epstein files which showed that he had called the financier “my best pal” in a handwritten note for his 50th birthday.\n\nThe unfolding Mandelson scandal threatened totopple Starmer’s premiership, with the bitter fallout leading to the resignations of key advisers and growing calls from senior Labour Party figures for the British prime minister to step down.\n\nThe British leader faced questions over how much he knew about the extent of Mandelson’s close relationship with the late sex offender when he appointed him as ambassador.\n\nMandelson has not publicly commented on these latest allegations. He has previously apologized for his association with Epstein.\n\nBritish MPs have been told the first tranche of documents related to Mandelson’s appointment as US ambassador is expected “very shortly in early March.”\n\nHowever, some correspondence between the former MP and Downing Street will be delayed due to the “Metropolitan Police interest,” Darren Jones, Chief Secretary to the Prime Minister told the House of Commons on Monday.\n\nMandelson, widely known in political circles as the “Prince of Darkness” for his Machiavellian skills, became Labour’s director of communications in the 1980s. He helped transform the party into a globalist, capital-friendly project known as “New Labour,” that eventually won a landslide election in 1997 under Tony Blair.\n\nHis arrest comes afterAndrew Mountbatten-Windsor, the younger brother of Britain’s King Charles III, was arrested on his 66th birthday last week following further revelations about the former prince’s relationship with Epstein.\n\nMountbatten-Windsor became the first member of the UK royal family to be arrested inmodern historyfollowing an early morning raid at his home on the Sandringham estate, also on suspicion of misconduct in public office.\n\nThe former prince was released “under investigation” late Thursday evening, after spending 10 hours in a police station in Norfolk, England.\n\nWhile police did not say what led to Mountbatten-Windsor’s arrest, they had previously said they were assessing whether he shared confidential information with Epstein during his decade as a UK trade envoy.\n\nThe offense of misconduct in public office is anotoriously difficult-to-prosecute lawthat experts have criticized for lacking clarity.\n\nUnder English law, the offense concerns “serious wilful abuse or neglect of the power or responsibilities of the public office held,” according to the Crown Prosecution Service, the body that prosecutes criminal cases in England and Wales.\n\nProsecution guidance says the person accused must be deemed a public officer, and there has to be a direct link between the misconduct and abuse of their responsibilities. It must also be committed “without reasonable excuse or justification.”\n\nThe offense must be shown to have been willfully committed, meaning the public official must be found to have deliberately done something wrong “knowing it to be wrong or with reckless indifference.”\n\nCNN’s Christian Edwards, Lauren Kent, and James Frater contributed reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/03/europe/peter-mandelson-epstein-ties-britain-intl-latam",
      "text": "Peter Mandelson"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/uk/uk-police-searching-peter-mandelson-linked-properties-intl",
      "text": "search warrants"
    },
    {
      "url": "https://www.thetimes.com/uk/politics/article/commons-speaker-reported-mandelson-as-flight-risk-to-met-police-npjqnvfn6?gaa_at=eafs&gaa_n=AWEtsqf3H7D8FmUS52Xo_Iyvh5qwodVuWFX5nUV6oRXwJqR-w5TcfcsmgVmF&gaa_ts=699efeb1&gaa_sig=6av736wDZGeN-bVz3lmipYzXvoB0vJFMaWFFORQC6cUhs8WXdkbNCRhkVEjEbk66SJB_WfkZj2lVZXo7YTAJYg%3D%3D",
      "text": "Times newspaper"
    },
    {
      "url": "https://www.cnn.com/2025/09/11/uk/peter-mandelson-uk-ambassador-fired-intl",
      "text": "September"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "topple Starmer’s premiership"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltl1lq7004s3b6pko1ab6qj",
      "text": "modern history"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/misconduct-public-office-andrew-arrest-explained-intl?iid=cnn_buildContentRecirc_end_recirc&recs_exp=up-next-article-end&tenant_id=related.en",
      "text": "notoriously difficult-to-prosecute law"
    }
  ],
  "hash": "2e006e3400e8d709b30e8ed552c792e12f5d1ee11bc8dcd580d7a1a94ddaa914",
  "scraped_at": "2026-02-26T07:31:37.244869+00:00"
}