{
  "url": "https://lite.cnn.com/2026/02/11/us/alex-murdaugh-murder-appeal",
  "title": "In Alex Murdaugh’s appeal, justices grill attorneys on court clerk and financial crimes | CNN",
  "date": "2026-02-12T21:31:09.081088+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAt Alex Murdaugh’sappeal of his double-murder convictionWednesday, South Carolina Supreme Court justices asked tough questions about improper comments from a county clerk and the fairness of including so much testimony about Murdaugh’s financial crimes.\n\nOverall, the five-member panel of justices appeared skeptical of the prosecution’s arguments on those points. Chief Justice John W. Kittredge in particular criticized the “rogue” clerk and suggested the prosecution’s focus on financial crimes was overdone.\n\n“The granular detail and the expansiveness of which everything under the sun was allowed is arguably problematic,” he said.\n\nThe oral arguments Wednesday werethe latest twist in thesprawling Murdaugh sagathat has riveted the public and spawned true crime documentaries, podcasts and books.\n\nMurdaugh, a prominent attorney from a South Carolina Lowcountry legal dynasty, was accused of the murders of his wife, Maggie, and 22-year-old son, Paul, at the family’s hunting property in June 2021. The six-week trial featured extensive testimony about Murdaugh stealing millions of dollars from vulnerable clients and his own law firm. Hetook the standin his own defense and denied he killed his wife and son, a position he still maintains.\n\nThe jury found Murdaugh, 57,guilty of the murders, and he received two life sentences. He separately pleaded guilty to dozens of financial crimes and is serving concurrent state and federal sentences of 27 and40 years.\n\nHe was not present at the hearing Wednesday.\n\nMurdaugh’s attorneys have appealed his murder conviction and argued he deserves a new trial based on the court clerk’s improper comments to the jury, prejudicial evidence and failures at trial and in the investigation.\n\nThe state has argued Murdaugh was convicted because the evidence against him was overwhelming and he was “obviously guilty.” They acknowledged the clerk’s comments were inappropriate but downplayed their importance to the verdict.\n\nThe justices are now tasked with deciding whether to uphold the murder conviction, remand the case for further proceedings, or overturn it and order a new trial. There is no deadline for their written ruling.\n\nHere’s a closer look at two of the most prominent issues from the hearing.\n\nThe first part of the hearing concerned former Colleton Courtcounty clerk Becky Hill, who clerked during Murdaugh’s trial and later wrote a tell-all book about it.\n\nMurdaugh’s attorneys argued Hill improperly influenced jurors during the trial by making comments, such as “watch his body language,” implying Murdaugh’s guilt. A few jurors affirmed she made these comments in affidavits and in testimony,but the majority said they did not hear them.\n\nIn January 2024, after a one-day evidentiary hearing, retiredSouth Carolina Chief Justice Jean Toaldetermined those comments did not influence the jury’s verdict and denied Murdaugh’s request for a new trial. Still, Toal found Hill made improper comments to the jury, was not credible and was “attracted by the siren call of celebrity.”\n\nHill wascharged last Maywith perjury, obstruction of justice and misconduct. The charges alleged she made sealed evidence available to the media, lied under oath about doing so, and used her court position to promote her book about the trial. Shepleaded guiltyto the charges in December 2025 and was sentenced to three years of probation.\n\nAt the hearing Wednesday, Murdaugh’s attorneys argued her comments infringed on his right to a fair trial and an impartial jury.\n\n“I’ve never seen a factual pattern like this where the clerk of court sets out to influence the verdict, to get a guilty verdict, for financial gain,” attorney Dick Harpootlian said.\n\nProsecutor Creighton Waters acknowledged Hill’s comments were improper but said they were of a “relatively non-egregious nature.” Despite her comments, the six-week trial featured over 90 witnesses and repeated directions from the judge to the jurors to only consider the evidence presented.\n\nJustice Kittredge expressed his frustration with the broader circumstances here.\n\n“In the courtroom, we have an excellent attorney general with a very professional and competent team of prosecutors, including you, Mr. Waters,” he said. “On the defense side, we have extremely competent top-drawer, representation. We’ve got a superb trial court judge.\n\n“And out in the hallway, we have a rogue clerk of court.”\n\nSecond,the justices asked questions about the prosecution’s focus on Murdaugh’s financial crimes in what was ostensibly a murder trial.\n\nAt the trial, a series of witnesses testified aboutMurdaugh’s history of financial crimesas prosecutors sought to show that he killed his wife and son to fend off a “gathering storm” that he believed would soon expose him as a fraud.\n\nHowever, Murdaugh’s attorneys have argued this motive did not make logical sense. They said the prosecution improperly used the financial crimes evidence to malign Murdaugh’s character and argued it should have been limited or completely excluded from the trial.\n\n“This was piling on,” attorney Jim Griffin said Wednesday.\n\nHowever, prosecutors said the jury had to understand those financial crimes to properly understand Murdaugh’s mindset and motive.\n\n“You can’t truly understand the boiling point if you don’t understand the slow burn leading up to that,” Waters argued.\n\nJustice George C. James said he was “struggling with the logical connection” between the financial crimes and the murders, and Justice Letitia H. Verdin asked about the limits of what evidence can be admitted under a theory of motive.\n\n“Could a prosecutor want evidence in and work backwards from there?” she asked.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/alex-murdaugh-murders-appeal-trial",
      "text": "appeal of his double-murder conviction"
    },
    {
      "url": "https://www.cnn.com/us/murdaugh-family-deaths-timeline",
      "text": "sprawling Murdaugh saga"
    },
    {
      "url": "https://www.cnn.com/2023/02/23/us/key-moments-alex-murdaugh-trial-testimony",
      "text": "took the stand"
    },
    {
      "url": "https://www.cnn.com/2023/03/02/us/alex-murdaugh-trial-defense-closings-thursday/index.html",
      "text": "guilty of the murders"
    },
    {
      "url": "https://www.cnn.com/2024/04/01/us/alex-murdaugh-federal-sentencing",
      "text": "40 years"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/us/murdaugh-killings-court-clerk",
      "text": "county clerk Becky Hill"
    },
    {
      "url": "https://www.cnn.com/2024/01/29/us/alex-murdaugh-murder-trial-hearing",
      "text": "South Carolina Chief Justice Jean Toal"
    },
    {
      "url": "https://www.cnn.com/2025/05/14/us/alex-murdaugh-trial-court-clerk-becky-hill-charges",
      "text": "charged last May"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/us/murdaugh-killings-court-clerk",
      "text": "pleaded guilty"
    },
    {
      "url": "https://www.cnn.com/2023/02/06/us/alex-murdaugh-trial-monday",
      "text": "Murdaugh’s history of financial crimes"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/alex-murdaugh-murder-appeal",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/us/alex-murdaugh-murder-appeal",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2e0bf5d9509fcd2680bc6335729a62d05c7cc14285988fe645482029cd1a659e",
  "scraped_at": "2026-02-12T21:31:09.081102+00:00"
}