{
  "url": "https://lite.cnn.com/2026/02/28/middleeast/israel-attack-iran-intl-hnk",
  "title": "What we know about the US-Israeli attack on Iran and Tehran’s retaliation | CNN",
  "date": "2026-03-01T07:06:14.998745+00:00",
  "authors": [
    "Christian Edwards",
    "Karina Tsui",
    "Mitchell McCluskey"
  ],
  "text": "Source: CNN\n\nThe United States and Israel launched a major joint assault on Iran on Saturday that killed Ayatollah Ali Khamenei, Iran’s longtime supreme leader, thrusting the country into uncertainty as US President Donald Trump urged its people to rise up against the government.\n\nIn a video on Truth Social, Trump said action was taken to “obliterate” Iran’s missile industry after he claimed the country had rejected “every opportunity to renounce their nuclear ambitions” even as a key mediator indicated a deal was close.\n\nThe strikes began in daylight on Saturday morning – the first day of the week in Iran – as millions went to work or school.Hundreds of civilians were killed – including students at a girls’ school hit by a drone strike, according to state media.\n\nIran has responded to the attacks, which it describes as unprovoked and illegal, with an unprecedented wave of strikes across the Middle East, targeting several countries that host US military bases – including Bahrain and the UAE – as well as four airports.\n\nWith airspace closed over key Mideast hubs, flight cancelations caused travel disruptions that rippled worldwide.\n\nHere’s what we know so far.\n\nWeakened by last summer’s war with Israel, which the US briefly joined, the Iranian regime has been battling a severe economic crisis which sparked nationwide protests in January.\n\nAfter a crackdown left thousands of protesters dead, Trump had promised to come to their aid.He warned the US was “locked and loaded” to attack and began moving huge amounts of materiel to the region, even as the US resumed efforts to reach a new nuclear deal with Iran.\n\nThe last round of talks ended in Switzerland on Thursday, with Iran agreeing to “never” stockpile enriched uranium. The Omani foreign minister, who acted as a mediator in the talks, said there had been “significant progress” and a peace deal was within reach.\n\nIn his Truth Social video, Trump said the main objective of the strikes was “to defend the American people by eliminating imminent threats from the Iranian regime.”\n\nThose threats, he said, included Iran’s nuclear program – which the White House claimed to have “totally” obliterated withstrikes in June.\n\n“It has always been the policy of the United States, in particular my administration, that this terrorist regime can never have a nuclear weapon,” Trump said, without providing evidence that Iran was any closer to obtaining a nuclear weapon.\n\nThe president also repeated his recent claims that Iran is building ballistic missiles which could reach the US mainland.  Anunclassified assessmentfrom the Defense Intelligence Agency (DIA) from 2025 said that Iran could develop a “militarily-viable” intercontinental ballistic missile (ICBM) by 2035 “should Tehran decide to pursue the capability.”\n\nAccording to two sources, the claim that Iran will soon have a missile capable of hitting the US is not backed up by intelligence.\n\nPrime Minister Benjamin Netanyahu has long viewed Iran as Israel’s most dangerous adversary. After the fall of Bashar al-Assad’s regime in Syria, a key Iranian ally, and Israel’s crippling of the Iran-backed Hezbollah militia in Lebanon– Israel last summer launched a war against Iran itself.\n\nAlthough Israel halted the conflict after the US struck Iran’s nuclear sites, analysts had long suspected that Netanyahu would take an opportunity to resume attacks on Iran. With elections due in October, Netanyahu may also see the return to war as a chance to shore up his standing domestically.\n\nIn a video statement Saturday, explaining why Israel was resuming its strikes on Iran, Netanyahu also repeated his claim that the Islamic regime must not be allowed to acquire a nuclear weapon.\n\nIn their statements, both Trump and Netanyahu were clear about their hopes for regime change in Iran as they pre-empted confirmation from Iran that Khamenei had died.\n\nTrump told the Iranian people “the hour of your freedom is at hand,” while Netanyahu urged them to “cast off the yoke of tyranny.”\n\nCheers and celebrations were heard in parts of Tehran on Saturday night following the reports of Khamenei’s death. In one video from Galleh Dar, in Fars province, people were seen tearing down a monument as fires burned around them.\n\nPro-regime crowds gathered separately in Tehran at daylight on Sunday to mourn the loss of their leader. Earlier, a state TV news presenter cried as he confirmed Khamenei’s death.\n\nExplosionswere heard Saturday inTehran’sPasteur district, the site of a highly secure compound housing Khamenei’s residence and office. Images showed severe damage to buildings and dense black smoke.\n\nTwo Israeli sources told CNN that the strikes targeted senior figures, including Khamenei, President Masoud Pezeshkian, and the armed forces’ chief of staff Abdolrahim Mousavi.\n\nSeveral other Iranian cities were hit, including Minab, where a girls’ elementary school suffered one of the largest death tolls. Citing a local prosecutor, Iranian state media reported 148 people had died there, as images showed a row of small body bags laid outside a damaged building.\n\nThe US-based Human Rights Activists News Agency (HRANA) said as of late Saturday, at least 133 civilians had been killed in the joint strikes on Iran, with 200 injured. Iranian state media put the death toll at over 200, with more than 700 wounded.\n\nIsrael ispreparing forseveral days of strikes against Iran and “even more if needed,” an Israeli source told CNN.\n\nIran retaliated with an unprecedented wave of strikes across the Middle East, targeting several nearby countries that host US military bases, as well as Israel.\n\nAcross Israel, one person was killed and 121 others were injured, according to the country’s national emergency service.\n\nBlasts were reported in the United Arab Emirates, Jordan, Qatar and Bahrain, as well as in Iran’s key regional rival, Saudi Arabia, which vowed to take “all necessary measures” to defend itself.\n\nA CNN team on the ground in Dubai heard three loud blasts at around 8:15 am local time Sunday morning.\n\nEarlier, dramatic footage showed people fleeing a smoke-filled passageway at Dubai International Airport, as officials confirmed four staff had been injured.\n\nThe Fairmont Hotel, in the city’s upmarket Palm Jumeirah islands development, also sustained damage with photos showing flames with a hole punched into an exterior wall.\n\nDrone strikescauseddamage and minor injuries at Kuwait International Airport, andone person was killed and seven injured at Zayed International Airport in Abu Dhabi.\n\nQatarandJordanintercepted missiles targeting their countries. One personwas reportedly killedby falling debris after air defenses intercepted missiles targeting sites in Abu Dhabi.\n\nBahrain’s interior ministry said three buildings in the cities of Manama and Muharraq had sustained damage “as a result of drone attacks and falling debris from an intercepted missile.” Video showed flames leaping from a residential building in Manama, though the cause of that blaze was unclear.\n\nThe clashes disrupted traffic in the Strait of Hormuz – acrucialshipping route located between the Persian Gulf and the Gulf of Oman.\n\nThe US hasn’t suffered any combat-related casualties in its operation against Iran and damage to US military installations has been minimal, US Central Command said in a statement.\n\nIran’s Foreign Minister Abbas Araghchi described the attack as unprovoked and illegal.\n\nIranian Foreign Ministry spokesperson Esmail Baghaei accused the Trump administration of being “dragged” into a conflict in which “the only beneficiary” would be Israel.\n\nThe spokesperson also defended Iran’s retaliatory strikes throughout the region as part of their “inherent, legitimate right of self-defense.”\n\nIran “didn’t welcome this war — it was imposed on us,” Baghaei said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/06/21/politics/trump-iran-air-strikes",
      "text": "strikes in June."
    },
    {
      "url": "https://www.dia.mil/Portals/110/Documents/News/golden_dome.pdf",
      "text": "unclassified assessment"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm5z7xcn0000356rmo74ffpk",
      "text": "Explosions"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm6071dj00003b6sir79z60w",
      "text": "Tehran’s"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm62jytj000l3b6t38qk93lk",
      "text": "preparing for"
    },
    {
      "url": "https://x.com/Kuwait_DGCA/status/2027759052386676826",
      "text": "caused"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm68jd2z00073b6t9i7nz2v0",
      "text": "Qatar"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm66kdbc001h3b6tiij6s8nu",
      "text": "Jordan"
    },
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm65nfwj0004356r92fj4mba",
      "text": "was reportedly killed"
    },
    {
      "url": "https://www.cnn.com/2025/06/23/business/strait-of-hormuz-iran-israel-explainer-intl-hnk",
      "text": "crucial"
    }
  ],
  "hash": "2ea5054e1bb1344850f21aa8ffce65135cc516bdbd72fab4ddd7dca957bc2a50",
  "scraped_at": "2026-03-01T07:06:14.998758+00:00"
}