{
  "url": "https://lite.cnn.com/2026/02/26/politics/syria-tps-supreme-court",
  "title": "Trump asks Supreme Court to remove immigration protections for thousands of Syrians | CNN Politics",
  "date": "2026-02-28T07:01:25.642621+00:00",
  "authors": [
    "John Fritze"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump’s administration urged the Supreme Court on Thursday to allow it to end temporary protections for thousands of Syrians who have been living in the United States since thegovernment’s brutal crackdownon protesters fifteen years ago.\n\nThe administrationfiled an emergency appealat the high court, the first of 2026, asking the justices to not only let it end Temporary Protected Status for the Syrians but also to decide broader questions about the president’s power to make similar decisions in other cases.\n\nTPS allows people who arrived from certain countries at times of upheaval totemporarily live and work in the US legally. As part of a broader effort to curb immigration, Trump has sought to end the status for multiple groups.\n\nThe Supreme Court has afforded the administration wide deference to cancel the designations in the past, including in a caseinvolving Venezuelans with TPS statusthat the court decided in May. And it reiterated that position in asecond emergency ruling in October.\n\nSolicitor General D. John Sauer, who has argued that courts don’t have the power to review the TPS decisions, urged the Supreme Court to take up the issue on the merits or else lower courts would “continue to impede the termination of temporary protection that the secretary has deemed contrary to the national interest, tying those decisions up in protracted litigation with no end in sight.”\n\nSeveral courts are considering similar decisions by the administration to end TPS.\n\nThe Obama administration granted TPS for certain Syrians in 2012 following the crackdown on protesters by former Syrian President Bashar al-Assad. That designation was repeatedly extended amid a civil war that erupted there. But Trump officials noted that the Assad regime fell in 2024 and it announced that it would end the TPS designation last November.\n\nA federal district court temporarily halted that decision last year, finding that the move by the Department of Homeland Security likely violated a federal law that dictates how agencies are supposed to consider and make decisions. The New York-based 2nd US Circuit Court of Appeals left the lower court’s decision in place.\n\nThe lawsuit was filed by seven Syrian nationals who “face near certain danger if forced to return to Syria,” their attorneys told a lower court.\n\nAbout 7,000 Syrians could be affected by the decision, according to court records filed at an earlier stage of the case.\n\n“There is no reasonable basis in fact for this decision,” lawyers for the Syrians told a federal district court last year. “It is instead part of the Trump administration’s preordained, political decision — motivated by animus — to end this congressionally-authorized program by terminating TPS designations across the board.”\n\nTPS recipients are vetted and are ineligible if they’ve been convicted of any felony or more than one misdemeanor in the US. The homeland security secretary has discretion to designate a country for TPS. But critics, including Trump, say that the designations were never intended to be permanent.\n\n“This application marks the third time that the government has been compelled to seek a stay from this court after lower courts have baselessly blocked the secretary of Homeland Security’s determinations regarding Temporary Protected Status (TPS) just before they took effect,” the administration told the Supreme Court in its appeal on Thursday.\n\nAfter flooding the Supreme Court with emergency appeals last year, those filings have slowed considerably in recent months. The last emergency application from the Trump administration was filed and decided in December. In that case, the courtsided against the Trump administration, keeping alive a federal lawsuit from immigration judges who are attempting to challenge a policy that limits their ability to speak publicly.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2024/12/08/middleeast/bashar-al-assad-syria-profile-intl-hnk",
      "text": "government’s brutal crackdown"
    },
    {
      "url": "https://www.documentcloud.org/documents/27419566-syria-tps-filing/",
      "text": "filed an emergency appeal"
    },
    {
      "url": "https://www.cnn.com/2025/05/19/politics/supreme-court-tps-venezuelans",
      "text": "involving Venezuelans with TPS status"
    },
    {
      "url": "https://www.cnn.com/2025/10/03/politics/supreme-court-tps-venezuela",
      "text": "second emergency ruling in October"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/politics/supreme-court-revives-free-speech-lawsuit-immigration-judges",
      "text": "sided against the Trump administration"
    }
  ],
  "hash": "2ebf856610c14003871427313f67fb4ef00f1181cb472bc0bde3ce08296b9720",
  "scraped_at": "2026-02-28T07:01:25.642632+00:00"
}