{
  "url": "https://lite.cnn.com/2026/02/12/politics/kennedy-hhs-change-control-vaccine",
  "title": "White House seeks to tighten control over HHS with personnel shakeup | CNN Politics",
  "date": "2026-02-12T21:29:17.435982+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe White House is looking to exercise tighter control over key areas of the US Health and Human Services Department, planning a shakeup of top personnel as the administration looks ahead to the midterm elections, an administration official told CNN.\n\nThe moves are aimed at restructuring HHS Secretary Robert F. Kennedy Jr.’s senior-most ranks, installing four new senior counselors who will be charged with more closely managing the department’s daily operations and communications across the federal government.\n\nChris Klomp, the administration’s current Medicare head and senior adviser at HHS, will become a senior counselor and the department’s de facto chief of staff, the administration official said.\n\nJohn Brooks, the deputy administrator at the Centers for Medicare and Medicaid Services, will be a senior counselor in charge of CMS-related issues. Two senior US Food and Drug Administration officials, Grace Graham and Kyle Diamantas, will take on senior counselor roles at HHS managing FDA-related issues.\n\nMatt Buckham, the current HHS chief of staff, will move to a senior counselor role, the administration official said.\n\nAn HHS spokesperson did not immediately comment.\n\nThe White House is preparing a midterm push that will rely heavily on promoting key health policies President Donald Trump has increasingly touted as central to his domestic agenda. That includes the “most favored nation” drug pricing deals that Klomp took a lead role in negotiating and recent efforts to spotlight healthier eating that Trump aides view as appealing to a broad spectrum of voters.\n\nThe moves also represent an effort to keep closer tabs on Kennedy and an HHS leadership that has struggled at times to coordinate with its own agencies and the White House, frustrating senior Trump officials and generating dayslong controversies.\n\nKennedy last year ousted his first chief of staff, Heather Flick Melanson, and a top deputy, Hannah Anderson, after just months on the job following a series of internal clashes. The department was also roiled last year by the abrupt firing — and then rehiring — of top FDA official Dr. Vinay Prasad, who has since made a series of controversial drug approval decisions that have overruled career staff and angered the drug industry.\n\nIn the meantime, Kennedy has also pressed ahead on a major overhaul of the nation’s vaccine system — a top priority for the longtime vaccine skeptic that has raised concerns among Republicans that it could damage the party politically ahead of the midterms.\n\nThe White House installed Klomp, who is well-regarded among Trump’s top aides, in large part to keep tighter hold on HHS priorities and messaging as the officials seek to focus on areas like drug pricing and nutrition that will be central to the midterm push, the official said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kennedy-hhs-change-control-vaccine",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/kennedy-hhs-change-control-vaccine",
      "text": "Cookie Settings"
    }
  ],
  "hash": "2fe0bf230f5b288881ba4847033a50f731e6e13e0106d75e940df40cb27a8207",
  "scraped_at": "2026-02-12T21:29:17.435996+00:00"
}