{
  "url": "https://lite.cnn.com/2026/02/21/business/apollo-epstein-wall-street",
  "title": "How Wall Street’s Apollo got tangled up again in the Epstein files | CNN Business",
  "date": "2026-02-22T07:09:40.895384+00:00",
  "authors": [
    "Matt Egan, CNN"
  ],
  "text": "Source: CNN\n\nJeffrey Epstein is once again haunting one of the most powerful firms on Wall Street: Apollo Global Management.\n\nFive years after the Epstein scandalforced billionaire Leon Black to step downas Apollo’s CEO, the recent release of millions of documents related to Epstein show Black’s replacement, current CEO Marc Rowan, met with Epstein multiple times years after Epstein’s 2008 guilty plea to procuring a minor for prostitution and his 18-month jail sentence. The Epstein files have raised new questions about the firm’s ties to the convicted sex offender — and its transparency to investors about those links.\n\nTwo powerful teachers’ unions that havecommitted at least $27.5 billion to Apollowrote a letter to the SEC this week calling for federal regulators to investigate Apollo’s “apparent lack of candor” over its relationship with Epstein.\n\nNow, Apollo is doing damage control. The asset management giantrespondedthis week by insisting to clients that there is “nothing new” in the Epstein documents and Rowan did not have a “business or personal relationship” with the disgraced figure. Despite multiple attempts from Epstein to do business with Apollo’s executives, other than Black, Apollo said Epstein’s requests were all rejected. Black said in late 2020 that “with the benefit of hindsight,” he deeply regretted having had “any involvement” with Epstein.\n\nThe focus on Apollo shows how the recent release of a trove of Epstein documents is raising new questions about his ties to powerful figures on Wall Street and across Corporate America long after his 2008 guilty plea to procuring a minor for prostitution. Newly discovered relationships, connections and conversations with Epstein risk damaging the reputations of major brands and business leaders.\n\nFor some, the consequences have been significant. The Epstein files have fueled anew flurry of resignations from business leadersin recent weeks, including the top lawyer at Goldman Sachs, thechairman of prestigious law firm Paul Weissand theexecutive chairman of Hyatt Hotels.\n\nNew York-based Apollo, which manages nearly $1 trillion in assets, has been dogged by its ties to Epstein for years. Black, one of its co-founders, resigned in 2021 after a probe found Black’s payments to Epstein totaled $158 million from 2012 to 2017.\n\nBut that probe, led by law firm Dechert LLP said that Black’s 2019 claims that he “never promoted Mr. Epstein’s services to other Apollo senior executives” were “not false but could have been more precise.” The law firm report also said that neither Rowan nor Apollo co-founder Josh Harris “hired Epstein or consulted with him on their personal matters.”\n\n“And it is clear that no Apollo employee other than Black ever seriously considered hiring Epstein, much less actually retained him,” the Dechert report said.\n\nDechert did not respond to a request for comment.\n\nHowever, the teachers’ unions note that hundreds of documents Epstein files released by the DOJ reference Rowan and indicate the current Apollo CEO met with Epstein multiple times years after the 2008 guilty plea and his 18-month jail sentence.\n\nFor example, inFebruary 2016 Epstein and Rowan traded emailsabout a potential Apollo corporate inversion, a tax maneuver designed to lower a company’s tax rate by reincorporating in a lower-tax country. The two discussed tapping banking firm Rothschild for the potential inversion.\n\n“i can join the call if you think appropriate,” Epstein emailed Rowan. “using rothschild for the inversion allows interesting structures.”\n\nRowan replied: “Agreed.”\n\nIn March 2016,Rowan shared with Epsteinwhat appears to be internal Apollo email correspondence about the valuation of a tax asset.\n\nIn September 2016, Brad Wechsler, an executive at an Apollo affiliate, sent anemailasking Apollo staffers to keep Epstein copied on certain tax matters for his “substantive expertise.”\n\nThe teachers’ union wrote in the letter: “We believe investor communications from Apollo currently give an inaccurate and incomplete picture of the firm and its partners’ connections to Epstein. The record must be clarified.”\n\nThe American Federation of Teachers and the American Association of University Professors, argued in aletteron Tuesday that Apollo has not been upfront about its links to Epstein.\n\n“We are troubled by Apollo’s seeming inability to be forthcoming about the extent to which Epstein was a personal, social and professional associate of the firm and its partners,” the unions wrote in the letter to the director of enforcement at the Securities and Exchange Commission. “We don’t know exactly what motivates that lack of candor, but it should be investigated.”\n\nSpecifically, the unions argued the SEC should investigate whether Apollo’s statements could be considered “materially false or misleading.”\n\nThe SEC declined to comment. Apollo did not respond to a request for comment.\n\nThe teachers’ unions argue that the Epstein files released late last month suggest Apollo’s prior statements in 2021 to shareholders about Epstein were “at the very least, misleading” and that senior executives at the time “would likely have known they were misleading.”\n\nThe union executives said aninvestigative report from law firm DechertLLP that Apollo made public in an SEC filling in January 2021 “takes pains to minimize Epstein’s ties with other Apollo executives.”\n\nIn a Wednesday letter to clients and partners, Apollo pushed back against the “flurry of coverage and certain constituents pushing their own agendas.”\n\n“From an Apollo perspective, there’s nothing new in these documents. Neither Marc Rowan nor anyone else at Apollo (excluding Leon Black) had either a business or personal relationship with Jeffrey Epstein,” Apollo President James Zelter wrote in the letter.\n\nZelter said that in “select instances” Rowan and other Apollo employees provided information to Epstein in connection to the convicted sex offender’s “tax work” for Black.\n\n“While Mr. Epstein sought to do work with the Apollo co-founders other than Mr. Black, it was declined at every turn,” the Apollo executive said. “Transparency and accessibility are hallmarks of who we are, and we will not be dissuaded from speaking out.”\n\nEleanor Bloxham, founder and CEO of The Value Alliance Company, which advises boards and executives, told CNN that she believes the unions have a “strong case” pushing for an SEC investigation.\n\n“The SEC has not done its duty on this. It’s a shame when investors have to call them out,” she said.\n\nBloxham described Apollo’s response this week as “very weak” and questioned why Rowan’s meetings and correspondence with Epstein was not previously disclosed.\n\n“When people invest with fiduciaries, they are looking for an honest broker. A lack of honesty and forthrightness here ought to be a shocker to clients,” Bloxham said.\n\nThe Epstein scrutiny adds to the financial headaches facing Apollo, which has lost about a fifth of its market value this year.\n\nApollo shares tumbled by another 6% on Thursday amid aselloff in the asset management industrysparked by worries about the health of private credit funds.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2021/03/22/investing/leon-black-apollo-epstein",
      "text": "forced billionaire Leon Black to step down"
    },
    {
      "url": "https://www.aft.org/press-release/aft-aaup-demand-sec-probe-over-apollo-execs-epstein-contacts",
      "text": "committed at least $27.5 billion to Apollo"
    },
    {
      "url": "https://www.apollo.com/insights-news/pressreleases/2026/02/apollo-sent-the-following-letter-to-clients-and-partners-3240705",
      "text": "responded"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/business/epstein-files-ceo-resign",
      "text": "new flurry of resignations from business leaders"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/brad-karp-resigns-chair-paul-weiss-epstein",
      "text": "chairman of prestigious law firm Paul Weiss"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hyatt-pritzker-retire-epstein",
      "text": "executive chairman of Hyatt Hotels"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00833332.pdf",
      "text": "February 2016 Epstein and Rowan traded emails"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00645429.pdf",
      "text": "Rowan shared with Epstein"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00816834.pdf",
      "text": "email"
    },
    {
      "url": "https://www.aft.org/sites/default/files/media/documents/2026/Letter_to_SEC_re_Apollo_Global_Management_February_17_2026.pdf",
      "text": "letter"
    },
    {
      "url": "https://www.sec.gov/Archives/edgar/data/1411494/000119312521016405/d118102dex991.htm",
      "text": "investigative report from law firm Dechert"
    },
    {
      "url": "https://www.barrons.com/articles/blue-owl-curb-redemptions-private-credit-fund-6a3e7364?gaa_at=eafs&gaa_n=AWEtsqfPXuFVctKh4U8u11forjxw6sAktkvbhPCQWNeFvvkwzKTOy9zS_-C3nVH6NSY%3D&gaa_ts=69975d87&gaa_sig=erY17eq8E0GMt7uetpnZ_lfAO06RxgCImLzvxjVNOUJI55cQYaPQEii0TLPttI6oJ-IBeo5DhgN6_iIPzCniyw%3D%3D",
      "text": "selloff in the asset management industry"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/apollo-epstein-wall-street",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/business/apollo-epstein-wall-street",
      "text": "Cookie Settings"
    }
  ],
  "hash": "300488b664b786e94018d43d405cd3f652c3b6e0b2d204a15d6246c0d69e8b60",
  "scraped_at": "2026-02-22T07:09:40.895399+00:00"
}