{
  "url": "https://lite.cnn.com/2026/02/10/media/don-lemon-minnesota-joseph-thompson-renee-good-ice",
  "title": "Don Lemon hires former federal prosecutor who resigned over handling of fatal ICE shooting probe | CNN Business",
  "date": "2026-02-14T07:07:44.744996+00:00",
  "authors": [],
  "text": "Source: CNN\n\nFormer CNN anchor Don Lemon, who faces several charges related to his coverage of a protest at a St. Paul church last month, has hired a prominent former Minnesota federal prosecutor to represent him, according to court records filed Tuesday.\n\nThat lawyer, Joseph H. Thompson, is now pitted against the very US Attorney’s Office he effectively ran until mid-January.\n\nThompson abruptly left the Minnesota US Attorney’s officelast month, alongside at least five other prosecutors.\n\nThe departures came after pressure from the Trump administration to focus the federal probe of the ICE officer shooting of Renée Good on the actions of the Minneapolis mother, her widow and others around her who may have been involved in ICE protests, according to a person brief on the matter who spoke with CNN shortly following the wave of resignations.\n\nLemon’s legal team is led by prominent Washington DC attorney Abbe Lowell.\n\nThompson served for 17 years in the Minnesota US Attorney’s office, most recently as the First Assistant US Attorney. He also served as the acting US Attorney from June until October. CNN has reached out to Thompson’s firm for comment.\n\nThompson notably led high-profile cases involving the multi-billion dollar fraud scandals that have plagued the state for several years and contributed to the political fallout that influenced Gov. Tim Walz’s decision to drop his bid for a third term.\n\nThompson and others left the office roughly a week after Good’s death, a few days before Lemon and protesters entered Cities Church.\n\nLemon and fellow independent journalist Georgia Fort were livestreaming that January 18 anti-ICE protest that interrupted a church service and led to tense confrontations with the pastor and attendees.\n\nLemon, who hosts his own show on YouTube,was arrestedon January 29 in Beverly Hills. Federal prosecutors alleged he participated in a “takeover-style attack” of the church and intimidated congregants.\n\nFederal authorities charged Lemon with two felonies: conspiring to intimidate or violate the free exercise of religion, and violating the FACE Act, which prohibits the use of force or threats to intentionally interfere with someone’s First Amendment right to practice religion.\n\nCorrection: An earlier version of this story misstated the date of Don Lemon’s arrest. It was January 29.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/politics/resignations-minnesota-prosecutors-trump-ice-shooting",
      "text": "last month"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/politics/don-lemon-custody",
      "text": "was arrested"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/media/don-lemon-minnesota-joseph-thompson-renee-good-ice",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/media/don-lemon-minnesota-joseph-thompson-renee-good-ice",
      "text": "Cookie Settings"
    }
  ],
  "hash": "30512f2629f15466d460afbd0d0e6c3a81cd638dd052616f843d5155d9edafd1",
  "scraped_at": "2026-02-14T07:07:44.745010+00:00"
}
