{
  "url": "https://lite.cnn.com/2026/02/27/health/measles-thousand-cases-deaths",
  "title": "Measles: The US has surpassed 1,100 cases in two months. Expect more deaths next | CNN",
  "date": "2026-03-01T07:07:50.625596+00:00",
  "authors": [
    "Deidre McPhillips"
  ],
  "text": "Source: CNN\n\nThe US has recorded more than 1,100 measles cases so far this year, according to data published Friday by the US Centers for Disease Control and Prevention. It’s a troubling milestone that has many in public health bracing for the worst.\n\nAccording to the CDC, out of every 1,000 children who are infected with measles, one may develop encephalitis, ​which is a dangerous swelling of the brain. Up to 3 out of every 1,000 infected children will die.\n\nThe US is on track for another record-breaking year for measles: The number of measles cases reported in the first eight weeks of the year — ​1,136 as of February ​26, according toCDC data— is already six times more than typical for an entire year. Atrackerfrom the Johns Hopkins University Center for Outbreak Response Innovation has tallied an even higher the annual case total than the CDC.\n\nThe current US trajectory for measles cases is “disappointing and depressing and ominous,” said Dr. William Schaffner, an infectious disease expert at Vanderbilt University Medical Center — especially because there is a safe and highly effective vaccine available to protect against measles infection and its complications.\n\n“Measles is a fierce infection, and we should be preventing it,” he said. “It can strike any healthy, normal child in its most severe fashion.”\n\nBut the vast majority of measles cases reported in the US so far this year — ​about 96% — have been among people who have not been vaccinated with the measles-mumps-rubella (MMR) vaccine or who have not received both recommended doses. More than 80% have been among children and teens, with about 1 in 4 cases among children under 5.\n\nLast year, the US reported nearly 2,300 measles cases — more than there have been in a single year since 1991, andsignificantly morethan there have been in any year since measles declared eliminated in 2000.\n\nThree people died from measles last year: two children in Texas and one adult in New Mexico, all of whom were unvaccinated.\n\n“That’s in that range of one to three deaths per 1,000 (cases). So, can we expect another death? Yes, I think we’re getting there where we can expect another death,” said Dr. Paul Offit, an infectious disease physician and director of the Vaccine Education Center at the Children’s Hospital of Philadelphia. “And it is unconscionable.”\n\n“When more people are choosing not to vaccinate their children, you’re going to see more disease, more suffering, more hospitalization and more death,” he said. “Children are dying from a vaccine-preventable disease because their parents are choosing not to vaccinate them, and they’re choosing not to vaccinate them because they fear the vaccine more than they fear the disease.”\n\nMore than half of US states have reported a measles case so far this year, and there are at least three large outbreaks happening across the country that continue to grow.\n\nArecord-breaking measles outbreakin the upstate region of South Carolina has led to at least 985 cases since it started in October, according to the South Carolina Department of Public Health.\n\nThe outbreak is centered in Spartanburg County, where vaccination rates ​are ​particularly low. As with broader national trends, nearly all measles cases in South Carolina — more than 93% — are among people who have not been vaccinated with the MMR vaccine, according tostate health department data.\n\nWhile no deaths have been reported, the state has reported severe complications from measles — including pneumonia and encephalitis, which can leave the patient deaf or with intellectual disability. Several pregnant women also required immunoglobulin treatment after exposure to help protect against the high risk of complications, the state health department said.\n\n“These are complications we hope to prevent, and increasing vaccination coverage protects those who cannot be vaccinated, like young infants, pregnant women and those with weakened immune systems,” South Carolina State Epidemiologist Dr. Linda Bell said at a news briefing earlier this month.\n\nEarlier this month, Prisma Health, a large health care system in South Carolina, implemented a new policy mandating masking for patients and visitors in emergency departments and in labor and delivery units.\n\nThese measures are meant to “reduce the risk of transmission and ensure a safe environment for patients, visitors and team members,” Prisma Health said in a news release.\n\nNew measles cases have started to slow in South Carolina in recent weeks. Less than two dozen cases were reported last week, which is down from nearly 250 cases reported in one week at the height of the outbreak in mid-January.\n\nThe downward trend is happening a bit earlier than originally projected, Bell said on Wednesday, crediting public health groundwork that has helped rapidly identify cases and potential exposures and drive quarantine guidance.\n\n“From the beginning of the outbreak, controlling the spread of measles and protecting people from disease has been our primary objective, and I don’t want anyone to miss that. That is our priority,” Bell said.\n\nImproving vaccination coverage has also helped, she said. The state health department administered nearly 17,000 MMR vaccines in January, which was one of the most successful months for vaccination that the state has had in years. But more work is needed, including raising vaccination coverage even more.\n\n“This is not over yet. It’s not nearly over yet,” Bell said Wednesday. “It is these pockets of undervaccinated people who remain susceptible. That ongoing susceptibility in our population may continue to fuel ongoing spread.”\n\nThe South Carolina health department has about 90 staff members spending a majority of their time on the measles outbreak, Bell told CNN in an email, about a third of whom are focused on contact tracing.\n\nThe health department will also receive support from about a dozen entry-level epidemiologists provided by the CDC Foundation, ​an independent nonprofit that helps support the agency’s mission, who will increase capacity for case investigation, contact tracing and data management for a few months.\n\nThey’ve also requested help from a CDC field team to help with epidemiological analysis.\n\n“Now that cases are decreasing, there are opportunities to use what data DPH epidemiologists have collected to learn from this response and continue working to stop measles transmission. CDC scientists have expertise and resources to make these studies happen to advance public health and our understanding of measles,” Bell said in an email to CNN.\n\nAnd significant, sustained measles spread in other parts of the US keep the county on a worrisome trajectory.\n\nMultiple state have reported measles cases with links to the South Carolina outbreak, including North Carolina, Washington and California. North Carolina has reported 23 measles cases since December, state health departmentdatashows, which is more than five times more cases than the state has had in total over the past decade.\n\nOutbreaks in other parts of the country also continue to grow. An outbreak along the border of Utah and Arizona continues to simmer, with each state reporting hundreds of cases since the summer.\n\nAnd a more recent outbreak along the Southwest coast of Florida has grown rapidly over the past month.\n\nThe outbreak is centered around Ave Maria University, a private Catholic college located in a tight-knit planned community in Collier County. There have been at least 83 measles cases in the county over the past month, according to data published by the Florida state health department.\n\nEarly updates suggest that the vast majority of cases have been among university students, but the university has stopped providing its own updates. The university website now references the Florida health department’s website for official case counts, but the state data does not provide any additional detail about the age, vaccination status, or other information to help local residents understand the scope of the outbreak.\n\nWhile most recent measles cases have been among children, experts say that a measles infection can be just as dangerous for adults.\n\n“Anyone who is susceptible (from being unvaccinated) can become infected and get measles,” Schaffner said. “The older you are when you acquire the measles infection, the more likely it is to be severe, and this is particularly true for pneumonia.”\n\nThe difference is that vaccine hesitancy has grown over time, so there are more young children at risk, he said.\n\n“Measles is a nasty virus,” Schaffner said.\n\n“Speak to your own doctor – the doctor that is caring for your child day in and day out – please have these discussions with that doctor and listen very carefully,” he said. “I can do everything I can to try to reassure parents and make them comfortable with the notion of their children receiving the measles vaccine and other vaccines, but please talk to your own doctor.”\n\nMeasles wasdeclared eliminatedin the US in 2000, but ongoing spread has threatened that status. The Pan American Health Organization will meet in April to make a formal determination.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cdc.gov/measles/signs-symptoms/index.html",
      "text": "According to the CDC"
    },
    {
      "url": "https://www.cdc.gov/measles/data-research/index.html",
      "text": "CDC data"
    },
    {
      "url": "https://cori.centerforhealthsecurity.org/resources/measles-outbreak-response",
      "text": "tracker"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/health/us-measles-outbreak-one-year",
      "text": "significantly more"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/health/largest-us-measles-outbreak-south-carolina",
      "text": "record-breaking measles outbreak"
    },
    {
      "url": "https://dph.sc.gov/diseases-conditions/infectious-diseases/measles-rubeola/2025-measles-outbreak",
      "text": "state health department data"
    },
    {
      "url": "https://www.dph.ncdhhs.gov/programs/epidemiology/communicable-disease/infectious-respiratory-diseases/measles-rubeola/measles-cases-and-outbreaks-north-carolina",
      "text": "data"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/health/cdc-south-carolina-measles-briefing",
      "text": "declared eliminated"
    }
  ],
  "hash": "30c3be061aa6591942c10ea4c9ad77a37443ec0f0eb6a8595425dd3d0e5d88d7",
  "scraped_at": "2026-03-01T07:07:50.625608+00:00"
}