{
  "url": "https://lite.cnn.com/2026/02/19/politics/us-iran-strike-options-trump-military",
  "title": "Trump confronts his options on Iran — from targeted attacks to potentially toppling regime | CNN Politics",
  "date": "2026-02-20T07:28:17.795480+00:00",
  "authors": [
    "Kevin Liptak",
    "Kristen Holmes",
    "Zachary Cohen",
    "Natasha Bertrand",
    "CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump faces one of the weightiest decisions of his second term as he orders the largest military buildup in the Middle East in 22 years.\n\nIf he decides to go ahead with an attack on Iran, his options now range from more targeted strikes to sustained operations that could potentially last for weeks, according to people familiar with the matter. Some include plans to take out Tehran’s leaders. Many would be on a much larger scale than the hourslong bombing run that targeted Iranian nuclear facilities last summer, according to people familiar with the plans.\n\nPeople familiar with the plans said the US military could be ready as soon as this weekend to strike Iran, but US officials and regional diplomats with knowledge of the diplomatic talks with Tehran do not expect strikes to come that soon. Middle East envoy and Trump’s son-in-law Jared Kushner — who has helped lead the US negotiating team — is among a number of Trump advisers who are hopeful that they can reach a nuclear deal with Iran, according to a source familiar with his thinking,\n\nUS troops have not yet received a target list for potential strikes on Iran, a sign Trump has not yet “pulled the trigger” on ordering any specific military operation, according to a source familiar with the planning. White House officials say he continues to prefer a diplomatic solution.\n\nHowever, many now say they see diminishing prospects of an agreement that satisfies all of the president’s demands.\n\nTrump, so far, has not publicly laid out everything he is hoping to achieve by launching a new war. Nor has he made serious attempts to gain the buy-in either from the American public or members of Congress, who have been away from Washington this week as he mulls his options. And experts remain skeptical Iran would make the concessions that Trump has publicly demanded, like giving up uranium enrichment entirely.\n\nTrump has offered vague warnings to the Islamic Republic to agree to a deal, the terms of which remain unclear. He said Thursday morning in Washington that he would know “over the next probably 10 days” whether an agreement was possible. Later, aboard Air Force One, he extended the timeline to 15 days.\n\n“They cannot continue to threaten the stability of the entire region and they must make a deal, or if that doesn’t happen — maybe you can understand if it doesn’t happen, it doesn’t happen, but bad things will happen if it doesn’t,” Trump said at the inaugural meeting of his Board of Peace on Thursday.\n\nPressed later what “bad things” could occur, Trump refused to elaborate.\n\n“I’m not going to talk to you about that,” he said.\n\nTrump, who promised as a candidate to avoid becoming embroiled in foreign wars, has been vocally wary of approving an operation that lacks a decisive outcome and could put Americans in harm’s way.\n\nHe has received numerous briefings on the potential options. They range in scale, from attacks on nuclear or missile sites all the way to attempts to take out government leaders and topple the regime. All the options would address, at least in part, the threat of Iran launching military strikes against Israel or American military bases in the region, as well as Iranian proxy groups potentially obtaining a nuclear or dirty bomb.\n\nTrump has hinted at a desire for regime change in Iran, but there is little clarity inside the administration of what might happen if the leadership in Tehran falls. Secretary of State Marco Rubio said during congressional testimony last month that no one really knows who might replace Supreme Leader Ali Khamenei if he was ousted.\n\nBecause Trump has not yet decided on a course of action, all the military assets needed to conduct a range of operations are in place, or will be in the coming days, sources have said. That includes the USS Gerald R. Ford, the world’s most advanced aircraft carrier, which is expected to sail to the Eastern Mediterranean by early next week.\n\nAt least part of the military buildup is intended to help defend US troops should Iran either preemptively stage an attack or retaliate for US strikes by firing drones or missiles toward American bases.\n\nThe question remains, however, whether any potential operation ordered by Trump would be focused on taking out Iran’s leadership, targeting its enrichment capabilities or taking out its ballistic missile program.\n\n“President Trump has been clear that the Iranian regime should make a deal or else ‘it will be very traumatic’ for the regime,” White House spokesperson Anna Kelly said in a statement, adding that Trump demonstrated that “he means what he says” with previous strikes.\n\nBehind the scenes, even some of Trump’s advisers aren’t clear on how to convey to the public why it might be necessary for the United States to potentially use military intervention in Iran. One source said administration officials were being intentionally vague on motivations in public.\n\nWhile Trump repeatedly claimed that the US strikes last June “completely and totally obliterated” Iran’s nuclear enrichment facilities, the head of the International Atomic Energy Agency Rafael Grossi said on Thursday that “most of the material that Iran had accumulated up until June of last year, despite the [U.S.] bombings and the attacks, is still there, in large quantities, where it was at the time of the strikes.”\n\n“Some of it may be less accessible, but the material is still there. From a non-proliferation standpoint, the material remains,” Grossi added. “That is why there is so much interest — I would say urgency — in reaching an agreement that would prevent new military action in the region.”\n\nOn Wednesday, White House press secretary Karoline Leavitt danced around why a strike on Iran might be necessary.\n\n“There’s many reasons and arguments that one could make for a strike against Iran,” Leavitt told reporters during a press briefing, without elaborating on what those reasons or arguments were.\n\nShe also wouldn’t say whether Trump planned to lay out his objectives or rationale for an Iran mission during his State of the Union address next week, traditionally one of the largest yearly television audiences for a commander in chief.\n\nTwo Trump advisers compared the current moment to both the decision to strike Iran last year and the capture of Venezuelan leader Nicolás Maduro in January, noting that in each case Trump didn’t firmly decide on a course of action until shortly before giving the order, despite months of planning.\n\nIn both cases, CNN reported that Trump had gone back and forth on whether to actually use military force for weeks. This week, Trump has privately argued both for and against military action and polled advisers and allies on the best course of action.\n\nHe has received different pieces of advice. Israeli Prime Minister Benjamin Netanyahu, who paid an urgent visit to the White House last week, has argued Iran has never been weaker, and the time is right to either extract concessions from Tehran or attempt to wipe out its missile program. Rubio is planning to visit Israel late next week to update Netanyahu on Iran talks, a State Department official told CNN Wednesday.\n\nOther top Trump allies, including Sen. Lindsey Graham of South Carolina, have been arguing for US intervention in both public and private.\n\nThere is no indication Trump is preparing to ask Congress for approval of any Iran operation. Two lawmakers — Rep. Ro Khanna, the California Democrat, and Rep. Thomas Massie, the Kentucky Republican — said Thursday that they plan to try forcing a vote next week on a resolution that would require authorization from Congress before Trump orders military force.\n\n“It’s not Donald Trump’s final decision to make. The Constitution is super clear about this, he cannot engage US forces into hostilities without congressional authorization,” another lawmaker, Massachusetts Democrat Rep. Jake Auchincloss, said on CNN. “That authorization for the use of military force has not been granted by Congress.”\n\n“Coercive diplomacy against Iran is appropriate, against their funding of proxy terror forces, against their ballistic missile development, against, of course, their nuclear program,” he added. “What is not appropriate is for him to make the unilateral decision that he will strike Iran and potentially vest the United States in another forever war that the American public does not want.”\n\nKylie Atwood, Kasie Hunt and Jennifer Hansler contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/us-iran-strike-options-trump-military",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/us-iran-strike-options-trump-military",
      "text": "Cookie Settings"
    }
  ],
  "hash": "30d41cf4987f039769f823a0fe694410766460e9e15e5a8659e305b558fa99dd",
  "scraped_at": "2026-02-20T07:28:17.795493+00:00"
}