{
  "url": "https://lite.cnn.com/2026/02/10/entertainment/chappell-roan-casey-wasserman-intl-scli",
  "title": "Chappell Roan leaves Casey Wasserman talent agency after Epstein files revelations | CNN",
  "date": "2026-02-11T16:32:50.481727+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nGrammy Award-winning singerChappell Roansaid Monday she’d left the talent agency led byCasey Wassermanafter emails released by the US Justice Department showed he exchanged flirtatious messages withGhislaine Maxwellmore than 20 years ago.\n\nThe emails were released last month as part of the department’s dump of millions of documents relating to its investigation into Maxwell’s partner, the late convicted sex offender Jeffrey Epstein.\n\nWasserman, a major power player in the entertainment industry, is the founder and CEO of Wasserman talent agency and is also head of the coordinating committee for the 2028 Olympic Games in Los Angeles. He is facing calls to step down from his roles following the emails’ release.\n\nOn Monday, Roan posted to her Instagram Stories: “As of today, I am no longer represented by Wasserman, the talent agency led by Casey Wasserman.”\n\nThe 27-year-old singer did not mention Wasserman’s messages in her statement but added that “no artist, agent or employee should ever be expected to defend or overlook actions that conflict so deeply with our own moral values.”\n\n“Artists deserve representation that aligns with their values and supports their safety and dignity,” Roan added. “This decision reflects my belief that meaningful change in our industry requires accountability and leadership that earns trust.”\n\nWasserman has not been accused of criminal wrongdoing in relation to Epstein. CNN has contacted his agency and a crisis communication firm representing him for comment.\n\nMaxwell was convicted of sex trafficking and other crimes in 2021 and is serving a 20-year sentence. Epstein died by suicide in 2019 while awaiting trial on federal sex-trafficking charges.\n\nThe slow trickle of revelations that have emerged from this latest batch of documents have laid bare the close ties dozens of keypolitical,businessand evenroyalfigures seemed to have with Epstein.\n\nWhile some aspects of Wasserman’s association with Epstein were already known, this fresh batch of emails shows a deeper and far more intimate relationship with Maxwell than had previously been revealed.\n\nDuring one exchange in March 2003, Wasserman asks Maxwell: “So what do I have to do to see you in a tight leather outfit?”\n\nIn another email, dated April 1, 2003, Wasserman, who was married at the time, says to Maxwell: “Where are you, I miss you,” before asking to book a massage.\n\nIn a statement to other news outlets last week, Wasserman apologized for his communications with Maxwell, which took place years before she was convicted of a crime, while adding he “never had” a personal or business relationship with Epstein.\n\nWasserman, one of the most prestigious agencies in the sports and entertainment industries, boasts several other stars on its roster like Kendrick Lamar, Ed Sheeran, Noah Kahan, Tyler, The Creator and Joni Mitchell.\n\nLike Roan, a handful of other artists have announced their intention to leave Wasserman. Alt-rock band Wednesday said this week that “given the circumstances we feel strongly that we need to begin the process of extracting ourselves from Wasserman.” The group added that the team they worked with at the agency were “decent and trustworthy people” and called on Wasserman himself to step down.\n\nElectronic pop duo Sylvan Esso also said they were leaving the agency, while art-pop band Water from Your Eyes said its members “are waiting to understand what our options are” as they have “no interest in being affiliated with Casey Wasserman.”\n\nMeanwhile, Bethany Cosentino, the frontwoman of rock band Best Coast, called on Wasserman to step down, change his business’ name and for her name to be removed from the company’s website.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/style/grammy-awards-bad-fashion-chappell-roan",
      "text": "Chappell Roan"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/casey-wasserman-la-olympics-ghislaine-maxwell-epstein",
      "text": "Casey Wasserman"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/trump-epstein-maxwell-clemency-analysis",
      "text": "Ghislaine Maxwell"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/europe/peter-mandelson-epstein-ties-britain-intl-latam",
      "text": "political"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "business"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/europe/norway-royal-family-scandals-intl",
      "text": "royal"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/entertainment/chappell-roan-casey-wasserman-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/entertainment/chappell-roan-casey-wasserman-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "31025fda0869405446ef3295c55b569591f3c206929853deec6196ac320f621e",
  "scraped_at": "2026-02-11T16:32:50.481739+00:00"
}