{
  "url": "https://lite.cnn.com/2026/02/22/americas/colombian-congresswoman-son-detained-by-ice-intl-latam",
  "title": "Pro-Trump lawmaker in Colombia faces questions after son’s detention by ICE | CNN",
  "date": "2026-02-23T07:36:12.867462+00:00",
  "authors": [
    "Rocío Muñoz-Ledo",
    "Michael Rios"
  ],
  "text": "Source: CNN\n\nA Colombian congresswoman whose conservative party is closely aligned with the right-wing ideologies of US President Donald Trump says her son was detained last month by ICE agents amid the US crackdown on immigration.\n\nÁngela Vergara says she decided to go public with the case last week in part because her son has not yet been allowed to return to Colombia despite having requested voluntary departure, but also to raise awareness about the harsh conditions Colombian immigrants are facing in the US.\n\nThe case has sparked a debate online, with critics questioning why Vergara, a member of a party that often backs Trump, came out in defense of immigrants only after her son’s detention.\n\nVergara has pushed back against the criticism, insisting that she has never supported immigration policies that she says violate human rights.\n\n“This isn’t a political issue; it’s really a human rights issue,” she told CNN. “Being a conservative politician doesn’t mean I agree with human rights violations in Colombia or anywhere else in the world.”\n\nVergara says her son Rafael, 23, has been locked up for more than 20 days at the River Correctional Detention Center in Louisiana, in what she describes as “inhumane conditions.” She says he is being held along with a number of Colombians waiting for a repatriation flight home.\n\n“He told me that he was with 70 people in a cell, that they had gone 12 hours the day before without drinking water, (and) everyone was sick,” Vergara recounted to CNN.\n\nThe congresswoman said Rafael had been detained by ICE agents after a routine inspection while driving a commercial cargo truck in Louisiana.\n\nShe insists Rafael has been living in the US legally with a work permit and paying into social security. She says he applied for asylum a year after arriving in 2022 and was awaiting an asylum hearing scheduled for 2028.\n\nCNN has reached out to the US Department of Homeland Security, which oversees ICE, for more information.\n\nAfter learning of her son’s arrest, Vergara said the family requested his voluntary return to Colombia, thinking it would be the quickest way to resolve the matter. But more than 20 days after his arrest, she says her son remains in detention.\n\nShe attributes the delay to a “bottleneck” in the repatriation process that has left thousands of Colombians stranded in the US waiting for a limited number of flights.\n\nColombia signed an agreement earlier this month to resume repatriation flights from the US. Foreign Minister Rosa Villavicencio said that approximately one flight per week would be carried out over the next few months.\n\nVergara says she has asked the Colombian government to expedite transfers and increase the frequency of humanitarian flights.\n\nVergara’s Conservative Party maintains many positions that are more aligned with the American right than with Colombia’s left-wing government led by President Gustavo Petro and has often expressed support for the Republican Party in the US.\n\nIn 2024, the Colombian Conservatives “celebrated” the electoral victories of Trump and his fellow Republicans in the House and Senate.\n\nLast year, when the Trump administration decertified Colombia as a partner in the fight against drug trafficking, the partycondemned,not Trump, but Colombia’s president for criticizing the US leader. It issued a statement pledging to support the US drug fighting measures.\n\nIn September, after the killing of prominent US conservative activist Charlie Kirk, Vergaraexpressed condolencesand support for the activist, saying, “His departure represents a loss for those of us who firmly defend life, family, and freedom.”\n\nStill, despite sharing some views with the American right, Vergara insists she doesn’t support inhumane immigration policies.\n\n“I have always demanded due process and humane treatment for Colombians, both inside and outside the country,” she recently wrote on X.\n\nVergara says her conversative leanings have caused people to make false assumptions about her.\n\nThis week, she denied being a member of the group “Latinas for Trump,” as many people online have alleged. She also denied that she celebrated the deportations of Latinos or called for a US invasion of Colombia.\n\nOn Tuesday, social media users and some news outlets shared a video of a woman dancing in a MAGA hat, whom they incorrectly identified as Vergara.\n\nThe video was also shared by Petro, who later took down his post after Vergara denied it was her in it.\n\nIn his post, Petro had also addressed the detention of Vergara’s son and asked the Colombian Embassy in Washington to provide him with consular assistance: “No matter the paradox, the Colombian embassy in the US must help … this Colombian congresswoman to recover her son.”\n\nCNN has reached out to the Colombian presidency for comment on the matter.\n\nVergara told CNN she thought it was positive that Petro addressed the issue but insisted that he needs to respond to her request for humanitarian flights.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/soyconservador/status/1854201896765890785",
      "text": "celebrated"
    },
    {
      "url": "https://x.com/soyconservador/status/1968271416882528611",
      "text": "condemned,"
    },
    {
      "url": "https://x.com/AMVergaraG/status/1965935417317818587",
      "text": "expressed condolences"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/colombian-congresswoman-son-detained-by-ice-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/americas/colombian-congresswoman-son-detained-by-ice-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "316f8e84294c23fe832c86cd936223fbe410a3db4a8fc9dcdfdbc59dbdfd7cbb",
  "scraped_at": "2026-02-23T07:36:12.867482+00:00"
}