{
  "url": "https://lite.cnn.com/2026/02/15/business/chinese-automakers-eye-us-move",
  "title": "Chinese automakers want to come to US. They could be here fairly soon | CNN Business",
  "date": "2026-02-16T07:34:11.701667+00:00",
  "authors": [],
  "text": "Source: CNN\n\nChinese cars could be at an American dealership sooner than you think, and that’s good news for US consumers.\n\nChinese car companies make more vehicles than anyone else on Earth and export more as well.But high tariffs and hostile US-China trade relations have kept them out of the American market.\n\nThat’s likely to change, according to experts, with Chinese autos hitting US showrooms in the next five to 10 years.\n\n“The ambition is there,” said Lei Xing, an independent auto analyst and former chief editor of China Automotive Review magazine, even if companies have to build factories here rather than ship cars here from China.\n\nHe said multiple Chinese automakers have shown “readiness to come to the US, to build in the US.”\n\nThat would be helpful for American car buyers. Greater competition means more choices, especially for EVs, which in turn should lower prices. But it would also squeeze the profits and market share of the car companies already selling in the US, likely affecting the nearly 1 million people who work for them.\n\nChinese cars shipped to America come with a 100% tariff, by far the highest tariff rate for any import. ButPresident Donald Trump, a critic of most Chinese products, recently seemed welcoming of Chinese brands if they build plants in the US.\n\n“If they want to come in and build the plant and hire you and hire your friends and your neighbors, that’s great. I love that,” he said in a speech last month at the Economic Club of Detroit. “Let China come in.”\n\nAsked about the administration’s willingness to let Chinese automakers enter the US market, a White House official told CNN last week that “the administration supports all investment into the United States as long as our national and economic security is not compromised.”\n\nAny Chinese entry into the market could further cement the country’s industry dominance.\n\nChina produced one-third of all cars worldwide last year, with more than 8 million of those exportedto other markets around the globe, according to theChina Association of Automobile Manufacturers. That’s up 30% compared to 2024. China eclipsed Japan as the world’s largest exporter of vehicles in 2023.\n\nChina is particularly competitive when it comes to electric vehicles. Chinese automaker BYDovertook Tesla last year as the largest electric car company worldwideand Ford this week in global sales.\n\nBuilding a car factory the US could take several years, but leading experts agree that most Chinese carmakers are already eyeing the US market.\n\n“It’s no secret that every automaker in the world looks at the United States market as the ultimate arena for triumph,” said Michael Dunne, an auto industry consultant who has been involved in Western automakers’ efforts in China since the 1990s.\n\nThat’s because American consumers are wealthier and buy bigger, more expensive vehicles — meaning it’s more profitable than anywhere else, he added.\n\nDunne said the average price of a car exported from China last year was about $19,000, while the average price of a new car sold in the United States is around $50,000.\n\nBYD and other leading Chinese automakers did not respond to questions from CNN about their plans for entering the US market.\n\nBut it doesn’t mean that they haven’t already dipped their toes in.\n\nVolvo, owned by Chinese automaker Geely, built a plant in South Carolina in 2015.\n\nThe plant, currently undergoing a $1.3 billion expansion, could serve as a beachhead for Geely to start building cars from its Zeekr and Lynk & Co. brands in the US. Geely’s global communications chief Ash Sutcliffe hinted as much in aninterview with Autoline last month.\n\nGeely already sells a limited number of Zeekrs to Waymo, the autonomous vehicle unit of Google parent Alphabet.\n\nGeely is the Chinese car company that’s best poised to enter the US, said Xing. “I think we’ll have an announcement on that in the next 24 to 36 months.”\n\nWith American car prices hovering around record highs, Chinese companies would bring more choice and capacity. That’s a prescription for lower prices, as has been the case in Europe since Chinese automakers entered that market, according to experts.\n\nBut the popularity of Chinese brands in both Europe and their home market is not just based on price, but also the quality and value of the vehicles, said Bill Russo, head of Shanghai-based investment advisory firm Automobility.\n\n“Foreign brands have lost more than half of their market share (in China) in the span of less than five years, and the reason isn’t because Chinese consumers were told they should buy Chinese products,” Russo said. “They just made better cars, and they made better technologies at affordable price points.”\n\nChinese carmakers’ global expansion is also driven by acut-throat price competitionamong more than 100 domestic brands.\n\nIn China, decades of government support and heavy investment created significant overcapacity in the automotive sector. Sluggish consumer spending this year added urgency for automakers to expand abroad.\n\nBut the US market won’t necessarily be easier, Russo said.\n\nChinese car companies might run into trouble breaking through with American buyers who could be slow to trust an unknown brand. But he believes any concern that the car is “cheap” and not just low-priced could  be quickly overcome.\n\n“Do Americans really care who made the car as long as it’s a good car? I don’t think they do,” he said. “They go to Walmart, they buy Chinese stuff all the time. I think at the end of the day, it’s the market cares about value for the money first. And xenophobia can only take you so far.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/02/business/tesla-byd-ev",
      "text": "overtook Tesla last year as the largest electric car company worldwide"
    },
    {
      "url": "https://www.youtube.com/watch?v=4tUAhzX_Lh0",
      "text": "interview with Autoline last month."
    },
    {
      "url": "https://www.cnn.com/2025/09/26/cars/chinese-electric-cars-price-wars-intl-hnk-dst",
      "text": "cut-throat price competition"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/business/chinese-automakers-eye-us-move",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/business/chinese-automakers-eye-us-move",
      "text": "Cookie Settings"
    }
  ],
  "hash": "31a834ad22b5a708ad1a4582731c9ce251c1154d036fc5219add3f0041cd1b92",
  "scraped_at": "2026-02-16T07:34:11.701685+00:00"
}