{
  "url": "https://lite.cnn.com/2026/02/20/politics/jesse-jackson-lie-in-honor-capitol-rejected",
  "title": "House Speaker Johnson rejects request for Jesse Jackson to lie in honor at Capitol | CNN Politics",
  "date": "2026-02-22T07:10:33.907128+00:00",
  "authors": [
    "Abby Phillip",
    "Manu Raju",
    "CNN"
  ],
  "text": "Source: CNN\n\nHouse Speaker Mike Johnson has denied a request forthe late Rev. Jesse Jackson Sr.to lie in honor at the United States Capitol, citing past precedent over how the deaths of other high-profile figures were handled, according to sources familiar with the matter.\n\nThe civil rights icon died this week at the age of 84. Jackson was praised by both Republicans and Democrats alike for his decades of activism and work in politics and international affairs. President Donald Trump repeatedly described Jackson this week as a “good man.”\n\nOne of the sources told CNN that the decision to reject the request to lie in honor – which had been made on behalf of Jackson’s family – was in keeping with precedent and was not political. The source said that requests for conservative political activistCharlie Kirkand formerVice President Dick Cheneywere also denied, and that the general practice is for select military officials and select government officials to lie in honor. But civilians or non-government officials have lain in honor in the US Capitol in the past, including civil rights hero Rosa Parks in 2005 and evangelical pastor Rev. Billy Graham in 2018, among others.\n\nLying in honor generallyinvolves laying the casket of the deceasedin the Rotunda of the US Capitol, where the publiccan come and offer final respects.\n\nJackson’s family has announced that next week, he will lie in repose at Rainbow PUSH headquarters in Chicago. That will be followed by formal services in his home state of South Carolina and in Washington, DC.\n\nJackson, a fiery orator whose worked shaped the Democratic Party and America, twice made a bid for the Democratic presidential nomination, inspiring Black America and stunning some with his ability to attract White voters. He rose to national prominence in the 1960s as a close aide to the Rev. Martin Luther King Jr.\n\nHisRainbow Coalition,an alliance of Blacks, Whites, Latinos, Asian Americans, Native Americans and LGBTQ people, helped pave the way for a more progressive Democratic Party.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/reverend-jesse-jackson-death",
      "text": "the late Rev. Jesse Jackson Sr."
    },
    {
      "url": "https://www.cnn.com/2025/09/21/politics/takeaways-charlie-kirk-memorial-service-trump-erika-kirk",
      "text": "Charlie Kirk"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/politics/dick-cheney-funeral-washington",
      "text": "Vice President Dick Cheney"
    },
    {
      "url": "https://www.aoc.gov/nations-stage/lying-state-honor",
      "text": "involves laying the casket of the deceased"
    },
    {
      "url": "https://www.cnn.com/2018/08/26/politics/mccain-lain-state-capitol",
      "text": "can come and offer final respects"
    },
    {
      "url": "https://www.history.com/news/jesse-jackson-rainbow-coalition",
      "text": "Rainbow Coalition,"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/jesse-jackson-lie-in-honor-capitol-rejected",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/jesse-jackson-lie-in-honor-capitol-rejected",
      "text": "Cookie Settings"
    }
  ],
  "hash": "31bba5835bc95872b8e866cfebf0ef19ae75434122947cdc4841a3a33c002cee",
  "scraped_at": "2026-02-22T07:10:33.907141+00:00"
}