{
  "url": "https://lite.cnn.com/2026/02/19/asia/north-korea-multiple-rocket-launchers-intl-hnk-ml",
  "title": "North Korea shows Kim Jong Un at the wheel of a mobile rocket launcher | CNN",
  "date": "2026-02-19T07:30:32.993572+00:00",
  "authors": [
    "Brad Lendon, CNN"
  ],
  "text": "Source: CNN\n\nNorth Korea’s Kim Jong Un took the wheel of a nuclear-capable multiple rocket launcher at a ceremony in the capital Pyongyang, according to the country’s state media, and touted the weapon as among the most powerful of its type in the world.\n\nNorth Korean state media routinely puts out eye-catching images of its leader as a way to bolster his reputation domestically – and send threatening messages to perceived enemies.\n\nThe authoritarian one-party state is preparing for a key party congress this month, a time when North Korea’s propaganda machine and displays of its military often kick into overdrive.\n\nWednesday’s display comes as North Korea continues to support Russia in its illegal invasion of Ukraine, supplying Moscow with missiles and thousands of troops.\n\nAnalysts say the experience North Korea’s military is gaining in the fight against Ukraine – along with possible technical know-how from Moscow – can help it refine its weapons and tactics.\n\nRelations also remain tense between Pyongyang and Seoul, which is supported by tens of thousands of US troops.\n\nThe latest North Korean state-media footage showed 50 carriers of the 600mm-rocket system lined up in rows of seven in a square. Each of the four-axle transporters and launch vehicles carries five rocket tubes.\n\nImages showed Kim in a black jacket, alighting a mobile missile launcher near the main stage as thousands of people waved small North Korean flags.\n\nA photo also showed him with a big smile as he sat behind the wheel.\n\n“He personally drove a launcher vehicle to review the weaponry symbolic of absolute power lined in the plaza of the venue for the glorious Party Congress,” North Korea’s state-run KCNA news agency said in its report.\n\nKim said the 600mm rockets – double the size found in most multiple rocket launch systems – are as good as short-range ballistic missiles.\n\nAnd their use of artificial intelligence in their guidance systems puts them in a class by themselves.\n\n“No other nations have got this kind of weapon system,” Kim said, according to the state-run Korean Central News Agency.\n\nIt “has completely changed the role and conception of artillery accepted by modern warfare.”\n\nThis isn’t the first time Kim is touting the 600mm launchers. In late 2022, his regimeshowed off 30 launchersof the same size rockets, but those were on tracked vehicles each carrying six rockets.\n\nAccording to a KCNA report then, the rocket system has all of South Korea in its range and can be loaded with tactical nuclear warheads.\n\nHowever, international monitors believe North Korea only possesses around 50 nuclear warheads, with the fissile material to make 30 to 40 more.\n\nBesides the multiple rocket launch systems, Pyongyang has a range of nuclear delivery vehicles, from intercontinental ballistic missiles that could strike the mainland United States, to short-range weapons that would ostensibly be used on the Korean Peninsula or to targets adversaries in the Western Pacific.\n\nNorth Korea has thousands of conventional artillery pieces, which could wreak havoc on South Korea.\n\nTwo years ago, it stageda massive firepower demonstration“of the long-range artillery sub-units near the border who have put the enemy’s capital in their striking range,” KCNA said at the time.\n\nA 2020 report from Washington-based think tank RAND Corp. said North Korea’s artillery systems, with nearly 6,000 big guns within range of major South Korean population centers, present as great a danger to the South as Kim’s nuclear weapons and missile programs.\n\n“If fired at civilian targets, those nearly 6,000 systems could potentially kill more than 10,000 people in only an hour,” the RAND report said.\n\nThe wheeled launchers on display Wednesday were in front of the April 25 House of Culture in Pyongyang. Red banners and signs for the upcoming Ninth Party Congress surrounded the military display.\n\nPyongyang often shows off new weaponry before party gatherings, key events and anniversaries.\n\nKim on Wednesday hinted more military hardware may be shown off in the coming days.\n\n“The Ninth Congress of our Party will make clear the next-stage plan and goal for strengthening the self-reliant defense capabilities,” Kim said, while calling on weapons developers and those assembling munitions to work harder to execute the party’s strategic plan.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/asia/north-korea",
      "text": "North Korea"
    },
    {
      "url": "https://www.cnn.com/2022/12/31/asia/north-korea-kim-jong-un-nuclear-expansion-intl-hnk-ml",
      "text": "showed off 30 launchers"
    },
    {
      "url": "https://www.cnn.com/2024/03/07/asia/north-korea-artillery-exercise-seoul-threat-intl-hnk-ml",
      "text": "a massive firepower demonstration"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/asia/north-korea-multiple-rocket-launchers-intl-hnk-ml",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/asia/north-korea-multiple-rocket-launchers-intl-hnk-ml",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3203d8186eadcae3ccd3a1193d621031221fddb963f516caea6c2e64d4c797d7",
  "scraped_at": "2026-02-19T07:30:32.993586+00:00"
}