{
  "url": "https://lite.cnn.com/2026/02/19/tech/takeaways-mark-zuckerberg-testifiessocial-media-child-mental-health",
  "title": "Takeaways: Mark Zuckerberg testifies for the first time ever on social media and children’s mental health | CNN Business",
  "date": "2026-02-19T07:30:39.200513+00:00",
  "authors": [
    "Clare Duffy",
    "Samantha Delouya",
    "Veronica  Miracle",
    "CNN"
  ],
  "text": "Source: CNN\n\nMeta CEO Mark Zuckerberg on Wednesday testified before a jury for the first timeabout accusations that social media, including Instagram, harm children’s mental health.\n\nKaley, a 20-year-old woman, alleges Instagram and Google’s YouTube were intentionally designed to be addictive — and that they hooked her from an elementary school age, causing anxiety, depression and body dysmorphia.\n\nThe outcome ofher lawsuitcould affect the hundreds of other cases by families who say their own children have been harmed or even died because of social media. Meta, for its part, denies the accusations and says it’s implemented numerous measures to safeguard young users.\n\nAt the core of the testimony were questions about what Meta knew about the potential risks to young people and whether it did enough to mitigate them. Zuckerberg argued he aims to build a product that has long-term appeal, not one that gets people hooked in the short-term and makes them feel bad about themselves.\n\nHere’s what we learned.\n\nThe lawsuit alleges that Meta designed its platforms to keep users scrolling  and juice profits, a key line of questioning Wednesday.\n\nWhile Meta previously had time-specific goals for Instagram, Zuckerberg said, it’s now focused on “utility and value.”\n\nKaley’s lawyer Mark Lanier showed an internal document in which Instagram head Adam Mosseri said the short-form video Reels feature had “driven time to all-time highs” and that his personal “stretch goal was to get on track to pass TikTok in terms of time spent.”\n\n“The way I read this, we try to increase the value of our services, but also trying to measure progress against competitors like TikTok,” Zuckerberg said, adding that time spent was a proxy for measuring Instagram’s success against competitors.\n\nLanier  showed a 2022 document of “milestones” for Instagram that projected average time spent on the platform would grow from 40 minutes in 2023 to 46 minutes in 2026.\n\nZuckerberg disputed that milestones are goals. “If we do good work, this is something we expect to see,” he said.\n\nUsers can alter photographs with Instagram’s beauty filters, mimicking plastic surgery or other alterations. Lanier argued the filters could harm teens’ perceptions of themselves, saying experts consulted by Meta reached that same conclusion.\n\nThe company decided to allow the filters, but not recommend them,in the name of free expression, Zuckerberg said. Denying users the tools would have been “paternalistic” he added.\n\nLater, Lanier showed an email that he said was sent by a Meta employee to Zuckerberg. The employee, a mother of two teen girls, warned about the filters and said the pressure on teen girls is intense.\n\n“I respect your call and I support it, but I want to say for the record, I don’t think it’s the right call,” read the employee email.\n\nInstagram says it requires users to be﻿at least 13 years old to create an account — a policy Zuckerberg reiterated on the stand.\n\nBut an internal document from 2015 estimated over 4 million Instagram users were under 13, which it said represented “30% of all 10-12 year olds in the US.” Kaley began using Instagram at age 9, Lanier said previously.\n\nInstagram didn’t begin asking new users to input a date of birth until December 2019; previously, it just asked users to confirm they were above the age of 13. Instagram in August 2021 started asking existing users to provide a birthdate if they hadn’t done so previously.\n\nThat means Kaley wasn’t asked for her age at all when she joined the platform.\n\nLanier also showed an internal document that read, “if we want to win big with teens, we must bring them in as tweens.”\n\nZuckerberg argued the company landed on the right policy for verifying users’ ages after initially weighing privacy concerns. He added that Meta and many other social media companies struggle to accurately confirm young users’ ages because teens often lack government-issued IDs or other forms of verification. Meta now says it uses AI to estimate users’ ages and enforce its teen safety measures.\n\nHe also estimated that teens make up less than 1% of Instagram’s revenue. “Most teens don’t have disposable income, so they’re not valuable for advertisers,” he said. (Parents and advocates have for years claimed that Meta targets young users not for their immediate buying power, but in hopes that they’ll become long-term users.)\n\nMeta lawyer Paul Schmidt on Wednesday also showed a 2018 email from Zuckerberg to Apple CEO Tim Cook in which he expressed a desire to ensure “technology improves people’s wellbeing,” including Facebook and Instagram.\n\nThere was a packed courtroom listening to the Meta CEO testify. But one audience member in particular stood out: Kaley.\n\nKaley, now 20, has social anxiety and difficulty in crowds, Lanier previously said, so she would not be present for much of the trial. (She is expected to testify later.)\n\nMeta has argued that Kaley’s difficult childhood caused her mental health challenges, not its products.\n\nBut Lanier suggested Wednesday that Kaley’s upbringing made it even more important that Meta safeguard vulnerable users, asking Zuckerberg if a company should “prey upon” people who come from difficult backgrounds or are “less fortunate in educational opportunities.”\n\n“I think a reasonable company should try to help the people who use its services,” Zuckerberg replied.\n\nLater in the day, Lanier brought out a poster so long it needed seven people to hold it, crammed with hundreds of photos from Kaley’s Instagram account — hammering home the countless hours he said she spent on the platform.\n\nNearly a dozen parents who say their children were harmed or died because of social media gathered and joined hands outside the courthouse Wednesday morning as they waited for Zuckerberg to arrive.\n\nAmong them were parents who were also in the audience during Zuckerberg’s 2024 congressional testimony,when he surprised many watchers by turning around to face the audience andapologize to familieswho said their children had been hurt by his platforms.\n\nThat 2024 moment echoed through Wednesday’s hearing.\n\nTammy Rodriguez was one of the parents who attended both hearings. Her 11-year-old daughter Selena died by suicide in 2021 after struggling with an alleged addiction to Instagram and Snapchat.\n\nRodriguez was the first of more than 1,500 individuals to file a civil case against the social media platforms; her suit’s outcome could depend in part on how the jury in Kaley’s suit decides.\n\nShe compared Wednesday’s testimony to the 2024 congressional hearing. “I don’t have any satisfaction,” she said after Zuckerberg concluded.\n\n“I feel just like I did when I left that day (in 2024), but we’re here and we’re in a courtroom, so that’s a big thing,” Rodriguez said. “I can’t say after today, but I believe that there will be change.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/tech/meta-mark-zuckerberg-testifies-social-media-addiction-trial",
      "text": "her lawsuit"
    },
    {
      "url": "https://www.cnn.com/videos/business/2024/01/31/mark-zuckerberg-apology-hearing-video-vpx.cnn",
      "text": "apologize to families"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/tech/takeaways-mark-zuckerberg-testifiessocial-media-child-mental-health",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/tech/takeaways-mark-zuckerberg-testifiessocial-media-child-mental-health",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3220f15dcaf336593186a69bee8d9add94f07afe90d6d99ec45db075b69e2b32",
  "scraped_at": "2026-02-19T07:30:39.200526+00:00"
}