{
  "url": "https://lite.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
  "title": "What we know about the arrest of Andrew Mountbatten-Windsor | CNN",
  "date": "2026-02-21T07:05:26.582661+00:00",
  "authors": [
    "Christian Edwards",
    "Lauren Said-Moorhouse",
    "Issy Ronald",
    "CNN"
  ],
  "text": "Source: CNN\n\nAndrew Mountbatten-Windsor, the younger brother of Britain’s King Charles III, was arrested on his 66th birthday following revelations about the former prince’s relationship with the late sex offender Jeffrey Epstein.\n\nAfter an early morning police raid at his home in Sandringham, Mountbatten-Windsor became the first member of the UK royal family to be arrested inmodern history.\n\nHis arrest – on suspicion of misconduct in public office – prompted Charles to express his “deepest concern,” while stressing that “the law must take its course.”\n\nAfter spending more than 10 hours in a police station in Norfolk, near his new home, Mountbatten-Windsor was released “under investigation” late Thursday evening and picturedleaving a police station.\n\nSeparately, London’s Metropolitan Police said Friday they had urged Andrew’s serving and former royal protection officers to “consider carefully whether anything they saw or heard” could be relevant to their investigation into Epstein and his associates.\n\nThe former prince’s arrest marks the latest extraordinary development in theyearslong controversyover his ties to Epstein, which has shredded his reputation and snowballed into the royals’ biggest crisis since the death of Princess Diana in 1997.\n\nHere’s what we know.\n\nThey did not disclose what led to Andrew’s arrest, but previously said they were assessing whether he shared confidential information with Epstein during his decade as a UK trade envoy.\n\nThe royal, who was then the Duke of York, was forced to step down from his role in 2011 over his friendship with Epstein, who had been convicted in 2008 for soliciting prostitution from a minor.\n\nThe former prince has denied all accusations against him and insisted he never witnessed or suspected any of the behavior of which Epstein is accused. He has not commented publicly on the allegation of misconduct in public office that emerged after the latest DOJ release.\n\nThe royal was arrested at his new home on his brother’s Sandringham estate in Norfolk, eastern England. Mountbatten-Windsor had only moved there earlier this month, after the King evicted him from the royal estate at Windsor in Berkshire, west of London, following an earlier DOJ release of Epstein files.\n\nSoon after unmarked police cars and plainclothes officers arrived at Wood Farm, Andrew’s residence at Sandringham, uniformed police officers also raided Royal Lodge at Windsor, which had been his home since 2003.\n\nMountbatten-Windsor was detained by Thames Valley Police, which covers Berkshire, even though the arrest was made in Sandringham, which is covered by the Norfolk Constabulary. The Norfolk force told CNN it was supporting Thames Valley Police’s investigation.\n\nLate Thursday, Thames Valley Police said it had concluded its searches in Sandringham, but that its searches at Windsor would likely continue through to Monday.\n\nAfter standing down as trade envoy in 2011, Mountbatten-Windsor faced prolonged scrutiny over his ties to Epstein. In 2019, he agreed to a long, sit-down interview with BBC Newsnight in which he responded to allegations of wrongdoing.\n\nHaving been pictured with Epstein in New York’s Central Park in 2010, after his conviction, Mountbatten-Windsor explained that he had traveled to New York to end his friendship with the disgraced financier. Asked why that involved his staying at Epstein’s mansion for several days, the former prince said it was “convenient,” and that he thought speaking with Epstein in person was “honorable and right.”\n\nMountbatten-Windsor also said he had “no recollection of ever meeting” Virginia Giuffre, who in 2015 had alleged that she was forced to have sex with the then-prince three times, including when she was 17. He suggested that a photo from 2001 showing himself and Giuffre in Ghislaine Maxwell’s house may have been faked.\n\nGiuffresuedMountbatten-Windsor in a New York court in 2021, accusing him of sexual assault. Despite claiming never to have met her, the royal reportedlypaid millions of dollarsto Giuffre in 2022 to settle the case, without admitting responsibility for any wrongdoing.\n\nFollowing further allegations in Guiffre’s memoir, published posthumously after she died by suicide in April 2025, King Charles stripped his younger brother of his title as prince in October. The scandal swelled again after the DOJ released photos in January that appeared to show Mountbatten-Windsor kneeling over a woman or girl lying on the floor.\n\nCharles said he learned “with the deepest concern” of Mountbatten-Windsor’s arrest and stressed that “the law must take its course.” The Prince and Princess of Wales supported Charles’ statement, CNN understands.\n\nThe monarch did, however, use the statement to distance himself from Andrew, taking care not to describe the former prince as his brother and attempting to ringfence the rest of the family. “My family and I will continue in our duty and service to you all,” Charles wrote.\n\nMarjorie Taylor Greene, the former Republican congresswoman from Georgia, pointed out the relative lack of accountability in the United States for those with ties to Epstein. Democratic Rep.Jake Auchinclossfrom Massachusetts struck a similar note, telling CNN: “Great Britain is holding its powerful and privileged to account. The United States of America should do the same.”\n\nPresident Donald Trump called Mountbatten-Windsor’s arrest a “shame,” but avoided mentioning his own connections to Epstein. “I think it’s a shame. I think it’s very sad. I think it’s so bad for the royal family,” Trump told reporters aboard Air Force One as he traveled to Georgia.\n\nTrump lamented how Mountbatten-Windsor’s predicament would affect Charles, who is expected to visit the US this year, likely in April.\n\n“It’s a very sad thing to see it and to see what’s going on with his brother, (the king is) obviously coming to our country very soon, and he’s a fantastic man, the king,” Trump said.\n\nThefamily of Virginia Giuffreexpressed their “gratitude” to Thames Valley Police.\n\n“Today, our broken hearts have been lifted at the news that no one is above the law, not even royalty,” the family said in a statement. “He was never a prince. For survivors everywhere, Virginia did this for you.”\n\nSeparately,Spencer T. Kuvin, an attorney for Epstein’s survivors, said Mountbatten-Windsor’s arrest may “restore some faith for those who believed justice was unreachable.”\n\nMountbatten-Windsor is the first senior royal to be arrested since King Charles I, the monarch who led the royalists to defeat at the hands of the Parliamentarians in England’s civil wars. Charles was detained in 1647 and tried and executed two years later.\n\nAlthough Princess Anne, Mountbatten-Windsor’s sister, was prosecuted and fined in 2002 after her dog attacked two children, she was not arrested.\n\nBritish lawmakers are now considering introducing legislation to remove Andrew Mountbatten-Windsor from the line of royal succession, CNN understands.\n\nThe new legislation, if implemented, would prevent Mountbatten-Windsor – who is eighth in line to the throne – from ever becoming King. An act of parliament would be needed toremovehim.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/02/19/europe/king-charles-andrew-arrest-royal-crisis-intl-latam",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltl1lq7004s3b6pko1ab6qj",
      "text": "modern history"
    },
    {
      "url": "https://cnn.com/2026/02/19/world/video/prince-andrew-arrest-police-station-vrtc",
      "text": "leaving a police station"
    },
    {
      "url": "https://cnn.com/2026/02/19/world/timeline-andrew-arrest-jeffrey-epstein-intl",
      "text": "yearslong controversy"
    },
    {
      "url": "https://cnn.com/2021/08/09/us/virginia-giuffre-sexual-abuse-lawsuit-prince-andrew",
      "text": "sued"
    },
    {
      "url": "https://cnn.com/2022/03/08/us/prince-andrew-virginia-giuffre-settlement",
      "text": "paid millions of dollars"
    },
    {
      "url": "https://cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmlti4cax003z3b6pxs6bhmcv",
      "text": "Marjorie Taylor Greene"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltjry070007356rhn8ikx3v",
      "text": "Jake Auchincloss"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltdqnr400003b6ps4ki4z61",
      "text": "family of Virginia Giuffre"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltl3smx0000356pdcox4p7p",
      "text": "Spencer T. Kuvin"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-consequences-intl",
      "text": "remove"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "32724dbba95bdb5d0d5ba3e7e0f1fbd9b7a5b0a3b06e912b2febd4482b50179d",
  "scraped_at": "2026-02-21T07:05:26.582673+00:00"
}