{
  "url": "https://lite.cnn.com/2026/02/24/entertainment/robert-carradine-death-hnk",
  "title": "Robert Carradine, actor in ‘Lizzie McGuire’ and ‘Revenge of the Nerds’ dies at 71 | CNN",
  "date": "2026-02-25T07:33:00.692222+00:00",
  "authors": [
    "Hanna Park",
    "Sandra Gonzalez"
  ],
  "text": "Source: CNN\n\nRobert Carradine,known for his roles in “The Long Riders,” “Revenge of the Nerds” and the television series “Lizzie McGuire,” has died at 71, his management company told CNN.\n\n“It is with profound sadness that we must share that our beloved father, grandfather, uncle, and brother Robert Carradine has passed away,” his family said in a statement toDeadline.\n\n“In a world that can feel so dark, Bobby was always a beacon on light to everyone around him. We are bereft at the loss of this beautiful soul and want to acknowledge Bobby’s valiant struggle against his nearly two-decade battle with Bipolar Disorder,” the family statement said.\n\n“We hope his journey can shine a light and encourage addressing the stigma that attaches to mental illness,” it added.\n\nBorn March 24, 1954, Robert Carradine was the youngest son of late American actor John Carradine, and the brother of actors David Carradine and Keith Carradine, as well as Christopher Carradine, a former vice president of Walt Disney Imagineering.\n\nKeith Carradine told Deadline the family wanted to share about his brother’s struggle withbipolar disorder, saying “We want people to know it, and there is no shame in it.”\n\n“It is an illness that got the best of him, and I want to celebrate him for his struggle with it, and celebrate his beautiful soul,” he said. “He was profoundly gifted, and we will miss him every day.”\n\nCarradine made his film debut in the 1972 film “The Cowboys,” which starred John Wayne and Roscoe Lee Browne, before forging a decades-long career in Hollywood across studio films, independent cinema and television.\n\nHe garnered huge popularity with his role as Lewis Skolnick, the idealistic leader of a fraternity of social misfits, in the 1984 film “Revenge of the Nerds,” a studio comedy which spawned multiple sequels.\n\nTwo decades later, he found a new generation of fans, starring as Sam McGuire in the popular Disney television series, “Lizzie McGuire.”\n\nHilary Duff, who co-starred in the series, paid tribute to Carradine in aposton Instagram Tuesday morning, writing, “This one hurts. It’s really hard to face this reality about an old friend.”\n\n“I’m deeply sad to learn Bobby was suffering. My heart aches for him, his family, and everyone who loved him,” she wrote.\n\nAnother “Lizzie McGuire” co-star, Jake Thomas,called him“one of the coolest guys you could ever meet. Funny, pragmatic, sometimes cranky, always a little eccentric.”\n\nCarradine’s daughter, Ever Carradine, shared a post onInstagramafter her father’s passing: “My sweet, funny dad, who’s only 20 years older than I am, who never missed an opportunity to drive me to the airport or tell me how much he loved my homemade salad dressing, is gone.”\n\n“Whenever anyone asks me how I turned out so normal, I always tell them it’s because of my dad. I knew my dad loved me, I knew it deep in my bones, and I always knew he had my back,” she wrote, before adding: “Rest easy, dad. I love you the most.”\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://deadline.com/2026/02/robert-carradine-dead-age-71-1236734055/",
      "text": "Deadline"
    },
    {
      "url": "https://www.cnn.com/2023/11/02/health/bipolar-disorder-explained-wellness",
      "text": "bipolar disorder"
    },
    {
      "url": "https://www.instagram.com/p/DVITYLOFCMT/?img_index=2",
      "text": "post"
    },
    {
      "url": "https://www.instagram.com/p/DVIH-kvka-I/",
      "text": "called him"
    },
    {
      "url": "https://www.instagram.com/p/DVIPXDuES1O/?hl=en&img_index=1",
      "text": "Instagram"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/entertainment/robert-carradine-death-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/entertainment/robert-carradine-death-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "32a46ad02e6103e99d274a241f6cb694d31a91bbae574d0e5c1052986164fd02",
  "scraped_at": "2026-02-25T07:33:00.692247+00:00"
}