{
  "url": "https://lite.cnn.com/2026/02/17/business/tax-rich-state-budgets",
  "title": "With budgets under strain, states are split on taxing the rich | CNN Business",
  "date": "2026-02-19T07:33:03.916557+00:00",
  "authors": [
    "Gordon Ebanks, CNN"
  ],
  "text": "Source: CNN\n\nAs state legislatures around the country meet to solidify their budgets for the year ahead, the effects of the One Big Beautiful Bill Act and an uncertain economic future are pushing states to take a hard look at their finances.\n\nFourteen states are facing budget deficits for the next fiscal year that threaten funding for schools, roads and services. While many states enact budget cuts to avoid raising taxes, lawmakers and advocates are pushing some to raise taxes on two groups: millionaires and billionaires.\n\nProponents of tax hikes on the wealthy say the added revenue is needed to support schools and hospitals and would mean sparing tax hikes on the middle class.\n\nBut critics of the proposals say the promise of new revenue is too good to be true, warning that the new taxes could risk existing tax revenue by prompting wealthy residents to move to other states that are lowering income taxes for high earners.\n\nThe governors ofWashingtonstate andRhode Islandhave endorsed adding a new special tax bracket for millionaires this year as their states stare down budget deficits, and New York City MayorZohran Mamdanireissued his call for New York state to do the same.\n\nMassachusetts has been at the forefront of the debate over taxing millionaires after voters passed theFair Share Amendmentin 2022, a ballot measure that added a surtax for those claiming more than $1 million in income. The measure has raised over $5 billion for education and transportation, surpassing initial predictions, according to estimates from state tax officials.\n\n“Every child in Massachusetts now has free breakfast and lunch at school” as a result of the tax, said Jessica Tang, President of AFT Massachusetts who helped campaign for the measure.\n\nIn Michigan, a ballot measure endorsed by the state’sboard of educationcalled Invest in MI Kids would scrap its flat tax and include an additional 5% tax on those claiming over $500,000 (or $1 million for joint filers) in income to fund public education.\n\nWhile those blue states are trying to enshrine higher income taxes on the rich, a California proposal to tax wealth instead of income would be the country’s most ambitious effort to tax wealth in generations.\n\nThe Billionaire Tax Act, which will be on California’s general election ballot in November, would levy a one-time 5% tax on residents with a net worth over $1 billion. The number of billionaires in the state has grown from 172 in 2019 to 255 in 2024, according to wealth intelligence firm Altrata.\n\nThose behind the initiative estimate the tax would generate upwards of $100 billion — money that would plug California’sbudget deficitseveral times over.\n\nThe proposal has already led some billionaires to deepen ties with other states, notably PayPal and Palantir co-founderPeter Thiel, who opened a new office in Miami at the end of last year. But other California billionaires, like Nvidia CEOJensen HuangandTom Steyer, a former Democratic presidential candidate who is vying to be California’s next governor, have expressed ambivalence or support for the measure.\n\nBusiness groups across the state, like the California Chamber of Commerce, have lined up in opposition, with theChamberclaiming a one-time tax “does nothing to solve the state’s systemic budget problems.”\n\nBut Suzanne Jimenez, chief of staff of the SEIU-UHW, a union for healthcare workers, argued that hospitals need more funding to surviverecent Medicaid funding cuts. The California Hospital Association estimates that the cuts could cost California hospitals up to$128 billionover the next decade.\n\n“No one else is offering a solution,” Jimenez told CNN.\n\nWhile some states are moving towards raising taxes on income and wealth, the broader trend among states is to cut taxes, implement a flat tax or have no income tax.\n\nEight states have cut their top marginal tax rate going into this year, while six states since 2021 have enacted a flat tax rate. There are nine states that have no income tax at all.\n\nTechnology makes it easier than ever for high earners to leave areas where they don’t feel welcome, as work-from-home options still remain popular years after the pandemic, said Kent Smetters, a professor at the Wharton School.\n\n“There’s no question people are moving,” Smetters said.\n\nAnd that’s a risk for California. Over the past two decades, the top 1% of earners have paid an average of 45% of the state’s income tax revenue, according to theCaliforniaDepartment of Finance.Making the state’s budget vulnerable if billionaires and their highly paid executives leave.\n\nAt theWorld Economic Forumlast month, California Governor Gavin Newsom struck a similar tone, saying the wealth tax proposal has had a “very negative impact on the state” — an apparent admission that billionaires have already left the state.\n\n“We’re competing with 50 states,” said Newsom. “Capital flows and move(s). That’s real. It’s not imagined. It’s very, very real.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.axios.com/local/seattle/2026/01/12/washington-state-millionaire-tax-ferguson-democrats-proposal",
      "text": "Washington"
    },
    {
      "url": "https://www.bloomberg.com/news/articles/2026-01-15/millionaire-tax-proposal-in-rhode-island-gets-governor-s-support",
      "text": "Rhode Island"
    },
    {
      "url": "https://www.wsj.com/livecoverage/election-day-2025/card/NbduHPAlna3arDc6fcZX?gaa_at=eafs&gaa_n=AWEtsqdJVL4nqdtZ_tLyGkHj6s81oerM37HVvzfsnjgC_kMMqSgZfC6EiEiEWJ8-ySY%3D&gaa_ts=6986419c&gaa_sig=g9KbDZXyAybniCB-8WVt9ODu1I-ajSoLU0Jn8xoHYFyHaz1g1DmxH8YXXqmLasXn3idc0lU0ZErL4_E57dhq3A%3D%3D",
      "text": "Zohran Mamdani"
    },
    {
      "url": "https://www.mass.gov/info-details/delivering-on-fair-share-impact-report",
      "text": "Fair Share Amendment"
    },
    {
      "url": "https://www.michigan.gov/mde/-/media/Project/Websites/mde/State-Board/Resolutions/2025/FINAL---RESOLUTION---Invest-in-MI-Kids---October-2025.pdf",
      "text": "board of education"
    },
    {
      "url": "https://lao.ca.gov/Publications/Report/5101",
      "text": "budget deficit"
    },
    {
      "url": "https://www.theguardian.com/us-news/2026/jan/12/peter-thiel-donation-california-billionaire-tax",
      "text": "Peter Thiel"
    },
    {
      "url": "https://www.cnbc.com/2026/01/07/nvidia-ceo-jensen-huang-perfectly-fine-with-proposed-billionaire-tax.html)%20and%20Tom%20Steyer%20(https://fortune.com/2026/01/26/billionaire-tom-steyer-says-he-would-vote-for-california-wealth-tax/",
      "text": "Jensen Huang"
    },
    {
      "url": "https://fortune.com/2026/01/26/billionaire-tom-steyer-says-he-would-vote-for-california-wealth-tax/",
      "text": "Tom Steyer"
    },
    {
      "url": "https://advocacy.calchamber.com/2025/12/05/calchamber-board-opposes-initiatives/",
      "text": "Chamber"
    },
    {
      "url": "https://www.cnn.com/2025/07/21/politics/americans-losing-health-insurance-trump-bill",
      "text": "recent Medicaid funding cuts"
    },
    {
      "url": "https://calhospital.org/file/cha-summary-and-impact-estimate-of-obbba/",
      "text": "$128 billion"
    },
    {
      "url": "https://ebudget.ca.gov/2026-27/pdf/BudgetSummary/RevenueEstimates.pdf",
      "text": "CaliforniaDepartment of Finance"
    },
    {
      "url": "https://www.kcra.com/article/gavin-newsom-davos-world-economic-forum-talk-trump/70098143",
      "text": "World Economic Forum"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/business/tax-rich-state-budgets",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/business/tax-rich-state-budgets",
      "text": "Cookie Settings"
    }
  ],
  "hash": "32ad88ad40010c0e1bffc72bb139e058e1d455d023b1dc2e4c4f009096436294",
  "scraped_at": "2026-02-19T07:33:03.916570+00:00"
}