{
  "url": "https://lite.cnn.com/2026/02/20/us/duffy-el-paso-shutdown",
  "title": "Transportation secretary says it was not a mistake to close airspace around El Paso | CNN",
  "date": "2026-02-21T07:05:07.365720+00:00",
  "authors": [
    "Alexandra Skores",
    "Aaron Cooper",
    "CNN"
  ],
  "text": "Source: CNN\n\nIt was not a mistake to close the airspace around El Paso, Texas, last week, Transportation Secretary Sean Duffy said at a news conference Friday afternoon.\n\nHe declined to share details about what happened andthe subsequent finger pointing, saying he would speak to Congress before addressing it publicly.\n\n“We have a briefing next week on Capitol Hill. We are going to go through that briefing and talk to the members of Congress,” he said.\n\nLast Wednesday, the Federal Aviation Administration abruptly grounded all flights up to 18,000 feet around the Texas city for 10 days, effectively shutting down El Paso International Airport.\n\nThe decision to close the airspace was made without first telling the White House, sources told CNN, and drew intense focus inside the West Wing. The restrictions were reversed about eight hours later.\n\n“I don’t think there was a lack of communication,” Duffy said. “We have good partners. I’m friends with all of the players that are involved. From Marco (Rubio) to Pete (Hegseth) to Kristi (Noem).  We all know each other well and we all communicate well.”\n\nDuffy initiallyposted on social mediathat the closure was because of the military acting to “address a cartel drone incursion” which had been “neutralized.”\n\nHowever, sources told CNN the closure came after Customs and Border Protection officials deployed ahigh-energy counter-drone laseron loan from the Pentagon without having coordinated with the FAA about potential risks to civilian flights.\n\n“I use information that I get,” Duffy said before asking if any questions related to the trucking industry, which was the intended focus of his remarks.\n\n“I appreciate the interest in El Paso… I served on the Hill, as you know, and I think we owe a conversation with the Hill before I have a conversation with you. And so that’s what we will do,” Duffy said. “I’ll take the Hill’s questions before yours and, you know, we’ll go from there.”\n\nCNN’s Alayna Treene, Kevin Liptak, Natasha Bertrand and Pete Muntean contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/el-paso-trump-administration-finger-pointing",
      "text": "the subsequent finger pointing"
    },
    {
      "url": "https://x.com/SecDuffy/status/2021594420806639787",
      "text": "posted on social media"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/military-lasers-directed-energy-el-paso",
      "text": "high-energy counter-drone laser"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/duffy-el-paso-shutdown",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/duffy-el-paso-shutdown",
      "text": "Cookie Settings"
    }
  ],
  "hash": "32b8fbf9b6f968d31de7fcf2781f7e76fac1254b1ed7dd231286358944b05d1d",
  "scraped_at": "2026-02-21T07:05:07.365733+00:00"
}