{
  "url": "https://lite.cnn.com/2026/02/23/sport/kara-braxton-dies-at-43",
  "title": "Kara Braxton: 2-time WNBA champion dies at 43 after being in a car crash | CNN",
  "date": "2026-02-24T07:31:21.303145+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nTwo-time WNBA champion Kara Braxton died after being in a car crash in Atlanta on Saturday. She was 43.\n\nThe athletic department at Georgia, where Braxton played in college, texted The Associated Press confirmation of her death on Monday and posted on social media. Her son, Jelani Thurman, posted a photo of his younger self in his mother’s jersey on social media and wrote that he we will miss his “queen.”\n\nBraxton last played in the WNBA in 2014 while finishing up a four-year stint with New York. She won two titles with the Detroit Shock in 2006 and 2008.\n\nShe celebrated her birthday last week.\n\n“It is with profound sadness that we mourn the passing of 2x WNBA Champion Kara Braxton,” the league said on social media on Sunday night. “A 10-season veteran, Kara played with the Detroit Shock, Tulsa Shock, Phoenix Mercury, and New York Liberty. Our thoughts are with her family, friends, and former teammates at this time.”\n\nThe 6-foot-6 Braxton was drafted by Detroit with the seventh pick in 2005. She earned All-Rookie honors that season after averaging 6.9 points and 3.0 rebounds.\n\nShe played half of a season with the franchise when it moved to Tulsa in 2010 before getting traded to Phoenix for the second half of the year.\n\nBraxton then played the first 18 games in Phoenix in 2011 before being acquired by New York. She played with the Liberty until 2014 when she was waived after playing four games.\n\n“We mourn the loss of Kara Braxton, a former Liberty player whose presence and passion left a lasting impact on our organization and the women’s game,” the Liberty posted on social media.\n\nBraxton was SEC Freshman of the Year for Georgia in 2002.\n\nThurman played football for Ohio State and won a national championship with the Buckeyes in 2024. He has since transferred to North Carolina.\n\nBraxton is also survived by her husband Jarvis Jackson and their young son Jream.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/sport/kara-braxton-dies-at-43",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/sport/kara-braxton-dies-at-43",
      "text": "Cookie Settings"
    }
  ],
  "hash": "331b11e8160c79179cf72fb21f459970e66f4360dd0492bf064af448d31e121b",
  "scraped_at": "2026-02-24T07:31:21.303158+00:00"
}