{
  "url": "https://lite.cnn.com/2026/02/11/us/chicago-border-patrol-shooting-video-evidence",
  "title": "Video and text messages from Border Patrol agent’s shooting of a Chicago woman are released | CNN",
  "date": "2026-02-12T21:30:53.983529+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nNewly released government evidence from last year’sBorder Patrol shootingof a Chicago woman revealed body camera footage from the shooting, previously unseen text messages from the agent who shot her and praise from the then-top Border Patrol official just hours after the incident. The documents were released by federal prosecutors Wednesday.\n\nA judge ordered the release last week, clearing the way for key evidence in the case to be made public, including body camera footage, text messages and emails.Charges have been droppedagainst the woman, but in the wake of two deadly shootings by federal agents in Minneapolis – in which video evidence appeared to contradict some statements made by the Trump administration – she and her attorney say it’s important for the public to see this evidence.\n\nMarimar Martinez, a 30-year-old American citizen, survived being shot multiple times by a Customs and Border Protection agent after her vehicle and a CBP SUV collided amidst the immigration crackdown in Chicago – named Operation Midway Blitz – on October 4.\n\nFederal prosecutors, alleging she rammed the agent’s car, charged her with assaulting, resisting or impeding federal officers. Martinez acknowledged she had been following Border Patrol vehicles before she was shot but denied any wrongdoing.\n\nThe government’s case dramaticallyfell aparta month later as Judge Georgia Alexakis dismissed the case at prosecutors’ request, saying the government’s handling of it had caused her “to question the narrative being put forward.”\n\n“It matters that people can actually see the real evidence, as opposed to the false claims by our government,” Martinez’s attorney, Christopher Parente, said in a news conference Wednesday.\n\nCharles Exum, the agent who shot Martinez, has been placed on administrative leave “consistent with policy,” a CBP spokesperson told CNN on Wednesday.\n\n“CBP is committed to the highest standards of conduct, transparency, and accountability,” the agency said in the statement.\n\n“All significant use-of-force incidents are thoroughly investigated, reviewed, and presented to the National Use of Force Review Board (NUFRB), an independent body comprised of senior CBP officials and representatives from DHS and DOJ, including the DOJ Civil Rights Division,” the statement continued.\n\nWhen asked for comment about the release of the evidence, the Department of Homeland Security referred CNN to the Justice Department.\n\nThe newly released evidence includes body camera footage from one of the agents in the Border Patrol vehicle that collided with Martinez’s car. It shows agents in the federal government’s Chevy Tahoe with weapons drawn moments before the shooting.\n\n“Camera’s on,” an agent can be heard saying, with much of the bodycam video seen through the trigger guard of a long firearm the agent is holding.\n\n“Do something, b*tch,” one agent is heard saying, over the sound of repeated honking from outside the SUV.\n\n“It’s time to get aggressive and get the f**k out, because they’re trying to box us in,” an agent says, seconds before the driver can be seen turning the wheel sharply to the left. The bodycam jostles, the vehicle stops and agents are heard saying, “we’ve been struck,” apparently reporting the collision to dispatch.\n\nThe driver exits the SUV, and gunshots are heard roughly two seconds later. The agent wearing the body camera gets out of the vehicle seconds later, though he does not appear to face the direction of Martinez’s car.\n\nExum had a body camera, Parente said, emphasizing the fact that it was not turned on at the time of the shooting.\n\n“All of this could have been avoided, because you would have clearly seen that she never drove at this agent and that he shot her as she went by, but Agent Exum never bothered to turn on the camera that the government paid for him to have,” Parente said at the news conference Wednesday.\n\nThe attorney also discussed evidence he says contradicts the government’s account of the shooting, including anX postfrom FBI Director Kash Patel claiming to show a video from the encounter between Martinez and the CBP. The post actually showed a different Chicago-area incident that had no connection to Martinez.\n\n“Within an hour of the actual incident, DHS branded her a domestic terrorist – the same thing they did to Renee Good, the same thing they did to Mr. Pretti,” he said, referencing the two people who were killed by federal agents in Minnesota last month.\n\nAmong the evidence released by prosecutors is an email from top Border Patrol official Gregory Bovino, who emailed Exum hours after the shooting, offering to delay his retirement beyondthe agency’scustomary 57-year-old retirement age “in light of your excellent service in Chicago.”\n\n“You have much yet left to do!!” he added. Bovino has since left his assignment leading the federal immigration operationin Minnesotaafter President Donald Trump announced he wasdispatchingWhite House border czar Tom Homan in his stead last month.\n\nParente noted it appeared the exchange took place while Martinez was hospitalized, when“they don’t know whether Marimar is going to live or die,” arguing that it does not line up with the respect for human life policy that ICE promotes.\n\nIn one text exchange, Exum responds to a question about whether he has received support, replying, “big time.”\n\n“Everyone has been including Chief Bovino, Chief Banks, Sec Noem and El Jefe himself…according to Bovino,” the text reads.\n\nParente said Wednesday that his team believes “El Jefe” is a reference to Trump.\n\nExum exchanged messages in other chats saying, “Awe, I cry,” and “That hurt my feeling,” in response to a text that Illinois Gov. JB Pritzker “is saying bad things about you this morning.”\n\nAmong Exum’s texts are messages of support, including one calling him a “legend among agents.”\n\n“Beers on me when I see you at training,” another message said.\n\nParente said the evidence, which includes photos of Martinez’s vehicle, shows at least one bullet traveled from the back to the front of his client’s car, contradicting Exum’s claim that he fired five shots through the windshield of Martinez’s car.\n\n“It’s also extremely troubling that he’s shooting at a fleeing vehicle, which is a violation of the Border Patrol’s published use of force policy,” the attorney said.\n\nMartinez’s request to put all of the government’s evidence into the public eye comes as the Trump administration faces intense criticism for rushing out narratives in the fatal shootings of US citizensRenee GoodandAlex Prettiin Minneapolis that appeared to becontradicted by video.\n\nThe administration’s framing of the deadly shootings in Minneapolis was part of the motivation for the request to modify the protective order in the case and release the evidence, said Parente.\n\n“Ms. Martinez believes certain information disclosed in her case, and currently subject to the Protective Order, would be useful for both the public and elected officials to know regarding how DHS responds in cases where their agents use deadly force against US citizens,”wroteParente, who also said he plans to announce a civil lawsuit arising from the shooting.\n\nDHS initially said Martinez deliberately rammed her car into an unmarked CBP vehicle, prompting Exum to exit his vehicle and open fire defensively. Martinez alleges the federal government’s SUV sideswiped her car, and Exum opened fire even though she deliberately turned to avoid him once he got out of his vehicle. She was hit in the arm and leg as she drove away.\n\nMartinez “was armed with a semi-automatic weapon,” DHS spokesperson Tricia McLaughlinposted October 4 on X. But Parente told CNN the weapon was a licensed handgun Martinez kept in her purse and did not touch during the incident; an account never disputed by government attorneys in court.\n\nThe DHS focus on Martinez being an armed protester wasmirrored controversiallyin the fatal shooting of Pretti, with administration officials repeatedly suggesting his possession of a gun while protesting made him inherently dangerous to officers. Multiple videos of the altercation did not show Pretti ever brandishing or reaching for the weapon.\n\nIn the Martinez case, the judge skeptically questioned several aspects of the government’s use of force, noting the agent had bragged about the shooting in a text message.\n\n“I fired 5 rounds, and she had 7 holes. Put that in your book boys,” Exumwroteto colleagues.\n\nIn court, Exum tried to explain the text messages, “I take pride in my shooting skills,” he said.\n\nThe agent also defended his use of force against Martinez, saying his life was at risk.\n\n“I did what I had to do,” he told the court.\n\n“That means illegal actions have legal consequences.”\n\nJudge Alexakis was infuriated by the government’s decision to release the agent’s damaged car from impound days after the shooting, allowing Exum to drive it home to Maine – more than1,000 milesfrom the scene – before defense attorneys could examine it.\n\nMartinez’s attorney said releasing the evidence gathered in the case was necessary to “combat the continuing harm” to his client’s reputation.\n\nThe judge declined to order the release ofFlock camera footage– outdoor cameras that can read license plates and identify other details about vehicles as they drive by.\n\nThat footage, Parente said, is less paramount than an admission from the US Attorney’s Office and DHS saying Martinez is not a domestic terrorist and that they made a mistake.\n\nDHS has never retracted its public accusations against Martinez,referringquestions about the decision to drop the case to the Justice Department. Although McLaughlinacknowledgedthe video publicized by Patel was incorrect, she again in January described Martinez and co-defendant Anthony Ian Santos Ruiz, who was driving a different vehicle, as “domestic terrorists,” CBS Newsreported.\n\nMartinez will attend Trump’s State of the Union address on February 24 as a guest of Illinois Democratic Rep. Jesús “Chuy” García, Parente said in a court filing last week.\n\nMcLaughlin told CNN in a statement it is “shameful” García plans to bring Martinez to the State of the Union, again accusing her of being “a known doxxer who attacked law enforcement,” and calling Martinez and Ruiz “rioters.”\n\n“It’s unfortunate to see someone who has sworn an oath to uphold the Constitution demonize federal law enforcement and prioritize politics over public safety with his guest decision,” said McLaughlin.\n\nMartinez’s legal team said they intend to file a claim against the government. She was hospitalized in the aftermath of the shooting, and still suffers from pain and has limited “use of her hand” and legs, Parente said.\n\n“We’ll be asking for damages in the tens of millions of dollars, when we do get our day in court,” attorney Michael Gallagher said Wednesday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/us/marimar-martinez-shooting-case-what-we-know",
      "text": "Border Patrol shooting"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/us/chicago-marimar-martinez-shooting-charges",
      "text": "Charges have been dropped"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/us/marimar-martinez-shooting-case-what-we-know",
      "text": "fell apart"
    },
    {
      "url": "https://x.com/FBIDirectorKash/status/1975001981828931752?lang=en",
      "text": "X post"
    },
    {
      "url": "https://www.cbo.gov/publication/61759",
      "text": "the agency’s"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/us/minneapolis-immigration-draw-down",
      "text": "in Minnesota"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/politics/gregory-bovino-minnneapolis-exit-ice",
      "text": "dispatching"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/us/video/3d-imaging-examines-renee-good-shooting-john-miller-digvid-vrtc",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/us/alex-pretti-protesters-minneapolis-invs",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/media/alex-pretti-minnesota-ice-shooting-video-media",
      "text": "contradicted by video"
    },
    {
      "url": "https://storage.courtlistener.com/recap/gov.uscourts.ilnd.487595/gov.uscourts.ilnd.487595.100.0.pdf",
      "text": "wrote"
    },
    {
      "url": "https://x.com/TriciaOhio/status/1974524869892276682",
      "text": "posted October 4 on X"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/politics/second-amendment-minneapolis-trump-pretti-shooting-nra",
      "text": "mirrored controversially"
    },
    {
      "url": "https://www.cnn.com/2025/11/05/us/chicago-marimar-martinez-shooting-hearing",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2025/10/21/us/chicago-suv-ramming-case-update",
      "text": "1,000 miles"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/tech/flock-safety-ai-cameras-brown-suspect-privacy",
      "text": "Flock camera footage"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/us/chicago-marimar-martinez-shooting-charges",
      "text": "referring"
    },
    {
      "url": "https://x.com/TriciaOhio/status/1974942178716610568",
      "text": "acknowledged"
    },
    {
      "url": "https://www.cbsnews.com/news/new-video-contradicts-border-patrol-account-of-chicago-shooting-lawyer-says-60-minutes/",
      "text": "reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/chicago-border-patrol-shooting-video-evidence",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/us/chicago-border-patrol-shooting-video-evidence",
      "text": "Cookie Settings"
    }
  ],
  "hash": "335a555aba27ef65a64b42f1e5502e9883f3a568045eb5f5b894e1406e9bcb07",
  "scraped_at": "2026-02-12T21:30:53.983543+00:00"
}