{
  "url": "https://lite.cnn.com/2026/02/11/health/baby-food-additives-ultraprocessed-study-wellness",
  "title": "Over 70% of tested baby foods are ultraprocessed and full of additives | CNN",
  "date": "2026-02-11T16:31:46.407967+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe vast majority ofbaby foods,drinks and snacks sold in the United States for children ages 6 months to 36 months areultraprocessedand may containadditivesincreasingly linked to potential health harms, a new study found.\n\nOver 70% of the 651 foods examined for the study contained additives that emerging research has linked to “inflammation and disruptions in the gut microbiome,” said first author Elizabeth Dunford, an adjunct assistant professor of nutrition at the University of North Carolina at Chapel Hill.\n\n“What shocked me was the top ingredient in 71% of these baby foods wasn’t a fruit or vegetable — it was one or more additives,” said Dunford, who is also a consultant at The George Institute for Global Health, which createdFoodSwitch, an app that contains nutritional information on thousands of products worldwide.\n\n“We know that babies’ guts are not fully developed enough to be able to handle additives in the way an adult stomach could,” she said. “There is no need for these additives; they are simply cosmetic, designed to make the food look more appealing.”\n\nThe names and brands of the baby foods were not disclosed in the studypublished Wednesdayin the peer-reviewed journal Nutrients.\n\nAn equal number of the baby foods in the study were classified as ultraprocessed foods, or UPFs. Examples include animal and fish crackers, puffs and sweetened yogurts. Experts say manufacturers design ultraprocessed foods to be hyperpalatable making it difficult to “eat just one.”\n\nAbout 62% of foods eaten by an American child are ultraprocessed, according toa recent reportby the US Centers for Disease Control and Prevention. Food preferences begin in the first years of life, so the findings of the study are alarming, said Jane Houlihan, research director forHealthy Babies, Bright Futures, an alliance of nonprofits, scientists and donors with a mission of reducing babies’ exposures to neurotoxic chemicals.\n\n“Babies exposed to ultraprocessed foods learn to prefer sugar and artificial flavors over the natural, nutrient-dense foods that set the stage for a lifetime of healthy eating,” Houlihan said. “Baby food companies should be making it easier, not harder, for families to choose healthy options.”\n\nStudieshave shown that eating just 10% more calories a day fromultraprocessed food— that’s about one serving — may be associated with a50% higher riskof cardiovascular disease-related death. There’s also a 55% greater chance of obesity and a 40% higher probability of developing type 2 diabetes.\n\nThe Consumer Brands Association, which represents manufacturers of baby food and other products, told CNN in an email there is “currently no agreed upon scientific definition of ultra-processed foods.”\n\n“Food manufacturers adhere to the rigorous evidence-based safety standards and nutrition policy established by the FDA to deliver safe, affordable and convenient products that families depend on every day,” said Sarah Gallo, the association’s senior vice president.\n\nFood additives include preservatives to resist mold and bacteria; emulsifiers to keep incompatible ingredients from separating; artificial colorings and dyes; fragrance and flavor enhancers; anti-foaming, bulking, bleaching, gelling and glazing agents; and added or altered sugar, salt and fats designed to make food more appealing.\n\nDunford and her team found 105 unique additives in the baby foods they examined. Over half were additives typically added to ultraprocessed foods; the rest were more natural options, such as the use of lemon juice as a preservative or beet juice for color.\n\nThirty-six percent of the baby foods contained synthetic flavor enhancers, including carrageenan, which has been linked to gut inflammation, the study found. Thickeners such as carrageenan, xanthan and guar gum were found in 29% of the baby foods, while both synthetic food dyes and emulsifiers were found in 19% of the products.\n\nAnApril 2025 studyfound a link between thickeners and emulsifiers such aspolysorbate 80,carrageenan, xanthan and guar gumand an increased risk of type 2 diabetes.Xanthanand guar gum are derived from plants and are typically safe,even beneficial,according to some studies. However, other studies on those additives havefound disruptionsin gut microbiota andinflammation.\n\nPetroleum-basedfood dyes,which have been linked tobehavioral issuesin children, have received scrutiny from the Trump administration. The US Food and Drug Administrationrecently approvedbeetroot as a natural food coloring and expanded access to spirulina extract.\n\nOverall, however, experts say there is little regulatory oversight for baby foods sold in the United States. TheAmerican Academy of Pediatricscalled for “urgently needed reforms” to the current FDA regulatory process for food additives in a 2018 policy statement.\n\n“Companies can add new chemicals to baby foods without any FDA safety review, simply declaring them ‘Generally Recognized as Safe,’” or GRAS, said Sarah Reinhardt, senior strategic campaign director of food systems for the Environmental Working Group, or EWG, a health advocacy organization that monitors chemicals in food and consumer products.\n\n“If we want to protect children, we need stronger labeling, stricter marketing rules, and an end to the GRAS loophole, so that every additive is reviewed for safety before it ever reaches a child’s plate,” Reinhardt said in an email.\n\nAdded sugar was found only in ultraprocessed baby foods and at much higher levels than non-UPF products, according to the study. Snack and finger food for babies and toddlers had the highest levels, with ultraprocessed products containing 2.5 times more sugar. Nearly 94% of the snack-size packaged products were ultraprocessed, the study found.\n\n“The less healthy products with added sugars also had ultraprocessed additives, which doesn’t surprise me, as products with added sugars are more likely to have synthetic dyes, for example,” Dunford said. “We already know that these ingredients come in combinations.”\n\nBaby food pouches were one of the worst offenders — in a 2024 analysis of the same data, Dunford found 50% of the sugar consumed from infant foods comes from pouches.\n\nThat same analysis found 70% of the 651 baby foods did not meet the World Health Organization’snutritional guidelinesfor protein in infant and toddler foods. One in five of the baby or toddler foods contained salt levels above the organization’s suggested limits, and 25% failed to meet calorie recommendations, the researchers found.\n\nParents can take action to limit their baby’s exposure to ultraprocessing and the additives that come with it, Houlihan said.\n\n“When you can, make meals at home using fresh, whole ingredients like fruits, vegetables, beans and whole grains,” she said. “If you’re buying packaged or processed foods, take a quick look at the ingredient list and choose options with simpler, more familiar ingredients. If it’s hard to tell what’s in a product, it may be ultra-processed and not the best choice for setting up healthy eating habits for a lifetime.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/01/04/health/baby-food-qr-codes-wellness",
      "text": "baby foods,"
    },
    {
      "url": "https://www.cnn.com/2025/12/14/health/ultraprocessed-food-definition-wellness",
      "text": "ultraprocessed"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/health/food-preservatives-cancer-diabetes-wellness",
      "text": "additives"
    },
    {
      "url": "https://www.georgeinstitute.org/projects/foodswitch",
      "text": "FoodSwitch"
    },
    {
      "url": "https://doi.org/10.3390/nu18040584",
      "text": "published Wednesday"
    },
    {
      "url": "https://www.cnn.com/2025/08/07/health/ultraprocessed-food-calories-average-diet-wellness",
      "text": "a recent report"
    },
    {
      "url": "https://hbbf.org/",
      "text": "Healthy Babies, Bright Futures"
    },
    {
      "url": "https://www.cnn.com/2025/04/28/health/ultraprocessed-food-death-wellness",
      "text": "Studies"
    },
    {
      "url": "https://www.cnn.com/2023/11/22/health/ultraprocessed-food-cancer-wellness/index.html",
      "text": "ultraprocessed food"
    },
    {
      "url": "https://www.cnn.com/2024/02/28/health/ultraprocessed-food-health-risks-study-wellness/index.html",
      "text": "50% higher risk"
    },
    {
      "url": "https://www.cnn.com/2025/04/08/health/ultraprocessed-food-additives-harm-wellness",
      "text": "April 2025 study"
    },
    {
      "url": "https://pubmed.ncbi.nlm.nih.gov/28325746/",
      "text": "polysorbate 80"
    },
    {
      "url": "https://pubmed.ncbi.nlm.nih.gov/38663950/",
      "text": "carrageenan, xanthan and guar gum"
    },
    {
      "url": "https://www.nature.com/articles/s41564-022-01093-0",
      "text": "Xanthan"
    },
    {
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC3931889/",
      "text": "even beneficial,"
    },
    {
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9194036/",
      "text": "found disruptions"
    },
    {
      "url": "https://www.sciencedirect.com/science/article/pii/S247529912311660X",
      "text": "inflammation."
    },
    {
      "url": "https://www.cnn.com/2025/06/26/health/food-dyes-maha-ultraprocessed-foods-wellness",
      "text": "food dyes,"
    },
    {
      "url": "https://www.jpeds.com/article/S0022-3476(06)80164-2/abstract",
      "text": "behavioral issues"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/health/natural-food-dyes-approved-beetroot-spirulina-wellness",
      "text": "recently approved"
    },
    {
      "url": "https://publications.aap.org/pediatrics/article/142/2/e20181408/37584/Food-Additives-and-Child-Health?autologincheck=redirected",
      "text": "American Academy of Pediatrics"
    },
    {
      "url": "https://www.cnn.com/2025/03/11/health/gras-reform-kennedy-wellness",
      "text": "Generally Recognized as Safe,"
    },
    {
      "url": "https://www.who.int/europe/publications/i/item/WHO-EURO-2022-6681-46447-67287",
      "text": "nutritional guidelines"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/health/baby-food-additives-ultraprocessed-study-wellness",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/health/baby-food-additives-ultraprocessed-study-wellness",
      "text": "Cookie Settings"
    }
  ],
  "hash": "33dd57f08617d825978483171fc8ccc5127f944187a0047456923c9e49ef3a57",
  "scraped_at": "2026-02-11T16:31:46.407980+00:00"
}