{
  "url": "https://lite.cnn.com/2026/02/16/sport/kansas-state-jerome-tang-dismissal",
  "title": "College basketball: Kansas State’s firing of its men’s basketball coach is the latest example of schools writing checks they don’t want to cash | CNN",
  "date": "2026-02-17T07:30:04.112853+00:00",
  "authors": [
    "Analysis by Dana O’Neil, CNN"
  ],
  "text": "Source: CNN\n\nIt is restorative to wake up in Italy and realize that, not unlike the Dolomites that surround this picturesque town, college administrators can be counted on to never change.\n\nThey remain committed to writing bad contracts that they will ultimately regret.\n\nThe latest chapter in this endless epic belongs to Kansas State, which is trying to line item its way out of paying Jerome Tang the money the administration offered him.\n\nTo review: in 2022-23, Jerome Tang took Kansas State to the Elite Eight, rolling up a 26-10 record that was so impressive the head coach earned himself a spot as the runner-up in the Associated Press Coach of the Year voting. So enamored were the K-State officials about the job Tang did, that they took his contract and ripped it up, writing a new one that would pay Tang considerably more and keep him in Manhattan, Kansas, through 2030.\n\nHe had coached one year. Not one year at Kansas State; one year anywhere. Those 26 wins were the extent of his success, a great rookie season to be sure, but not exactly a guarantee that Tang was John Wooden in waiting.\n\nIn fact, for those who don’t remember, much of that K-State run was built on the back of a 5-foot-8-inch guard who transferred in from the University of Arkansas at Little Rock. Markquis Nowell averaged 23.5 points, 13.5 assists and four steals in the Wildcats’ four NCAA games, enjoying a March glow-up that the tourney is known for and carrying K-State into the regional final.\n\nBut after that, the administration was terrified of losing Tang – Arkansas had been sniffing around – and in order to guarantee that the coach who had led a whopping 36 games in his lifetime wasn’t going anywhere, gave him a fresh new deal with a bunch more money.\n\n“What Coach Tang and his staff did in their first year here was phenomenal,’’ athletic director Gene Taylor said at the time. “The run to the Elite Eight was remarkable, but what separates Coach Tang is his pure love of his players, and the relationship that he builds with everyone he encounters. We are delighted to have him, Rey, Seven and Aylyn as a vital part of the Wildcat family and for him to continue to lead our basketball team for a very long time.’’\n\nTherein, however, was the rub. The new contract was richer, filled with all sorts of incentives … and also for a very long time. It was guaranteed.\n\nAnd now? Surprise - they have buyer’s remorse. Tang’s last three seasons have not matched his first, a series of diminishing returns that are reaching their nadir this year. K-State has just one Big 12 win and 10 victories overall.\n\nIn true February college basketball fashion, Tang unleashed his aggravation about his torpedoing season. This is the crazy season for college hoops. The calendar is nearing March and coaches are feeling the pressure. Annually you can set your clocks to a torrent of angry press conferences in which coaches kvetch about something - bad losses (Tang and Green Bay’s Doug Gottlieb), lack of fan commitment (UConn’s Dan Hurley), lousy officiating (Illinois’ Brad Underwood), unfair scheduling (Seton Hall’s Shaheen Holloway).\n\nSo Tang vented about his team’s lack of commitment after the Wildcats got poleaxed by Cincinnati for their fifth consecutive loss and their 10th loss in 11 games.\n\n“These dudes do not deserve to wear this uniform,’’ Tang said. “There will be very few of them in it next year. I’m embarrassed for the university. I’m embarrassed for our fans, our student section. I have no words.’’\n\nThe next day, he made good on his promise and took the names off their jerseys. Then lost to Houston by 14 points.\n\nAt which time someone in a Manhattan athletics department office pulled out their magnifying class and Tang’s contract, finding a way to get rid of the coach and not pay him.\n\n“This was a decision that was made in the best interest of our university and men’s basketball program,’’ athletic director Gene Taylor said in a statement. “Recent public comments and conduct, in addition to the program’s overall direction, have not aligned with K-State’s standards for supporting student-athletes and representing the university.’’\n\nMorality clauses typically are invoked for NCAA violations, arrests or serious conduct unbecoming. Michigan oustedSherrone Moorefor violating his morality contract. If coaches publicly criticizing their teams is now considered a violation of a moral clause, well, we might run out of coaches real soon.\n\nThis is not a moral issue; it’s a money issue.\n\nIf Kansas State cuts Tang without cause, it owes him $18.67 million, a hefty price tag in an age where all of the bills from name, image and likeness deals and revenue sharing are coming due.\n\nNo one would argue that K-State should keep Tang. The Wildcats have won one game since New Year’s Day, losing their last six by an average of 18 points. This is not going well.\n\nBut the university, like so many others – Penn State andJames Franklin(owed $49 million; negotiated down after he was hired by Virginia Tech), LSU andBrian Kelly(owed $54 million);Jimbo Fisherand Texas A&M (owed $76 million) – tied itself to a bad deal and now doesn’t want to pay.\n\nTang already has put out a statement. There will be lawyers and billable hours, and blame tossed around.\n\nBecause like the Dolomites here, college athletic administrators and bad decisions are permanent.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/13/sport/ncaa-college-football-sherrone-moore-university-of-michigan",
      "text": "Sherrone Moore"
    },
    {
      "url": "https://www.cnn.com/2025/10/12/sport/football-ncaa-james-franklin-penn-state-fired",
      "text": "James Franklin"
    },
    {
      "url": "https://www.cnn.com/2025/10/31/sport/college-football-coach-buyouts",
      "text": "Brian Kelly"
    },
    {
      "url": "https://www.cnn.com/2023/11/13/sport/jimbo-fisher-record-buyout-texas-am-spt-intl",
      "text": "Jimbo Fisher"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/sport/kansas-state-jerome-tang-dismissal",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/sport/kansas-state-jerome-tang-dismissal",
      "text": "Cookie Settings"
    }
  ],
  "hash": "347484eba0c4d7ed99b0ec247688a9d2d19e4d51c3633f6ae258fdc278ac70b8",
  "scraped_at": "2026-02-17T07:30:04.112867+00:00"
}