{
  "url": "https://lite.cnn.com/2026/02/22/travel/what-to-do-stranded-mexico-intl-hnk",
  "title": "Mexico travel guidance: What you need to know as violence erupts over death of cartel leader | CNN",
  "date": "2026-02-25T07:32:14.859152+00:00",
  "authors": [
    "Charlotte Reck"
  ],
  "text": "Source: CNN\n\nThe situation in Mexico is returning to normal following widespread unrest in the wake of the killing of drug lord “El Mencho,” the US State Department said Tuesday.\n\nUS citizens are no longer urged to seek shelter in the areas of Jalisco, Nayarit, and Baja California. However, US government staff there remain subject to a nighttime curfew. Staff in Jalisco state and Monterrey, Nuevo León, have also been directed to stay within their metropolitan areas.The US State Departmentissued alertsencouraging citizens to follow the same restrictions as its employees.\n\nFlight schedules are operating normally again in Guadalajara, and many airlines have extra flights planned for Puerto Vallarta.\n\nThe US agency said there are no roadblocks ordered by local authorities, but warned that “some routes in Jalisco have not yet fully reopened.” Public transportation and businesses are returning to normal, it added.\n\nThe US, Canada and the UK foreign offices have warned its citizens to avoid all but essential travel to affected areas of Mexico.\n\nFor individuals in affected areas, the US State Department advises:\n\nAnyone needing assistance help can contact:\n\nFrom US & Canada: 1-888-407-4747\n\nFrom Overseas (including Mexico): +1 202-501-4444\n\nTourism in Mexico is on the rise. The country reportedly welcomed a record 47.4 million visitors between January and July 2025 — a 13.8% increase on the same period in 2024.\n\nTravelers preparing to explore Mexico’s archaeological sites or beaches are encouraged to prepare carefully. According to the US State Department guidance:\n\nThose who choose to proceed with travel are encouraged to take additional precautions:\n\nMexico will co-host the FIFA World Cup from June 11 to July 19, 2026, alongside the United States and Canada. More than five million fans are expected across the 16 host cities in the three countries.\n\nIn Mexico, matches will take place in Guadalajara, Mexico City and Monterrey. However, with Jalisco currently categorized by the US government as a state where visitors should reconsider travel, some fans may weigh their plans carefully.\n\nFans who have secured tickets are advised to:\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://travel.state.gov/en/international-travel/travel-advisories/mexico.html",
      "text": "issued alerts"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/travel/what-to-do-stranded-mexico-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/travel/what-to-do-stranded-mexico-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "34ee01bcba7206ccc0449da3c2a3ae9b293315836891e4e0a64efc82c6a1d1ef",
  "scraped_at": "2026-02-25T07:32:14.859166+00:00"
}