{
  "url": "https://lite.cnn.com/2026/02/13/politics/munich-2028-democrats-aoc-newsom",
  "title": "As Trump tests alliances, Democrats with 2028 ambitions offer reassurance at Munich conference | CNN Politics",
  "date": "2026-02-14T07:07:11.814547+00:00",
  "authors": [],
  "text": "Source: CNN\n\nCalifornia Gov. Gavin Newsom and Rep. Alexandria Ocasio-Cortez were among the high-profile Democrats looking to counterPresident Donald Trumpat the Munich Security Conference this week as they outlined their foreign policy visions and what could come next.\n\n“Donald Trump is temporary. He’ll be gone in three years,” said Newsom during a panel on climate change. “California is a stable and reliable partner in this space. And it’s important for folks to understand the temporary nature of this current administration in relationship to the issue.”\n\nOcasio-Cortez, who spoke on a panel about the rise of populism, said “We are ready for the next chapter, not to have the world turn to isolation, but to deepen our partnership on, on greater and increased commitment to integrity to our values.”\n\nRoughly half a dozen Democrats with potential presidential ambitions in 2028 are descending on the annual Munich conference, a frequent stop for politicians to test the foreign policy waters and elevate their own profiles on the international stage ahead of White House runs.\n\nOther possible 2028 hopefuls participating in the weekend events include Arizona Sens. Mark Kelly and Ruben Gallego, Sen. Elissa Slotkin and Gov. Gretchen Whitmer of Michigan, Connecticut Sen. Chris Murphy and former Commerce Secretary Gina Raimondo.\n\nDemocrats traveled to Munich one year after Vice President JD Vance, a potential 2028 contender,chastised European leadersat the conference, accusing them of suppressing free speech, losing control of immigration and refusing to work with hard-right parties in government.\n\nWhile Vance is not in attendance this year, Secretary of State Marco Rubio, who is often included in chatter about 2028, was set to represent the Trump administration. As he departed for Munich, Rubio told reporters “the old world is gone, frankly” and “we live in a new era of geopolitics.”\n\n“It’s going to require all of us to sort of re-examine what that looks like and what our role is going to be,” Rubio added, also noting that Europe is important to the US. “I think they want honesty. They want to know where we’re going, where we’d like to go, where we’d like to go with them.”\n\nBut many Democrats in attendance sought to assure European leaders of their commitment.\n\nIn an interview with CNN’s Kasie Hunt, Kelly pushed back on Rubio’s comments, saying, “The old world is gone because Donald Trump blew it up.”\n\n“What I’m hearing now is, even if we are able to repair these relationships, it’s going to take generations before they feel comfortable,” Kelly said. “I think we can fix this. I think we can get past this. It’s going to take a new president, a new administration.”\n\nOcasio-Cortez said Democrats are seeking “a return to a rules-based order” and warned against an “age of authoritarianism,” accusing Trump of turning the Western Hemisphere into “his personal sandbox.”\n\nDuring the panelon populism, the progressive rising staralso pitched “working class centered politics” to “stave off the scourges of authoritarianism.” Asked if she would impose a wealth tax “when you run for president,” Ocasio-Cortez responded, “We don’t have to wait for any one president to impose a wealth tax. I think that it needs to be done expeditiously.”\n\nThe New York Democrat also appeared on a panel with Whitmer on the future of foreign policy later in the day. In the lead-up to her appearance at Munich, Ocasio-Cortez was advised by Matt Duss, a former foreign policy adviser to independent VermontSen. Bernie Sanders.\n\nIn an interview with CNN’s Kasie Hunt, Newsom warned of the damage Trump has caused with traditional US allies.\n\n“They see us as a wrecking ball. They see us as unreliable and a lot of them think irrevocable. They don’t think we’ll ever come back to our original form,” Newsom said. “I’m not as convinced of that.”\n\n“Whatever happens, we can undo, we can shape-shift, we can fix. And while trust is difficult to reestablish, there’s too much at stake in a multinational — from a multi-international perspective, that we have a lot of work to do once Trump’s done,” Newsom added.\n\nFor Newsom, the Munich appearance marked his second turn on the international stage within the past month. He was on hand at the World Economic Forum in Davos, Switzerland, in January and emerged as a focal point in Trump’s own speech at the summit.\n\nLast year, Newsomtraveled to Brazil for COP 30, an international climate conference to which the Trump administration declined to send an official delegation.\n\n“The United States was a footnote. China sent close to 800 delegates. The United States didn’t even send a stenographer. They sent nobody,” Newsom said Friday. “They’ve completely walked away, abdicated any role in relationship to the issue of low carbon green growth.”\n\nAsked what he would do to restore trust in the US on climate issues if he “were to become president, maybe the next president,” Newsom turned to talking about “my day job as governor of California” and the work his state has done on the issue.\n\n“We have long moved beyond the partisanship on this issue, because there is no Republican thermometer, there’s no Democratic thermometer, there’s just reality. And people in my state have been mugged by reality,” he said.\n\nNewsom was also set to meet with German Chancellor Friedrich Merz and sign a memorandum of understanding relating to a new partnership with Ukraine while in Munich, his office said.\n\nSpeaking during a panel on Gaza, Murphy argued Trump has “engaged in a consistent campaign to alienate our friends in Europe” and said he must use “leverage” with the Israeli government to ensure the next steps of plan for Gaza are implemented.\n\n“The humanitarian situation continues to be morally unacceptable,” he said “I really worry about the long term health of the US-Israel relationship, if we don’t see real, meaningful progress in the clearing of rubble, in the delivery of humanitarian and medical aid, the construction of actual, real, permanent shelters in which people can live.”\n\nRaimondo, a former commerce secretary under President Joe Biden and governor of Rhode Island, was also on hand to moderate a panel on economic security and emerging technology. Slotkin is scheduled to participate in a panel conversation Saturday about defending Europe and supporting Ukraine while Gallego is slated to speak on a panel about security for the Western Hemisphere.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl",
      "text": "chastised European leaders"
    },
    {
      "url": "https://www.cnn.com/2025/11/12/climate/newsom-trump-invasive-species-cop30-brazil",
      "text": "traveled to Brazil for COP 30"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/munich-2028-democrats-aoc-newsom",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/munich-2028-democrats-aoc-newsom",
      "text": "Cookie Settings"
    }
  ],
  "hash": "34fba93273cbbe284ba8a648ac65c77f8952a7939a8f8f8c90ab6e938fff9e1c",
  "scraped_at": "2026-02-14T07:07:11.814559+00:00"
}