{
  "url": "https://lite.cnn.com/2026/02/27/investing/tech-stocks-us-markets",
  "title": "Nasdaq and S&P just had their worst month since March. Here’s how to navigate the shift | CNN Business",
  "date": "2026-02-28T06:59:23.241756+00:00",
  "authors": [
    "John Towfighi"
  ],
  "text": "Source: CNN\n\nTechnology stocks aren’t carrying the market like they used to — but investors can protect their portfolios during the volatility.\n\nAfter years of powering the market on the promise of revolutionizing productivity, tech and AI stocks have hit a lull. It’s been four months since the tech-heavy Nasdaq Composite hit a record high. The S&P 500 and Nasdaq each just posted their worst month since March.\n\nMeanwhile, stocks with less exposure to AI are climbing higher. The blue-chip Dow, which is less reliant on tech than the Nasdaq and the S&P, is up 1.9% this year. The S&P is up 0.49% this year and the Nasdaq is down roughly 2.5%.\n\nIt’s part of a broader shift on Wall Street, which is navigating an AI maelstrom. Nvidia (NVDA), the star of the AI trade, on Thursday had its worst day since April despite posting stellar quarterly earnings.\n\nNerves about AIdisrupting business modelscontinue to wreak havoc on software companies. And there is persistent angst about Big Tech’s enormous spending on data centers and uncertainty about whether it will translate into a return on the hundreds of billions of dollars of investment.\n\nBut analysts and portfolio managers say investors shouldn’t give in to these nerves just yet, pointing instead to shifts in the markets that could create new opportunities.\n\nThe broader market also tends to climb higher in the long run, resulting in strong average annual returns for the S&P 500. This means long-term investors in indexes like the S&P 500 can often ignore short-term volatility.\n\nUS stocks closed lower Friday: The Dow sank 521 points, or 1.05%. The S&P 500 fell 0.43%, and the tech-heavy Nasdaq slid 0.92%. Wall Street’s fear gauge, the VIX, surged 8%.\n\nThe 10-year Treasury yield fell below 4% and hit its lowest level since October as investors moved into bonds. Oil prices jumped more than 2% as tensions lingerbetween the United States and Iran.\n\nNearly 40% of the S&P 500’s value is concentrated in mega-cap technology stocks like Nvidia, Microsoft (MSFT) and Alphabet (GOOG). Concerned investors could rebalance their holdings or look for sectors with less exposure to AI.\n\n“Investors can become heavily tech-exposed without realizing it,” said Jon Ulin, managing principal at Ulin & Co Wealth Management.\n\nNerves about tech are fragile, and that has left the S&P 500 trading sideways. The index closed at a record high in late January but lost some ground in February and is roughly flat since late October.\n\nUlin told CNN that it’s important not to react to noise in the market but still review portfolios in times of tumult. He said he is relying less on Big Tech stocks, instead reallocating his portfolio to include more sectors like materials, energy, infrastructure, industrials, health care and staples.\n\nCraig Johnson, chief market technician at investment bank Piper Sandler, this week lowered his rating of the technology sector from “overweight” to “neutral.” In other words, he shifted the balance of his portfolio to rely less on tech.\n\nJohnson is positive on sectors like energy, and he expects a rotation to continue playing out in the market as investors seek protection from recent volatility in tech stocks.\n\nEnergy, materials and consumer staples are the three top-performing sectors in the S&P 500 so far this year, while tech and financials lag behind. A popular exchange-traded fund tracking the energy sector is up 25%, while an ETF tracking the tech sector is down roughly 3.6%.\n\nIt’s unclear whether the worst of the AI uncertainty is behind us, analysts said. How investors should respond to the moment depends on their savings and investment goals — but there are strategies to protect your portfolio during the heightened unease.\n\n“Investors have become really skittish and fearful of AI’s impact,”Jed Ellerbroek, portfolio manager at Argent Capital Management, said. “The market is skittish and volatile today. The focus area seems to be shifting pretty rapidly, bouncing from thing to thing, and so I think it makes sense to have a well-diversified portfolio.”\n\nAnother strategy is rebalancing, or investing in an index like the equal-weighted S&P 500. The equal-weighted index assigns the same weight to each stock, mitigating the impact of major drops in tech. The equal-weighted S&P is up nearly 7% this year, outpacing the S&P’s gain of less than 1%.\n\nIncreasing exposure to international stocks could also help bolster returns. Markets in Europe and Asia are outperforming the United States this year after posting strong gains in 2025.\n\nDuring periods of volatility and uncertainty, sticking to your long-term plan and tuning out the noise can also prove to be a compelling strategy, analysts said.\n\n“What we suggest is to always use diversification, to not just have one theme in your investments,” said Johan Strand, wealth manager and research analyst at Badgley Phelps.\n\n“It’s always hard to bet what the stock market will do in the near term,” Strand said. “There could still be negative sentiment going on here, but we’re still positive for 2026 to be a positive year for the stock market.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/markets/stocks/NVDA",
      "text": "NVDA"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/ai-disruption-fears-us-stocks",
      "text": "disrupting business models"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-27-26",
      "text": "between the United States and Iran."
    },
    {
      "url": "https://www.cnn.com/markets/stocks/MSFT",
      "text": "MSFT"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/GOOG",
      "text": "GOOG"
    }
  ],
  "hash": "352c8a1225e146afd88695e6510d3fe2dbc21d8eccb050c658439754270f4c2e",
  "scraped_at": "2026-02-28T06:59:23.241770+00:00"
}