{
  "url": "https://lite.cnn.com/2026/02/09/sport/keion-white-shot-san-francisco-49ers",
  "title": "49ers’ Keion White undergoes surgery after being shot in ankle during altercation in San Francisco | CNN",
  "date": "2026-02-11T16:33:31.815885+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nSan Francisco 49ersdefensive lineman Keion White underwent surgery after being shot in the ankle early Monday morning.\n\nThe shooting happened hours after the end of theSuper Bowlthat was played at Levi’s Stadium in Santa Clara.\n\n“Keion White was a victim of a shooting and sustained a bullet wound to his ankle this morning in San Francisco,” the team said in a statement. “He is currently undergoing surgery at a local hospital. We will provide further updates when appropriate.”\n\nSan Francisco police said they responded to a shooting a little after 4 a.m. and found a victim from an apparent gunshot wound. Officers gave aid and called paramedics and said the victim was taken to a hospital to be treated for non-life-threatening injuries. No arrests have been made.\n\n“A preliminary investigation revealed a verbal altercation occurred between two groups inside a business,” police said in a statement. “The victim was injured when shots were fired by an unknown suspect. All information is preliminary at this time, and more information will be provided as it becomes available.”\n\nWhite joined the 49ers midway through this season after a trade from New England. White’s old team, the Patriots, lost the Super Bowl on Sunday night to the Seattle Seahawks. The 27-year-old White just finished his third season in the NFL.\n\nThis is the second time in the past 18 months that a 49ers’ player has been a victim of a shooting in San Francisco. Receiver Ricky Pearsallwas shot in the chestduring a robbery attempt on Aug. 31, 2024. A teenager is awaiting trial in juvenile court in that case.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/sport/football-nfl-49ers-christian-mccaffrey-panthers-intl",
      "text": "San Francisco 49ers"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/super-bowl-seahawks-patriots-02-08-26",
      "text": "Super Bowl"
    },
    {
      "url": "https://www.cnn.com/2025/01/07/sport/ricky-pearsall-san-francisco-49ers-forgive-teenager-spt",
      "text": "was shot in the chest"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/sport/keion-white-shot-san-francisco-49ers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/sport/keion-white-shot-san-francisco-49ers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "352fdf5f6f544207aa5e8842100d944435036b65952332f41f1746d1de9b9fa3",
  "scraped_at": "2026-02-11T16:33:31.815897+00:00"
}