{
  "url": "https://lite.cnn.com/2026/02/14/style/tatreez-why-palestinian-women-are-preserving-this-embroidery",
  "title": "Tatreez explained: Why Palestinian women are preserving this embroidery | CNN",
  "date": "2026-02-15T07:11:11.015486+00:00",
  "authors": [],
  "text": "Source: CNN\n\nBorn in Ramallah at the end of the ‘90s, Ayham Hassan grew up privy to the political weight attributed to certain sartorial practices. “I became aware early on that Palestinian textiles are not just objects,” said the designer, who is based between London and the occupied West Bank. “They are evidence carrying geography, lineage, and memory.”\n\nWhen Hassan graduated from London’s Central Saint Martins art and design college last June, he titled his final collection “IM-Mortal Magenta: The Color That Doesn’t Exist.” Shaped by his understanding of this relationship between art and politics, it was infused with visual elements inspired by Gaza. “The color magenta became a conceptual anchor, used to speak about erasure and survival,” he explained in an email. “And tatreez informed not only the visual language, but also the structure of the work, and fundamentally how I design.”\n\nThis perception of tatreez, or traditional Palestinian embroidery, as a type of visual language is widely shared, owing to its intimacy with the land and biographical characteristics. A centuries-old creative practice, tatreez originally married its maker (usually women from rural communities) with their respective region. Details like color, technique and even its depictions of certain plants and flowers were tied to specific areas; by design it denoted social status and personal life events, including marriage or widowhood.\n\nBeginning in 1948, following the Arab-Israeli war (recognized as the Nakba, or catastrophe, during which 700,000 Palestinians were expelled from their homes) – as well as later intifadas, or uprisings, against the occupation in 1987 and 2000 – tatreez became a political vehicle, actively embodying resistance for many Palestinians.\n\n“Today it’s become part of an understanding of Palestinian steadfastness, or ‘sumud’ — of resistance more broadly,” Rachel Dedman, a curator of Middle Eastern art at the Victoria & Albert Museum in London, and author of “Stitching the Intifada: Embroidery and Resistance in Palestine,” said during a video call. “And its practice as one of solidarity is becoming more and more clear. On TikTok you get lots of results for people running stitching circles and tatreez workshops.”\n\nDedman has spent the past decade researching tatreez and curating exhibitions in Europe and across the Middle East, following an initial invitation from the Palestinian Museum in Birzeit, north of Ramallah, in 2014. “Thread Memory: Embroidery from Palestine” is currently on show at the V&A Dundee in Scotland while more recently “Embroidering Palestine” opened at MoMu, the fashion museum of Antwerp, where work by Hassan is displayed alongside thobes (embroidered ankle-length dresses, also known as thobs) made over a century ago.\n\n“Often in museums there’s a feeling that historic fashion is something that’s unchanging and static, held in amber,” said Dedman. “In the 19th century, tatreez and Palestinian dress was fashion – women were looking at each other. Being in MoMu then, I was excited to really approach this as fashion in the fullest sense, carving that connection between a 19th century embroidered thobe and the work of designers in the present.”\n\n“The purpose of tatreez was a celebration of culture, land and identity,” added Samar Abdrabbou, a Palestinian program manager for Made in Palestine (MIP), an Australian humanitarian non-profit, who is based in Bethlehem. Many women used the traditional craft to “celebrate their beauty and femininity – they were not trying to fight or resist,” Abdrabbou explained. “Tatreez was never meant to be political, but during the Nakba many women left with only the thobe they were wearing, and a lot of fabric factories were burned. Palestinian women never stopped stitching.”\n\nAfter 1948, tatreez became important as material evidence of Palestinian presence on the land, and women started to insert politically charged motifs into their work. They also began appropriating colors in their tatreez, and the watermelon became a symbol of Palestinian solidarity with its red flesh, white rind, black seeds, and green skin mirroring the Palestinian flag. “Those objects are fascinating because they render women’s bodies sites of active political power, engaging in this explicitly political moment, making tatreez with a view to being seen,” said Dedman. “And they’re not what we associate with protest, because they take so long to make and they’re often stitched in difficult circumstances.”\n\nIn 2021, the global significance of tatreez was recognized by UNESCO, when it was added to the Representative List of the Intangible Cultural Heritage of Humanity, a safeguarding measure to ensure its preservation. Its political interpretations still continue today. As Hassan asserted, “Carrying embroidery between London and Palestine has never felt neutral to me. Tatreez is read very differently depending on who is looking at it. It is framed as ‘heritage’ or ‘folk craft’, or under occupation it is immediately politicized.”\n\nBeing a part of the exhibition at MoMu then, alongside other contemporary designers like Studio Nazzal and Zeid Hijazi, feels particularly remarkable. “Presenting Palestinian embroidery and contemporary design within a major European fashion museum is an act of visibility at a time when Palestinian lives, histories, and voices are systematically erased or misrepresented,” said Hassan. “Tatreez is not simply ornamentation; it is a living language, a form of resistance, and an intergenerational archive.”\n\n“It’s really about looking at the wealth of beauty, that side that we don’t necessarily see,” added Dedman, in reference to the images of destruction in Gaza after two years of war. “We’re celebrating Palestinian joy, creativity and brilliance, as much as we are engaging with the realities of the situation. To be able to bring people closer to the intimate lives, of Palestinian women in particular, is very important.”\n\nFor Abdrabbou, who in 2024 established SAMARKAND, a cultural initiative dedicated to preserving and teaching tatreez, practicing the art feels most keenly like a way to honor her heritage. Traditionally passed between generations in families, increasingly she recognized an absence of knowledge about the craft amongst younger Palestinians and sought to rectify this. “I’m doing it to celebrate and keep this traditional art alive,” she said, though acknowledged there is a political component too. “I remember seeing a photo of a tatreez piece under the rubble (in Gaza), the first thing I thought about was the time and effort that the woman who made this piece put in it. This was my personal urgent response.”\n\n“The sense of community while stitching with other people is so powerful. Women feel comfortable and supported, everyone shares personal stories,” continued Abdrabbou, discussing her weekly Tatreez circle at a local café in Bethlehem. Open to men as well as women, she receives both Palestinians and international audiences. “I believe it’s important for everyone living in Palestine to learn about the traditions and culture of the country. And since it’s a diverse group, of Palestinians and internationals, we hear about crafts and traditions from different countries and cultures too.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/style/tatreez-why-palestinian-women-are-preserving-this-embroidery",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/style/tatreez-why-palestinian-women-are-preserving-this-embroidery",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3540c6b4119247c6bb4cdfa022d292ffab5e80342f1bbb193a5dd1c803609568",
  "scraped_at": "2026-02-15T07:11:11.015499+00:00"
}