{
  "url": "https://lite.cnn.com/2026/02/23/entertainment/nick-reiner-arraignment",
  "title": "Nick Reiner pleads not guilty to murder charges in the deaths of his parents, Rob and Michele Reiner | CNN",
  "date": "2026-02-24T07:31:57.722213+00:00",
  "authors": [
    "Alli Rosenbloom",
    "Nick Watt",
    "CNN"
  ],
  "text": "Source: CNN\n\nNick Reiner, the 32-year-oldchargedwith two counts of first-degree murder in connection with the fatal stabbing of his parents,famed director Rob Reinerand photographer Michele Singer Reiner, pleaded not guiltyin a Los Angeles courtroom on Monday.\n\nReiner waived his right to a speedy preliminary hearing and no bail was granted. Reiner, who had a shaved head, wore brown prison-issued overalls and had shackles on his wrists during his appearance.\n\nA preliminary hearing is tentatively scheduled for April 29.\n\nRob and Michele Reiner were found stabbed to death in their Los Angeles home late last year.\n\nReiner has been in custody since his initial arrest in December.\n\nThe charges carry a maximum sentence of life in prison without parole or the death penalty.\n\nLos Angeles County District Attorney Nathan Hochman told reporters outside the courthouse after the hearing that his office has not yet determined whether they will seek the death penalty.\n\n“We take the process in which we determine whether or not the death penalty should be sought extremely seriously, and it goes through a very rigorous process,” he said. “We will be looking at all aggravating and mitigating circumstances, and we have invited defense counsel to present to us, both in writing and orally in a meeting, any arguments that they would like to make in consideration for our going forward or not going forward with the death penalty.”\n\nRob and Michele Reiner had three children together – Jake, Romy and Nick.\n\nCNN has reached out to a spokesperson for Romy and Jake Reiner for comment.\n\nLast month, Reiner did not enter a plea during hisinitial arraignmentbecause his high-profile attorney, Alan Jackson, withdrew as his counsel. Deputy Public Defender Kimberly Greene now represents him, according to the Los Angeles County Public Defender’s Office.\n\n“The Public Defender’s Office recognizes what an unimaginable tragedy this is for the Reiner family and the Los Angeles community. Our hearts go out to the Reiner family as they navigate this difficult time,” Garcia said in astatementat the time. “We ask for your patience and compassion as the case moves through the legal process, as these matters are complicated and require careful consideration.”\n\nJackson told reporters at the time that while his team is still committed to Reiner and his best interests, circumstances beyond his or Reiner’s control “made it impossible” for his team to continue representing him.\n\nJackson also said that after investigating the matter, they believe that “pursuant to the laws of this state, pursuant to the law in California, Nick Reiner is not guilty of murder.”\n\nProsecutors say Reiner stabbed his parents to death in the early hours of the morning in the master bedroom area of the family home. A family member had previously told detectives that Reiner had also been living on the property in a guest house and that he argued with his father at Conan O’Brien’s holiday party the night before.\n\nReiner has beenopenabout his struggles with addiction, mental health and his experience of multiple stints in rehab. In 2015, he channeled his experiences into a film that he co-wrote about a family struggling with a child’s addiction, which his father directed.\n\nRob Reiner was a larger-than-life and beloved figure in Hollywood. His breakout role as an actor came in 1971 on TV’s “All in the Family,” on which he starred as Mike Stivic, the son-in-law of Archie and Edith Bunker. Rob Reiner earned two Emmy Awards for the role.\n\nAs an actor and a director throughout his esteemed, decades-long career, his body of work included everything from cult comedies such as “The Princess Bride” to classic rom-coms like “When Harry Met Sally” and the Oscar-nominated legal drama “A Few Good Men.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/entertainment/live-news/rob-michele-reiner-death-investigation-12-16-25-hnk",
      "text": "charged"
    },
    {
      "url": "https://www.cnn.com/2025/12/15/entertainment/rob-reiner-obituary-films",
      "text": "famed director Rob Reiner"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/entertainment/nick-rob-michele-reiner-arraignment",
      "text": "initial arraignment"
    },
    {
      "url": "https://pubdef.lacounty.gov/news/media-release-la-public-defender-issues-statement-on-appointment-to-represent-nick-reiner/",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2025/12/15/entertainment/nick-reiner-wwk-being-charlie",
      "text": "open"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/entertainment/nick-reiner-arraignment",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/entertainment/nick-reiner-arraignment",
      "text": "Cookie Settings"
    }
  ],
  "hash": "362982c67f5b955d9b297583f3c7403f88df7773a2b65f9c02dcb6488e266dd8",
  "scraped_at": "2026-02-24T07:31:57.722226+00:00"
}