{
  "url": "https://lite.cnn.com/2026/02/23/tech/facebook-researchers-study-addictive-features",
  "title": "Facebook researchers previously proposed studying whether features were ‘addictive,’ documents show | CNN Business",
  "date": "2026-02-24T07:31:40.718728+00:00",
  "authors": [
    "Clare Duffy, CNN"
  ],
  "text": "Source: CNN\n\nMeta executivestestified in a Los Angeles courtroomearlier this month that while use of the company’s platforms could become problematic, it couldn’t be considered addiction. But inside the company, researchers havesought to study whether certain Facebook features could contribute to “addiction” or “addictive’-like” behaviors among users.\n\nThat’s according to new internal documents released in legal filings in another lawsuit against Meta.\n\nThe files, released on Friday, raise new questions about what Meta has known about the risks of its platforms, especially to young people — a question at the heart of the legal battle currently underway against the company. Some of the features the company’s researchers raised questions about, including autoplay and endlessly scrolling feeds, are among the same features that lawsuits now claim contribute to youth addiction and harm.\n\nEmployees at the company, then known as Facebook, proposed a public audit of design features that might contribute to compulsive use of the platform in the fall of 2018, citing growing public concern that tech companies were intentionally manipulating users, according to the documents.\n\nThey suggested working with outside researchers to lend expertise and credibility to the effort. One suggested expert was Tristan Harris, who at the time hadrecently left his jobas an ethicist at Google to found the Center for Humane Technology to address concerns about social media and smartphone addiction. But the documents show employees expressing concerns that Harris might suggest changes to Facebook that the company’s product teams wouldn’t be willing to make.\n\nThe researchers hypothesized that certain features could “promote frequent, automatic, undesired behaviors” that build habits users may not want or intend.\n\n“These may lead to feelings of being manipulated, feeling lack of control related to certain behaviors, and feelings of dependence on checking or going on Facebook that could be related to lower well-being — and could be fueling the subjective, colloquial experiences of feeling ‘addicted’ to Facebook,” they wrote.\n\nThe documents were released as evidence in a lawsuit brought by hundreds of school districts and attorneys general from across the United States against Meta, Snap, TikTok and YouTube-parent Google in the Northern District Court of California. The case is set to go to trial later this year.\n\nIt will follow the conclusion of the social media addiction case against Meta and YouTube currently on trial in Los Angeles, thefirst of more than 1,500 lawsuitsbrought by individuals against the companies. Meta has denied the lawsuits’ claims.\n\nParents and safety advocates have for years raised concerns that social media platforms are designed to get users hooked and keep them scrolling for as long as possible to serve them more ads. Meta CEO Mark Zuckerbergobjectedto this claim in his testimony in the LA trial last week, saying the company was focused on maximizing “value” to users.\n\nMeta never carried out the proposed audit, although Meta spokesperson Liza Crenshaw said it has conducted other research on the topic that informed design changes such as parental control tools and default teen safety settings that were introduced in recent years.\n\n“We’ve intentionally designed automatic defaults like Sleep Mode that encourage teens to leave the app and pause notifications over night,” Crenshaw said in a statement. “Parents can go even further by restricting their teens’ total time to as little as 15 minutes a day or setting scheduled breaks when teens are required to exit our apps.”\n\nFriday’s release is just the latest tranche of internal documents to be made public in the Northern California case.\n\nDocumentsreleased earlieralso showed Meta researchers in an internal chat raising concerns about compulsive use, saying, “IG (Instagram) is a drug… we’re basically pushers.” Internal documents from the other tech companies similarly suggest the firms were aware that their apps could harm teens. The companies said at the time the documents paint a misleading picture of their platforms and safety efforts.\n\nMeta and other tech firms have long argued publicly that there is no conclusive evidence linking social media to addiction or other mental health challenges.\n\n“I think it’s important to differentiate between clinical addiction and between problematic use, so, using something more than you feel good about,” Instagram head Adam Mosseri testified in the Los Angeles case earlier this month.\n\n“Sometimes we use the word ‘addiction’ to refer to things more casually,” he said. “I’m sure I’ve said that I’ve been addicted to a Netflix show, you know, when I binged it really late one night, but I don’t think it’s the same thing as clinical addiction.”\n\nBut the 2018 document suggests the company’s researchers believed certain Facebook features contributed to repeated use that made users feel worse, or like they had little control of their behavior. In the proposal, researchers also suggested expanding the study to Instagram.\n\n“Given that currently there is NO medically defined FB addiction disorder -what are the real people problems in this space?” they wrote. “The well-being team has reframed the addiction narrative to focus on the ways that FB may be contributing to use patterns that people find difficult to control despite negative impacts on their lives, and to identify and correct those contributing factors.”\n\nThe researchers expressed a desire to identify and change problematic features — such as video autoplay, “like” count notifications and “endless scroll” — and noted that the platform should only promote “frequent” behaviors that also provide real value to users.\n\nA separate document described “comms considerations” around the proposed audit, including the opportunity to address “extreme” claims in the media that Facebook was “sprinkling behavioral cocaine” all over its products and to “preempt any regulations.” The document notes the audit could improve user well-being, but said teams should consider possible trade-offs including a loss of engagement.\n\nThe company did not carry out the proposed audit. Harris, at The Center for Humane Technology, did not immediately respond to a request for comment about whether he had discussions with the company about the study.\n\nBut Meta’s Crenshaw said the company’s researchers continued to research users’ potentially negative experiences on its platforms with the intention of improving them. She said Meta researchers have also met with other academics working in the space, including United Kingdom psychologists and digital psychology researchers Daria Kuss and Mark Griffiths, who were mentioned in the 2018 proposal along with Harris.\n\nSeveral months after the proposal, in May 2019, Metapublicly released a separate studyconducted by internal researchers entitled “Understanding Perceptions of Problematic Facebook Use.”\n\nThe 2019 public study, which involved a survey of 20,000 Facebook users, found that around 3% of US Facebook users experienced “problematic use,” defined as feeling a lack of control over their use and experiencing trouble with sleep, work or relationships because of the platform. Problematic use was highest among teens and young adults. The researchers concluded that Facebook should make it easier for people to take a break from the platform and consider reducing the frequency of notifications, especially for teens.\n\nIn 2021, Meta rolled out “take a break” reminders for teens on Instagram. It added parental control tools — including the option to set a time limit for scrolling — the following year. In 2024, Meta compiled many of its teen safety measures into “Teen Accounts,” which implements default privacy and safety settings for teens such as pausing notifications overnight.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction",
      "text": "testified in a Los Angeles courtroom"
    },
    {
      "url": "http://nytimes.com/2018/02/04/technology/early-facebook-google-employees-fight-tech.html",
      "text": "recently left his job"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/tech/social-media-addiction-trial-tobacco-moment",
      "text": "first of more than 1,500 lawsuits"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/tech/takeaways-mark-zuckerberg-testifiessocial-media-child-mental-health",
      "text": "objected"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/tech/social-media-youth-mental-health-lawsuit-meta-tiktok-snap-youtube",
      "text": "released earlier"
    },
    {
      "url": "https://research.facebook.com/publications/understanding-perceptions-of-problematic-facebook-use/",
      "text": "publicly released a separate study"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/tech/facebook-researchers-study-addictive-features",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/tech/facebook-researchers-study-addictive-features",
      "text": "Cookie Settings"
    }
  ],
  "hash": "36b9f9ba1c3949c2b9afd41d91a9552647a67f6ee13ae7ffe0a8ebc3a86c0fd2",
  "scraped_at": "2026-02-24T07:31:40.718741+00:00"
}