{
  "url": "https://lite.cnn.com/2026/02/15/politics/jeffries-midterms-gerrymandering-redistricting",
  "title": "Jeffries goes all in on gerrymandering — with House control on the line | CNN Politics",
  "date": "2026-02-16T07:34:26.075567+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAs Hakeem Jeffries sits in the minority of a GOP-controlled Washington, he is still haunted by a Republican gerrymandering gambit that he believes cost him the speaker’s gavel — and cost his party control of the House.\n\nThis time, he’s making sure Democrats fight back.\n\nJeffries is leading the Democratic party’s counterpunch toPresident Donald Trump’s aggressive mid-decaderedistricting push.He’s going all in with money, legal firepower and his own political capital to make sure no seat is left on the table for Democrats — forcing the party to abandon the left’s longtime moral opposition to party-line map meddling.\n\n“Republicans started this redistricting war, and Democrats have made clear, we’re going to finish it,” Jeffries said in an interview with CNN. “When they go low, we strike back.”\n\nTop Democrats, including Jeffries, are buoyed by signs of surging anti-Trump sentiment across the country —with special election wins even in ruby red parts of Texas— and believe they will capture the House, and possibly the Senate, in November. But Jeffries believes he can’t afford to ignore the GOP’s gerrymandering, when just three seats in North Carolina in 2024 were enough to cost Democrats the majority.\n\nAftera huge win on redistricting in California, Jeffries is vowing to spend “tens of millions” of dollars to push through an April ballot initiativein Virginiato potentially give Democrats four more seats. And he is now turning his attention to Maryland, where Democrats’ big gerrymandering gamble is facing its most difficult test yet. Jeffries and other top Democrats are now intensifying pressure on a key party leader, the 42-year-old Baltimorean who runs the state Senate, who refuses to help draw his party another more favorable seat that would target the state’s lone GOP-held congressional district.\n\nJeffries issued a stark warning to that Democrat, state Senate President Bill Ferguson — suggesting the move could help Trump’s GOP win the midterms.\n\n“One man shouldn’t stand in the way of the people of Maryland … being able to decide, ‘Should we go in this direction? Or should we not answer Donald Trump’s continued efforts to rig the midterm election?’” Jeffries said.\n\nIf Ferguson doesn’t back down, Jeffries vowed to personally apply the pressure: “At some point I’m going to have a conversation with him if he continues to stand in the way of an up-or-down vote.” CNN has reached out to Ferguson for comment.\n\nThe prevailing sentiment in the Maryland Senate Democratic Caucus, however, is one of skepticism. They insist a new map at this point would only backfire on Democrats.\n\n“It’s not a question of one man, but a caucus that measures the risk calculation differently given recent past experience,” a person close to the Maryland Senate Democratic Caucus told CNN.\n\nWhile the caucus agreed with Jeffries that fighting Trump should the top goal, this person added: “Unfortunately, mid-cycle redistricting in Maryland would have the opposite impact and likely backfire in the state courts, giving Trump and the GOP even more seats in Congress.”\n\nTop Democrats, including Jeffries, never expected a mid-decade redistricting push to be the centerpiece of their midterms strategy. It’s expensive and legally fraught with plenty of political pitfalls. Already, Jeffries and Illinois Gov. JB Pritzker struggled to find support for a mid-decade map redraw in blue Illinois. (With early voting already underway in Illinois, Jeffries’ allies insist the state could still be muscled to act, if necessary, such as if the Supreme Court strikes down part of the Voting Rights Act and creates what one Democratic operative called “a worst-case-scenario” for the party.)\n\nDemocrats say they were dragged into the redistricting fight by Trump and the GOP, who kicked offthe redistricting arms race last year in Texas.Now, as many Democrats see it, it’s the new future of House campaigning.\n\nJeffries and his team are already looking ahead to states like Washington, Colorado and even Pennsylvania for the 2028 cycle, according to multiple people familiar with party strategy. In their minds, it’s not just the path to the House majority this year, it’s the way to hold onto it.\n\n“(Trump) wanted to rig the midterm elections, and for whatever the reason, didn’t think that Democrats were going to forcefully respond. He got that wrong,” Jeffries said.\n\nJust months after the GOP’s Texas effort, Democrats believe they are on track to gain as many as five seats in California, one in Utah and several in Virginia — moves that could nearly neutralize the GOP’s own gerrymandering push. Another seat could be coming in New York if a court challenge goes their way.\n\nRepublicans, meanwhile, have enacted new congressional maps in four states, targeting nine House seats held by Democrats. (One seat in Missouri, though, is still tied up in courts.) A big push in Florida is still to come.\n\nJeffries, though, believes it could end up as a wash.\n\n“The best-case scenario for Republicans at this point is status quo, which is very different than what they were claiming when they were beating on their chest last year, saying they were going to gerrymander our opportunities out of existence,” Jeffries said.\n\nBoth parties are closely watching another big state fight: Virginia.\n\nNewly elected Gov. Abigail Spanberger and state Democrats are pursuing a strategy so aggressive that it’s surprised even some Democrats in Washington. They are looking to eliminate as many as four GOP seats, transforming their House delegation — which has six Democrats and five Republicans — into one with 10 Democrats and just one Republican.\n\nThat’s all in a state where Kamala Harris won by about 6 points.\n\nJeffries told CNN he is willing to devote “tens of millions of dollars” to make sure Democrats are successful on the ballot in April. (House Majority Forward, a group linked to Jeffries, committed $5 million last week, and it is expected to spend more before April, the group told CNN.)\n\nDemocrats are much more anxious about neighboring Maryland, where Jeffries and others are ratcheting up pressure on the state Senate president to yield in time.\n\nIt may not be enough. Ferguson and others in the caucus are insisting there is no path forward, both publicly and privately, according to interviews with a half-dozen people closely tracking the state’s push.\n\n“At the end of the day, if he won’t bring it to a vote, there’s not much you can do about that,” Rep. Glenn Ivey, a Maryland Democrat, told CNN.\n\nIvey said he personally wouldn’t have chosen this path if Trump hadn’t forced Democrats’ hand, adding: “It’s an awful game.”\n\nBut Ivey, like many others, is deeply anxious about what could happen if blue-leaning Maryland ignores what GOP leaders in Texas, Florida, North Carolina and other states are doing.\n\n“We better not lose the House by one seat,” Ivey said.\n\nFerguson and other skeptics believe a new Democratic map in Maryland would not survive the courts and could ultimately backfire. Andy Harris, the GOP lawmaker who stands to lose the seat if Democrats redraw the maps, predicted that Republicans could actually gain a seat if Democrats moved forward — with a court forcing them to redraw in favor of the GOP.\n\n“We’ll get a second seat. That’s why the Senate president doesn’t want to do it,” Harris said in an interview with CNN.\n\nBut Jeffries was blunt when asked about a new map backfiring on Democrats: “That’s not going to happen.”\n\nTop Democrats believe they can still win back the House even without that single additional seat in Maryland. But they don’t want to take the gamble.\n\nAsked if Ferguson’s move could cost Democrats a possible majority, Jeffries said: “Well, he’d have to live with that.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2025/11/17/politics/indiana-redistricting-trump",
      "text": "redistricting push."
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/texas-state-senate-special-election-taylor-rehmet",
      "text": "with special election wins even in ruby red parts of Texas"
    },
    {
      "url": "https://www.cnn.com/2025/08/21/politics/california-democrats-redistricting-plan",
      "text": "a huge win on redistricting in California"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/virginia-redistricting-election-supreme-court",
      "text": "in Virginia"
    },
    {
      "url": "https://www.cnn.com/2025/08/23/politics/texas-republicans-approve-new-congressional-maps-as-partisan-redistricting-race-escalates",
      "text": "the redistricting arms race last year in Texas."
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/jeffries-midterms-gerrymandering-redistricting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/politics/jeffries-midterms-gerrymandering-redistricting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "36c558870c6ae755b8bbf2ed188d21a10a1520acb74c25772035cebdb3597700",
  "scraped_at": "2026-02-16T07:34:26.075581+00:00"
}