{
  "url": "https://lite.cnn.com/2026/02/16/us/pawtucket-rhode-island-shooting",
  "title": "Shooting at youth hockey game in Pawtucket, Rhode Island, leaves 2 dead, 3 injured | CNN",
  "date": "2026-02-17T07:29:53.756288+00:00",
  "authors": [
    "Elise Hammond",
    "Mark Morales",
    "Danya Gainor",
    "Amanda Musa",
    "CNN"
  ],
  "text": "Source: CNN\n\nA hockey game was violently interrupted Monday when the sound of gunfire echoed inside a packed ice rink in Rhode Island, leaving at least two people dead and three others injured, police said.\n\nThe suspected shooter, who police say took their own life after opening fire, appeared to target family members during the incident, two law enforcement officials who have been briefed on the situation tell CNN. Police have said the investigation is ongoing.\n\nPolice identified the suspected shooter as Robert K. Dorgan, who Pawtucket Police Chief Tina Goncalves said went by the name of Roberta Esposito.\n\nThe latest spasm of gun violence comes just two months after a shooting at Brown University, a few miles south, left Rhode Island shaken and underscored the vulnerability of trusted community spaces.\n\nThe shooting appeared to unfold behind one of the team’s benches in the middle of play, video from the youth-sports streaming service LiveBarn shows. In the footage, aired by CNN affiliate WJAR, players from both teams are seen taking cover as at least a dozen shots are fired, with players and coaches rushing for the gates leading out of the rink’s benches.\n\nSome of the high-school-aged skaters joined the players on the ice, leaping into the rink amid the sound of shots, charging toward a door on the opposite side which leads to the locker room, according to WJAR. Another person tried to disarm the shooter in the stands, Sen. Jack Reed of Rhode Island saidon social media.\n\nThe good Samaritan’s efforts are “probably what led to a swift end of this tragic event,” Goncalves said at a news conference Monday evening.\n\nThe three injured people are in critical condition at Rhode Island Hospital with gunshot wounds, the hospital system said. It is the same facility where victims in the shooting at Brown University were treated.\n\nPolice are working to put together a timeline of what happened before they responded to the facility at 2:30 p.m. Monday, Goncalves said.\n\nIt was the 41st mass shooting across the US in the first 47 days of the year, according to the Gun Violence Archive.\n\n“This kind of violence, especially in a place meant for families and youth, is devastating,” Providence Mayor Brett Smiley said in apost on X.\n\nTwo teams made up of students from multiple schools were playing in hockey games at the arena, according to school officials. North Providence, which is involved with one of the co-op teams, told CNN the shooting involved spectators and happened around the start of the first period.\n\n“Fortunately, all students involved in the game are safe,” Superintendent Joseph B. Goho said. North Providence previously said, “Preliminary information indicates the incident may have involved parent(s) of NP student(s).”\n\nMeanwhile, Coventry, another school, said all its students have been accounted for. Saint Raphael Academy also said none of its students were hurt, according to WJAR.\n\nRhode Island lawmakers decried this latest instance of gun violence. Rep. Gabe Amo said in astatement on Xthat “an ice arena should be a safe place for kids and families to come together. It’s horrible that the memory of these teams’ high school hockey Senior Night, with families from across Rhode Island, will be a tragedy.”\n\nSen. Sheldon Whitehouse said the incident is “more unnecessary horror for kids,” in apost on X. Sen. Jack Reed also posteda statement, saying, “children and families should be safe at a youth sporting event, not subject to gun violence.”\n\nThe arena is about 5 miles north of Brown University’s Barus and Holley engineering building in Providence, where a 48-year-old man opened fire in December, killing two students and wounding nine other people.\n\nAgents from the Bureau of Alcohol, Tobacco, Firearms and Explosives responded in assisting local law enforcement, an agency spokesperson tells CNN.\n\nRhode Island State Police were also working with local agencies, according toGov. Dan McKee. Providence Police also had officers assisting, it said in apost on X.\n\n“I am praying for Pawtucket and everyone involved,” McKee said on X.\n\nCNN’s Aaron Eggleston contributed to this report.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/SenJackReed/status/2023526575291924642?s=20",
      "text": "on social media"
    },
    {
      "url": "https://x.com/PVDMayor/status/2023514690903531529",
      "text": "post on X"
    },
    {
      "url": "https://x.com/RepGabeAmo/status/2023551192060883062?s=20",
      "text": "statement on X"
    },
    {
      "url": "https://x.com/SenWhitehouse/status/2023548216940392928?s=20",
      "text": "post on X"
    },
    {
      "url": "https://x.com/SenJackReed/status/2023526575291924642?s=20",
      "text": "a statement"
    },
    {
      "url": "https://x.com/GovDanMcKee/status/2023494517509521754",
      "text": "Gov. Dan McKee"
    },
    {
      "url": "https://x.com/ProvidenceRIPD/status/2023498824128639353?s=20",
      "text": "post on X."
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/pawtucket-rhode-island-shooting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/us/pawtucket-rhode-island-shooting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "36f09c5cfde2c88660b2af163c969c14c622813c36cad8b6ef15ef25680bb115",
  "scraped_at": "2026-02-17T07:29:53.756302+00:00"
}