{
  "url": "https://lite.cnn.com/2026/02/13/politics/virginia-redistricting-election-supreme-court",
  "title": "Virginia redistricting election will go forward while court considers appeal | CNN Politics",
  "date": "2026-02-15T07:11:59.779561+00:00",
  "authors": [],
  "text": "Source: AP\n\nVirginia voters will get to cast ballots on acongressional redistricting planbenefiting Democrats while a court battle plays out over the legality of the effort.\n\nThe Virginia Supreme Court said Friday that a statewide referendum can be held April 21 on whether to authorize mid-decade redistricting, and the court will decide sometime later whether the plan is legal.\n\nDemocrats celebrated the green light for the election. But the court’s schedule raises the possibility that it could all be for naught, if the Supreme Court ultimately upholdsa lower court rulingthat the mid-decade redistricting amendment is invalid.\n\nVirginia Democrats hold six of the state’s 11 US House seats, but they are backing arevised mapthat could help them win up to 10 seats in this year’s midterm elections. The new districts are a key part of Democrats’ national strategy to try to offset potential Republican gains in several other states that redrew their districts last year at the urging of President Donald Trump.\n\nThe Republican president is trying to preserve a narrow GOP majority in the House against political headwinds that typically blow against the party in power in midterm elections.\n\nBefore Virginia Democrats can implement new congressional districts, they need voter approval to temporarily set aside a constitutional provision that places redistricting authority with a bipartisan commission and instead grant that power to the General Assembly. Lawmakers endorsed a constitutional amendment allowing their mid-decade redistricting last fall, then passed it again in January as part of a two-step process that requires an intervening election in order for an amendment to be placed on the ballot.\n\nBut Tazewell Circuit Court Judge Jack Hurley Jr. last month struck down the General Assembly’s actions on three grounds. The judge ruled that lawmakers failed to follow their own rules for adding the redistricting amendment to a special session.\n\nHurley also ruled that the General Assembly’s initial vote for the amendment failed to occur before the public began casting ballots in last year’s general election and thus didn’t count toward the two-step process. And he ruled that the state failed to publish the amendment three months before the election, as required by law. As a result of those issues, he said, the amendment was invalid and void.\n\nDemocrats appealed the decision to the state Supreme Court, which agreed on Friday to consider the case while stating that a narrowly tailored injunction by the lower court doesn’t prevent the April referendum. The court directed initial briefs to be filed by March 23, with the last round of court filings due April 23. Any oral arguments would be scheduled for later, the court said.\n\nNationwide, the redistricting battle has resulted so far in nine more seats that Republicans believe they can win in Texas, Missouri, North Carolina and Ohio, and six that Democrats think they can win in California and Utah. Democrats have hoped to make up that three-seat margin in Virginia, though the lower court ruling raised a hurdle to their plans. It’s unclear whether the redistricting efforts in various states ultimately will make any difference in determining control of Congress in the November election.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/state-redistricting-maps-vis",
      "text": "congressional redistricting plan"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/politics/virginia-democrats-redistricting-setback",
      "text": "a lower court ruling"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/virginia-redistricting-democrats-spanberger",
      "text": "revised map"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/virginia-redistricting-election-supreme-court",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/virginia-redistricting-election-supreme-court",
      "text": "Cookie Settings"
    }
  ],
  "hash": "36fb1b52cc7108941f50a02c22fbd79e1461936248050ad82b8b93be488c30f8",
  "scraped_at": "2026-02-15T07:11:59.779574+00:00"
}