{
  "url": "https://lite.cnn.com/2026/02/10/politics/analilia-mejia-democratic-primary-new-jersey",
  "title": "Analilia Mejia will win New Jersey special primary after rival concedes and blames AIPAC for ad barrage | CNN Politics",
  "date": "2026-02-12T21:32:22.626555+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAnalilia Mejia will win the special primary in New Jersey’s 11th Congressional District in a tight race over former Rep. Tom Malinowski, a major win for an ally of Sen. Bernie Sanders and other progressives.\n\nMalinowski conceded on Tuesday in a statement in which he gave Mejia “unequivocal credit for running a positive campaign and for inspiring so many voters on Election Day.”\n\nNotably, Malinowski blamed the American Israel Public Affairs Committee, which helped fund a group that spent roughly $2 million on ads targeting him. The group, United Democracy Project, sought in its ads to portray Malinowski as supportive of US Immigration and Customs Enforcement, pointing to a 2019 vote for a bipartisan spending bill that provided funding to the agency.\n\n“I wanted so much to be able to tell you today that this effort, which was meant to intimidate Democrats across the country, failed in NJ-11,” Malinowski said in his statement. “But the huge difference between the early vote, which we were winning comfortably, and the Election Day vote, suggests that it had a major effect. I met several voters in the final days of the campaign who had seen the ads and asked me, sincerely: ‘Are you MAGA? Are you for ICE?’”\n\nThursday’s primary to replace now-Gov. Mikie Sherrill was seen as an early testing ground for the debates that will shape the Democratic push to retake the US House in this year’s midterms.\n\nA win by Mejia, who served as political director on Sen. Bernie Sanders’ 2020 presidential campaign, is a major success for national progressive leaders who had backed her run, like Sanders as well as Massachusetts Sen. Elizabeth Warren and New York Rep. Alexandria Ocasio-Cortez. Mejia was the former head of the Working Families Alliance in New Jersey and is currently serving as one of the executive directors of Popular Democracy, a network of grassroots organizations.\n\n“Like many Democrats in this moment, I am not only appalled at MAGA, at Trumpism, at Donald Trump’s administration – their overreach, their corruption, their blatant hypocrisy – but I’m also ticked off at my own Democratic leadership,” she told CNN during the campaign.\n\nMalinowski is a moderate who had been supported in the past but expressed openness for conditioning aid to Israel as the national Democratic Partyshows more skepticismabout the Israeli government in the wake of its offensive followingHamas’ October 7, 2023, attacks.\n\nMejia, meanwhile, was the only person at a candidate forum who raised her hand when asked if she agreed with human rights groups that say Israel has committed a genocide in Gaza.\n\nIn a press conference Tuesday afternoon, Mejia condemned AIPAC’s role in the race, calling it “horrendous.”\n\n“I think that it is part of their brand to take – to misconstrue facts, to confuse voters and to try to create division just so that they can get what they have explicitly stated they desire, which is a blank, unquestioned submission,” she said.\n\nShe later added that although she felt AIPAC “did play a role in this race – confusing, rejecting, misinterpreting, I’m sure – what they didn’t do was win this for us.”\n\nA source close to AIPAC told CNN that there was concern that Malinowski, with his profile, seniority, and likelihood of a long career, would be worse for Israel allies than a progressive in Mejia who they see as less influential.\n\nThe source also says they are assessing closely whether to spend money and run ads again in the district in June, when there will be a primary for the next two-year term, or in the November general election.\n\nUnited Democracy Projectlaunched a new ad campaignin Illinois’ 7th District backing Melissa Conyears-Ervin.\n\nTrailing the top two vote-getters in New Jersey were former Lt. Gov. Tahesha Way and Essex County commissioner Brendan Gill, among a ballot of more than a dozen Democratic primary candidates.\n\nMeija will face Republican Randolph Township councilman Joe Hathaway, who ran unopposed, in the general election on April 16, and will be favored in a district that voted for former Vice President Kamala Harris by nearly nine percentage points in 2024.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/07/18/politics/cnn-poll-israel-support",
      "text": "shows more skepticism"
    },
    {
      "url": "https://www.cnn.com/2024/10/07/middleeast/israel-anniversary-october-7-hamas-attacks-intl-latam",
      "text": "Hamas’ October 7, 2023, attacks"
    },
    {
      "url": "https://host2.adimpact.com/admo/viewer/ed8de6cd-bbec-4130-92b3-ce99a6539ab8/",
      "text": "launched a new ad campaign"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/analilia-mejia-democratic-primary-new-jersey",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/analilia-mejia-democratic-primary-new-jersey",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3736f47efaf5723fcbbd1209ba270027d58eed301b4c724e07d409ff5f9893d3",
  "scraped_at": "2026-02-12T21:32:22.626568+00:00"
}