{
  "url": "https://lite.cnn.com/2026/02/10/us/expert-analysis-video-nancy-guthrie",
  "title": "What stands out to experts about the surveillance video in the Nancy Guthrie case | CNN",
  "date": "2026-02-13T07:31:08.143485+00:00",
  "authors": [],
  "text": "Source: CNN\n\nVideo and images showing anarmed, masked individualoutside the Tucson, Arizona, home of Nancy Guthrie have given new life to the search for the 84-year-old – and may offer investigators important clues about the subject’s identity.\n\nThe imagery released by the FBI on Tuesday is the biggest break so far in the case of themissing mother of “Today” show anchor Savannah Guthrie. They were captured by Guthrie’s Nest-made doorbell camera and recovered thanks to technical expertise provided by Google, a person familiar with the investigation toldCNN’s Brian Stelter.\n\nInvestigators’ goal in sharing the imagery, experts say, is to engage the public in hopes someone will recognize the individual and provide a crucial tip that could solve the mystery of the suspected abduction of Guthrie in the early morning hours of February 1.\n\nOn Thursday,the FBIcalled the person in the video a “suspectin the kidnapping of Nancy Guthrie,” and said he is approximately 5’9” or 5’10” tall.\n\nThe Pima County Sheriff’s Department said it received more than 4,000 tips in the 24 hours since the surveillance photos and videos were released to the public.\n\nMeanwhile, the department has asked Guthrie’s neighbors to submit any video footage that includes cars, traffic, people or pedestrians, and anything they feel may be out of the ordinary or important for law enforcement to review as they investigate Guthrie’s disappearance.\n\nHere’s what stands out to law enforcement experts about the footage and images of the armed, masked individual:\n\nThe subject seen in the images is armed, carrying what appears to be a pistol in a holster at the waist. But some experts said the holster and its placement at the individual’s groinarea suggest this person lacks proficiency with firearms.\n\n“In my opinion, this is not someone, first of all, who was ever trained to carry a gun,” said CNN Senior Law Enforcement Analyst Andrew McCabe, former deputy director of the FBI.\n\n“No person with law enforcement or military training would ever carry a firearm in a holster like that, right where that is at almost the center of his body, hanging off of his belt there,” he said. “It’s not very tactically sound for a lot of reasons.”\n\nSteve Moore, a retired FBI supervisory special agent, similarly said the holster and gun did not appear to be appropriately paired.\n\n“It’s kind of ridiculous,” Moore said. “He’s got a small, semiautomatic pistol meant for concealment that he could have put in his pocket, but instead he’s holstering it in a holster made for a large-frame revolver. They don’t even match.”\n\nThe images also show the individual covered head to toe, wearing a mask, gloves, a jacket and long pants in addition to the holster and backpack.\n\nCNN senior correspondent Josh Campbell, a former FBI agent, said the individual’s garb “could have been a purposeful attempt to try to prevent leaving behind any DNA at the scene, from skin or hair fibers, as well as fingerprints.”\n\nEach of the subject’s items will be scrutinized, Campbell said, in hopes of determining its brand and thus where the item might be sold.\n\n“In past cases,” he said, “authorities have canvassed places like clothing and hardware stores in order to determine if employees may have recognized a possible subject (from) when the items were purchased.”\n\nThe backpack appears to be an Ozark Trail Hiker Pack, part of Walmart’s private-label outdoor brand,according to a CNN analysis.\n\nInvestigators recovered a black glove about a mile and a half from Guthrie’s home, according to theNew York Post. The sheriff’s departmentsaidThursday investigators had found “several items of evidence, including gloves.”\n\nIt isnot clearwhether authorities believe they are the same gloves worn by the person in the doorbell camera footage.\n\nIf it is the same glove, though, investigators willtry to recover DNA, fiber, hair and traces of a plant that was used to cover up the camera, CNN’s chief law enforcement and intelligence analyst John Miller said.\n\nThe video specifically offers a key insight that the still images can’t: How the individual moves.\n\nThe footage shows the subject walking around outside as they approach Guthrie’s home  and try to obstruct the camera. While the movement may not be an obvious cue to strangers, experts say it could be recognizable to someone who knows the person.\n\n“We recognize people more by the way that they move than by visual cues, often,” said Josh Schirard, a former SWAT commander. “Understanding how they’re moving, seeing them walk back and forth, is definitely a great way to recognize someone that you might know,” even when other distinctive features may be obscured.\n\nOther experts said the subject’s movement could illustrate a lack of urgency. McCabe said the individual’s approach was “not particularly furtive or concerned.”\n\nBryanna Fox, a former FBI agent, similarly said the individual “almost saunters up like that’s his house.”\n\nThere is “a lack of concern that he’s going to be caught,” she said.\n\n“He still has this kind of air of bravado, that he’s going to be able to get away with this.”\n\nThe video released by the FBI is brief and doesn’t show much in the way of action. But it does capture the subject’s apparent attempts to cover the camera outside Guthrie’s home.\n\nThe person appears to first try obstructing the lens with their gloved hand. Then, the individual steps back, seemingly searching the ground. The person ultimately picks up a piece of shrubbery from the yard, then uses the foliage to try to cover the camera.\n\n“This does raise questions about his sophistication and any pre-planning,” said Campbell, the CNN correspondent. “If he had actually conducted surveillance on the home and saw a camera, he would have brought with him means of obstructing it.”\n\nAsked about the attempt to cover the camera with shrubbery, Moore said it suggested the purported abduction of Nancy Guthrie was “highly premeditated and very poorly planned,” adding he believes “this is the first time he’s ever done something like this.”\n\n“What this strikes me as is somebody who doesn’t know what he doesn’t know,” Moore said.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/video/nancy-guthrie-surveillance-video-fbi-digvid",
      "text": "armed, masked individual"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-10-26",
      "text": "missing mother of “Today” show anchor Savannah Guthrie"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-10-26?post-id=cmlh3g26s000k356ptjohcwxg",
      "text": "CNN’s Brian Stelter."
    },
    {
      "url": "https://x.com/FBIPhoenix/status/2022084453699350981",
      "text": "the FBI"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-12-26?post-id=cmlk0st9b000d356rois09oqh",
      "text": "suspect"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-11-26?post-id=cmlil211l00003b6qy58q39nb",
      "text": "according to a CNN analysis"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-11-26?post-id=cmlim2rj700053b6qv865e28q",
      "text": "New York Post"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-12-26?post-id=cmljpzgw800003b6px0r5fjwp",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-11-26?post-id=cmlif1ar70005356pd5ntw412",
      "text": "not clear"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-11-26?post-id=cmlif1ar70005356pd5ntw412",
      "text": "try to recover DNA"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/expert-analysis-video-nancy-guthrie",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/us/expert-analysis-video-nancy-guthrie",
      "text": "Cookie Settings"
    }
  ],
  "hash": "39101420cc45206cd706a54f1f54617c8fb3102aae1580bc3d4a2c017e5c442b",
  "scraped_at": "2026-02-13T07:31:08.143499+00:00"
}