{
  "url": "https://lite.cnn.com/2026/02/27/tech/social-media-addiction-trial-plaintiff-testimony-meta-youtube",
  "title": "What social media addiction looks like, according to the woman suing Meta and YouTube | CNN Business",
  "date": "2026-02-28T06:59:51.742661+00:00",
  "authors": [
    "Clare Duffy",
    "Samantha Delouya"
  ],
  "text": "Source: CNN\n\nKaley started using YouTube at the age of 6, downloading the app on her iPod Touch to watch videos about lip gloss collections and the online kids game Animal Jam. She posted her first video when she was 8 — in it, she played Animal Jam as an otter character, singing in a put-on British accent.\n\nA year later, she downloaded and began posting on Instagram, circumventing a guardrail her mom had tried to set up to block her from the app.\n\nShe says she became addicted. She started staying up late and sneaking out of class to scroll YouTube and Instagram.\n\nWithin several years Kaley says she began cutting herself to cope with depression, one of a number of mental health challenges she claims were caused or exacerbated by anaddiction to social media.\n\nKaley, now 20, described ongoing struggles with social media before a Los Angeles jury on Thursday,part of a lawsuitfrom her and her mother against Meta and YouTube. It marks the first time the public has gotten to hear directly from the young woman at the heart of a case that could set a precedent for hundreds of lawsuits accusing tech platforms of intentionally addicting and harming young users.\n\n“Anytime I would try to set limits for myself, I couldn’t,” said Kaley, who is being referred to in court by only her first name because her claims relate to incidents that took place while she was a minor.\n\nMeta and YouTube have denied her claims and objected to the idea that social media can be “addictive.” YouTube has contested the amount of time Kaley says she spent on the platform; Meta has argued her upbringing is responsible for her mental health challenges.\n\nBoth companies say they’ve invested heavily in youth safety features such as parental controls and safety settings for teens, although many of those measures were not in place in Kaley’s early years using the platforms.\n\nBy the time she was 10, Kaley had uploaded 200 videos to YouTube. She also created multiple accounts so it would appear her videos had more likes and urged her mom and sister to like her videos, too.\n\nWhen her videos received little reaction, “it made me feel like I shouldn’t have posted or that it was stupid, or I looked bad,” she said. Losing subscribers made her feel “not worthy.”\n\nDespite bullying Kaley said she experienced on YouTube, she didn’t leave the platform because the idea “bothered me more than the comments.” She once turned off notifications, but that didn’t last, saying, “”I wanted to see what people were saying or who was liking my video.”\n\nYouTube’s autoplay feature also often kept Kaley on the app longer than she intended.\n\n“I would say okay I’m going to get off after that, but then it would autoplay and I would be on for hours,” she said. She added, “I was on it from a young age and I would spend all my time on it,” and would often sneak onto YouTube on her phone in class.\n\nYouTube argues that records from Kaley’s logged-in account show she used it for only a short time each day. The company’s attorney, Luis Li, said in court that Kaley “is not addicted to YouTube and never has been … the data proves she spent little more than a minute a day using the very features her lawyers claim are addictive.”\n\nBut Kaley’s attorney, Mark Lanier, has argued that, like many kids, she spent much of her time using the platform logged out, including her first two years on YouTube.\n\nLanier showed an undated YouTube video showing Kaley, who looked to be in her early teens, walking viewers through her “night routine.” In it, she scrolls her phone in bed, gets up to shower and take off her makeup, and then gets back in bed to scroll Instagram. Kaley testified her current nighttime routine still looks similar.\n\nKaley alleges that she used Instagram from age 9 to 13 without her mom knowing. She said she was using a hand-me-down phone that had already had Instagram downloaded once before, allowing her to bypass a restriction that required her mom to type a password before she could get a new app.\n\nShe testified that she’d open the app “first when I woke up” and again before bed, sometimes sneaking to use it during the night.\n\nLike on YouTube, Kaley set up multiple accounts to help feed her desire for more likes. She also used an app that promised to use bots to provide more likes on photos, she said.\n\nShe also discussed her use of Instagram’s “beauty” filters — which can manipulate a user’s face to make it appear that they’re wearing makeup or, for example, that their eyes are bigger or nose is smaller. Kaley claims the filters contributed to body dysmorphia, a struggle that she said even today leads her to spend 3 to 4 hours on her appearance each morning.\n\n“At one point, almost all my photos had a filter on,” she said.\n\nLanier showed the jury an Instagram post of Kaley and her friends captioned: “We look horrible, just put a filter on it.”\n\nEarlier on Wednesday, Kaley’s former therapist, Victoria Burke, testified that she had once asked Kaley what her “miracle day” would be — what would have to happen for her to have her best-case-scenario life. Kaley responded that she would be prettier, no chubby cheeks, no lines.\n\n“I just felt like I wanted to be on it all the time and if I wasn’t on it, I felt like I was going to miss out on something,” she said of Instagram.\n\nMeta has argued that it was Kaley’s difficult childhood — an abusive father, a combative relationship with her mother — that is responsible for her mental health challenges, not social media. “The evidence will show (Kaley) faced many significant, difficult challenges well before she ever used social media,” a Meta spokesperson previously told CNN.\n\nDuring her testimony, Kaley was asked about posts in which she said her “mental health is so bad” because of her mom. But while Kaley acknowledged that they once had a difficult relationship, she testified she now believes her mom was doing her best to raise her in a tough situation. Social media, she said, contributed to her struggles by coopting her attention and alienating her from friends, family and hobbies.\n\nKaley contemplated suicide while “dealing with feeling insecure about myself, feeling socially withdrawn and just feeling really depressed and anxious,” she said.\n\nUltimately, she said, her life would be better without social media. But the platforms continue to have a pull; Kaley told the jury she still sneaks to the bathroom during work to scroll on the apps and she’s considering a career in social media marketing.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/23/tech/facebook-researchers-study-addictive-features",
      "text": "addiction to social media"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/tech/social-media-addiction-trial-tobacco-moment",
      "text": "part of a lawsuit"
    }
  ],
  "hash": "3945693724234ee4a0fc1c499f21582402626bb696b11080025e9091c424db28",
  "scraped_at": "2026-02-28T06:59:51.742673+00:00"
}