{
  "url": "https://lite.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
  "title": "Rep. Tony Gonzales denies allegations that he had an affair with an aide who later died by suicide | CNN Politics",
  "date": "2026-02-23T07:38:30.691349+00:00",
  "authors": [
    "Piper Hudspeth Blackburn, CNN"
  ],
  "text": "Source: CNN\n\nUS Rep. Tony Gonzales of Texas is denying that he had an affair with a staffer who died by suicide last year, allegations that have gained new traction in the final days before a March 3 primary election.\n\nAttorney Bobby Barrera, who represents Adrian Aviles, said his client’s spouse, Regina Ann Santos-Aviles, had confessed that she had been having an affair with Gonzales in June   2024.\n\nGonzales denies having had the affair and says he’s being blackmailed.\n\nSantos-Aviles, a former staffer in Gonzales’ district office in Uvalde, Texas, died in September,according to CNN affiliate KENS.The county medical examiner ruled that she died of self-immolation and listed her manner of death as suicide.\n\nBarrera added that Santos-Aviles in 2024, showed text messages to her husband that revealed the extent of the affair. While Barrera described the messages as “substantial,” “graphic” and “detailed about the sexual relationship” that allegedly occurred between Santos-Aviles and Gonzales, he said it was up to Aviles to release the messages because of their sensitive nature.\n\nGonzales is in the midst of a tough GOP primary fight against Brandon Herrera, a YouTube personality who ran against him in 2024. Gonzales, who beat Herrera in a runoff two years ago by 354 votes, insists that Herrera is behind the reports of an affair.\n\nIn November, the lawmaker dismissedrumors of an affair in an interviewwith Punchbowl News and said the “rumors are completely untruthful.”\n\nHe told CNN in a statement Thursday: “Ms. Santos-Aviles was a kind soul who devoted her life to making the community a better place. Her efforts led to improvements in school safety, healthcare, and rural water like never before. It’s shameful that Brandon Herrera is using a disgruntled former staffer to smear her memory and score political points, conveniently pushing this out the very day early voting started. I am not going to engage in these personal smears and instead will remain focused on helping President Trump secure the border and improve the lives of all Texans.”\n\nCNN has reached out to Herrera for comment. In apost on Xthis week, Herrera wrote: “You blame me? Are you kidding me?”\n\n“Tony Gonzales is an irredeemable coward, who dodges accountability and lies to the people,” Herrera added. “This started with my problems with your votes in Congress, but now I understand you are a horrifically wicked man who must be removed.”\n\nThe allegations from the attorney for Santos-Aviles’ husband follow a report in theSan Antonio Express-Newsthat said Santos-Aviles told a former employee of Gonzales’ district office, whom she worked closely with, about the affair. The San Antonio Express-News spoke with the unnamed former employee and cited a text message from Santos-Aviles in which she said she was having an “affair with our boss.”\n\nBarrera told CNN that Adrian Aviles did not originally want to go public with his allegations but did so following the report, because he did not like that Gonzales had denied the   alleged affair.\n\n“Tony is out there in the public domain telling people that never happened, that it’s a false, politically hacked campaign against him, which Adrian knew was not true. That’s why Adrian spoke out when he did finally,” he said.\n\nGonzales, in a Thursday post on X, also accused Barrera of blackmailing him. “I WILL NOT BE BLACKMAILED. Disgusting to see people profit politically and financially off a tragic death,” he wrote. The congressman included a screenshot of an email from Barrera offering to engage in settlement talks with a non-disclosure agreement – saying it is not his intention to damage the congressman’s career by filing a claim.\n\nBarrera called Gonzales’ post  “a desperate act by a desperate man.”\n\n“The assertion of extortion is ridiculous,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.ksat.com/news/ksat-investigates/2026/02/19/i-will-not-be-blackmailed-rep-gonzales-accuses-former-aides-husband-of-trying-to-profit-from-wifes-death-affair/",
      "text": "according to CNN affiliate KENS."
    },
    {
      "url": "https://www.texastribune.org/2026/02/18/tony-gonzales-staffer-fire-affair-text-brandon-herrera/",
      "text": "rumors of an affair in an interview"
    },
    {
      "url": "https://x.com/TheAKGuy/status/2024193605494088064",
      "text": "post on X"
    },
    {
      "url": "https://www.expressnews.com/news/article/tony-gonzales-affair-regina-santos-aviles-21357720.php",
      "text": "San Antonio Express-News"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
      "text": "Cookie Settings"
    }
  ],
  "hash": "395069f24215785837c63ab9b4b7810e471b74d48aef3b020dd8877648d480c4",
  "scraped_at": "2026-02-23T07:38:30.691361+00:00"
}