{
  "url": "https://lite.cnn.com/2026/02/13/us/minneapolis-ice-shooting-investigation",
  "title": "ICE officers on leave while feds investigate the shooting of a Venezuelan man in Minneapolis | CNN",
  "date": "2026-02-14T07:07:20.115780+00:00",
  "authors": [],
  "text": "Source: AP\n\nFederal authorities have opened a criminal probe into whether two immigration officers lied under oath about the shooting of a Venezuelan man in Minneapolis last month.\n\nImmigration and Customs Enforcement Director Todd Lyons said Friday that his agency had opened a joint probe with the Justice Department after video evidence revealed “sworn testimony provided by two separate officers appears to have made untruthful statements.” The announcement came as a federal judge ordered all charges dropped against Julio Cesar Sosa-Celis, who was shot in the leg by an immigration officer, as well as another Venezuelan man, Alfredo Alejandro Aljorna.\n\nThe officers, who were not named, have been placed on administrative leave pending the completion of an internal investigation, he said.\n\n“Lying under oath is a serious federal offense,” said Lyons, adding that the U.S. Attorney’s Office is actively investigating.\n\nLyons said at the conclusion of the investigation, the officers may face termination of employment, as well as potential criminal prosecution.\n\n“The men and women of ICE are entrusted with upholding the rule of law and are held to the highest standards of professionalism, integrity, and ethical conduct,” Lyons said. “Violations of this sacred sworn oath will not be tolerated. ICE remains fully committed to transparency, accountability, and the fair enforcement of our nation’s immigration laws.”\n\nThe dismissal of the charges against Aljorna and Sosa-Celis follows a string ofhigh-profile shootingsinvolving federal immigration agents in which eyewitness statements andvideo evidencehave called into questionclaims made to justify using deadly force. Dozens offelony cases against protestersaccused of assaulting or impeding federal officers have also crumbled.\n\nIn a highly unusual motion to dismiss filed Thursday, U.S. Attorney for the District of Minnesota Daniel N. Rosen said “newly discovered evidence” was “materially inconsistent with the allegations” made against Aljorna and Sosa-Celis in a criminal complaint and at a hearing last month.\n\nU.S. District Court Judge Paul A. Magnuson dismissed the case with prejudice, meaning the charges cannot be resubmitted.\n\nA lawyer for Aljorna and Sosa-Celis said Friday they are “overjoyed” that all the charges have been dismissed. Had they been convicted, the two immigrants would have faced years in federal prison.\n\n“The charges against them were based on lies by an ICE agent who recklessly shot into their home through a closed door,” said attorney Brian D. Clark. “They are so happy justice is being served.”\n\nIt is unclear whether the men could still be deported.\n\nAn FBI investigator said in an affidavit that U.S. Immigration and Customs Enforcement officers attempted to conduct a traffic stop in Minneapolis on a vehicle driven by Aljorna on January 14. He crashed the vehicle and fled on foot toward the apartment duplex where he lived. An immigration officer chased Aljorna who — according to the government — violently resisted arrest.\n\nThe complaint alleges Sosa-Celis and another man attacked the officer with a snow shovel and a broom handle as the officer and Aljorna struggled on the ground. The officer fired his handgun, striking Sosa-Celis in his right thigh. The men ran into an apartment and eventually were arrested.\n\nAfter the shooting, Homeland Security Secretary Kristi Noem attacked Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey, accusing the Democrats of “encouraging impeding and assault against our law enforcement which is a federal crime, a felony.”\n\n“What we saw last night in Minneapolis was an attempted murder of federal law enforcement,” Noem said in a January 15 statement. “Our officer was ambushed and attacked by three individuals who beat him with snow shovels and the handles of brooms. Fearing for his life, the officer fired a defensive shot.”\n\nThe Department of Homeland Security has not responded to requests Friday asking whether Noem stands by those statements.\n\nClark, the lawyer for Aljorna and Sosa-Celis, urged the government Friday to release the name of the ICE agent and charge him “for his crime.”\n\nCourt filings show state authorities have opened their own criminal investigation into the shooting, though the FBI has refused to share evidence, provide the name of the ICE officer or make him available for an interview.\n\nRosen’s motion seeking to drop the charges did not detail what new evidence had emerged or what falsehoods had been in the government’s prior filings, but cracks began to appear in the government’s case during a January 21 court hearing to determine whether the accused men could be released pending trial.\n\nIn court, the ICE officer’s account of the moments before the shooting differed significantly from testimony from the two defendants and three eyewitnesses. The ICE officer’s account that he was assaulted with a broom and snow shovel was also not corroborated by available video evidence.\n\nAljorna and Sosa-Celis denied assaulting the agent with a broom or a snow shovel. Neither video evidence nor testimony from a neighbor and the men’s romantic partners supported the agent’s account that he had been attacked with a broom or shovel or that a third person was involved.\n\nFrederick Goetz, a lawyer representing Aljorna, said his client had a broomstick in his hand and threw it at the agent as he ran toward the house. Attorney Robin Wolpert, representing Sosa-Celis, said he had been holding a shovel but was retreating into the home when the officer fired, wounding him. The men’s attorneys said the prosecution’s case relied wholly on testimony from the agent who fired the gun.\n\nNeither Aljorna and Sosa-Celis had violent criminal records. Both had been working as DoorDash delivery drivers at night in an attempt to avoid encounters with federal agents, their attorneys said.\n\nAljorna and Sosa-Celis retreated into their upstairs apartment and barricaded the door, so federal officers used tear gas to try to force the men out, the FBI agent said. Concerned about the safety of two children under 2 inside the home, Aljorna and Sosa-Celis surrendered.\n\nA third Venezuelan man, Gabriel Alejandro Hernandez Ledezma, who lived in the apartment downstairs was also arrested.\n\nThough he was never federally charged, a January 30 court petition seeking his release says Hernandez Ledezma was detained without a warrant and within hours flown to an ICE detention facility in Texas. He alleges his removal was to prevent him becoming a material eyewitness who could undercut the federal government’s case and help the Minnesota state investigation.\n\nHernandez Ledezma was returned to Minnesota and discharged from ICE custody on Monday after a federal judge ordered his release.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/minnesota-immigration-enforcement-crackdown-woman-shot-1aeabfaf747eff0162c15216bf41c9e7",
      "text": "high-profile shootings"
    },
    {
      "url": "https://apnews.com/article/minneapolis-ice-alex-pretti-videos-861a0d8f3ee182f3b5909b3613900e2e",
      "text": "video evidence"
    },
    {
      "url": "https://apnews.com/article/immigration-chicago-shooting-crackdown-border-f05c446c37bf0cd7e7e2ad1dcfa104b1",
      "text": "claims made to justify using deadly force"
    },
    {
      "url": "https://apnews.com/article/ice-immigration-protests-prosecutions-doj-arrests-591f155d50c13756842e033ea23f16d3",
      "text": "felony cases against protesters"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/us/minneapolis-ice-shooting-investigation",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/us/minneapolis-ice-shooting-investigation",
      "text": "Cookie Settings"
    }
  ],
  "hash": "398db2d576993e12b5572b74c40505e7422aca5226e34e6bdd28bef1ec0d5d14",
  "scraped_at": "2026-02-14T07:07:20.115794+00:00"
}
