{
  "url": "https://lite.cnn.com/2026/02/13/travel/sydney-beach-bikini-ban-bus-intl-scli",
  "title": "Bikinis banned on Sydney bus after modesty complaints | CNN",
  "date": "2026-02-15T07:12:34.246135+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA Sydney council has banned beachgoers from boarding a community bus while shirtless or wearing bikinis, reigniting a decades-old debate over public decency inAustralia.\n\n“Please dress appropriately. Clothing must be worn over swimwear,” reads a sign for the Hop, Skip and Jump bus, which is funded by Northern Beaches Council and drives through the northern Sydney suburbs of Manly, Fairlight and Balgowlah. The sign was shown in areportby CNN affiliate 7News Sydney on Friday.\n\nBus is the main form of public transportation in the coastal region, the council’swebsitestates.\n\nDenying passengers a ride due to their clothing, or lack of it, will be down to the driver’s discretion, according to 7News.\n\nThe change follows complaints from passengers, according to CNN affiliate9News, with many older commuters in support of the restriction.\n\n“We’re a bit old-fashioned. We’d probably like people to dress properly, especially if you’re on public transport,” one woman told 7News.\n\nAnother woman described passengers wearing swimwear as “confronting,” adding that the bus is “small” and “very contained.”\n\n“I think it’s a little off-putting sometimes when you see people get on with virtually no clothes on,” one man said.\n\nHowever, “the problem becomes where you draw the line,” a younger woman said, adding that “a lot of people will wear activewear on buses.”\n\nThe council has not yet added the new rule to itscode of conductfor the bus service on its website. The code already instructs passengers not to eat, drink or smoke on the bus, or board with large objects such as surfboards when the bus is full.\n\nCNN had reached out to the council for further comment.\n\nAustralia has a long history of controversy over beachwear.\n\nIn the early 1960s, decades of tensions between female beachgoers and the local authority in the eastern Sydney suburb of Waverley rose to the point of being dubbed “the bikini war” by local media, according to local council archives. Similar “wars” raged elsewhere in Sydney, 7News reported.\n\nIt followed the arrests of more than 50 women on Bondi Beach during a long weekend in October 1961, after a 1935 ordinance required bathing suits to meet strict measurements, with beach inspectors enforcing the rule.\n\nWhile the ordinance was abandoned later in 1961 in favor of a simpler requirement for “proper and adequate” swimsuits, debate over appropriate beachwear continues.\n\nIn 2024, a call for a ban on wearing G-string bikinis on the streets of Australia’s eastern Gold Coast sparked protests and nationwide debate.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/travel/ai-tourism-nonexistent-hotsprings-intl-scli",
      "text": "Australia"
    },
    {
      "url": "https://www.instagram.com/reels/DUsS00yCoyV/",
      "text": "report"
    },
    {
      "url": "https://www.northernbeaches.nsw.gov.au/services/roads-and-paths/transport",
      "text": "website"
    },
    {
      "url": "https://www.9news.com.au/videos/national/bikini-wearing-and-shirtless-commuters-banned-from-bus-service/cmljuj4jb000m0gnrtc9obgk0",
      "text": "9News"
    },
    {
      "url": "https://files.northernbeaches.nsw.gov.au/nbc-prod-files/hop-skip-jump-code-conduct.pdf?1770987910",
      "text": "code of conduct"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/travel/sydney-beach-bikini-ban-bus-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/travel/sydney-beach-bikini-ban-bus-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "39e2f9093956a0a396fd45c47304f24fc1e9f471e2eabd5c294f2116074b5d7b",
  "scraped_at": "2026-02-15T07:12:34.246149+00:00"
}