{
  "url": "https://lite.cnn.com/2026/02/09/asia/bangladesh-election-candidates-old-guard-intl-hnk",
  "title": "Bangladesh election candidates: Gen Z won the revolution but the old guard are dominating | CNN",
  "date": "2026-02-12T21:30:32.995018+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nBangladesh votes on Thursday in the first election since a Gen Z protest movement toppled an ageing autocrat – an uprising tens of millions of young people dreamed could chart a new course for their country.\n\nImages of longtime leader Sheikh Hasina fleeing by helicopter as protestersstormed her residencein the summer of 2024 sent shockwaves around the world, inspiring other youth-led movements against corruption and nepotism that helped topple governments in Nepal and Madagascar.\n\nMany are happy that Hasina’s 15 years of rule – marked by accusations of rigged elections, the loot of state resources and brutal crushing of dissent – have ended.\n\nThe “revolution showed the power of what Gen Z can achieve,” Mirza Shakil, a student who participated in the protests to topple Hasina, told CNN.\n\nBut the two candidates most likely to lead Bangladesh into a post-Hasina future are a far cry from those who risked everything on the barricades and in the streets to topple her.\n\nOne is the 60-year-old scion of a political dynasty which has dominated Bangladeshi politics for decades. The other is a 67-year-old Islamist leader whose party is fielding no women candidates in the polls.\n\n“We dreamt of a country where all people regardless of gender, race, religion would have equal opportunity,” another former protester Sadman Mujtaba Rafid told Reuters.\n\n“We expected policy changes and reforms, but it is far away from what we dreamt of.”\n\nHasina’s downfall began with student demonstrations over civil service job quotas. In response, her government unleashed a brutal and bloody crackdown that only galvanized the movement and brought more people onto the streets.\n\nProtests soon spread nationwide, and when the army said it would not fire on protesters, it was clear Hasina’s rule was over.\n\nIn August 2024, students stormed her official residence, smashing walls and looting its contents, forcing her to flee into neighboring India and exile.\n\nLast November, a court in Dhakasentenced Hasina to deathin absentia for her role in the unrest, in which the UN human rights office estimates around 1,400 people were killed.\n\nHasina now finds herself a pawn in atense standoff between the two countriesas Bangladesh demands her extradition to face justice for crimes that she insists she did not commit. Her Awami League is banned from contesting in the upcoming vote.\n\nThe absence of Hasina and her party has been a boon for its historic rival, the Bangladesh Nationalist Party (BNP).\n\nIts leader, Tarique Rahman, the son of former prime minister and bitter Hasina rival, the late Khaleda Zia, has since returned to Bangladesh after 17 years of exile and now appears the frontrunner to win.\n\nAnother of the old guard enjoying a comeback is Jamaat-e-Islami, the country’s largest Islamist party, which is making a resurgence after years of suppression under Hasina.\n\nMeanwhile the National Citizen Party (NCP), a political party founded by students following the uprising, has struggled to meaningfully muscle its way into Bangladesh’s fractious and often violent political scene.\n\nIn late December, it stunned many when it announced an alliance with Jamaat-e-Islami.\n\nThat pact is partly about protection, said Naomi Hossain, a professor of Development Studies at SOAS University of London.\n\n“Some in the NCP stand a strong chance of getting seats if they ally with Jamaat,” she told CNN.\n\nFurthermore, in a “violent political setting,” parliamentary status offers protection, and without it, leaders fear being “very vulnerable to backlash,” she said.\n\nA spate of violent clashes toward candidates and religious minorities has frayed nerves. The interim government, led by Nobel laureate Muhammad Yunus, has faced criticism for not being able to maintain law and order within the country.\n\nThis instability stands in contrast to the hopes many of the student protesters initially had.\n\nThe NCP “had promised reform, inclusivity and many other things,” said student protester Nazifa Jannat.\n\nAn alliance with a party who has not put forward a single woman candidate, feels like a betrayal.\n\nIt is a “disgraceful incident,” she said. “We have told them how shameful this is for us.”\n\nStill, Thursday’s vote is being described by many as the first free and fair election in more than a decade, and on the streets of Dhaka, the prevailing mood is one of anticipation.\n\n“The election can bring something new,” Shakil, the former protester told CNN.\n\n“We are excited.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/08/05/world/video/demonstrators-bangladesh-dhaka-sheikh-hasina-residence-digvid",
      "text": "stormed her residence"
    },
    {
      "url": "https://www.cnn.com/2025/11/17/asia/bangladesh-sheikh-hasina-verdict-intl-hnk",
      "text": "sentenced Hasina to death"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/asia/bangladesh-india-sheikh-hasina-death-sentence-intl-hnk-dst",
      "text": "tense standoff between the two countries"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/asia/bangladesh-election-candidates-old-guard-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/asia/bangladesh-election-candidates-old-guard-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "39ef1dede6f12a397970d2ce8ff0b4e84c673d46b141c563f1e5bf213f5870de",
  "scraped_at": "2026-02-12T21:30:32.995031+00:00"
}