{
  "url": "https://lite.cnn.com/2026/02/23/politics/donald-trump-tariff-difficulties-section-122",
  "title": "Analysis: Donald Trump’s tariff troubles might not be over | CNN Politics",
  "date": "2026-02-24T07:32:00.025222+00:00",
  "authors": [
    "Analysis by Aaron Blake, CNN"
  ],
  "text": "Source: CNN\n\nHours after the Supreme Court struck down his tariff policy on Friday, President Donald Trump insisted the ruling had actually, somehow, rendered him “stronger.”\n\nHe was overcompensating. His other potential options are objectively weaker.\n\nAnd his stated alternative, that he would institute a global 15% tariffunder a different authority,could easily fizzle — and bring his entire tariffs gambit down with it.\n\nThat’s because the law he’s now relying upon, Section 122(a) of the Trade Act of 1974, was intended to address different situations. It’s meant not for trade deficits, which the Trump administration has cited as the justification for the president’s now-nixed emergency tariffs, but rather a severe “balance of payments” deficit.\n\nTo the extent the Trump team can justify the global tariffs under this authority, they’ll need to offer a completely different justification than they’ve been using to this point.\n\nOr they’ll have to convince judges of a rather novel reading of Section 122 in which trade deficitsarebalance-of-payments deficits.\n\nBut on both counts, their past arguments could come back to haunt them.\n\nSection 122holds that a president can unilaterally implement tariffs of up to 15% for 150 days to deal with “large and serious United States balance-of-payments deficits.” After 150 days, congressional approval would be required to extend the tariffs.\n\nWhat is a balance-of-payments deficit? It’s complicated, but it basically refers to when the record of transactions that come into and go out of the United States isout of whack.\n\nEven when we pay US dollars for imports, the countries that receive the money need to send the dollars back to the United States in order to use them, at some point. Over time, the balance of payments should be close to zero.\n\nSo trade deficits are a piece of this equation, but they are notthe equation itself.\n\nImportantly, the Trump team itself has acknowledged this distinction. Indeed, ina filing last year in the tariffs case, officials conceded that the administration couldn’t necessarily use Section 122 authority to address trade deficits.\n\nIt said that Section 122 didn’t “have any obvious application here, where the concerns the President identified in declaring an emergency arise from trade deficits, which are conceptually distinct from balance-of-payments deficits.”\n\nSaying it didn’t have an “obvious application” doesn’t rule out some level of application. But the Trump team clearly downplayed the applicability of Section 122.\n\nThat suggests Trump would have to declare a new justification — after spending nearly a year saying this was about trade deficits and many other things that aren’t balance-of-payments deficits.\n\nThe Trump team could seemingly reverse itself and argue that trade deficits are a form of a balance-of-payments deficit. Indeed, its “fact sheet” on Trump’s announcement Fridaycontinued to cite trade deficitsas part of its case. And it has also floatedusing Section 122 for trade deficitsin the past.\n\nBut that could be a difficult argument to make in court, irrespective of what the Trump team said before.\n\nThat’s because Section 122 later refers separately to “balance-of-trade surpluses” — and offers different authorities for that scenario. The fact that it refers to “balance-of-payments” and “balance-of-trade” separately suggests the drafters of the law viewed them as distinct from one another.\n\nAnd the other point here is that it’s just not at all clear we have anything that could be construed as “large and serious United States balance-of-payments deficits.”\n\nThe conservative National Review has featured a pair of compelling pieces arguing that we’re not in such a situation. One argues that our balance-of-payments deficitis actually near zero. In another, Andrew C. McCarthy argues that the scenario for which Section 122 was drafted simply doesn’t apply to our modern setup, in which the dollar is no longer anchored to the price of gold and has a floating value.\n\n“These new tariffs are even more clearly illegal than Trump’s IEEPA tariffs,” McCarthywrote, referring to Trump’s emergency tariffs that were just struck down.\n\nEven those who drafted that law might agree with that argument.\n\nA1974 report from the Senate Finance Committeeconceded that “under present circumstances,” Section 122 “is not likely to be utilized.” But the panel said it nonetheless wanted to give it to the president because “circumstances can change rapidly.”\n\nIndeed, half a century later, Section 122 hasnever previously been used, according to the Congressional Research Service.\n\nThe tariffs are limited at 150 days, and the legal process could actually take longer than that. There’s a possibility that judges let these tariffs run their course, rather than move quickly to temporarily block them.\n\nBut Trump is at the very least risking a double-rebuke from the courts on his signature economic policy.\n\nIf that were to happen, it could sting even more. It would not only be a second strike, but it could also make it even more difficult to revive his tariffs using other authorities that the White House has floated.\n\nAt that point, congressional Republicans might run out of patience for Trump’s tariffs gambit — especially given many of them have been skeptical from the start. And that’s doubly so in an election year, in which tariffs appear to be hurting Republicans.\n\nIt’s also worth re-emphasizing that these tariffs aren’t nearly as beneficial for Trump.\n\nThe fact that he’s limited to 15% means he can’t jack up tariffs on individual countries in an instant like he has before. Trump on Monday threatened to raise tariffs on “any Country that wants to ‘play games’” after last week’s Supreme Court decision. But he just doesn’t have the same flexibility.\n\nThe time limit — and the fact that Congress almost certainly would not extend the tariffs beyond 150 days — also means other countries could simply wait Trump out rather than feel compelled to cut trade deals with him. So these tariffsare smaller overalland also provide less leverage.\n\nDespite those bothersome details, Trump actually claimed Friday that Section 122 was “stronger” and “probably the direction that I should have gone the first time.”\n\nBut given the potential problems ahead, it’s likely his team foresaw this being a potentially rocky road as well.\n\nYou could be forgiven for thinking Trump is just trying this because it’s the best option he has left — and that he’s hoping to salvage his pride as much as his tariffs.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "under a different authority,"
    },
    {
      "url": "https://www.law.cornell.edu/uscode/text/19/2132",
      "text": "Section 122"
    },
    {
      "url": "https://www.khanacademy.org/economics-finance-domain/ap-macroeconomics/ap-open-economy-international-trade-and-finance/the-balance-of-payments/a/the-balance-of-payments",
      "text": "out of whack"
    },
    {
      "url": "https://storage.courtlistener.com/recap/gov.uscourts.cafc.23105/gov.uscourts.cafc.23105.147.0.pdf",
      "text": "a filing last year in the tariffs case"
    },
    {
      "url": "https://www.whitehouse.gov/fact-sheets/2026/02/fact-sheet-president-donald-j-trump-imposes-a-temporary-import-duty-to-address-fundamental-international-payment-problems/",
      "text": "continued to cite trade deficits"
    },
    {
      "url": "https://www.politico.com/news/2024/04/15/devaluing-dollar-trump-trade-war-00152009",
      "text": "using Section 122 for trade deficits"
    },
    {
      "url": "https://www.nationalreview.com/corner/the-u-s-balance-of-payments-deficit-is-essentially-zero/",
      "text": "is actually near zero"
    },
    {
      "url": "https://www.nationalreview.com/corner/trumps-section-122-tariffs-are-illegal/",
      "text": "wrote"
    },
    {
      "url": "https://www.finance.senate.gov/imo/media/doc/trade10.pdf",
      "text": "1974 report from the Senate Finance Committee"
    },
    {
      "url": "https://www.congress.gov/crs_external_products/R/PDF/R48435/R48435.1.pdf",
      "text": "never previously been used"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-23-26?post-id=cmlza8a9g00003b6rvu6vjrdp",
      "text": "any Country that wants to ‘play games’"
    },
    {
      "url": "https://taxfoundation.org/research/all/federal/trump-tariffs-trade-war/",
      "text": "are smaller overall"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/donald-trump-tariff-difficulties-section-122",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/donald-trump-tariff-difficulties-section-122",
      "text": "Cookie Settings"
    }
  ],
  "hash": "39fe0f93e3dc63e5495248670e9c8d3400f327a517ecff001656039ce4090a0a",
  "scraped_at": "2026-02-24T07:32:00.025237+00:00"
}