{
  "url": "https://lite.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
  "title": "Analysis: If Trump said Iran’s nuclear program was ‘obliterated,’ why is he looking to strike again? | CNN Politics",
  "date": "2026-02-24T07:31:08.701017+00:00",
  "authors": [
    "Analysis by Aaron Blake, CNN"
  ],
  "text": "Source: CNN\n\nIn March, the US intelligence community assessed that Iran was “not building a nuclear weapon.”\n\nIn June, the Trump administration neverthelesslaunched airstrikestargeting Iran’s nuclear program.\n\nAnd today, it might strike Iran again over its nuclear ambitions — this time despite President Donald Trump having assured repeatedly that those June airstrikes had “obliterated” its program.\n\nTrump and his team have rarely taken care to provide consistent rationales for using  military force.\n\nBut ahead ofa potentially more extensive campaignin Iran — one Trump is likely to talk about Tuesday night in hisState of the Unionaddress — their failures to build a coherent case for war are getting even more conspicuous.\n\nTrump and his administration went to great lengths to highlight the success of those June strikes, in ways that appeared to go well beyond the available evidence at the time.  And today, those grand claims are suddenly looking like a liability.\n\nThe administration has in recent days repeatedly cited Iran’s potential nuclear threat while floating potential military force if Tehran doesn’t cut a deal.\n\n“Our primary interest here is, we don’t want Iran to get a nuclear weapon,” Vice President JD Vance told Fox News last week.\n\n“They can’t have nuclear weapons; it’s very simple,” Trump said last week.\n\nAnd over the weekend, Trump’s special envoy Steve Witkoff suggested Iran’s nuclear threat was rather imminent.\n\n“They’ve been enriching well beyond the number that you need for civil nuclear. It’s up to 60%,” Witkoff told Fox. “They are probably a week away from having industrial-grade bomb-making material, and that’s really dangerous.”\n\nBut if Iran actually is that close to having material to make nuclear bombs, that would represent a truly miraculous recovery — at least, to the extent one believes Trump. After all, it was just eight months ago that Trump declared Iran’s nuclear program to have been “obliterated.”\n\nInitially, Trump merely said that Iran’s nuclearfacilitieshad been obliterated.\n\n“Iran’s key nuclear enrichment facilities have been completely and totally obliterated,” he said the day of the operation, June 21.\n\nEven that was a weird answer, though, given after-action reports generally take some time. It wasn’t clear how Trump could have reached this conclusion so quickly and definitively. And indeed, Joint Chiefs of Staff Chairman Dan Caine provideda more circumspect versionthe next day.\n\nBut then Trumprepeated the claimon social media. And Defense Secretary Pete Hegseth in his own comments on June 22 went even further, declaring that not only were thefacilitiesobliterated, but so too were Iran’s nuclearambitions.\n\n“Thanks to President Trump’s bold and visionary leadership and his commitment to peace through strength, Iran’s nuclear ambitions have been obliterated,” Hegseth said.\n\nBy June 24, Trump followed Hegseth’s lead. “It was my great honor to Destroy All Nuclear facilities & capability, and then, STOP THE WAR!” Trump said onsocial media.\n\nThat same day, though, CNN broke the news that an early US intelligence assessmentdid not back up Trump’s claims. It had found the strikes did not destroy the core components of Iran’s nuclear program and likely only set it back by months. (The New York Timesreported something similar.)\n\nBut Trump has continued to say the nuclear program was obliterated.\n\nA sampling:\n\nSo to recap: Trump has claimed to have obliterated Iran’s nuclear “capacity,” “capability,” “future … capability,” “potential capability,” “hopes,” “threat” and “enrichment capability.” And as recently as four months ago, he said Iran didn’t even have a nuclear program to speak of.\n\nThe word “obliterate” means to utterly destroy or wipe out. In the context of nuclear capability, it’s not the kind of claim that allows for the obliterated thing to be reconstituted in a matter of months.\n\nBut today, Trump’s motivations are different.\n\nSuddenly, it’s not about highlighting the success of a past mission but rather about building the case for a future one. And suddenly, it’s not so helpful for that first mission to have been the resounding success that Trump has spent months asserting it was.\n\nIndeed, Trump was critical of the CNN and Times reports that Iran’s nuclear program was only set back months.\n\nIt’s an altogether familiar tale. This administration often seems to say whatever it needs to in the moment to build its case for military intervention — regardless of how substantiated or how consistent it is.\n\nThat was true not justwith the initial Iran strikesin June, but also with its operation to oust Venezuelan President Nicolás Maduro. That latter operation was justified as beingabout drugs, about law enforcement and/or about oil.\n\nAnd it’s happening again.\n\nLast month, when Trump was first threatening to strike Iran again, the stated reason wasthat Tehran was killing protesters. Today, the stated case is much more focused on nuclear issues.\n\nWhen White House press secretary Karoline Leavitt was asked last week why  the US might have to strike Iran again even after its nuclear program was supposedly “obliterated,” she responded: “Well, there’s many reasons and arguments that one could make for a strike against Iran.”\n\nThe administration is still searching for a logically consistent one.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.dni.gov/files/ODNI/documents/assessments/ATA-2025-Unclassified-Report.pdf",
      "text": "not building a nuclear weapon"
    },
    {
      "url": "https://www.cnn.com/2025/06/22/politics/trump-iran-strike-decision-inside",
      "text": "launched airstrikes"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
      "text": "a potentially more extensive campaign"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/sotu-address-prep-trump",
      "text": "State of the Union"
    },
    {
      "url": "https://www.defense.gov/News/Transcripts/Transcript/Article/4222543/secretary-of-defense-pete-hegseth-and-chairman-of-the-joint-chiefs-of-staff-gen/",
      "text": "a more circumspect version"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/114730186433008075",
      "text": "repeated the claim"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/114739003459183372",
      "text": "social media"
    },
    {
      "url": "https://www.cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites",
      "text": "did not back up Trump’s claims"
    },
    {
      "url": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html?campaign_id=60&emc=edit_na_20250624&instance_id=157175&nl=breaking-news®i_id=248848251&segment_id=200569&user_id=e5b77ed2dcc338330d0bbc81341e1102",
      "text": "reported something similar"
    },
    {
      "url": "https://www.cnn.com/2025/06/19/politics/intelligence-iran-trump-gabbard-analysis",
      "text": "with the initial Iran strikes"
    },
    {
      "url": "https://www.cnn.com/2026/01/03/politics/legal-authority-trump-venezuela",
      "text": "about drugs, about law enforcement and/or about oil"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/donald-trump-dilemma-iran",
      "text": "that Tehran was killing protesters"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3a44409673f5b1eb55a79b9c6102030c5738f4b892893a935bc47d96d2f37041",
  "scraped_at": "2026-02-24T07:31:08.701031+00:00"
}