{
  "url": "https://lite.cnn.com/2026/02/18/health/cdc-acting-director-jay-bhattacharya",
  "title": "NIH director temporarily steps in to run CDC | CNN",
  "date": "2026-02-19T07:31:04.005819+00:00",
  "authors": [
    "Jen Christensen, CNN"
  ],
  "text": "Source: CNN\n\nThe director of the National Institutes of Health, Dr. Jay Bhattacharya, will also take on the temporary role of acting director of the US Centers for Disease Control and Prevention, an administration official told CNN Wednesday.\n\nBhattacharya will stay on as head of the NIH and will also serve as the head of the CDC until President Donald Trump can appoint a permanent leader. The head of the CDC job requires Senate confirmation.\n\nBhattacharya is replacing HHS Deputy Secretary Jim O’Neill, who had been guiding the CDC as acting director since last August, after US Health and Human Services Director Robert F. Kennedy, Jr.ousted Dr. Susan Monarezafter she clashed with himover vaccine policyand declined to dismiss top agency leaders. She spent less than a month in that position.\n\nO’Neill left his role last Friday as a part of abroader restructuring. O’Neill had been a controversial figure at the CDC, where he helped amplify anti-vaccine messaging, cheered the United States departure from the World Health Organization, and was considered a poor communicator.\n\nPrior to joining the Trump administration, Bhattacharya worked as a health economist and professor at Stanford University Medical School. He’sbest knownfor co-authoringthe Great Barrington Declaration, an open letter published two months prior to Covid-19 vaccines being available that opposed certain Covid-19 mitigations.\n\nThe Declaration, named for the Massachusetts town where they signed it, drew considerable scrutiny from many doctors and scientists because it argued while the most vulnerable people should be protected, people should otherwise resume a normal life, so the world could gain herd immunity through infection with the virus. At the time, the director-general of the World Health Organization called the idea of allowing a dangerous virus to sweep through unprotected populations“unethical.”Bhattacharya latertestifiedbefore Congress that it – and he – immediately became targets of suppression and censorship by those leading scientific agencies.\n\nAs head of the NIH, Bhattacharya has seen pushback from hundreds of staffers. Last April, hundreds of staffers – including top leaders – were cutfrom several federal agencies, including at the NIH. In June, some NIH scientists published what they called the Bethesda Declaration, named for the location of the NIH.The letter, signed by more than 300 employees, took issue with what they saw as the politicization of research and destruction of scientific progress under the Trump administration.\n\nThe administration had proposed cutting the NIH budget by 40% and thousands of NIH grants have been terminated in just the year and a half Trump has been in office.\n\nAs the head of the NIH, Bhattacharya hasspoken extensivelyaboutrestoringAmerican’s faith in the federal government’s approach to health and science.\n\nCNN’s Meg Tirrell, Sarah Owermohle, Brenda Goodman and Adam Cancryn contributed to this report\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/27/health/cdc-director-monarez",
      "text": "ousted Dr. Susan Monarez"
    },
    {
      "url": "https://www.cnn.com/2025/08/29/politics/cdc-director-susan-monarez-vaccines-covid-maha-rfk-analysis#:~:text=Susan%20Monarez%20after%20she%20clashed%20with%20Health,vaccine%20policy%20and%20declined%20to%20dismiss%20top",
      "text": "over vaccine policy"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/health/rfk-aides-jim-oneill-hhs-cdc",
      "text": "broader restructuring"
    },
    {
      "url": "https://www.cnn.com/2025/11/08/politics/stanford-maha-trump-rfk-bhattacharya-huberman",
      "text": "best known"
    },
    {
      "url": "https://gbdeclaration.org/",
      "text": "the Great Barrington Declaration"
    },
    {
      "url": "https://www.cnn.com/2020/09/01/health/herd-immunity-coronavirus-pandemic-explainer-wellness/index.html",
      "text": "“unethical.”"
    },
    {
      "url": "https://www.congress.gov/118/meeting/house/115561/witnesses/HHRG-118-IF16-Wstate-BhattacharyaJ-20230328.pdf",
      "text": "testified"
    },
    {
      "url": "https://www.cnn.com/2025/04/01/health/staff-cuts-at-federal-health-agencies-have-begun",
      "text": "from several federal agencies"
    },
    {
      "url": "https://www.standupforscience.net/bethesda-declaration?utm_source=pressrel&utm_campaign=bethesdadec",
      "text": "The letter"
    },
    {
      "url": "https://www.help.senate.gov/imo/media/doc/ff827562-af70-c970-0151-33edc8e260bf/Bhattacharya%20Testimony.pdf",
      "text": "spoken extensively"
    },
    {
      "url": "https://x.com/DrJBhattacharya",
      "text": "restoring"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/health/cdc-acting-director-jay-bhattacharya",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/health/cdc-acting-director-jay-bhattacharya",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3a954d8936257ff881c1efc4e373e55f824f7f1c041f6f7e779a8d456f723f1e",
  "scraped_at": "2026-02-19T07:31:04.005832+00:00"
}