{
  "url": "https://lite.cnn.com/2026/02/19/politics/midterm-elections-trump-health-care",
  "title": "Midterm elections: Trump is preparing to make health care a central focus | CNN Politics",
  "date": "2026-02-20T07:29:10.254272+00:00",
  "authors": [
    "Adam Cancryn, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump is preparing to make health care a central focus of his midterm sales pitch, despite weak polling and misgivings among some of his own advisers about elevating an issue that’s long proved disastrous for the Republican Party.\n\nThe approach developed by Trump and his senior aides aims to spotlight key priorities that they believe carry broad voter appeal, like lower drug prices, while seeking to preempt an expected barrage of Democratic attacks over rising health costs, according to more than a half-dozen administration officials and others familiar with the matter.\n\n“We’ve done a bad job over the years in that we don’t talk about health care, and when we do, it’s only when we’re forced to,” said a Trump adviser involved in the discussions. “There’s good stuff that Trump’s trying to do, and we need to get more aggressive on it.”\n\nThe strategy has already created some headaches.\n\nTrump officials in recent weeks have pitched GOP lawmakers on mounting a longshot bid to pass major health legislation ahead of November’s midterm elections, despite little congressional appetite to do so. And inside the administration, White House aides are orchestrating an extraordinary shakeup of Trump’s health department in an attempt to remedy concerns about its messaging operation and move its focus away from more divisive topics like vaccines.\n\nThe intensifying emphasis on health care marks the White House’s latest bid to solve the cost-of-living woes dragging down Trump’s approval ratings and deepening fears within the GOP of a midterm rout. On Thursday, the president will travel to Georgia to deliver the latest in a set of affordability-focused speeches touting his economic accomplishments.\n\nThat message hasn’t resonated widely with voters so far, polling shows. While there’s hope that shifting toward health care will help the administration gain traction, several Republican allies working on the issue privately characterized the approach as a sign of the sheer depth of the challenge facing the administration nine months out from Election Day.\n\n“There truly are not many things they will be able to do that will alter the fate of the Republican majority,” said one Republican close to the White House. “That’s obviously a tough place for them to be.”\n\nRepublicans have struggled for more than a decade to formulate a winning health care platform, most notably failing repeatedly during Trump’s first term to repeal and replace Obamacare. That 2017 episode alienated voters and shifted the politics of the issue decisively toward Democrats, presaging a 40-seat swing that cost Republicans control of the House the following year.\n\nSince then, Democratic candidates have enjoyed a sustained polling advantage on health care. And despite Trump’s efforts to revamp the GOP’s agenda by embracing the Make America Healthy Again movement and staking out a more populist position on drug prices, there’s little evidence he’s managed to significantly narrow the gap.\n\nWhite House spokesperson Kush Desai argued that Trump has already defied the party’s history on health care, touting the president’s efforts to lower drug prices.\n\n“The Trump administration in the coming weeks and months will continue to highlight and build on these initiatives to deliver real and historic healthcare affordability for the American people,” he said.\n\nBut in recent briefings on midterm strategy, Trump’s political advisers offered a blunter motivation for leaning in on health care: They have no other choice.\n\nJames Blair, the White House deputy chief of staff, and top Trump pollster Tony Fabrizio have privately warned Republicans that Democrats are likely to focus their campaign attacks overwhelmingly on affordability and health care issues, according to two people familiar with their message. That became especially obvious after Trump failed to strike a deal last year to extend certain Obamacare subsidies, triggering price increases for millions of enrollees.\n\nHealth care costs also consistently rank among Americans’ top affordability concerns, making it a potent issue in a midterm landscape officials expect will be shaped primarily by voters’ economic views.\n\nAgainst that backdrop, Trump’s team has argued that it needs to go on offense.\n\n“I don’t think they just want to be attacked for letting health care costs go up,” said Alex Conant, a longtime GOP operative. “Trump wants to define himself, rather than letting Democrats define the Republican position.”\n\nIn a meeting on midterm strategy Tuesday night led by Blair and chief of staff Susie Wiles, Trump’s team stressed the importance of portraying the midterms as a choice for voters between the progress the administration’s made or going back to a situation they voted against just a year ago, a source present told CNN. Though Trump officials acknowledged that Americans are skeptical and, in some cases, unhappy, they struck a positive tone, contending that it’s still possible to message around those challenges.\n\nThe new focus has mirrored Trump’s own rising enthusiasm for campaigning on parts of his health care agenda. The president has taken particular pride in his “Most Favored Nation” initiative, which offers Americans negotiated discounts on certain medicines. He insisted earlier this month that “the Republican Party should be able to win the midterms on that alone.”\n\nHe’s similarly talked up the potential of his so-called Great Healthcare Plan — a loosely constructed framework for tackling health costs centered on funneling subsidies directly to individuals that he’s pressed lawmakers to prioritize on Capitol Hill, despite little appetite for passing major legislation on a complicated topic in an election year.\n\nThe White House in the meantime has taken steps to shore up key elements of its health messaging operation. In late January, Wiles quietly tasked a trusted senior Trump official with evaluating the US Health and Human Services Department’s inner workings, following months of internal clashes and public missteps that had frustrated the White House and complicated efforts to execute on its agenda, two people familiar with the matter said.\n\nThe conclusions submitted by the official, Brad Smith, formed the basis of a shakeup of the department’s senior ranks coordinated between the White House and HHS Secretary Robert F. Kennedy Jr. The overhaul resulted in the ouster of two top Kennedy aides from their Senate-confirmed roles and elevated four others. The Washington Post first reported Smith’s involvement.\n\nStill more changes are under consideration: Trump officials are weighing a move to effectively sideline Kennedy’s close aide, Stefanie Spear, amid dissatisfaction over her handling of HHS’ activities and messaging efforts, the people familiar said.\n\nDesai said suggestions that Spear might be reassigned were “fake news.”\n\n“Nothing is changing with Stefanie Spear, who will maintain her title of Senior Counselor, remain a close advisor to Secretary Kennedy — as she has been for years — and continue serving as a key HHS official in the Trump administration,” Desai said.\n\nThe newly elevated group, which includes two staffers who worked closely on Trump’s drug pricing initiative, will instead take over much of the department’s day-to-day operations, in a bid to more closely coordinate its work with the White House and avoid the negative headlines that plagued HHS at times over the past year. Specifically, the department is expected to pivot away from Kennedy’s polarizing efforts to revamp the nation’s vaccine policies.\n\nTrump officials have instead pushed for Kennedy to travel more frequently to promote broader-appeal ideas like healthy eating, in hopes of turning out the MAHA devotees who bolstered Trump’s coalition in 2024. The HHS secretary is one of several Cabinet members expected to hit the road in the coming months, with Trump aides on Tuesday urging them to make themselves available for any lawmakers who request their presence — and above all, to stay militantly on message.\n\n“It’s all about, what are the winning issues for the midterms?” said one of the people. “That’s all that matters.”\n\nStill, the recalibration remains a work in progress. After the Food and Drug Administration last week abruptly refused to review a new flu vaccine developed by the drugmaker Moderna, setting off alarms across the pharmaceutical industry, complaints about the surprise move eventually reached Trump.\n\nThe president responded angrily, berating FDA Commissioner Marty Makary over the decision, two people familiar with the episode told CNN. The FDA has subsequently said it will now review the flu shot, after Moderna submitted a revised proposal.\n\nTrump must also contend with broader skepticism of his health agenda, including among some of the Republican lawmakers he’s counting on to line up behind his priorities. Despite the fanfare surrounding Trump’s ability to strong-arm drugmakers into lowering some prices, there’s still hesitation among conservatives about trying to codify an approach first popularized by prominent progressives like Sen. Bernie Sanders.\n\nThe president’s Great Healthcare Plan faces even longer odds. Republicans have only a narrow majority in the House, dwindling enthusiasm in the Senate for another big legislative push and, despite Trump’s urging, little unified support for spending the last stretch before the midterms on a topic that’s burned them numerous times before.\n\n“Trump gets that it’s a problem and he needs to talk about it, but he has the same problem we’ve traditionally had,” said veteran Republican strategist Doug Heye. “We’ve never been able to really demonstrate what we’re for.”\n\nKristen Holmes contributed to this report.\n\nThis story has been updated to reflect statements from the White House.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/midterm-elections-trump-health-care",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/midterm-elections-trump-health-care",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3aa2dadf1a782123565ba9bdb574d65b2143060ac12b3b8b9f3d16f42d9b24a9",
  "scraped_at": "2026-02-20T07:29:10.254285+00:00"
}