{
  "url": "https://lite.cnn.com/2026/02/27/us/minnesota-church-protest-indictments-doj",
  "title": "Pam Bondi announces more indictments against people who protested at a Minnesota church | CNN",
  "date": "2026-03-01T07:07:23.753545+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nAttorney General Pam Bondi announced charges Friday against 30 more people who are accused of civil rights violations in aJanuary protest inside a Minnesota churchwhere a pastor works for Immigration and Customs Enforcement.\n\nBondi said on social media that 25 people were in custody and more arrests would follow. The new indictment comes a month after independent journalistsDon LemonandGeorgia Fortand prominent local activistNekima Levy Armstrongwere charged for their alleged roles in the protest at Cities Church in St. Paul, Minnesota.\n\nBondi accused the group of attacking a house of worship.\n\n“If you do so, you cannot hide from us — we will find you, arrest you, and prosecute you,” she wrote on social media.\n\nA livestreamed video posted on Facebook shows people interrupting services at Cities Church on January 18 by chanting “ICE out” and “Justice forRenee Good,” a reference to the woman who was fatally shot by an ICE officer in Minneapolis on January 7.\n\nProtesters descended on Cities Church after learning that one of the church’s pastors also serves as an ICE official. The protest drew swift condemnation from Trump administration officials and conservative leaders for disrupting a Sunday service.\n\nIn total, 39 people have been charged over the church protest and all are charged with conspiracy against religious freedom and interfering with the right of religious freedom.\n\nLemon and Fort said they were at the church as journalists covering news. Levy Armstrong was the subject of a doctored photo posted by the White House showing her crying during her arrest. The three have pleaded not guilty.\n\nThe indictment says the “agitators” entered the church in a “coordinated takeover-style attack” and engaged in acts of intimidation and obstruction.\n\n“Young children were left to wonder, as one child put it, if their parents were going to die,” the indictment says.\n\nA lawyer for the church praised the Justice Department for charging more people.\n\n“The First Amendment does not give anyone — regardless of profession, prominence, or politics — license to storm a church and intimidate, threaten, and terrorize families and children worshipping inside,” Doug Wardlow said in a statement.\n\nThe revised indictment adds new allegations when compared to the original filed in January.\n\nIt says two people “conducted reconnaissance” outside the church a day before the protest and recorded their visit on video, with one saying, “My thoughts are to be able to close up this whole alleyway right here.”\n\nThe court filing quotes one protester as chanting in the church, “This ain’t God’s house. This is the house of the devil.”\n\nTrahern Crews, who was charged in January and is lead organizer of Black Lives Matter Minnesota, said the latest arrests were a “waste of time.”\n\n“It’s a shame that the people who have killed Alex Pretti and Renee Good or Keith Porter have not been arrested but peaceful protesters have,” Crews said. Porter was fatally shot in Los Angeles by an off-duty ICE officer.\n\nLevy Armstrong defended the protest shortly after it occurred. She said critics needed to “check their hearts” if they were more concerned about a disruption than the “atrocities that we are experiencing in our community.”\n\nThe protest came at a tense time in Minnesota, where the Trump administration sent thousands of federal officers forOperation Metro Surgeafter a series of public fraud cases where the majority of defendants had Somali roots. Officers frequently deployed tear gas for crowd control in neighborhood clashes with residents, often detaining them along with immigrants.\n\nGood, 37, was shot in Minneapolis. In another fatal shooting one week after the church protest, a federal officer killed 37-year-old nurseAlex Pretti.\n\nNationwide demonstrations erupted in response, followed by a change in Operation Metro Surge’s leadership and the eventual wind-down of the immigration enforcement operation. Roughly 400 ICE officers and Homeland Security agents were expected to remain in Minneapolis by early March, down from roughly 3,000 at the peak, according to a court filing.\n\nSince then, the Twin Cities have grappled with the impact to communities and the local economy. The city of Minneapolis said it suffered an impact of $203.1 million due to the operation, with tens of thousands of residents in need of urgent relief assistance.\n\nSeparately, a woman who was at the church service has filed a lawsuit against some people who were charged, alleging emotional trauma and an inability to exercise her religion that day.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/01/30/politics/don-lemon-custody",
      "text": "January protest inside a Minnesota church"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/media/don-lemon-arraignment-minnesota",
      "text": "Don Lemon"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/us/video/georgia-fort-interview-anderson-cooper-digvid",
      "text": "Georgia Fort"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/video/anti-ice-activist-who-organized-church-protest-disputes-claims-of-coordination-with-don-lemon",
      "text": "Nekima Levy Armstrong"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/us/renee-nicole-good-minneapolis-ice-shooting-hnk",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "Operation Metro Surge"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/immigration-agents-shooting-alex-pretti-invs",
      "text": "Alex Pretti"
    }
  ],
  "hash": "3aae258e2bee83f165416872313aa034837a12706c357cb15969920585aec7e5",
  "scraped_at": "2026-03-01T07:07:23.753556+00:00"
}