{
  "url": "https://lite.cnn.com/2026/02/14/politics/american-detained-venezuela-maduro",
  "title": "American held in Venezuela during Maduro’s last days tells all | CNN Politics",
  "date": "2026-02-14T07:06:44.944629+00:00",
  "authors": [],
  "text": "Source: CNN\n\nJames Luckey-Lange has been spending a lot of time looking at the names he carved on a bar of soap he smuggled out of a Venezuelan prison in his underwear.\n\nThe 28-year-old New York native spent just over a month detained by Venezuelan officials, whom he says beat him, deprived him of food and only released him on January 13 following theUS captureof the country’s then president, Nicolás Maduro.\n\nAt one point, he said, “I thought they were just going to execute me. That was the scariest time. Besides that, I was just really frustrated, really aggravated [and] angry.”\n\nNow back at his aunt’s home in New Jersey, Luckey-Lange is looking up the names of his former prison mates on his soap and searching for their families on Facebook to let them know they might be alive.\n\nHe was held in solitary confinement for long stretches and didn’t get a good look at many of his prison mates. “I’ve never seen a lot of these people’s faces. It’s hard to find their families if you don’t know what they look like,” Luckey-Lange told CNN.\n\n“I hope they don’t think I’m up there getting tortured right now,” he said of those he was held with. “I hope they know I got out.”\n\nDozens of Americans have been arrested and detained in Venezuela over the last several years — part of a long campaign by the former Venezuelan leader to use Americans as political pawns. But Luckey-Lange’s detention and release came at an unprecedented moment in US-Venezuela relations. President Donald Trump sent special operations forces to snatch Maduro in early January. His administration is now exerting huge amounts of influence on the interim Venezuelan government led by former Maduro acolytes.\n\nLike many Americans detained in Venezuela, Luckey-Lange was accused of espionage and subjected to the harsh conditions of Venezuela’s notorious prisons. The experiences take a physical toll on the inmates that can last for months, if not years, and a mental toll that may never go away.\n\nBut Luckey-Lange has no regrets about traveling to Venezuela. “I got to learn something” and see “what’s really going on” there, he said wryly on a recent Zoom call from a coffee shop in New Jersey.\n\nThe US government urges Americans not to travel to Venezuela in part because of “a very high risk of wrongful detention.”\n\nThe warning didn’t resonate with a wanderlust like Luckey-Lange.\n\n“I’m not the type of guy that really wants to be confined,” he said.\n\nLuckey-Lange is the son of the late Diane Luckey, a singer known as Q Lazzarus whose single was featured in the film “The Silence of the Lambs.” Following her death in 2022, Luckey-Lange traveled throughout Latin America, learning Spanish andbloggingabout his adventures. Venezuela was meant to be his last stop on that trip.\n\nLuckey-Lange wanted to visit Mount Roraima, a plateau in the east of Venezuela with views of Guyana and Brazil. The authorities detained him, he said, in December after he crossed the border from Brazil to ask about a visa.\n\nHe was flown several hundred miles from a military base in eastern Venezuela to the capital of Caracas, where he said he was held at the headquarters of the General Directorate of Military Counterintelligence, known as the DGCIM.\n\nVeneuelan prisons generally don’t meet “the minimum rules for the treatment of international inmates,” much less “the national standards of hygiene, sanitation, care, nutrition, etcetera, that should be met in our prisons,” Gonzalo Himiob, vice president of the Venezuelan human rights organization Foro Penal, told CNN. Foro Penal confirmed that Luckey-Lange was held at a DGCIM facility.\n\nLuckey-Lange said his fellow prisoners were from all over Latin America and the Caribbean, among other places.\n\n“They starved me and didn’t give me any water” for days, Luckey-Lange recalled. “I was chained up in solitary with the camera in my room. Every time I would break out of the restraints from the waist, because it was tied by rope and I would untie it, they’d come in, beat me, throw me back in.”\n\nFrom the start, Venezuelan authorities accused him of being a spy, Luckey-Lange said. His hiking boots were military-style, they claimed. They drew maps in his notebook of roads and military bases in an effort, he said, to frame him as some sort of James Bond.\n\n“No matter what I’d say, they say they didn’t believe me because they really wanted to catch a spy,” he recalled. “They all wanted to go home and tell their wives, tell their higher-ups, that they had caught a spy.”\n\nSome four days later after arriving at DGCIM headquarters, Luckey-Lange was transferred to El Rodeo, a prison complex where Maduro imprisoned scores of political prisoners. He languished there for weeks and was only allowed outside once, he said.\n\n“I was making a joke in there, all we have is books and soap,” he told CNN. “All the dominoes, all the chess pieces, everything is made out of soap.”\n\nThinking there was a good chance he would get out of prison before the others, “I started carving the names on soap so I can talk to their families, talk to somebody about getting them out,” Luckey-Lange said.\n\nAbout 10 days before his release, US special forces captured Maduro and his wife. Luckey-Lange and his fellow inmates at El Rodeo had no idea what happened until days later. They got fragments of rumors through a game of prison telephone. Cries from people outside on the street suggested something big was afoot. Military and prison officials told Luckey-Lange and other inmates that Maduro would return to power, he said, even though the deposed leader was already in custody in New York.\n\nAfter Maduro’s ouster, the interim Venezuelan government pledged to release political prisoners, including Venezuelans and foreign nationals, without specifying how many or who would be released. The Trump administration had publicly pressed for the release of all political prisoners.\n\nLuckey-Lange didn’t know he was being freed until he was out.\n\nHe had heard his name whispered the night before, he recalled. But when the prison director came to his cell, Luckey-Lange thought he might be taken to the “fourth floor,” where he said people were tortured.\n\nIn the second week of January, Venezuelan officials drove him from El Rodeo to a private airplane hangar on the outskirts of Caracas. US State Department and Drug Enforcement Administration officials were waiting to help him out of the country, he said.\n\n“You’re famous,” one of the State Department officials told him, dispelling the impression he had that the outside world didn’t know he had been thrown in a Venezuelan prison. His story was already being told without him.\n\nLuckey-Lange eventually ended up in Texas, where he and other Americans held in Venezuela took part in the US government readjustment program known as PISA, or Post Isolation Support Activities. It’s typically offered to Americans who have been designated as wrongfully detained to help them acclimate after being imprisoned abroad.\n\nA US official confirmed Luckey-Lange participated in a variation of the program.\n\nLuckey-Lange’s health had deteriorated in Venezuela, he said. He had a parasite and his teeth were in bad shape.\n\nStill, outward signs that Luckey-Lange had been through such a harrowing experience were minimal.\n\nSometimes, in moments alone, it hit him.\n\n“I had a breakdown in the shower the second night [after being released]. That was it,” he said.\n\nLuckey-Lange said he wants to travel again.  Maybe go from Morrocco all the way down to South Africa.\n\nBut not before he reaches as many family members of his former prison mates as he can.\n\n“I had promised all those guys that I was going to help them get out, but I didn’t know it was going to be so difficult.”\n\nCNN’s Uriel Blanco and Mauricio Torres contributed reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/americas/venezuela-maduro-fort-tiuna-compound-operation-reconstruction-intl-invs",
      "text": "US capture"
    },
    {
      "url": "https://jamesluckey.substack.com/p/the-conscious-traveler-venezuela?r=k8x0n&utm_medium=ios&utm_source=notes-share-action",
      "text": "blogging"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/american-detained-venezuela-maduro",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/politics/american-detained-venezuela-maduro",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3ac951f923637cea1f06f54ad43f069972301cbbdc8f5b1d6af2a473645cda8d",
  "scraped_at": "2026-02-14T07:06:44.944642+00:00"
}