{
  "url": "https://lite.cnn.com/2026/02/10/asia/pakistan-pink-tax-womens-rights-intl-cmd",
  "title": "A young lawyer is taking Pakistan’s government to court over ‘period tax.’ She hopes the case will break sexual health taboos | CNN",
  "date": "2026-02-11T16:31:40.196882+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFor years, Mahnoor Omer didn’t talk about it.\n\nEvery time the topic arose, her school friends in Islamabad, the Pakistani capital, flushed with embarrassment, Omer recalled.\n\n“This happened so many times. A class fellow of mine would get her period during class,” she told CNN late last year. “Her white kameez on the back was entirely red. She freaked out. She had absolutely no idea what was going on with her.”\n\nNow, the 25-year-old lawyer and her colleague, Ahsan Jehangir Khan,29, are trying to rip apart that stigma – and ensure girls and women can access the sanitary products they need – through a landmark legal case which calls on the government to remove tax on menstrual products and categorize them as essential goods instead of luxury items.\n\nSeveral medical workers and women’s rights activists who support the case told CNN that pervasive social taboos over sexual health in Pakistan have led to tax policies that prevent swathes of the population from being able to afford essential sanitary items, exacerbating gender inequalities in education, health and social welfare.\n\n“I think what we’ve started here is not a legal case, but a movement to now bring period poverty to the forefront,” said Omer.\n\nOmer, the petitioner in the case, and Khan, who is representing her, say they hope to replicate the success of similar efforts elsewhere, which have led to governments either reducing taxes on period products or slashing them altogether – including inIndiaandNepal.\n\nThat regional ripple of legislative change “emboldened” them, Khan told CNN, adding: “In the Global South, people or governments are talking about this. We should be the ones taking charge.”\n\nCNN has reached out to Pakistan’s health ministry for comment on the case.\n\nBushra Mahnoor, a reproductive rights activist, counts herself among a small proportion of women and girls in Pakistan – about 12%, according to theUN’s children’s agency(UNICEF) – who use commercial sanitary products, rather than homemade alternatives.\n\nEven so, menstrual products were a “luxury” in her family home, she said, adding that she often lined her pads with cotton, or used cleaning rags, to try to make them last for hours longer than medically advised.\n\n“Periods were very traumatic during my whole childhood,” the 22-year-old from Attock, a small town in Punjab province, northern Pakistan, told CNN. She started menstruating at the age of 10 – a “very isolating” chapter of life, she said.\n\nLawyers say that by applying tax to sanitary items, the Pakistani government has systemically neglected women’s and girls’ rights to health and education – impeding their ability to fully participate in public life – and violated Article 25 ofthe Constitution, which prohibits discrimination on the basis of sex.\n\nUnder the Sales Tax Act of 1990, an 18% sales tax was imposed on locally made sanitary pads and a 25% customs tax on imported menstrual items, according to the legal petition published by Omer and Khan in October.\n\nThat additional charge, coupled with other local taxes, means women in Pakistan face a 40% surcharge on period products, accordingto UNICEF, pricing out the most vulnerable.\n\nAs of mid-2025, nearly 45% of the country’s population were living below the World Bank’s global lower middle-income poverty line of $4.20 (about 1,175 Pakistani rupees) per day, it reportedlast year.\n\nEssential goods strain meager household budgets, with consumers paying around 363 Pakistani rupees for a dozen eggs or 2,186 Pakistan rupees for a kilogram of wheat flour, according to economic data firmCEIC Data, citing 2025 figures from the Pakistan Bureau of Statistics.\n\nMeanwhile, a pack of 10 commercial sanitary pads costs between 400 and 485 Pakistani rupees, on average – or $1.43 to $1.73 – and might not be enough to last one woman or girl for a month.\n\nFailures to implement the laws intended to protect women are reinforced by the taboos around menstruation, said Omer, which limit public discussion.\n\nA court in Rawalpindi ordered the government to give a “timely response” to the lawyers’ arguments so the case could proceed, following a hearing in late November, Omer said.\n\nIn the interim, Omer hopes the government will take her case seriously. “With a tax like this, each day the price of injustice is experienced by half the population,” she told CNN last week.\n\nAfter she started menstruating, Mahnoor, the reproductive rights activist, said she felt like a stranger in her own body – an experience all too common for girls in Pakistan, according to one health worker, who cited a dearth of educational resources about the physical changes that accompany puberty.\n\n“When periods come, girls think they’re getting cancer,” said Dr. Azra Ahsan, a gynaecologist based in the port city of Karachi. “They think they’re dying, until they talk to someone.”\n\nIn a society where men are often the breadwinners and handle household finances – and menstrual products are unaffordable for many – women’s health care needs tend to fall by the wayside, Ahsan said.\n\nThose who try to deliver sexual health education are ostracized and discouraged, the doctor told CNN.\n\nThe knowledge gap exists across income and education levels, said Ahsan, helping misinformation to proliferate. A lack of access to toilets, running water or menstrual items in public spaces forces many girls and women to exclude themselves from public life. One in five girls in Pakistan miss school due to their menstrual cycle, UNICEFsaid in a 2024 report, “leading to the loss of at least a year’s worth of education.”\n\nSome students avoid walking to class if they have a stain on their clothes because they cannot access sanitary pads, said Mahnoor. Her own class teacher skipped the textbook section on periods, she added, which to her implied that “you’re not allowed to know and learn about your bodies.”\n\nOn one occasion, she recalled, another female teacher sent a student home because her period had started, instructing her to stand at the end of a classroom until her parents could come to collect her. “She had to take notes and write and do all the work standing just because she was bleeding,” Mahnoor added. “It was really cruel.”\n\nThe school had no supplies of sanitary items to offer the girl, she explained. “If she sat, there might be a stain might be left on her clothes, which was something more shameful to deal with.”\n\nThe challenges around menstruation don’t end with school. Employers do not always offer bathroom breaks, meaning some women, particularly garment workers, don’t have time to get up from their workstation and change their sanitary pad, added Mahnoor.\n\nOver the past couple of years, seasonalflash floods, exacerbated by the climate crisis, have trapped women in Pakistan in an “awful, awful cycle” of period poverty, said Omer, the lawyer.\n\nFor people navigating their period in flood relief camps, the reality can be “painful,” according to Mahnoor, who co-founded the non-profit Mahwari Justice in 2022, and has distributed sanitary products to people in flood-stricken zones.\n\nWomen have little choice but to wash their rags in floodwater, the activist told CNN, adding that they may not be able to dry them if there is no sun. Some are forced to use their headscarf as a makeshift pad. Others resort to “free bleeding,” or fold mud and sand into their rags to add absorbency, she said – increasing the risk of chafing, skin diseases, urinary tract infections and vaginal infections.\n\nIf a girl or a woman wants to relieve herself in a secluded area for privacy, she may be at risk from “people who are going to prey on her,” added Mahnoor.\n\nBeyond the physical health risks, doctors and lawyers warn the societal shame around menstruation has a corrosive impact on women’s mental wellbeing and sense of self. Some religious communities bar menstruating women from common living areas, said Ahsan.\n\nAs a result, women and especially girls feel they are being “punished for bleeding,” Mahnoor said, adding that men who stay silent on the issue are complicit.\n\nAs the case moves forward, Omer said she and Khan had been “pleasantly surprised” by the “encouraging” response from broad swaths of society, including national media outlets.\n\nThe two lawyers hope it will prompt discussions about reproductive rights, puberty and sexual health across Pakistani society, particularly for those now in their teens and 20s. “It’s time to go beyond just protesting. It’s time to actually start challenging what we can (do)… through legal reform and through advocacy and through lobbying in the right circles,” Omer said.\n\n“With the newer generations coming in, people are speaking up a bit more on previously taboo topics,” she added. “They are very outspoken.”\n\nCorrection: This story has been amended to correctly identify where the legal petition was filed.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2018/07/22/health/india-tampon-tax-intl",
      "text": "India"
    },
    {
      "url": "https://kathmandupost.com/money/2025/06/21/supreme-court-orders-tax-removal-on-sanitary-pads-after-four-year-legal-battle",
      "text": "Nepal."
    },
    {
      "url": "https://chrome-extension//efaidnbmnnnibpcajpcglclefindmkaj/https://www.publichealth.columbia.edu/file/17293/download?token=vPs7Yk7P#:~:text=%7C%20p4-,Current%20MHH%20status,or%20products%20to%20manage%20menstruation.",
      "text": "UN’s children’s agency"
    },
    {
      "url": "https://rimap.unhcr.org/node/61784#:~:text=(2)%20There%20shall%20be%20no,protection%20of%20women%20and%20children.&text=For%20the%20determination%20of%20his,fair%20trial%20and%20due%20process.&text=(1)%20Slavery%20is%20non%2D,in%20human%20beings%20are%20prohibited.&text=(b)%20for%20an%20offence%20by,fifty%2Dsix%2C%20an%20offence.&text=(b)%20shall%2C%20when%20accused,the%20purpose%20of%20extracting%20evidence.",
      "text": "the Constitution"
    },
    {
      "url": "https://chrome-extension//efaidnbmnnnibpcajpcglclefindmkaj/https://www.publichealth.columbia.edu/file/17293/download?token=vPs7Yk7P#:~:text=%7C%20p4-,Current%20MHH%20status,or%20products%20to%20manage%20menstruation.",
      "text": "to UNICEF"
    },
    {
      "url": "https://openknowledge.worldbank.org/entities/publication/21567354-9a75-4e6d-a2b2-219a69f007a1",
      "text": "last year"
    },
    {
      "url": "https://www.ceicdata.com/en/pakistan/average-retail-price-201516-price/average-retail-price-rice-basmati-broken",
      "text": "CEIC Data"
    },
    {
      "url": "https://clearinghouse.unicef.org/sites/ch/files/ch/sites-PD-WASH-WASH%20Knowledge%20unicef-FN40_Pakistan_PeriodEmpowerment%20and%20Santex%20Partnershi-5.0.pdf",
      "text": "said in a 2024 report, “"
    },
    {
      "url": "https://www.cnn.com/2025/08/06/asia/pakistan-floods-climate-crisis-intl-hnk",
      "text": "flash floods"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/asia/pakistan-pink-tax-womens-rights-intl-cmd",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/asia/pakistan-pink-tax-womens-rights-intl-cmd",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3b7d91cfb0a5a705ba556238676d5170a8ec6f7085f4137a067cbc8617057d75",
  "scraped_at": "2026-02-11T16:31:40.196895+00:00"
}