{
  "url": "https://lite.cnn.com/2026/02/10/markets/ai-investing-stock-market-companies",
  "title": "Wall Street is searching for AI winners and losers | CNN Business",
  "date": "2026-02-11T16:40:22.484770+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFor years, anything exposed to artificial intelligence was a hottrade on Wall Street. But today’s investors are more selective, demanding stronger evidence that companies are poised to benefit from the AI boom.\n\nWall Street is debating whether software companies canprotect their market share from AI startups’ new tools. Investors have grown skeptical of Big Tech’s plans tobuild data centers.But at the same time, they’ve continued betting onthechipmakersthat power the AI boom.\n\nSome software companies have emerged as potential AI losers, while hardware companies (think semiconductor chipmakers) continue to be AI winners. Popular exchange-traded funds highlight the divergence: The iShares Expanded Tech-Software Sector ETF is down 19% this year, while the VanEck Semiconductor ETF is up 12%.\n\n“The rising tide surrounding AI was lifting a lot of boats,” Steve Sosnick, chief strategist at Interactive Brokers,previously told CNN. “Now it’s forcing Wall Street to be much more selective and really decide who are the winners and losers. And that’s going to require a lot more detailed analysis, rather than just sort of riding the momentum train.”\n\nA sell-off swept through software stocks last week after Anthropic — one of the world’s biggest AI startups — released new plug-ins for its Claude chatbot. The plug-ins improved the chatbot’s ability to do work-oriented tasks and stoked concerns that such AI tools could reduce businesses’ need for their existing software subscriptions.\n\nInvestors are split on whether the sell-off was overdone. But software companies will need to evolve to co-exist with improvements in AI, said Angelo Zino, tech analyst at CFRA Research.\n\nSoftware companies that can leverage their own proprietary data and develop their own AI offerings could compete with chatbots like Claude, he said.\n\n“You’ve got to be a lot more selective,” Zino said. “The (companies) that do have access to customer data, and then can actually build actual (AI) agents upon that, those are going to be the ones that are going to be able to successfully evolve.”\n\nDan Ives, a tech bull and global head of technology research at Wedbush Securities, called the software sell-off “overblown” in a note on Monday.\n\nIves said many customers have reservations about data privacy and protection, which could be a hurdle for general AI chatbots becoming go-to services for businesses.\n\nWhile there are doubts about the software industry, Wall Street has resounding confidence that hardware companies are AI winners.\n\nSemiconductor chips are vital for the AI boom. Chipmakers like Nvidia (NVDA) have benefited from plans for enormous spending on data centers, regardless of whether investors approve of Big Tech’s aspirations.\n\nMemory chipmakers have also seen extraordinary surges due to expectations for the AI buildout to boost demand for data storage. Shares of Sandisk (SNDK) are up a whopping 1,500% across the past year since it spun off from Western Digital, a data storage company.\n\nChoosing winners and losers is not easy, and it might not be apparent which companies are poised to outperform. The “Magnificent Seven” group of technology stocks that powered the market higher across the past few years are diverging.\n\nBig Tech “hyperscalers” like Microsoft (MSFT), Amazon (AMZN), Meta (META) and Alphabet (GOOG), or companies building out infrastructure for the AI boom, are facing heightened scrutiny about their spending plans.\n\n“I think there’s more risk now tied to some of these data center companies, these hyperscalers, because of the greater spending that they’re taking on,” Zino said.\n\nTo be sure, some investors are betting that the enormous build out will eventually translate into revenue and profits.\n\nAlphabet and Meta shares are each up roughly 2% this year. Amazon shares are down 10%, and Microsoft shares are down 15%.\n\n“I would argue we are still in the early innings of a long-tailed investment cycle, but we have moved past the ‘beta’ or ‘get-me-in’ phase where names are rewarded simply for announcing they are spending on AI-related capex,” Kevin McCullough, portfolio consultant at asset management companyNatixis Investment Managers Solutions, said in an email.\n\n“The next phase of this cycle, where the market tries to pick winners and losers, is likely here to stay,” McCullough said.\n\nSome investors are looking for winners in the AI boom by finding companies that might benefit from the side effects.\n\nCaterpillar (CAT), for example, has benefited from the data center buildout. The industrial and construction company hit a record high Tuesday and is the best-performing stock in the Dow this year, with shares up 30%.\n\nThe AI boom also centers around OpenAI, andcircular financingbetween some Big Tech, chipmakers and cloud companies has raised questions about the size and health of long-term funding for the industry’s aspirations.\n\nZino at CFRA Research said companies with financial obligations related to OpenAI’s success might see elevated scrutiny from investors.\n\nWall Street is ultimately trying to discern the leaders and laggards of an investment theme that isbecoming more nuanced as it ages and develops.\n\n“The winners and losers from a revolutionary technology are often not clear for years,” Ajay Rajadhyaksha, managing director at Barclays, said in a Sunday note.\n\nJames Reilly, senior markets economist at Capital Economics, said in a note that while the broader stock market continues to climb higher, exposure to AI will be a specific boost or drag for certain companies.\n\n“Ultimately, firms’ exposures to the AI revolution can be grouped into one of three boxes: those who enable, those who adopt and those who are disrupted,” Reilly said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/investing/us-stocks-anthropic-software",
      "text": "protect their market share from AI startups’ new tools"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/tech/ai-chips-lifecycle-questions",
      "text": "build data centers"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/tech/vera-rubin-nvidia-ai-ces",
      "text": "chipmakers"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/markets/tech-stocks-meltdown-why",
      "text": "previously told CNN"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/NVDA",
      "text": "NVDA"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/SNDK#:~:text=Sandisk%20Corporation,-SNDK&text=Last%20closed%20at%20%24597.95.",
      "text": "SNDK"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/MSFT",
      "text": "MSFT"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/AMZN",
      "text": "AMZN"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/META",
      "text": "META"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/GOOG",
      "text": "GOOG"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/CAT",
      "text": "CAT"
    },
    {
      "url": "https://www.cnn.com/2025/10/07/business/openai-nvidia-bubble-nightcap",
      "text": "circular financing"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/markets/ai-investing-stock-market-companies",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/markets/ai-investing-stock-market-companies",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3bf2e0a02791a034701405b9bb3f67c88e4f6fbff58683e96c2a193895eacdf2",
  "scraped_at": "2026-02-11T16:40:22.484783+00:00"
}