{
  "url": "https://lite.cnn.com/2026/02/07/australia/australia-israel-herzog-visit-intl-hnk",
  "title": "Clashes in Sydney over Israeli president’s visit as police disperse mass protests | CNN",
  "date": "2026-02-11T16:34:25.548759+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIsraeli President Isaac Herzogreceived two very different receptions in Australia on Monday – a warm welcome by a government determined to show solidarity with itsgrievingJewish community, and mass protests by activists who consider him a war criminal.\n\nPrime Minister Anthony Albanese invited Herzog to visit as a gesture of unity with Jewish Australians after15 people were killedat a Hanukkah festival near Sydney’s Bondi Beach – the worst terror attack committed in the country.\n\nIn the weeks after the December 14 attack, the government has repeatedly pushed the need for social cohesion. However, Albanese’s decision to invite Herzog – the head of state of a country accused of genocide in Gaza, a claim Israel’s government denies– has angered many Australians and even led to calls for the visitor’s arrest.\n\nAfter touching down in Sydney on Monday, Herzog laid a wreath at Bondi Pavilion, near the site of the massacre, as across town lawyers for the PalestineAction Group argued in court for their right to protest his visit within an area subject to new government restrictions.\n\nLike many nations across the world, Australia has experienced sharp divisions over Israel’s war in Gaza that have spilled into protests – and as many as 30 were planned nationwide on Monday to mark Herzog’s visit.\n\nThe largest was held outside Sydney Town Hall, where police clashed with thousands of pro-Palestinian protesters on Monday evening, using pepper spray to disperse the crowd and making a number of arrests. The Palestine Action Group issued a statement condemning the “brutal attack by the NSW (New South Wales) Police against a massive peaceful protest.”\n\nNSW Police assistant commissioner, Peter McKenna, said in a news conference that police arrested 27 people – 10 for assaults against police and 17 for failing to comply with directions to move and related offences.\n\nOne video from the protests appears to show police forcibly dispersing a group of Muslims praying in the street. In response, the Australian National Imams Council released a statement calling the police conduct “shocking, deeply disturbing, and entirely unacceptable.”\n\nMajor Jewish groups in Australia, including the Executive Council of Australian Jewry and the Australian Jewish Association, have welcomed Herzog’s visit and condemned the protests.\n\nBondi Beach massacre survivor, Yvonne, who declined to give her surname, said the Israeli president’s trip to Sydney gave her comfort. She survived the onslaught after sheltering under a picnic table with her 2-year-old son as gunmen fired on the crowd.\n\n“It means we’re not alone. He’s come from the other side of the world,” she said of Herzog. “It means wherever we are in the world, we are supported by Israel. It means a lot.”\n\nAs Israel’s head of state, Herzog occupies a largely ceremonial role removed from the executive decision-making led by Prime Minister Benjamin Netanyahu, whose stated aim to destroy Hamas following the group’s October 7 massacre has resulted in the deaths of more than 70,000 Palestinians, according to the Palestinian Ministry of Health.\n\nThe International Criminal Court issuedarrest warrants for Netanyahu and former Defense Minister Yoav Gallant in 2024for alleged war crimes and crimes against humanity. Then last September, an independent UN inquiry found Netanyahu and Gallant – as well as Herzog – had“incited the commission of genocide.”\n\nThe inquiry commission pointed to comments Herzog made less than a week after Hamas militantskilled and kidnapped hundreds of Israelison October 7, 2023. Herzog said “an entire nation” had been responsible for the Hamas attack.\n\nHis words “may reasonably be interpreted as incitement to the Israeli security forces personnel to target the Palestinians in Gaza as a group as being collectively culpable,” the commission found.\n\nAfter the report’s release, Herzog angrily dismissed it as suffering from a lack of legitimacy.\n\nThe president’s office has not responded to a CNN request for comment. But Herzog has previously rejected claims he blamed all Palestinian people for the attack.\n\nOne of the authors of the report, UN commissioner Chris Sidoti, a former Australian human rights commissioner, says the country has a legal and moral imperative to detain Herzog on arrival, though he doesn’t think it’ll happen.\n\n“I feel quite confident that he would not even be attempting this trip if he had not received assurances from the Australian government that he would not be arrested,” he said. TheAustralian Federal Police (AFP) has confirmed that Herzog is protected by diplomatic immunity.\n\nAn Israeli official told CNN that Israel’s justice ministry had assured Herzog and his delegation there was no threat of arrest, partly because it was a state visit and also because no warrants existed for anyone in their party.\n\nOne of Herzog’s entourage, Doron Almog, chairman of the Jewish Agency, is also the subject of a formal complaint filed with the AFP by four legal groups including the Australian Centre for International Justice (ACIJ) and Palestinian human rights organization Al-Haq.\n\nAlmog, a former general in the Israel Defense Forces, reportedly canceled a planned trip to South Africa for fear he’d be arrested there by a country that took a genocide case against Israel to the International Court of Justice.\n\nUnlike Herzog, Almog does not have diplomatic immunity, the lawyers said.\n\nCNN has reached out to the Jewish Agency for comment.\n\nIn an interview with The Australian newspaper prior to his arrival, Herzog said he wanted to use the trip to confront “lies and false information” about Israel.\n\n“It’s the time to get out of that brainwash campaign that has been going on within the Australian public for quite some time, both against the Jews and against Israelis.”\n\nBut not all Jewish groups in Australia welcomed the visit.\n\nThe Jewish Council of Australia, a progressive advocacy group, accused Albanese of using Jewish grief as a “political prop and diplomatic backdrop.”\n\nHosting Herzog “risks entrenching the dangerous and antisemitic conflation between Jewish identity and the actions of the Israeli state,” Sarah Schwartz, the group’s executive officer, said in a statement. “This does not make Jews safer. It does the opposite.”\n\nA full-page open letter signed by “hundreds of Jews” was published in two major Australian newspapers on Monday that said Herzog does not speak for them and is “not welcome.”\n\nAfter the Bondi attacks, many in the Jewish community said Albanese had not done enough to stamp outantisemitism that had worsenedsince Israel sought to avenge Hamas’ murderous attack.\n\nIn the two years to September 2025, as Netanyahu’s government turned much of Gaza to rubble and the Palestinian death toll grew, Jewish groups recorded more than 3,700 “anti-Jewish incidents” in Australia, including arson attacks onsynagogues, car fires, and antisemitic graffiti.\n\nThe shaken Jewishcommunity was forced to increase its own security for fear that hatred could turn to bloodshed.\n\nIn the days after the Bondi Beach massacre – allegedly committed by afather and sonwho had embraced Islamic State ideology – the government announcedsweeping new gun laws, tougher rules on hate speech, and stronger powers for the home affairs minister to cancel visas on character grounds.\n\nAs his political opponents demanded he recall parliament and hold a special federal investigation into the attacks, Albanese asked Australia’s governor-general to formally invite to Herzog to the country.\n\nSidoti, the UN commissioner, said the Australian government had made a “tragic mistake” by inviting Herzog to the country at a time of deep division.\n\n“This mistake should have been corrected weeks ago,” he said. “This is a visit that will have serious consequences for social cohesion in Australia.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/australia/australia-jewish-community-home-intl-hnk-dst",
      "text": "grievingJewish community"
    },
    {
      "url": "https://www.cnn.com/2025/12/15/australia/australia-bondi-beach-shooting-victims-intl-hnk",
      "text": "15 people were killed"
    },
    {
      "url": "https://www.cnn.com/2024/11/21/middleeast/international-criminal-court-issues-arrest-warrant-for-israeli-prime-minister-intl",
      "text": "arrest warrants for Netanyahu and former Defense Minister Yoav Gallant in 2024"
    },
    {
      "url": "https://www.cnn.com/2025/09/16/middleeast/israel-gaza-genocide-un-commission-report-intl",
      "text": "“incited the commission of genocide.”"
    },
    {
      "url": "https://www.cnn.com/interactive/2023/10/middleeast/hamas-music-festival-attack-investigation-cmd-intl/",
      "text": "killed and kidnapped hundreds of Israelis"
    },
    {
      "url": "https://www.cnn.com/2025/01/25/australia/australia-antisemitic-attacks-investigation-intl-hnk-dst",
      "text": "antisemitism that had worsened"
    },
    {
      "url": "https://www.cnn.com/2024/12/05/world/fire-australia-synagogue-intl-hnk",
      "text": "synagogues"
    },
    {
      "url": "https://www.cnn.com/2025/12/16/australia/bondi-beach-shooting-suspects-intl-hnk-dst",
      "text": "father and son"
    },
    {
      "url": "https://www.cnn.com/2025/12/14/australia/australia-bondi-shooting-gun-laws-hnk-intl",
      "text": "sweeping new gun laws"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/australia/australia-israel-herzog-visit-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/07/australia/australia-israel-herzog-visit-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3c2b462f58128b69d3621ded9533b561c741e7653b4ac150a0aa9d80755d644a",
  "scraped_at": "2026-02-11T16:34:25.548771+00:00"
}