{
  "url": "https://lite.cnn.com/2026/02/18/tech/meta-mark-zuckerberg-testifies-social-media-addiction-trial",
  "title": "Meta’s Zuckerberg testifies about social media’s effects on children in landmark trial | CNN Business",
  "date": "2026-02-19T07:30:57.810437+00:00",
  "authors": [
    "Clare Duffy",
    "Samantha Delouya",
    "Veronica Miracle",
    "CNN"
  ],
  "text": "Source: CNN\n\nMeta CEO Mark Zuckerberg was grilled Wednesday about whether his company intentionally designed Instagram to be addictive, in front of the young woman accusing Meta and YouTube of hooking her as a child and damaging her mental health.\n\nThe Meta CEO, testifying before a jury for the first time on years-old claims about social media harming children’s mental health, said he believed he has navigated the safety of young users “in a reasonable way.”\n\nBut parents who traveled from across the country for the trial, saying their children had been hurt or died because of social media, painted a different picture outside the Los Angeles courtroom, describing a company that they say preyed on and exploited their children in the name of profits.\n\nThe outcome of this trial, in which a young woman, “Kaley,” accuses Meta and YouTube of designing addictive features to hook her as a small child, could serve as a bellwether for hundreds of other cases. If the companies lose, they could be on the hook for potentially billions in damages and forced to make changes to platforms that have shaped how many people live.\n\nZuckerberg exited from a back door of the courthouse after concluding more than five hours of testimony on Wednesday.\n\nBefore the trial began, nearly a dozenparents who say their children were harmedgathered hands outside the courthouse before Zuckerberg arrived.\n\nZuckerberg entered through the front door of the Los Angeles Superior courthouse around 8:30 a.m. local time, past a swarm of parents, media and jurors also waiting in line to enter. He did not respond to a question about what his message would be to parents who say their children were harmed by social media.\n\nKaley herself was also in the tightly packed courtroom to hear Zuckerberg’s testimony. Her lawyer, Mark Lanier, previously said she would not be present for much of the trial proceedings because she has social anxiety and difficulty being around crowds, although she is expected to testify later in the trial.\n\nAt one point in the testimony, Lanier pointed to Zuckerberg’s 2024 congressional testimony that “the existing body of scientific work” has not shown a link between social media and worse mental health outcomes for young people.\n\n“We get feedback from a handful of different stakeholders, including people who study wellbeing,” Zuckerberg said. “I took into account all of that info and I think I navigated this in a reasonable way.”\n\nSpeaking to reporters outside the courtroom during a break, Julianna Arnold said it was “surreal” to see Zuckerberg testify, after years of calling on the company to make greater changes. Arnoldtracesthe death of her 17-year-old daughter Coco to Instagram.\n\n“The intention of the company was to prey on teens … exploit them so they can make greater profits,” Arnold said. “That was done intentionally, not by accident.”\n\nAt the end of his questioning, Lanier brought out a dramatic prop: a poster multiple feet long, held by seven people, with hundreds of photos Kaley had posted to Instagram, as a way of hammering home her compulsive use of the platform.\n\nZuckerberg was pressed on Wednesday about whether children younger than 13 have access to Instagram. The app technically requires users to be 13 to sign up, and Zuckerberg said younger children are “not allowed on Instagram.”\n\nBut Lanier showed an internal document from 2015 that estimated over 4 million Instagram users were under 13, which it said represented “30% of all 10-12 year olds in the US.” Lanier has said the now-20-year-old plaintiff, Kaley, began using Instagram at age 9.\n\nLanier pointed out that it wasn’t until December 2019 that Instagram began asking new users to input a birthdate when signing up; previously, it just asked them to confirm they were above the age of 13. Instagram in August 2021 started asking existing users to provide a birthdate if they hadn’t done so previously, as part of a safety push for young people.\n\nThat means Kaley wasn’t asked for her age at all when she joined the platform.\n\nZuckerberg said that in 2019, before the birthdate rule was implemented, there was “some concern around privacy,” but he thinks they eventually landed on the right policy.\n\nLanier has said Kaley sometimes used Instagram for “several hours a day” and was once on the platform for more than 16 hours in a single day, despite her mother’s attempts to curb her use.Kaley claims the app’saddictive features led her to develop anxiety, body dysmorphia and suicidal thoughts and that she experienced bullying and sextortion on Instagram.\n\nA Meta spokesperson has said “we strongly disagree” with the allegations in Kaley’s lawsuit and “are confident the evidence will show our longstanding commitment to supporting young people.” The company’s lawyer has argued that it was Kaley’s difficult family life, rather than social media, that caused her mental health challenges. YouTube also denies the lawsuit’s claims.\n\n“The question for the jury in Los Angeles is whether Instagram was a substantial factor in the plaintiff’s mental health struggles,” a Meta spokesperson said in a statement ahead of Zuckerberg’s testimony. “The evidence will show she faced many significant, difficult challenges well before she ever used social media.”\n\nMeta has also pointed to safety features, such as parental oversight tools and “teen accounts,” which implement default privacy settings and content restrictions for users under the age of 18.\n\nLanier asked Zuckerberg whether a company should “prey upon” people who come from difficult backgrounds or are “less fortunate in educational opportunities.”\n\n“I think a reasonable company should try to help the people who use its services,” Zuckerberg replied.\n\nThe exchange got somewhat heated when Lanier questioned whether Zuckerberg and Meta set goals to maximize time spent on the app. The Meta CEO said time-specific goals existed “earlier on in the company” but it then shifted to focus on “utility and value.”\n\n“There’s a basic assumption I have that if something is valuable, then people will do it more,” Zuckerberg said on the stand.\n\nLanier showed an internal email from December 2015 in which Zuckerberg referenceda three-year plan for the company, which included “Time - +10% for Instagram.”\n\n“We used to give teams goals… we changed that because I don’t think it’s the best way to run the company,” Zuckerberg said in response.He argued that Lanier was mischaracterizing his approach from a decade ago.\n\nZuckerberg reiterated later reiterated that his goal is to build a product that has long-term appeal, not one that gets people hooked in the short-term but makes them feel bad about themselves.\n\nIn another tense exchange, Lanier grilled Zuckerberg over Instagram’s decision to allow “beauty” filters that manipulate a user’s face to make it appear they’re wearing makeup or have had facial surgery. Meta consulted with 18 experts that found such filters can cause harm, Lanier said.\n\nInstagram ultimately decided to allow such filters created by users but not to promote them in the app.\n\n“I thought the balance of free expression should allow people to make those filters but that we shouldn’t create those filters ourselves,” Zuckerberg said. He added that “experts in free expression” were also consulted on that decision, but said he didn’t know their names and hadn’t met with them.\n\nKimberly Pallen, a partner at the law firm Withers who specializes in complex civil litigation, told CNN that Zuckerberg needs to show Meta is doing its best. “That’s probably what it’s going to come down to: From the jury’s perspective, are they doing enough? And do they care?”\n\nZuckerberg’s performance on the stand could also play a significant role in how the jury views the case, Pallen said.\n\n“It’s going to turn on how these people testify in front of the jury, if the jury likes them, and what the documents show,” she said.\n\nEarlier in testimony, Zuckerberg discussed his majority ownership stake in Meta. He argued that the better Meta stock does, the more money gets invested into science andresearch, adding that he haspledgedto give away 99% of his wealth.\n\nLanier asked whether Zuckerberg would also “pledge money for the victims of social media.”\n\n“I disagree with the characterization of your question,” Zuckerberg said.\n\n–CNN’s Jack Hannah contributed reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/tech/meta-mark-zuckerberg-addiction-trial-testimony",
      "text": "parents who say their children were harmed"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/business/video/meta-youtube-tiktok-trial-julianna-arnold-vrtc",
      "text": "traces"
    },
    {
      "url": "https://www.youtube.com/watch?v=kz9crfdO5IM",
      "text": "pledged"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/tech/meta-mark-zuckerberg-testifies-social-media-addiction-trial",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/tech/meta-mark-zuckerberg-testifies-social-media-addiction-trial",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3c34ae012142584a3fe28b49f3b0608c1bbae8d88947fc2bcdc74d3e2f422ed6",
  "scraped_at": "2026-02-19T07:30:57.810449+00:00"
}