{
  "url": "https://lite.cnn.com/2026/02/14/sport/keshad-johnson-slam-dunk-contest-nba-all-star",
  "title": "Heat’s Keshad Johnson soars to a slam dunk title, edging Carter Bryant who had a perfect score | CNN",
  "date": "2026-02-15T07:10:41.853226+00:00",
  "authors": [],
  "text": "Source: AP\n\nKeshad Johnson of the Miami Heat won the Slam Dunk contest at NBA All-Star Saturday, overcoming perfect scores by San Antonio rookie Carter Bryant on his first dunk in the final round.\n\nFor his final dunk, Johnson started behind the judges’ table, took off from the free throw line and threw down a one-handed windmill jam. His first dunk earned a slightly higher score for a between-the-legs move.\n\nBryant earned the contest’s highest score for his first dunk in the final. He bounced the ball in front of him, caught it between his legs and dunked with his right hand, earning perfect 50.0 marks from all five judges.\n\nBut Bryant struggled on his second dunk. He missed his first two tries, pausing to talk to Vince Carter in between. He attempted bouncing the ball off the glass and throwing down a reverse but it rolled around the rim and out. He settled for a less flashy but successful dunk on his third and final attempt.\n\nIt wasn’t enough, giving the NBA a new slam dunk champion in Johnson. He accepted the trophy from Hall of Famer Julius Erving after shaking hands with all of the judges.\n\n“All the kids out there, keep dreaming, anything can happen,” Johnson said. “I just came out here and showed people.”\n\nIf there’d been a dance contest, Johnson would have won that, too. He came dancing onto the court, smiling all the way, and danced after claiming the title.\n\nThree-time dunk winnerMac McClung— currently on a two-way contract with the Chicago Bulls — didn’t participate. He was the only competitor in history to have a perfect contest, scoring 50s from every judge on all of his dunks last year in San Francisco.\n\nIt was a four-man field for the fifth consecutive year, with Jaxson Hayes of the Lakers and Jase Richardson of Orlando joining Johnson and Bryant. But Hayes and Richardson didn’t advance to the final.\n\nIn the first round, Johnson brought out rapper E-40. After missing on his first try, he leapt over E-40’s bowed head and slammed the ball down while keeping his left hand behind his head.\n\nJudging the contest were Erving, fellow Hall of Famer Dominique Wilkins, Dwight Howard, Corey Maggette and Brent Barry.\n\nDamian Lillardisn’t playing this season. He still scored big anyway, winning the 3-point contest over Devin Booker.\n\nLillard tied Larry Bird and Craig Hodges with his third title, most in the contest’s history. Defending champion Tyler Herro of the Miami Heat didn’t compete.\n\nLillard scored 30 points in the final round, edging Booker, who got hot early but tailed off and finished with 27. Booker of the Phoenix Suns was the champion in 2018.\n\n“I was praying for his downfall,” Lillard said.\n\nCharlotte Hornets standout rookie Kon Knueppel finished third with 17 points, wrinkling his nose at the result.\n\nLillard won his first title in 2023 while playing for the Portland Trail Blazers. He won it again the following year with Milwaukee. He’s not playing for the Blazers while rehabbing from a torn left Achilles tendon. Still, he told the NBA he’d suit up for the contest if he needed.\n\n“That’s all I do it for, keep adding to my legacy,” he said.\n\nBooker was the top scorer after the first round with 30 points. Knueppel and Lillard were tied for second with 27.\n\nLillard fired away in the final, with the The Wall section of fans at the Los Angeles Clippers’ Intuit Dome holding up red umbrellas in a sign he was making it rain.\n\n“You just got to let the ball fly, trust your instincts as a shooter, and you can’t get ruffled when someone else gets hot,” Lillard said.\n\nEliminated after the first round were Donovan Mitchell, Tyrese Maxey, Norman Powell, Jamal Murray and Bobby Portis Jr.\n\nAmong the celebs on hand were Spike Lee,Magic Johnson, Queen Latifah, James Worthy, comics Keegan-Michael Key and Chris Tucker and singer Joey Fatone. Ludacris performed “All I Do Is Win” and other hits in a flame- and firecracker-filled show before the dunk contest.\n\nTeamKnicks, comprised of Karl-Anthony Towns, Allan Houston and Jalen Brunson, won the Shooting Stars trophy with 47 points. Lee, wearing his New York bucket hat, grinned from courtside.\n\nThey rallied in the final seconds to beat Team Cameron’s Knueppel, Jalen Johnson and Maggette, who finished with 38 points in the contest’s return for the first time since 2015.\n\nBrunson’s father, Rick, a current Knicks assistant, served as the winning team’s “celebrity” passer.\n\nTeam Cameron, a nod to the trio’s alma mater of Duke, took its passes from actor-comedian Anthony Anderson.\n\nRon Harper Jr., Dylan Harper and Ron Harper of Team Harper, along with Team All-Star’s Richard Hamilton, Chet Holmgren and Scottie Barnes were eliminated after the first round.\n\nTeams had 70 seconds to score points while rotating through seven designated shooting locations around the court, with all three players on a team shooting at each spot in a set order.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/02/16/sport/mac-mcclung-slam-dunk-history-spt-intl",
      "text": "Mac McClung"
    },
    {
      "url": "https://www.cnn.com/2025/04/29/sport/cavaliers-heat-sweep-damian-lillard-nba-spt-intl",
      "text": "Damian Lillard"
    },
    {
      "url": "https://www.cnn.com/magic-johnson-billionaire",
      "text": "Magic Johnson"
    },
    {
      "url": "https://www.cnn.com/2025/05/29/sport/new-york-knicks-hope-nba-playoffs-spt",
      "text": "Knicks"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/sport/keshad-johnson-slam-dunk-contest-nba-all-star",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/sport/keshad-johnson-slam-dunk-contest-nba-all-star",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3d482ad7bb3a034384831d55d421ed754cccb1b5c942a33bbbd1c169ab5beb23",
  "scraped_at": "2026-02-15T07:10:41.853239+00:00"
}