{
  "url": "https://lite.cnn.com/2026/02/26/politics/voter-id-save-act-filibuster",
  "title": "Despite Trump’s voter ID law push, Republicans say votes aren’t there to change filibuster rules to pass SAVE Act | CNN Politics",
  "date": "2026-02-27T07:15:47.788058+00:00",
  "authors": [
    "Morgan Rimmer",
    "Lauren Fox",
    "Ted  Barrett",
    "Ellis Kim"
  ],
  "text": "Source: CNN\n\nDespitePresident Donald Trumpdemanding that Majority Leader John Thune find some wayto pass a voter ID billin the Senate, Republicans in the chamber maintain they do not have the support to change Senate rules to bypass the filibuster.\n\nThe predicament for Republicans highlights the limits of their narrow majority on Capitol Hill, and the constraints the party faces in enacting Trump’s agenda even with control of Congress and the White House.\n\nMost legislation in the Senate requires 60 votes to advance, which means Republicans would need some Democratic support to pass the voter ID bill. But Democrats are opposed to the package, as is GOP Sen. Lisa Murkowski.\n\nTrump’s push for the voter ID bill has ramped up pressure on Thune. The Senate GOP leader supports the bill and has said he’ll bring it up for a vote, but has warned that Democrats will block it.\n\nAnd as some conservatives push for the Senate to nukethe filibusterto give the bill a real chance at passing, Thune has said he does not have the votes to take that step.\n\nAsked by CNN if he’s surprised by the pushback from some on the right, Thune on Thursday said that a social media “ecosystem” has created an “echo chamber” on the issue.\n\n“They aren’t going to, you know, tell us how we’re going to run the Senate,” he said when asked about pressure from some in the House.\n\nIn addition to requiring voter ID to vote in federal elections, the bill, called “the SAVE America Act,” wouldrequire documentary proof of US citizenshipto register to vote in federal elections.\n\nRepublicans say the bill will safeguard elections and prevent non-US citizens from voting in elections, which is already against the law and experts say rarely happens. Democrats and opponents of the legislation argue it would effectively disenfranchise American citizens who cannot easily access their birth certificate or other citizenship documentation.\n\nSen. Mike Lee, a Utah Republican, has proposed the “talking filibuster,” meaning Democrats would have to hold the floor to block the bill, not just say they object to moving forward. But Senate leaders are concerned that the process they expect would play out on the floor, if that were to happen, could take weeks or months to deal with the bill.\n\n“The conference is not unified on an approach on that yet,” Thune said about the “talking filibuster.”\n\nLee said on Thursday “we’re a few votes shy” when asked about the SAVE Act, adding, “we need the support of the conference.”\n\nDuring his State of the Union address on Tuesday night, Trump demanded that Thune take action andpush the bill through the Senate.\n\n“I’m asking you to approve the SAVE America Act to stop illegal aliens and others who are unpermitted persons from voting in our sacred American elections,” said Trump. “That cheating is rampant in our elections. It’s rampant. It’s very simple, all voters must show voter ID. All voters must show proof of citizenship in order to vote.”\n\nThere is no evidence that voter fraud is “rampant,” as Trump claimed.\n\nRepublican Sen. John Cornyn, who faces a contentious primary next week and has so far been unable to secure the president’s endorsement, refused to say if he opposes gutting the filibuster in order to pass the bill in the Senate.\n\n“There’s not the votes in the Republican conference to change those rules,” he replied.\n\nGOP Sen. Josh Hawley told CNN, “I hope that we can pass the Save Act. … And I’m in favor of doing the talking filibuster or anything else we need to do to try to pass it.”\n\nAsked whether there is any frustration with Thune’s hesitancy to take that step, Hawley acknowledged that maintaining a “talking filibuster” requires agreement within the GOP conference — something Thune has said they don’t have.\n\n“This would only work if you had a majority of the Senate GOP willing to do it because once you start a filibuster the majority party has to be able to hold the floor. You know, otherwise Democrats would gain control of the floor, so I think we should do that. Not all of my colleagues agree with that, so you know he’s, I think, probably trying to negotiate those differences,” said Hawley.\n\nMurkowski noted that Republicans had opposed nuking the filibuster when Democrats controlled the chamber and wanted to pass a voting rights bill.\n\n“Once again we’re in the same place, it’s just a different team carrying this ball to erode the protections of the filibuster. So I have said that I didn’t support doing that when the Democrats were making an effort on election reform. And I don’t support it when the Republicans do as well.”\n\nThe Alaska Republican said she opposes the bill itself due to “the specific requirements that make implementation in a very, very rural state like mine, very difficult, if not impossible in certain areas.”\n\n“And so, I’m very concerned about the potential for disenfranchisement of voting,” she added\n\nRetiring Sen. Thom Tillis is not opposed to the underlying bill, but he is against changing the filibuster over the legislation. “I think the predicate for a talking filibuster, or de facto filibuster, nuking it to get it done, is wrong. I think it’s bad strategy. I don’t think they’re going to accomplish their goal, and we’re going to burn a lot of legislative days to come to that blinding flash of the obvious,” he said.\n\nAfter hosting his annual dog costume parade on Wednesday, Tillis faced anger from some right-wing accounts on social media that suggested that time should be spent on trying to pass the SAVE Act.\n\nTillis has long hosted his annual event at Halloween, but due to the lengthy government shutdown this fall he rescheduled the event for “Doggi Gras.” The North Carolina Republican is retiring, making this his final “bipawtisan” parade.\n\n“They’re either sad cases or cat owners — with all due respect, I like cats…my God, it was a 45 minute session. I can walk and chew gum at the same time. They should try it,” he told CNN of the online pushback.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/02/politics/donald-trump-sotu-address-vis/",
      "text": "to pass a voter ID bill"
    },
    {
      "url": "https://www.cnn.com/2025/10/31/politics/filibuster-senate-trump-explained",
      "text": "the filibuster"
    },
    {
      "url": "https://www.cnn.com/2025/04/10/politics/save-act-noncitizen-voting-bill-house",
      "text": "require documentary proof of US citizenship"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026?post-id=cmm1gxer6001h3b6t7x4ns7il",
      "text": "push the bill through the Senate."
    }
  ],
  "hash": "3d4bb3c6544ff4feb3996f7e6651f66bf8c7df84b264552d1c246ee24e383329",
  "scraped_at": "2026-02-27T07:15:47.788071+00:00"
}