{
  "url": "https://lite.cnn.com/2026/02/26/us/shah-alam-blind-refugee-border-patrol-hnk",
  "title": "Nurul Amin Shah Alam: Nearly blind refugee found dead in New York days after immigration agents dropped him at a coffee shop alone, officials say | CNN",
  "date": "2026-03-01T07:08:40.447386+00:00",
  "authors": [
    "Hanna Park",
    "Alisha Ebrahimji",
    "Elise Hammond"
  ],
  "text": "Source: CNN\n\nThe death of a nearly blind refugee in Buffalo, New York, days after Border Patrol agents dropped him off at a coffee shop alone, has prompted an investigation into the circumstances of his final days and drawn sharp criticism from state and local officials.\n\nNurul Amin Shah Alam, 56, who spoke little English, had been missing since February 19, when the agents left him at the shop shortly after he was released from the Erie County jail, officials said. His body was found five days later, around 8:30 p.m. Tuesday, about four miles from the coffee shop, the Buffalo Police Department said.\n\nDozens of people gathered at a local mosque for Shah Alam’s funeral Thursday afternoon. They prayed and went to a cemetery to lay the father to rest.\n\nThere are still many unanswered questions about Shah Alam’s death and what led up to it.\n\nA spokesperson for US Customs and Border Protection said Border Patrol agents offered Shah Alam “a courtesy ride, which he chose to accept to a coffee shop, determined to be a warm, safe location near his last known address, rather than be released directly from the Border Patrol station.”\n\n“He showed no signs of distress, mobility issues or disabilities requiring special assistance,” CBP said.\n\nBuffalo Police said its “homicide detectives are investigating the circumstances and timeframe of events leading up to his death, following his release from custody.”\n\nBuffalo Mayor Sean Ryan said Thursday the Erie County Medical Examiner has not yet released full findings on his cause of death, despite an earlier statement from a city spokesperson who said the medical examiner conducted an autopsy and determined Shah Alam’s cause of death was health‑related. CNN has reached out to the medical examiner for clarity.\n\nThe Erie County Health Department previously told CNN that Medical Examiner records are treated as confidential medical records and would only be shared with law enforcement and others legally entitled to them.\n\n“The Border Patrol officers had no protocol of what to do with a disabled man who doesn’t speak English, who is confused and lost. And you know what they did? They dropped him at a closed coffee shop. That’s why we do not cooperate with ICE, Homeland Security and Border Patrol,” Ryan said.\n\nOnWednesday, the mayor called Shah Alam’s death “preventable” and insisted CBP “answer for how and why this happened.”\n\nNew YorkCongressman Tim Kennedyalso called for a “full and transparent investigation at the local, state, and federal levels.”\n\nNew York Attorney General Letitia James said her office “is reviewing our legal options,” according to a statement.\n\nThe incident highlights growing concerns over the constitutionalrights and treatmentof people who come in contact with federal agents, regardless of their immigration status, in the Trump administration’s mass deportation efforts.\n\nShah Alam, a refugee from Myanmar, had spent much of the previous year in custody awaiting trial on criminal charges that were ultimately resolved with a misdemeanor plea deal, Erie County District Attorney Michael J. Keane told CNN in a statement Thursday.\n\nShah Alam had previously worked in construction in Malaysia and came to the US with his wife and two children, searching for opportunity, Imran Fazal, who knows the family, told CNN affiliateSpectrum News Buffalo. He could not walk without a cane, she said.\n\nHe had only been in the US for a few months before his arrest, the Legal Aid Bureau of Buffalo, which was representing Shah Alam, said.\n\nOne of his children toldReutersthe arrest was a result of a misunderstanding with police. Shah Alam had been out for a walk and was using a curtain rod as a walking stick when he got lost and wandered onto private property, his son Mohamad Faisal said. When he did not understand officers’ commands to drop the rod, Shah Alam was arrested.\n\nIn body camera video of the incident obtained by WGRZ, Shah Alam is seen walking through a yard with what appears to be two black poles. He appears to wave the poles in the direction of the officers, before they fire stun guns, the video shows. Shah Alam is then tackled and handcuffed.\n\nThe two officers were injured, according to the police report. While they were taking Shah Alam into custody, the man bit one officer on the arm and the other on the hand, the report said.\n\nShah Alam was being held on two counts of assault with intent to cause injury to an officer, a count of possession of a weapon and trespassing, among other charges, before a plea deal was reached, according to apolice report.\n\nAt Shah Alam’s arraignment on the indictment in June 2025, his bail was modified to $5,000 cash or bond, but he remained in custody as the case moved to its trial date, the district attorney’s office said.\n\nIn early February, Shah Alam pleaded guilty to misdemeanor charges with prosecutors and defense attorneys agreeing that he would remain in custody on bail pending a sentencing hearing set for March 24, Keane said.\n\n“In this matter, the reduced disposition appropriately held the defendant accountable for the crime while avoiding a penalty that would be unduly harsh and disproportionate to the offense,” Keane said.\n\nEven though Shah Alam was in the US legally as a refugee, according to his attorneys, “due to the uncertainty of the current immigration climate, a strategic decision was made not to post bail for fear that he would disappear into immigration custody.”\n\nBut later, after consulting with another attorney, the Legal Aid Bureau of Buffalo said it was determined that Shah Alam’s family could post his bail and he would not be deported.\n\nShah Alam was released from jail after it was posted on February 19, Keane said.\n\nAs Shah Alam’s discharge from jail was being processed, deputies notified US Border Patrol, which had earlier placed him under an immigration detainer, the Erie County Sheriff’s Office said in a statement.\n\n“U.S. Border Patrol arrived at the Holding Center prior to the finalization of Mr. Shah Alam’s release from Erie County Sheriff’s Office custody,” the statement said.\n\nA spokesperson for CBP said the agents later determined Shah Alam had entered the United States as a refugee on December 24, 2024, and “was not amenable to removal.”\n\nUpon learning that Shah Alam was ineligible for removal, Border Patrol agents, using a translator program, attempted to communicate with him, according to a federal law enforcement official who said that Shah Alam asked to be taken to the location where he was eventually left. He was offered an opportunity to make a phone call but declined, the official said.\n\nRyan, the mayor, criticized the series of events by Border Patrol, saying there were ways they could have contacted someone to help Shah Alam. After it was clear he could not be removed from the country, agents did not take him back to the holding center, he said. There, they could have obtained phone numbers for his son or lawyer, who had both been active visitors while he was in custody, according to Ryan.\n\n“That is bad policing, but that is also bad human beings. That is an inhumane thing to do,” he said.\n\nAccording to preliminary information, Shah Alam did not have shoes on, just orange booties from the detention center, when he was dropped off by agents, Ryan said.\n\nThe day Shah Alam was dropped off at the coffee shop, the area saw light freezing rain with temperatures in the low 30s. There was snow and fog over the next two days, with temperatures hovering around freezing for at least 24 consecutive hours.\n\nNeither his family nor their attorney was notified by federal authorities where Shah Alam was dropped off at the coffee shop and he did not read, write or use electronic devices, his son told Reuters. Additionally, his family no longer lives in the area of the coffee shop, Shah Alam’s lawyers said.\n\nRyan said that “for multiple days, there was confusion” about where Shah Alam was. When he wasn’t at the holding center, his family thought he was at an ICE detention center in Buffalo, the mayor said. They later found out he was released, which prompted several agencies and community groups to start searching for him, Ryan said.\n\nA missing person report was filed on February 22 by Shah Alam’s attorney. The next day, a police report said a detective determined that Shah Alam had been in federal custody and closed the probe, but it was reopened a few hours later when the detective found out that was no longer true.\n\nOn February 24, law enforcement talked to Shah Alam’s son who said he last saw his father at the Erie County Holding Center five days before, a police report said. From there, detectives found out Shah Alam had been dropped off the at the coffee shop and searched the surrounding neighborhood, the document shows.\n\nLater that day, someone called 911 and said there was a man that appeared to not be breathing, according to the police report. The man, later identified as Shah Alam, was pronounced dead at the scene after first responders attempted life-saving measures.\n\n“How in a place like the United States of America, how does something like that happen here?” a family friend, Khaleda Shah, told CNN affiliate WKBW. “We don’t feel safe at all. The family does not feel safe. And here, especially in the City of Buffalo, we’re supposed to be in the City of Good Neighbors.”\n\nThe family are Arakan Rohingya refugees from Myanmar, Faisal ﻿said, referring to the stateless Muslim minority from Myanmar’s Rakhine state. Hundreds of thousands of Rohingya havefled the war-torn countrysince late 2016 following a brutal crackdown by the military junta that the US has since declared a genocide.\n\nShah Alam only wanted to “eat home-cooked food” and “be united with the rest of (his) family,” Faisal told Reuters.\n\nIn his statement, Keane said his office first learned about Shah Alam’s release from jail on Tuesday and will move to dismiss the charges against the man when they receive his death certificate.\n\n“I am saddened to learn of the tragic death of Nurul Amin Shah Alam,” Keane said. “I recognize the desire for answers sought by his family, friends and our community as his death remains under investigation.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.buffalony.gov/m/newsflash/home/detail/1614",
      "text": "Wednesday"
    },
    {
      "url": "https://kennedy.house.gov/news/documentsingle.aspx?DocumentID=2370",
      "text": "Congressman Tim Kennedy"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/us/refugees-asylum-seekers-minnesota-detained-ice",
      "text": "rights and treatment"
    },
    {
      "url": "https://spectrumlocalnews.com/nys/buffalo/news/2026/02/26/mayor-ryan-sounds-off-after-disabled-refugee-is-found-dead-in-buffalo",
      "text": "Spectrum News Buffalo"
    },
    {
      "url": "https://www.reuters.com/world/us/near-blind-refugee-found-dead-buffalo-after-release-by-us-border-patrol-2026-02-26/",
      "text": "Reuters"
    },
    {
      "url": "https://www.scribd.com/document/1003916133/Bpd-Arrest",
      "text": "police report"
    },
    {
      "url": "https://www.cnn.com/specials/asia/rohingya",
      "text": "fled the war-torn country"
    }
  ],
  "hash": "3d68fe9b6230bed023f4bb12149ad8c10391e1bed8c2c39c835e7153f6be130c",
  "scraped_at": "2026-03-01T07:08:40.447396+00:00"
}