{
  "url": "https://lite.cnn.com/2026/02/26/business/paramount-wbd-merger-david-ellison",
  "title": "With Paramount’s winning WBD bid, David and Larry Ellison are amassing a media empire | CNN Business",
  "date": "2026-02-28T06:59:19.169165+00:00",
  "authors": [
    "Analysis by David Goldman"
  ],
  "text": "Source: CNN\n\nLess than a year ago, David Ellison was the head of a small production company. Now, he’s on the verge of becoming the king of Hollywood.\n\nThe Paramount Skydance CEOemerged victoriousThursday night in a bidding war for Warner Bros. Discovery. It was a prize Paramount desperately needed to survive, and winning was not assured. It still isn’t.\n\nThe battlepitted Ellison against Netflix, the industry’s biggest and most important player. President Donald Trump injected himself into the sweepstakes. So did the Saudis. And at one point, the bidding war involved ahostile takeover threat.\n\nBut Ellison won. And if the deal is completed – pending shareholder approval and a potentially difficult regulatory review – he will run one of the media industry’s largest movie studios, streaming platforms and television networks.\n\nEllison, the son of Oracle founder Larry Ellison, has been a Hollywood producer for two decades, forming Skydance with his billionaire father in 2006 and financing some major franchises, including Star Trek, Mission Impossible and Top Gun. When Paramount – a company in disarray and deep financial distress – started courting potential buyers in 2024, Ellison emerged as the white knight. Skydance completed its Paramount purchase in August 2025.\n\nBut the company needs more help than Ellison alone can provide. Paramount+ is an also-ran streaming platform with a few fan-favorite franchises, NFL broadcast rights and a bunch of question marks. The movie studiodidn’t land a single filmin the top 10 grossing box office releases of 2025. Its cable networks barely make any original content anymore, beyond Comedy Central’s South Park and the Daily Show. CBS’ ratings tumbled 12% in 2025, according to Nielsen.\n\nTo battle against legacy media companies like Disney and Netflix – and social media companies like TikTok and YouTube – Paramount needed scale. So Ellison almost immediately started courting Warner Bros. Discovery.\n\nTwo months after Skydance bought Paramount, WBDput itself up for sale. But Netflix emerged with WBD’s favored bid.\n\nNetflix appeared to have the upper hand for months: It had plenty of cash to complete the transaction, and Netflix planned to offload CNN and the rest of WBD’s cable assets in a tax-free spinoff before it acquired HBO Max and Warner Bros. WBD continued to insist that Paramount’s offer – even though it was for the entire WBD company – undervalued the assets.\n\nWBD also questioned whether Paramount was truly good for the money, raising questions about the Saudi financing backing part of the deal and whether Larry Ellison would really guarantee that he’d bankroll the acquisition. Even after Paramount alleviated those concerns by letting WBD peer into Ellison’s books and making the Saudis nonvoting, non-board members, WBD still favorited Netflix.\n\nSo Paramount threatened a hostile takeover bid, pledging to take the deal directly to shareholders. The tide turned last week, when Paramount said it would revise its offer. Raising its bid by $1 – to $31 a share – Paramount won over WBD’s skeptical board Thursday. Hours later, after Netflix’s CEO left a meeting at the White House, Netflix said – shockingly – it was dropping out of the bidding.\n\nIt’s not clear why Netflix dropped out so quickly. It knew Paramount was going to up its bid.\n\nTrump was and remains a major X factor in the transaction. Although presidents typically stay out of antitrust investigations, Trump strongly suggested that he favored a Paramount deal because of Ellison’s politics. Ellison donated to Democrats but hasrecently cozied up to Trump.\n\nIf the deal closes, Hollywood’s landscape will forever change.\n\nThe movie industry would consolidate. Although Paramount plans to operate Warner Bros. as a separate studio, it would still put one of the industry’s five major studios under mutual ownership. Paramount+, which wasn’t viable on its own, would suddenly become a true streaming competitor to Netflix, Amazon and Disney+ by integrating HBO Max. And the Discovery and Viacom cable networks would gain leverage in negotiations with advertisers and cable companies.\n\nThe media industry is in crisis, and the combination could help both companies survive.\n\nBut it won’t come without considerable pain: Paramount said the merger will create $6 billion of synergies and cost savings that will almost certainly lead to thousands of layoffs.\n\nUnions, which were unhappy with the prospect of any industry consolidation may give Paramount a hard time and may not want to play ball. Arguably Paramount’s most important star, “Yellowstone” and “Landman” writer Taylor Sherdian plans to leave for NBCUniversal at the conclusion of his current contract.\n\nAnd since Ellison took the helm at Paramount, the company has been accused of bowing to Trump. It paid Trump millions of dollars after the president sued over a 60 Minutes edit of its interview of former Vice President Kamala Harris that he didn’t like. It canceled Stephen Colbert’s Late Show – one of the most bitingly critical-of-Trump shows on TV. And 60 Minutes temporarily held a segment about the El Salvadorian prison the Trump administration sent some deportees to.\n\nThose questions will remain as the company seeks to integrate with WBD – including CNN, a news outlet that Trump says he despises.\n\nShareholders will need to approve the deal – and so will regulators. Although Netflix’s deal faced a steep regulatory hurdle in the United States because of the sheer market power it would have created, the Paramount deal for WBD may not be as tough a sell at home.\n\nAlthough it removes a major player from Hollywood, the combined company still won’t approach Netflix’s scale. Layoffs are a near certainty after the deal is consummated – but they were a near certainty without a deal, because each company individually lacked staying power in a rapidly changing media landscape. Neither had a robust parks business like Disney or Universal, and the entire industry has been upended by YouTube and social media.\n\nNevertheless, the deal could face a tough fight from states’ attorneys general, who may resist the creation of a new media behemoth. And regulation overseas may be a tough sell. That’s why the deal could take months – and perhaps more than a year – to finalize.\n\nIt could also attract some copycats. After the deal, Disney, Comcast and Sony could be left without dance partners, and they may be persuaded to bulk up to compete with the newly combined giant.\n\nScale may help kick the can far down the road. But even with its massive scale, the long-term prospects for a potential Paramount-WBD merger remain a question.\n\nPeople are going to the theater less. They’re spending less time consuming scripted comedies and dramas, and they’re replacing it with scrolling on their phones. Audiences are less interested in news and less interested in watching TV.\n\nBut there really wasn’t much other option for David Ellison, who is about to rule Paramount and WBD … and Hollywood along with them.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/media/netflix-paramount-wbd",
      "text": "emerged victorious"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/media/paramount-warner-bros-wbd-offer",
      "text": "pitted Ellison against Netflix"
    },
    {
      "url": "https://cnn.com/2025/12/08/business/paramount-hostile-takeover-bid-wbd",
      "text": "hostile takeover threat"
    },
    {
      "url": "https://www.boxofficemojo.com/year/2025/?sort=rank&sortDir=asc&ref_=bo_yld__resort#table",
      "text": "didn’t land a single film"
    },
    {
      "url": "https://www.cnn.com/2025/10/21/media/warner-bros-wbd-sale-paramount-skydance-suitors",
      "text": "put itself up for sale"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/media/david-ellison-trump-paramount-netflix-wbd",
      "text": "recently cozied up to Trump"
    }
  ],
  "hash": "3dd36a02b68570c79da15f84860e73568ea71369284d3a7748c86d085bfe68ee",
  "scraped_at": "2026-02-28T06:59:19.169179+00:00"
}