{
  "url": "https://lite.cnn.com/2026/02/26/media/netflix-paramount-wbd",
  "title": "Paramount emerges victorious over Netflix in Warner Bros. Discovery bidding war | CNN Business",
  "date": "2026-02-27T07:15:18.831341+00:00",
  "authors": [
    "Brian Stelter"
  ],
  "text": "Source: CNN\n\nParamount emerged as the victor in the months-long battle for Warner Bros. Discovery after Netflix backed out of the bidding war on Thursday, leaving Paramount poised to acquire Warner’s vast media empire, including CNN.\n\nNetflix said it has “declined to raise its offer for Warner Bros.” after the Warner Bros. Discovery board determined that Paramount has submitted a “superior” offer for the media giant.\n\n“The deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid,” the streamer said, suddenly ending the corporate tug-of-war.\n\nWith that announcement, Paramount suddenly moved much closer to taking over CNN, HBO, and the rest of the assets owned by Warner Bros. Discovery, or WBD for short.\n\nThe regulatory review process will still take several months at a minimum. But barring any further surprises, Paramount CEO David Ellison will assemble a sprawling entertainment and news empire with dozens of TV channels, multiple movie studios and two leading newsrooms.\n\nWBD CEO David Zaslav wished Netflix well and extended a friendly hand toward Paramount in a statement Thursday evening.\n\n“Once our Board votes to adopt the Paramount merger agreement, it will create tremendous value for our shareholders,” Zaslav said, alluding to the fact that WBD’s stock price more than doubled during the months-long bidding war. Paramount most recently offered $31 per share.\n\n“We are excited about the potential of a combined Paramount Skydance and Warner Bros. Discovery,” Zaslav added, “and can’t wait to get started working together telling the stories that move the world.”\n\nNetflix’s withdrawal — which has the effect of arguing that Paramount is overpaying for WBD — caused the company’s shares to surge 9% on the news after-hours, showing that some investors were relieved by the decision.\n\nThe change in fortunes came on the same day that Netflix co-CEO Ted Sarandos held meetings at the White House.\n\nSarandos was seen exiting the White House complex with a glum look on his face.\n\nDemocratic Sen. Elizabeth Warren, a staunch critic of both the Netflix and Paramount bids, immediately questioned whether the Sarandos discussions with Trump administration officials had something to do with Thursday’s sudden change.\n\n“What did Trump officials tell the Netflix CEO today at the White House?” Warren asked in a post on X, saying it “looks like crony capitalism with the President corrupting the merger process in favor of the billionaire Ellison family.”\n\nPresident Trump had previously indicated that he favored Paramount over Netflix, though he also sent mixed messages about the mega-merger.\n\nLast weekend, Trump publicly told Netflix to remove board member Susan Rice, a former Obama advisor, or “pay the consequences” — renewing the prospect that he would put his thumb on the corporate scale.\n\nAdditionally, Trump said last December that it was “imperative that CNN be sold,” and the deal with Netflix did not entail CNN being sold; instead, it would have been spun off into a new entity with WBD’s other cable assets.\n\nHowever, that corporate breakup plan may no longer be relevant. Paramount has repeatedly said that it was seeking to acquire all of WBD, including the cable assets, even though it cast doubt on the actual value of those assets.\n\nNetflix’s decision came barely an hour after the WBD board deemed Paramount’s latest takeover offer “superior” to the existing deal for Netflix to buy Warner Bros and HBO.\n\nSuddenly, for the first time, WBD was calling Paramount the frontrunner in a competition that Ellison started last summer by going to Zaslav with an unsolicited bid for the much bigger media company.\n\nWBD repeatedly rebuffed Paramount’s bids and raised doubts about Paramount’s financial wherewithal. When the WBD board signed a deal with Netflix instead, Paramount launched a hostile takeover bid.\n\nLast week, Netflix granted WBD a seven-day waiver to hold talks with Paramount while calling Paramount’s push an “ongoing distraction” for the entertainment industry.\n\nThe goal, from WBD’s perspective, was to find out Paramount’s “best and final” offer, since Paramount had previously indicated that it would go higher than its $30-per-share proposal.\n\nIndeed, Paramount did. Ellison’s newest bid, announced Tuesday, values all of WBD, including CNN, at $31 per share.\n\nParamount attached several deal sweeteners that appealed to the WBD board, including a $7 billion “regulatory termination fee.” The company accepted all the key terms that WBD wanted.\n\nWhen WBD released quarterly earnings on Thursday morning, Zaslav said the bidding war had “led to eight price increases” and “thus far achieved a 63% increase in value versus the first offer received in September, delivering significant value for WBD shareholders throughout the process.”\n\n“Our focus has and always will be maximizing value and certainty while mitigating downside risks,” Zaslav said, “and the board will evaluate any proposal against that standard, with the objective of delivering the best deal for our shareholders.”\n\nSarandos visited the White House for meetings — though notably not with the president — just before WBD announced that Paramount’s bid was “superior.”\n\nIndustry analysts had said they expected Trump’s Justice Department to sue to block the deal, potentially leading to a protracted period of litigation. But Sarandos had exuded confidence about Netflix’s ability to get the deal done.\n\nA Wednesday report by Politico about the upcoming Sarandos visit spurred speculation about whether the Netflix chief would have face time with the president. That apparently led the White House to clarify on Thursday that Sarandos was not meeting directly with Trump.\n\n“Netflix is meeting with staff members at the White House,” a White House official told CNN.\n\nThat lined up with an account from a Netflix spokesperson, who said the company’s leadership did not request a meeting with Trump in the first place.\n\nThe Netflix spokesperson also said the visit with staff members was set up two and a half weeks ago. The timing point is noteworthy because the tug-of-war over Warner had escalated in recent days, with Trump’s criticism of Susan Rice, for instance.\n\nSarandos has been at the White House repeatedly in recent months, though not always to meet with the president.\n\nOn a parallel track, David Ellison has made a number of moves to forge a close relationship with Trump. The two men had a private meeting at the White House earlier this month, as CNN previously reported.\n\nSoon after the Ellison meeting, Trumptold an interviewerthat “I haven’t been involved” in the battle over WBD, despite previously saying of the Netflix deal, “I’ll be involved in that decision, too.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/12/10/media/trump-cnn-sold-paramount-warner-bros-netflix",
      "text": "imperative that CNN be sold"
    },
    {
      "url": "https://www.prnewswire.com/news-releases/warner-bros-discovery-board-of-directors-determines-revised-proposal-from-paramount-skydance-constitutes-a-company-superior-proposal-302699009.html",
      "text": "superior"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/media/david-ellison-trump-paramount-netflix-wbd",
      "text": "told an interviewer"
    }
  ],
  "hash": "3e90106c9e3e7ce35085ec30cc7470b13b9190b1be3f795f1894a7180b3e1c2e",
  "scraped_at": "2026-02-27T07:15:18.831354+00:00"
}