{
  "url": "https://lite.cnn.com/2026/02/22/tech/social-media-addiction-trial-tobacco-moment",
  "title": "A ‘bellwether’ social media addiction trial is underway. It could set off a chain reaction | CNN Business",
  "date": "2026-02-23T07:36:06.403524+00:00",
  "authors": [
    "Analysis by Clare Duffy, CNN"
  ],
  "text": "Source: CNN\n\nBig Tech may be on the verge of its Big Tobacco moment.\n\nMeta CEO Mark Zuckerberg, one of the leading architects of the modern online world, testified for the first time before a jury this week over claims that social media harms young people.His testimonycomes more than four years after internal documents leaked bywhistleblower Frances Haugen indicatedthe company knew its platforms could be harmful.\n\nInternal documents presented in a Los Angeles courtroom on Wednesday seemed to confirm what many have long believed — that Meta has known that preteens use its apps; that it’s aimed to maximize the time people spend scrolling; andthat it’s disregarded expert advice about how to make its platforms safer — although the company claims the documents are cherrypicked and out of date.\n\nThere are still weeks to go in the trial, and its outcome is far from certain. But it’s just the start of a wave of litigation inspired by the 1990s tobacco trials that plaintiffs hope could spur widespread industry change.\n\nThe Big Tobacco litigation resulted in more public warnings and education about tobacco’s harmful effects, as well as decreased usage, said Joseph McNally, former California federal prosecutor and now director of emerging litigation at McNicholas & McNicholas.\n\n“I think there’s a lot of parallels in that the outcome (in the social media trials) very much may change behavior in terms of how people approach social media,” he said.\n\nThe Los Angeles trial centers on allegations made by a 20-year-old woman, Kaley, and her mother that four social media giants intentionally designed addictive platforms that hooked her as a child and led to mental health challenges, including anxiety and depression. Meta and YouTube deny the lawsuit’s claims. Snap and TikTok settled the case before trial, although they remain defendants in many other cases.\n\nInstagram chief Adam Mosserisaid in his testimony last weekthat he believes social media use — even 16 hours a day of scrolling by a teen — can be considered “problematic,” but not “clinically addictive.” Meta and other tech firms have argued there’s no conclusive evidence linking social media to addiction or mental health problems.\n\nThat language sounds familiar to some lawyers who have taken on tobacco companies.\n\nJohn Uustal, who has successfully litigated numerous cases against tobacco companies and other firms on behalf of individuals, said there are “startling” similarities between Meta’s argument and that of tobacco sellers, including “fighting so hard” to say their product isn’t addictive.\n\n“Legally, and morally and public relations-wise, once you admit it’s addictive, you’re done,” Uustal said. (Unlike tobacco, though, Meta and other platforms have noted that social media does have benefits for young people, like fostering creativity and community; some healthexperts agree,others have nonethelesscalled fortobacco-style warning labels on social media.)\n\nKaley’s is a “bellwether” trial for more than 1,500 similar civil lawsuits against the tech companies. Its outcome could help determine how those other cases are resolved.\n\nMeta is also currently standing trial in New Mexico in a separate case accusing the company of enabling child sexual exploitation on its platforms. A Meta spokesperson said the New Mexico lawsuit contained “sensationalist, irrelevant and distracting arguments.” And later this year, the first of hundreds oflawsuits brought by school districtsagainst the social media companies is also set to go to trial.\n\nThe tobacco trials — which took place over decades but began to shift in favor of plaintiffs in the ’90s — similarly saw various types of plaintiffs file a wave of lawsuits, contributing to the release of internal documents andtesting new legal theories.\n\nKaley’s case also uses a novel approach. For years, tech companies avoided safety-related litigation by pointing to Section 230, a law that shields them from liability over what their users post. But her lawyers are now attempting to hold them accountable for product design decisions that they say caused harm to young users, regardless of the specific content they were viewing.\n\nAll four companies have taken steps to improve safety, including by introducing parental controls tools, adding privacy settings for young users, increasing content restrictions and offering options to limit notifications or time spent scrolling.\n\nMany families say such features still put too great a burden on parents and teens to ensure a safe online experience and hope the trials could lead to new online safety legislation. In some cases, thecompanies’ internal documents raise questionsabout how effective or widely used those safety features are.\n\nLegal experts say lawsuits can sometimes be faster avenues for change, especially given Big Tech, like Big Tobacco before it, spends heavily on lobbying.\n\n“I think in America, compared to some other countries, that’s how we make progress,” Uustal said. “You can look at it again and again, in industry after industry where it was lawsuits that raised the cost eventually high enough that it was cheaper to fix the problem.”\n\nThe jury in Kaley’s case hasn’t yet heard the full arguments from Meta and YouTube’s lawyers, who are expected to take their turn in the coming weeks. Ultimately, whether the jury sides for or against Kaley in her case, the decision could guide the legal strategy and outcomes for both plaintiffs and the companies in other cases.\n\nEither way, more bellwether cases are likely to be tried, and different situations and juries could lead to different outcomes. With each plaintiff loss, the value of future cases could decline, McNally said. By contrast, multiple losses for the tech firms could put them on the hook for billions of dollars in damages and force them to make changes to their platforms to avoid further litigation.\n\nIt’s also possible the jury will find that one company is liable and the other isn’t. The claims regarding Meta and YouTube are somewhat different, as are the companies’ defenses.\n\nKaley’s case could be harder to win because she had a tough childhood. Meta argues that upbringing is responsible for her mental health challenges, not social media. Her lawyers say it only increased the platforms’ responsibility to keep Kaley and young users like her safe.\n\n“The evidence will show (Kaley) faced many significant, difficult challenges well before she ever used social media,” a Meta spokesperson told CNN. They also said the company has had a “longstanding commitment to supporting young people.”\n\nZuckerberg testified that Meta has evolved how it handles issues like age verification, an argument that suggests “the company took these issues seriously,” said Kimberly Pallen, a partner at the law firm Withers who specializes in complex civil litigation, told CNN in an email.\n\nAnd the jury has heard relatively little so far about YouTube, which argues it’s more like an entertainment platform than a social network. Kaley’s lawyers plan to call the platform’s vice president of engineering, Cristos Goodrow, for testimony Monday. YouTube’s lead attorney Luis Lee has said that “the Plaintiff is not addicted to YouTube and never has been … the data proves she spent little more than a minute a day using the very features her lawyers claim are addictive.”\n\n“As much as people want to frame this as a watershed moment for social media companies, it remains true thatthisplaintiff must provehercase,” Pallen said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/tech/meta-mark-zuckerberg-testifies-social-media-addiction-trial",
      "text": "His testimony"
    },
    {
      "url": "https://www.cnn.com/2021/10/06/tech/facebook-frances-haugen-testimony",
      "text": "whistleblower Frances Haugen indicated"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction",
      "text": "said in his testimony last week"
    },
    {
      "url": "https://www.apa.org/monitor/2023/09/protecting-teens-on-social-media",
      "text": "experts agree,"
    },
    {
      "url": "https://www.nytimes.com/2024/06/17/opinion/social-media-health-warning.html",
      "text": "called for"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/tech/social-media-youth-mental-health-lawsuit-meta-tiktok-snap-youtube",
      "text": "lawsuits brought by school districts"
    },
    {
      "url": "https://lawreview.unl.edu/smoke-how-recent-court-rulings-have-torched-big-techs-litigation-strategy-and-why-it-matters/",
      "text": "testing new legal theories."
    },
    {
      "url": "https://www.cnn.com/2025/11/25/tech/social-media-youth-mental-health-lawsuit-meta-tiktok-snap-youtube",
      "text": "companies’ internal documents raise questions"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/tech/social-media-addiction-trial-tobacco-moment",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/tech/social-media-addiction-trial-tobacco-moment",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3e916d44d50d18a5cdf04636a45b66c0a33f8aea91e822e3e6d087186c4a1d63",
  "scraped_at": "2026-02-23T07:36:06.403539+00:00"
}