{
  "url": "https://lite.cnn.com/2026/02/18/uk/uk-police-stansted-airport-epstein-intl",
  "title": "UK police assess claims Epstein trafficked women on flights through London Stansted Airport | CNN",
  "date": "2026-02-19T07:31:26.742974+00:00",
  "authors": [
    "Lauren Said-Moorhouse, CNN"
  ],
  "text": "Source: CNN\n\nUK police are “assessing” information about private flights flown into and out of London’s Stansted Airport following the publication of millions of documents from the US Department of Justice related to the late convicted sex offenderJeffrey Epstein,an Essex Police spokesperson said in a statement on Wednesday.\n\nFormer UK Prime Minister Gordon Brown last week in a piece for the New Statesman called on London’s Metropolitan Police to “urgently” re-examine claims Epstein’s victims were trafficked to the country on these flights.\n\nBrown said the emails released in the Epstein files showed a paper trail of visas, payments and transport records which demonstrate that women and girls were trafficked across the world.\n\nHe also said that the files suggested a number of British girls were aboard flights made from the sex offender’s private jet, dubbed the “Lolita Express,” from UK airports.\n\n“Among the many aspects that should sicken anyone looking at the emails is that 15 of these flights were given the go-ahead after his 2008 conviction for soliciting sex from a minor. How the flights were allowed to continue should have been fully investigated,” Brown wrote.\n\nStansted Airport has said that private aircraft operations are conducted through separate independent terminals, while immigration and customs checks are handled by Border Force, a law enforcement command within the UK Home Office.\n\n“These are entirely independent terminals not operated by London Stansted and no private jet passengers enter the main airport terminal,” a spokesperson for the airport said.\n\n“The airport does not manage or have any visibility of passenger arrangements on privately operated aircraft.”\n\nCNN has contacted the UK Home Office for comment.\n\nStansted is referenced in more than 80 documents in the files released by the DOJ. One email dated November 2012 from a redacted individual to Epstein discusses arrangements for an unnamed Russian woman to transfer between private aircrafts at the London airport before traveling on to the US.\n\nIn a separate email a month later, Epstein asks an unknown person about traveling with a redacted individual from Paris to London by train before heading to Stansted in a taxi.\n\nPolice are assessing numerous claims that have emerged from the massive document dump. This could lead to further action or investigations. At least six British police forces are looking into information or assisting with inquiries following the disclosures within the Epstein files. In addition to Essex Police, these include London’s Metropolitan Police, Thames Valley Police, Norfolk Constabulary, Bedfordshire Police and Wiltshire Police.\n\nBedfordshire Police said in a statement on Wednesday that it “is reviewing materials published as part of the DOJ Disclosures Under the Epstein Files Transparency Act, in relation to private flights in and out of London Luton Airport.”\n\nSeveral high-profile individuals from Britain are facing increased scrutiny amid the fallout from the Epstein files.\n\nThames Valley Police has said in recent weeks that it is assessing multiple allegations against the disgraced former prince, Andrew Mountbatten-Windsor.\n\nThe police force, which is charged with overseeing the Windsor area where the former prince lived with his ex-wifeSarah Fergusonuntil recently, said earlier this month that it was assessing allegationsa second woman has claimedthat she was trafficked by Epstein to the UK for a sexual encounter with Mountbatten-Windsor in 2010.\n\nLast week, the force revealed it was also assessing whether Mountbatten-Windsor shared confidential material with Epstein during the former prince’s role as UK trade envoy. Buckingham Palace later said King Charles standsready to supportpolice in their inquiries into his brother’s alleged sharing of sensitive information.\n\nMountbatten-Windsor has previously denied any wrongdoing over his ties to Epstein. He has not publicly responded to the latest allegations. CNN has reached out for comment.\n\nThe National Police Chiefs’ Council said that a national group had been created to support UK police forces “to understand any potential impact” from allegations that have emerged from the millions of DOJ files.\n\n“The national co-ordination group is working with the National Crime Agency to ensure specialist support for forces seeking information from overseas law enforcement agencies through approved channels,” a spokesperson for the NPCC said in a statement.\n\n“It may take some time due to the volume of material and the complexity of international jurisdictions, but policing and its law enforcement partners are taking this matter extremely seriously, and will assess all information thoroughly.”\n\nPeter Mandelson, the former UK ambassador to the US, quit the UK’s House of Lords this month after documents appeared to show he leaked market-sensitive government information to Epstein in the wake of the 2008 financial crisis.\n\nBritish policeraided two propertieslinked to Mandelson in early February as part of an investigation into alleged misconduct in public office. CNN has been unable to contact Mandelson’s representative.Mandelson has previouslysaid he was “wrong to believe (Epstein) following his conviction and to continue my association with him afterwards.”\n\nThe furor over Mandelson’s appointment despite his known links to the disgraced financier has led to calls for UK Prime Minister Keir Starmerto step down.\n\nStarmer has said he is “not prepared to walk away from my mandate and my responsibility to my country, or to plunge us into chaos as others have done.”\n\nInstead, his chief of staff Morgan McSweeneyresignedover the appointment, taking “full responsibility” for advising Starmer to put Mandelson in the post last year.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/epstein-files-trump-ruemmler-lutnick-musk-clinton-accountability",
      "text": "Jeffrey Epstein,"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/uk/sarah-ferguson-companies-epstein-fallout-intl",
      "text": "Sarah Ferguson"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/europe/andrew-mountbatten-windsor-moves-royals-epstein-intl-hnk",
      "text": "a second woman has claimed"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
      "text": "ready to support"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/europe/peter-mandelson-epstein-ties-britain-intl-latam",
      "text": "Peter Mandelson"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/uk/uk-police-searching-peter-mandelson-linked-properties-intl",
      "text": "raided two properties"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/uk/peter-mandelson-epstein-apology-intl",
      "text": "Mandelson has previously"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "to step down."
    },
    {
      "url": "https://www.cnn.com/2026/02/08/uk/morgan-mcsweeney-resigns-mandelson-epstein-intl",
      "text": "resigned"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/uk/uk-police-stansted-airport-epstein-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/uk/uk-police-stansted-airport-epstein-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3ea5bcec7e4fe0301be40a0c4e1c3738def794b26d47fb7871a587054bf04302",
  "scraped_at": "2026-02-19T07:31:26.742988+00:00"
}