{
  "url": "https://lite.cnn.com/2026/02/26/science/humans-neanderthal-mating-dna",
  "title": "Geneticists reveal an unexpected pattern in prehistoric hookups between humans and Neanderthals | CNN",
  "date": "2026-02-27T07:16:04.837970+00:00",
  "authors": [
    "Katie Hunt"
  ],
  "text": "Source: CNN\n\nThe 2010discoverythat early humans and Neanderthals once encountered one another and had babies was a scientific bombshell that electrified the field of human origins.\n\nNow, geneticists at the University of Pennsylvania say they have a better understanding of the nature of those prehistoric hookups, suggesting the trysts were mostly between male Neanderthals and female humans.\n\nThe intriguing finding, published Thursday in the journalScience, could help explain why the Neanderthal ancestry that is present in humans today is unevenly distributed across the genome. However, it’s far from clear why prehistoric pairings between our species, Homo sapiens, and Neanderthals — who went extinct around 40,000 years ago — largely followed this pattern.\n\n“This is a fascinating and provocative hypothesis,” said Joshua Akey, a professor at Princeton University’s Lewis-Sigler Institute for Integrative Genomics, who wasn’t involved in the research. “I find it extraordinary that we can use genome sequences to infer aspects of social dynamics and mating patterns that occurred tens to hundreds of thousands of years ago.”\n\nResearchers don’t know exactly how often Neanderthals and members of our species encountered one another but astudy published in 2024suggested the two groups exchanged DNA at multiple points over the past 250,000 years as they migrated around the world. Neanderthals and Homo sapiens are also known to have interbred with a third species: Denisovans.\n\nMost humans carry a small percentage of Neanderthal DNA, a genetic legacy from those sexual interactions. In certain cases, those genes can still influence human health. Neanderthal DNA has been found to affectcircadian rhythms,immune systemfunction and the way some people feel pain.\n\nMysteriously, however, the human X chromosome today appears to be what geneticists call an “archaic desert,” meaning it has next to no Neanderthal DNA. (Women have two X chromosomes, while men have just one plus a Y chromosome.)\n\n“It’s not zero on the X, but mostly gone,” said the study’s lead coauthor Alexander Platt, a senior research scientist in the University of Pennsylvania’s department of genetics. “And for the last 10 years or so, we’ve had two families of explanations about what happened.”\n\nPerhaps, researchers have speculated, genes on the X chromosome don’t transfer well between species, or Neanderthal genetic variants on the X chromosome were disadvantageous in some way to human variants and were therefore gradually eliminated by the evolutionary process of natural selection. The latest research, however, ruled out those scenarios and suggested that a different dynamic was at play.\n\nThe new study, based on information from the genomes of 73 women and three female Neanderthal samples, found that Neanderthal X chromosomes showed a pattern opposite to that of their Homo sapiens counterparts: They displayed a relative excess of human DNA far beyond what would be expected even if human DNA conferred genetic benefits to Neanderthals.\n\nThe researchers identified modern human DNA in the Neanderthal genomes by comparing it with present-day female genomes drawn from human populations in Africa that had little to no Neanderthal DNA, making it easier to ensure that any overlaps could be attributed to Homo sapiens DNA, rather than that of Neanderthals.\n\nTheir analysis showed that the excess of human DNA on the Neanderthal X chromosome could be best explained by a strong sex bias in mating between the two groups that resulted in little Neanderthal X-chromosome DNA ever entering the human gene pool. Specifically, the research suggested that when Neanderthals and humans interbred, the pairings were mostly between male Neanderthals and female humans.\n\n“It’s a story that involves who has X chromosomes,” Platt said. “We did not get as many X chromosomes from those Neanderthal males, and they got an excess of modern human ancestry on their X chromosomes,” he said.\n\nMoreover, after episodes of interbreeding between the two groups, subsequent generations of Neanderthal males would have been more likely to mate with Neanderthal women that had more modern human ancestry, the study found.\n\nThe simplest explanation for this phenomenon, according to the study, was “mate preference.” In other words, male Neanderthals, female Homo sapiens and Neanderthal females with greater human ancestry might have been “more attractive and desirable as mates,” for some unknown reason, Platt said. Equally, he noted, female Homo sapiens who encountered Neanderthal males may have viewed them as more alluring sexual partners.\n\nSex-based migration patterns — meaning that Neanderthal men and Homo sapiens women were more likely to be in the right place at the right time to intermingle and have babies — could have also contributed, the study said, but were unlikely to explain the finding on their own.\n\nGenomes contain a wealth of information that geneticists can use to mathematically model human migrations, encounters with other populations and inheritance over thousands of millennia. However, modeling studies can’t capture the nuances of real-world behavior, making it impossible for now to paint a more complete picture of Neanderthal-human relationships.\n\n“We would all love to be able to go back in time and figure this out,” said study coauthor Sarah Tishkoff, the David and Lyn Silfen University Professor in Genetics and Biology at the University of Pennsylvania. “You can do simulations and modeling under different scenarios and say which one fits the best, but it doesn’t exclude that you can have multiple things happening at one time.”\n\nRyan McRae, a paleoanthropologist at the Smithsonian National Museum of Natural History, said the methods used in the study were sound and the “super interesting” findings made sense. He noted, however, that it would be very difficult to find archaeological evidence of how these pairings unfolded.\n\n“In an ideal world, we could find a Neanderthal site with a bunch of Neanderthal males and human females, but that is unlikely to ever occur,” he said.\n\n“Perhaps human females flocked to Neanderthal groups naturally, or perhaps they were coerced into it. Perhaps there was some form of trade going on. Endless stories are possible,” he added via email.\n\nThe findings don’t necessarily mean that Neanderthals were constantly ditching their own females in favor of humans, but they do suggest that “if a female with some human ancestry was available, however many generations ago the human ancestor was, she made a more desirable mate,” McRae said.\n\n“Even if we find hybrid fossils of first or second generations, learning which of their parents was which species would only tell us about that individual, not the whole population or demographic landscape,” he noted. “That is why these sorts of studies are so important; they can tell us about broader scale impacts that individual fossils cannot.”\n\nPrinceton’s Akey said via email the X chromosome has a “uniquely complicated evolutionary history,” and added that he is cautious about interpreting the differences in Neanderthal ancestry between the X and other chromosomes as proof of this mating pattern.\n\n“Unraveling human history is complex,” Akey said, “And many different evolutionary forces and demographic processes can interact in ways that are challenging to disentangle.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5100745/",
      "text": "discovery"
    },
    {
      "url": "http://www.science.org/doi/10.1126/science.aea6774",
      "text": "Science"
    },
    {
      "url": "https://cnn.com/2024/07/31/science/dna-analysis-neanderthals-disappearance",
      "text": "study published in 2024"
    },
    {
      "url": "https://www.cnn.com/2023/12/14/health/early-risers-neanderthal-dna-scn/index.html",
      "text": "circadian rhythms"
    },
    {
      "url": "https://www.cnn.com/2023/12/14/health/early-risers-neanderthal-dna-scn/index.html",
      "text": "immune system"
    }
  ],
  "hash": "3fdf52467e65f7e962c57bd21b49e3ec9b346632a5041f57a3b623b359b21b6a",
  "scraped_at": "2026-02-27T07:16:04.837983+00:00"
}