{
  "url": "https://lite.cnn.com/2026/02/12/asia/bangladesh-election-results-rahman-bnp-win-intl-hnk",
  "title": "Bangladesh’s BNP wins big in first election since Gen Z uprising, son of former ruler set to become prime minister | CNN",
  "date": "2026-02-14T07:08:22.943724+00:00",
  "authors": [],
  "text": "Source: Reuters\n\nBangladesh’sopposition Bangladesh Nationalist Party (BNP) won a landslide parliamentary election on Friday, returning to power after nearly two decades and positioning party leader Tarique Rahman to become prime minister as the country emerges frommonths of unrestand economic disruption.\n\nRahman, the son of former premierKhaleda Ziaand assassinated former President Ziaur Rahman, faces immediate challenges in restoring political stability, reviving investor confidence and rebuilding key industries - including the garment sector - after prolonged turmoil that followed the collapse of former Prime Minister Sheikh Hasina’s government in 2024.\n\nAn interim government led by Nobel laureate Muhammad Yunus has been in charge since then.\n\nThe official count in a vote viewed as the South Asian nation’s first truly competitive election in years gave the BNP and its allies at least 212 of the 299 seats up for grabs, the Election Commission said. The opposition Jamaat-e-Islami and its allies won 77 seats in the Jatiya Sangsad, or House of the Nation.\n\nRahman, 60, has not yet commented even though more than 12 hours have passed since trends in favor of his party became clear, but the BNP asked people to refrain from large celebrations and offer special prayers on Friday instead.\n\nHe did not speak to media gathered outside his house in Dhaka, smiling and waving from his vehicle when he left for a mosque, local media reported.\n\n“Despite winning … by a large margin of votes, no celebratory procession or rally shall be organized,” the party said in a statement issued in the early hours of Friday.\n\nThe National Citizen Party (NCP), led by youth activists who played a key role in toppling Hasina, won just five of the 30 seats that it contested. The NCP was part of the Jamaat-led alliance.\n\nA clear outcome had been viewed as key for stability in the Muslim-majority nation of 175 million after months of deadly anti-Hasina unrest disrupted everyday life and industries including garment manufacturing. Bangladesh is the No. 2 exporter of apparel in the world.\n\n“A strong majority gives the BNP the parliamentary strength to pass reforms efficiently and avoid legislative paralysis. That alone can create short-term political stability,” said Selim Raihan, an economics professor at the University of Dhaka.\n\nIn its manifesto, the BNP promised to prioritize job creation, protect low-income and marginal households and ensure fair prices to farmers.\n\n“If the factories run regularly and we get our wages on time, that’s what matters to us. I just want the BNP government to bring back stability so more orders come to Bangladesh and we can survive,” Josna Begum, 28, a garment worker and mother of two, told Reuters.\n\nIndian Prime Minister Narendra Modi, Pakistan Prime Minister Shehbaz Sharif and the US ambassador to Bangladesh, Brent T. Christensen, were among the first to congratulate Rahman on his party’s victory.\n\nIndia, China and the United States are vying for influence in Bangladesh, with the US ambassador telling Reuters earlier this week that Washington was concerned about growing Chinese influence in the country.\n\nNew Delhi-Dhaka relations have nosedived since Hasina fled and took refuge in India, badly affecting visa services and cricket ties between the two neighbors.\n\n“It is an opportunity for Bangladesh…it has these major powers around it that are vying for influence. It’s also a challenge. How do you manage those relationships?” Thomas Kean, a senior consultant with the International Crisis Group, said.\n\nThe Jamaat-e-Islami conceded defeat late on Thursday night once trends became clear, but said in a statement on Friday that it was “not satisfied” with the process and asked its followers to remain patient.\n\nThe party won its highest-ever tally of 70 seats in parliament, contesting for the first time since it was banned in 2013. The ban was lifted after Hasina’s ouster.\n\nThe BNP win with more than 200 seats is one of its biggest, surpassing its 2001 victory with 193, although Hasina’s Awami League, which ruled for 15 years and was barred from contesting this time, secured a bigger tally of 230 in 2008.\n\nBut elections of other years were boycotted by one of the main parties or were contentious.\n\nTurnout this time exceeded the 42% of the last election in 2024, with media reports saying nearly 60% of registered voters participated in the election on Thursday.\n\nMore than 2,000 candidates, many independents among them, were on the ballot, which featured a record number of at least 50 parties. Voting in one constituency was postponed after a candidate died.\n\nBroadcaster Jamuna TV said more than 2 million voters chose “Yes” while more than 850,000 said “No” in a referendum on constitutional reforms held alongside the election, but there was no official word on the outcome.\n\nThe changes include two-term limits for prime ministers and stronger judicial independence and women’s representation while providing for neutral interim governments during election periods and setting up a second house of the 300-seat parliament.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/asia/bangladesh-election-candidates-old-guard-intl-hnk",
      "text": "Bangladesh’s"
    },
    {
      "url": "https://www.cnn.com/2024/08/06/asia/bangladesh-protests-hasina-resignation-explainer-intl-hnk",
      "text": "months of unrest"
    },
    {
      "url": "https://www.cnn.com/2025/12/29/asia/khaleda-zia-bangladesh-death-intl-hnk",
      "text": "Khaleda Zia"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/asia/bangladesh-election-results-rahman-bnp-win-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/asia/bangladesh-election-results-rahman-bnp-win-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "3ff8836593dcff8a62e486844a40584705afed8e8229efc21cfc017b6f6b1c86",
  "scraped_at": "2026-02-14T07:08:22.943738+00:00"
}
