{
  "url": "https://lite.cnn.com/2026/02/27/us/colin-gray-trial-defense-testimony",
  "title": "Colin Gray trial: Georgia school shooter’s father takes the stand and defends introducing his son to firearms | CNN",
  "date": "2026-02-28T06:59:12.917885+00:00",
  "authors": [
    "Eric Levenson"
  ],
  "text": "Source: CNN\n\nColin Gray, the father of teenage Georgia school shooter Colt Gray, took the stand Friday to testify in his own defense at his murder trial and said he never saw any red flags that his son would carry out a school shooting.\n\n“He’s a good kid,” the father said through tears. “He wasn’t perfect, nor was I, but to do something that heinous, I don’t know that anybody can see that kind of evil. The Colt I knew, the relationship I had, there was this whole other side of Colt I didn’t know existed.”\n\nBut in a fiery cross-examination, Barrow County District Attorney Brad Smith challenged him to explain that position, given Colt had previously searched “how to kill your dad” in 2021 and was investigated for threatening a school shooting online in 2023.\n\nColin Gray testified that he believed his son’s explanations downplaying and denying those incidents – even as he admitted he did not personally look into his son’s online activity.\n\nThe key testimony comes a year and a half after Colt Gray, then 14, brought that AR-15-style rifle to Apalachee High School in Winder, Georgia, and opened fire. Four people were killed and nine were injured, before the teen surrendered to police.\n\nProsecutors have accused Colin Gray of allowing his son unsecured access to the weapon despitewarnings that his son was a dangerto others, actions that constitute criminally reckless conduct. The state rested its case Thursday after about two weeks of testimony.\n\nGray was the defense’s only witness and finished his testimony late Friday. Closing arguments are set for Monday, the judge said.\n\nGray has pleaded not guilty to nearly 30 charges, including two counts each of second-degree murder and involuntary manslaughter. His attorneys have argued he was unaware his son was planning the shooting and had taken steps to try to get him help.\n\nThe trial is part of a broader push to hold more people accountable for a school shooting, including the shooter’sparentsandresponding law enforcement officers. This case bears close similarities to the trials ofJames and Jennifer Crumbley, whose then-15-year-old son killed four students in 2021 at his high school in Oxford, Michigan.\n\nColt Gray admitted to the shooting, according to authorities. Now 16, he has pleaded not guilty to 55 felony counts, including four counts of malice murder. A trial date has not been set.\n\nIn his testimony Friday, Colin Gray explained for the jury some of his actions and how he interpreted his son’s troubles.\n\nHe said he first introduced his son to firearms in an attempt to bond with him and get him away from screens and video games.\n\n“My thought process was, I will do whatever I have to do to get Colt interested in the outdoors,” he said.\n\nHe said he first bought a Bushmaster rifle that Colt used at the range and out deer hunting. The day Colt shot his first deer was “the greatest day of my life,” Colin Gray said. But when the gun repeatedly jammed, he traded it in for a Sig Sauer – an AR-15-style rifle – which he gifted to Colt Gray for Christmas 2023.\n\nHe defended his decision to buy the weapon and to keep multiple unsecured, unlocked guns in the house – even as he noticed his son’s mental health issues.\n\n“I was very clear on the rules. No loaded guns in the house ever, and he abided by those rules. He respected the weapon,” he said. “We didn’t have it in a safe. We didn’t have locks on it. But I’m telling you, he had a healthy respect for weapons.”\n\nIn May 2023, deputies with the Jackson County Sheriff’s Office visited Colt and Colin Gray’s home after receiving an FBI tip about anonline threat to shoot up a school.\n\nColin Gray testified he took the issue very seriously, but said law enforcement was ultimately not able to substantiate the tip. “Nobody could ever really tell me if this was him,” he said.\n\nThe father said he generally kept the firearms on the top shelf of his bedroom closet, without a lock or safe. The Sig Sauer rifle was sometimes in Colt’s room, mainly before or after a trip to the gun range, he testified.\n\nColin Gray struggled to explain Colt’s lack of schooling in eighth grade, as records showed he did not attend any school the entire 2023-24 school year. He tried to get Colt into an online home-schooling program, but they couldn’t find an open spot, and Colt fell further and further behind, he said.\n\n“It was never, ‘I don’t give a damn if he goes to eighth grade.’ That’s not what happened here. It was a very fluid kind of thing,” he said. “Could I have done better? Yes, I could have done better. I could have done more. I see that now.”\n\nHe acknowledged Colt Gray sometimes became “frustrated” and on a few occasions “bull-rushed” him in physical altercations. Still, he described his son as “thoughtful” and “respectful,” and he said their firearm hobby was a way to build their father-son relationship.\n\nColin Gray used his testimony to try to explain or deny other testimony presented by the prosecution.\n\nA few weeks before the shooting, Colt Gray sent a text to his father saying, “Whenever something happens just know the blood is on your hands.”\n\nColin Gray testified that he believed that comment was related to a previous incident, when his estranged wife, Marcee Gray, who was struggling with drug and alcohol addiction, had allegedly threatened to kill Colt. He said he did not believe that Colt was making his own threat in that text.\n\nIn addition, Marcee Gray testified earlier in the trial that Colin Gray was supposed to take Colt to a crisis counseling program in Athens on the Saturday before the shooting, but he did not do so. However, Colin Gray testified he never agreed to that plan, saying he had made plans to get Colt counseling through the school the following week.\n\n“We had a plan in place,” he said.\n\nHe said he did not know his son was fascinated with school shooters and did not see the shrine of photos of Nikolas Cruz, the Parkland school shooter, on Colt’sbedroom wall. He also denied ever telling hisdaughter to lie on his behalf, as she testified earlier this week, saying he was “shocked” by her testimony.\n\nJust hours after the shooting, law enforcement officers went to Colin Gray’s home, and he blurted aloud, “I knew it,” according to police body-camera footage. He testified Friday he made that comment because he had finally pieced together what happened, but he reiterated he did not know ahead of time that Colt would carry out a school shooting.\n\n“I never heard or he never spoke to me about doing anything as drastic as he had done,” he said.\n\nSmith, the District Attorney, sharply questioned Colin Gray on cross-examination.\n\nIn the May 2023 interview with sheriff’s deputies about a Discord threat, Colin Gray did not mention that Colt had previously gotten in trouble for searching “how to kill your dad,” he acknowledged. The officers advised him to make sure the guns were not freely available and lying around the house, Colin Gray testified.\n\n“Because you don’t want dangerous kids to have access to dangerous instruments, do you?” Smith asked.\n\n“That’s correct,” Gray said.\n\n“That’s just reasonable, right?” he asked.\n\n“Yep,” Gray said.\n\nAfter that interview, Colin Gray took Colt’s computer away for a period but did not lock up the firearms, he testified. He said the guns were out of reach “for the most part,” placing them in the top of his bedroom closet.\n\nHe acknowledged he made incorrect statements denying that his family was investigated by the Georgia Division of Family & Children Services, known as DFCS. “If I did not remember every single detail that you were asking me at that point, that is my bad,” he said.\n\nHe also admitted he had lied to his boss on the day of the shooting about why he had to leave early, and he had lied to his sister about why he needed to borrow money.\n\nMarcee Gray had expressed concerns about Colt’s misbehavior, but Colin Gray testified he was skeptical of her version of events.\n\n“I believe my son more than I believe his mother,” he testified.\n\nThe state rested its case Thursday after about two weeks, includingemotional testimony from students and teacherswho survived the shooting,police interviewswith Colin Gray,photos showing unsecured firearms and ammoin the home and testimony from the teen’s mother, grandmother and sister about their unsettled family life.\n\nEarlier this week, jurors heard two lengthy police interrogations of Colin Gray after the shooting.\n\nThe father said he first introduced his son to firearms in an attempt to bond with him and get him away from screens and video games.He also acknowledged the teen’s behavior had escalated and become more aggressive in the previous five to seven months, and that he had signed paperwork with the school to get him into counseling.\n\nThe defense sought to use the recording to humanize Colin Gray as a working father trying to care for his three children while helping his wife recover from drug and alcohol addiction.\n\nMarcee Graytestified Colt Gray was riddled with anxiety, easily agitated and had a panic attack. She said it was “very obvious” he needed professional help, but Colin Gray “just didn’t want to deal with it.”\n\nWhen the state’s final witness was on the stand, prosecutors played for the court surveillance video showing Colt Gray’s movements in school before, during and after the shooting. The video, parts of which were not shown to the public, left Colin Gray in tears at the defendant’s table.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "Colin Gray"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/colin-gray-trial-georgia-shooting",
      "text": "warnings that his son was a danger"
    },
    {
      "url": "https://www.cnn.com/2024/03/03/us/james-crumbley-trial-mass-shooting-accountability",
      "text": "parents"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/school-shooting-trials-police-officers",
      "text": "responding law enforcement officers"
    },
    {
      "url": "https://www.cnn.com/2024/03/16/us/james-jennifer-crumbley-trials-differences/index.html",
      "text": "James and Jennifer Crumbley"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "online threat to shoot up a school"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/colin-gray-trial-georgia-shooting",
      "text": "daughter to lie on his behalf"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "emotional testimony from students and teachers"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "police interviews"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "photos showing unsecured firearms and ammo"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/colin-gray-trial-georgia-shooting-mother",
      "text": "Marcee Gray"
    }
  ],
  "hash": "405d3146356935e44ba409b8bfc45859b7f0a34927f563f279d707c5a45804b7",
  "scraped_at": "2026-02-28T06:59:12.917898+00:00"
}