{
  "url": "https://lite.cnn.com/2026/02/20/politics/secret-service-suits-kristi-noem",
  "title": "Exclusive: Secret Service will offer tailored suits to new protective detail agents | CNN Politics",
  "date": "2026-02-23T07:37:46.730253+00:00",
  "authors": [
    "Holmes Lybrand",
    "Jamie Gangel",
    "CNN"
  ],
  "text": "Source: CNN\n\nNew Secret Service protective detail agents are about to get a wardrobe upgrade, courtesy of taxpayers.\n\nThe Secret Service will soon offer each agent who graduates from protective detail training two tailored suits, according to sources familiar with the matter and a public contract solicitation.\n\nThe initiative to have the Secret Service purchase suits happened because Department of Homeland Security Secretary Kristi Noem disliked how a protective detail was dressed in the suits they bought for themselves, two sources familiar with the matter told CNN.\n\nDHS spokesperson Tricia McLaughlin denied that account, telling CNN, “This does not have to do with optics” but aims to fix inequities for the “men and woman who are just starting their career.”\n\n“This is to fix the inequity that non-uniformed (officers) have to pay for their uniform,” she added, noting that while the Secret Service supplies clothing to the uniformed division — who dress in protective vests and dark, police-style clothing — agents in protective details have to purchase their own suits.\n\nOne of the sources echoed that leadership at DHS believes supplying suits for agents could work as an incentive to help with recruiting, bearing the cost of what can be a financial burden, the source said.\n\nThe source added that the Secret Service had to find funding for the suits inside its current budget.\n\nA former senior law enforcement official said this had never been done before for plainclothes Secret Service agents, who in the past couldn’t request reimbursement for suits — let alone receive them for free from the government. And some agency veterans are surprised by the move.\n\n“With all the resource challenges the Secret Service has, this seems like an odd expenditure,” former Secret Service agent and CNN contributor Jon Wackrow said.\n\nThe new suits will only be supplied to new graduates from protective detail training. Such agents typically make between $70,000 and $90,000 per year, including benefits, according to a Secret Service official.\n\nNewly trained agents assigned to protective details will be supplied with two, navy-blue tailored suits made entirely in the US, according toa public solicitationfor a 5-year contract for the suits published last week. The contract also calls for “name embroidery on inside of jacket.”\n\nDHS is currently ensnared in apartial government shutdown, as Republicans and Democrats negotiate over potential immigration enforcement reforms that could be part of an agreement to fund the department. It isn’t clear if the solicitation for suits can move forward while the shutdown is underway.\n\nSecret Service agents are considered essential and are currently working without pay during the shutdown.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://sam.gov/workspace/contract/opp/45e9a916c8454d4fbaf99ff8e1cd89c1/view",
      "text": "a public solicitation"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "partial government shutdown"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/secret-service-suits-kristi-noem",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/secret-service-suits-kristi-noem",
      "text": "Cookie Settings"
    }
  ],
  "hash": "40b04257d850d74de7049837ee80ec9a77e2f7d93fe895e151481f8a6a40cb80",
  "scraped_at": "2026-02-23T07:37:46.730267+00:00"
}