{
  "url": "https://lite.cnn.com/2026/02/27/us/renee-good-parents-interview",
  "title": "Renee Good’s parents remember her love and laughter | CNN",
  "date": "2026-02-28T06:58:50.398516+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nRenee Good loved sparkles and laughter and any excuse for a celebration. She loved pretty much everyone she met, and was late for pretty much everything.\n\n“She had this way of making you feel special and loved that I didn’t even understand that until we lost her,” Donna Ganger said Friday of her daughter, who wasshot and killedby an immigration officer during the federal crackdown in Minneapolis.\n\nShe was “slow to anger, quick to love, quick to care,” said her father, Tim Ganger. “That’s the essence of who she was.”\n\nGood, a 37-year-old mother of three, was killed Jan. 7 as immigration agents surged through the Minneapolis area, sparking waves of protests. Her death and that ofanother U.S. citizen, Alex Pretti, just weeks later sparked outrage across the country andcalls to rein inimmigration enforcement.\n\nIn a wide-ranging interview in Colorado, where some of the family lives, Good’s parents and two of her brothers, Brent and Luke Ganger, talked to the AP about the joy Good found in life, their grief at losing her and their hopes that her death can bring some sort of change in a deeply polarized nation.\n\n“It’s going to be hard in the future,” Donna Ganger said. “It’s going to be kind of a constant pain.”\n\nGood, who graduated from college later in life, was volunteering in a local school district and working as a substitute teacher when she was killed, her parents said.\n\n“She was working so hard to get her education, and then she was finally able to use it, and I could just tell how happy she was and how fulfilled,” Donna Ganger said.\n\nGood, her 6-year-old son and her partner Becca Good — the women were not legally married, according to a family lawyer, but referred to one another as wives — had only recently relocated to Minneapolis from Kansas City, Missouri, settling in a quiet residential street in a tight-knit neighborhood known for its progressive activism.\n\nIn social media accounts, Renee Good described herself as a “poet and writer and wife and mom.” On Pinterest, a profile picture shows her smiling and holding a young child, alongside posts about tattoos, hairstyles and home decorating.\n\nThe family “settled very quickly into the community in Minneapolis,” said Donna Ganger, describing how the neighborhood had also welcomed the rest of the family when they came after the shooting. They see that as the result of the love that Good had showed her new neighbors.\n\n“It was incredible to receive that back,” Luke Ganger said.\n\nDonna Ganger held a stuffed, toy owl as she spoke, a gift from her daughter, who knew how much she loved the birds. It had sparkles on its feet, a reminder of Good’s love for glitter.\n\nAt Good’s memorial service, a table of glitter had been set out for guests. Donna Ganger had put a piece on a lens of her glasses and it’s remained there.\n\n“She just kind of sparkled all the way through,” said Donna Ganger. “I think of her and I look down and see my little sparkle.”\n\nThe family is “a very American blend,” Luke Ganger said recently in testimony to Congress. “We vote differently, and we rarely completely agree on the finer details of what it means to be a citizen of this country.”\n\nYet “we have always treated each other with love and respect,” he said.\n\nOn Friday, the family didn’t want to discuss the specifics of their differences, but Donna Ganger said she’d long prayed for guidance: “Before all this happened I said ‘Make me a wise woman.’”\n\nIn the hours after Good’s death, Trump administration officials said she had been shot as she tried to drive her car into an immigration officer. Homeland Security Secretary Kristi Noem said Good had committed “an act of domestic terrorism.”\n\nBut as details of the confrontation emerged, and criticism of the crackdown began growing, administration comments softened.\n\nPresident Donald Trump said he’d been told that Tim Ganger had supported him.\n\n“He was all for Trump, loved Trump. And, you know, it’s terrible,” he told reporters. “I hope he still feels that way.”\n\nTim Ganger declined to talk about his political affiliation or whether it had changed with his daughter’s killing.\n\n“I think I’m just going to leave that go,” he said. “There’s so many other important things,” to deal with now.\n\nBut family members said they hoped their ability to get along would be an inspiration.\n\n“Our purpose through this whole tragic, difficult, unbelievable time, is to have something good come out of this,” Tim Ganger said. “Otherwise the senselessness of this is overwhelming.”\n\nSadness echoed in Donna Ganger’s voice as she talked about navigating family differences.\n\n“Sometimes I’m just silly, you know, and I joke with them and I’m goofy,” she said. “But I want to be able to talk about hard things — and that’s hard sometimes with your own family to talk about hard things that maybe you don’t agree on. And I don’t want there to be any hardships between us or hurt.”\n\n“But it’s important that we learn to be careful with our words, but share them in a deep way,” she said. “It’s really important.”\n\nFamily members only spoke in general ways about the change they’d like to see come from Good’s death.\n\n“I think it’s evident that something is broken, right?” said Brent Ganger. “And when something is broken, you have to take a deep look to see what it is that can be changed and fixed in order for it to not happen again.”\n\nOn the morning of the shooting, as immigration raids and protests were flaring across the city, Becca Good has said they stopped their car in the street to support neighbors during an immigration operation.\n\nVideo showsRenee Good in a red SUV blocking part of the road and repeatedly honking her horn.\n\nTwo immigration officers get out of a truck and one orders Good to open her door. She reverses briefly, then turns the steering wheel as the officer says again, “get out of the car.” Almost simultaneously, Becca Good, standing in the street shouts, “drive, baby, drive!”\n\nWhen Good begins pulling forward, an ICE officer standing in front of the vehicle pulls his weapon and fires at least two shots into the car, killing Good.\n\nWeeks later, Tim Ganger said he hoped the family’s tragedy would lead to change, though “I’m not even sure what that will look like.”\n\n“But for something good, for people to stop and take a breath and take a look and have a dialog,” he said. “That’s the broader mission of what we want, for people to come together and take care of each other.”\n\nThe Justice Department has said it sees no basis to open a federal civil rights investigation into Good’s death, but the family has hired a law firm that is conducting its own investigation and exploring potential legal action.\n\nFamily members said no one from the federal government has contacted them about Good’s killing, and they are unsure if anyone will be held accountable.\n\n“All we can do is speak out and hope that our sincere words are enough to enact some kind of change,” Brent Ganger said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/01/10/us/ice-shooting-minneapolis-renee-good",
      "text": "shot and killed"
    },
    {
      "url": "https://www.cnn.com/2026/01/25/us/shooting-minneapolis-alex-pretti-killed",
      "text": "another U.S. citizen, Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/politics/ice-minneapolis-shooting-funding-democrats-shutdown",
      "text": "calls to rein in"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/us/ice-shooting-minneapolis-renee-good",
      "text": "Video shows"
    }
  ],
  "hash": "410aea94251e0ad65ebecd4918499f9aedd4a76e6c650d06767d73af5f67c385",
  "scraped_at": "2026-02-28T06:58:50.398528+00:00"
}