{
  "url": "https://lite.cnn.com/2026/02/23/europe/zelensky-trump-ukraine-russia-war-intl-latam",
  "title": "Zelensky pleads to Trump: ‘Stay on our side’ | CNN",
  "date": "2026-02-24T07:31:23.396229+00:00",
  "authors": [
    "Clarissa Ward",
    "Ivana Kottasová",
    "CNN"
  ],
  "text": "Source: CNN\n\nUkrainian President Volodymyr Zelenskymade a plea to Donald Trump on Monday, telling CNN he wants the US president “to stay on our side.”\n\nSpeaking at the Presidential Palace in Kyiv on the eve of the fourth anniversary of Russia’s full-scale invasion of Ukraine, Zelensky said the United States is far too big and too important to walk away from the conflict. And he hopes that Trump, during hisState of the Unionaddress Tuesday, will back Ukraine as it fights back against the Russia of President Vladimir Putin.\n\n“They have to stay with … a democratic country which is fighting against one person. Because this person is a war. Putin is a war. It’s all about himself. It’s all about one person. And the country, all his country is in the prison,” Zelensky told CNN.\n\n“If they really want to stop Putin, America’s so strong,” he said. Asked if he believes Trump is putting enough pressure on Putin, Zelensky said, “No.”\n\nIn a wide-ranging and — at times — emotional interview, Zelensky acknowledged that Ukrainians are exhausted by the conflict. But giving in to Putin’s demands is simply not an option, he said.\n\n“We can’t just give him everything he wants. Because he wants to occupy us. If we will give him all he wants, we will lose everything — all of us, people will have to run away or be Russian.”\n\nAs the war enters its fifth year, trilateral peace talks involving Ukraine, Russia and the United States have not yet led to a breakthrough.\n\nZelensky told CNN that security guarantees, especially the issue of how Ukraine’s allies would react if Russia invaded Ukraine again in the future, remain a sticking point.\n\nHe said he keeps being told that Russia simply would not start another war. “This is not the answer to me. I’m sorry,” he said.\n\n“We have good things in these security guarantees, it’s true,” he said of the promises currently on the table. “But I want (a) very specific answer: what (our) partners will be ready to do if Putin will come again. This is what Ukrainians want to hear,” he said.\n\nThere is also a disagreement about the sequence of steps toward peace, Zelensky said. Trump wants Zelensky to sign a peace agreement with Russia and a deal with the United States and European nations that gives Ukraine its security guarantees all in one go, ideally in a big ceremony marking the end of the war.\n\nBut Zelensky is adamant that security guarantees must be agreed and ratified by the US Congress first. He said this would give the Ukrainian people the confidence that they could rely on their allies in the future — because they have been let down too many times in the past.\n\nSpeaking about another thorny issue, Zelensky told CNN that Ukraine is willing to freeze the war at the current front lines. But he said the Ukrainian military would not withdraw from the areas of the eastern Donetsk region that are still under its control.\n\nRussia is demanding that Ukraine relinquish the roughly 20% of the region that is still under Kyiv’s control, including the “fortress belt” of industrial cities, railways and roads that form the backbone of Ukraine’s defense and supply the front line.\n\n“Russia wants (us) just to withdraw our army. … We can’t be such, sorry, foolish guys. We are not children. We went through this war, during all these years, and so we just, we can’t give them the country on (a) plate,” he said.\n\n“For people who live there, it’s very important what security they will have … 200,000 people live there,” Zelensky said. “What do I have to say (to them) and what (do) our soldiers have to say — ‘Okay, bye, bye. We go away. You are Russian from this moment?’”\n\nZelensky also addressed elections and his own future. He was elected in 2019 for a term ending in May 2024, but he has stayed in power as Ukrainian martial law prohibits holding elections during wartime. But Trump has suggested that Ukraine should hold elections, even going as far as calling Zelensky a “dictator.”\n\n“It’s very interesting when the presidents of different countries, including the United States and Russia, speak about elections in … Ukraine,” Zelensky noted in the CNN interview. “What do they want? Another president? Okay,” he said, wondering if the thinking was that a different leader would back down before Russia.\n\nZelensky said it is not clear to him whether Trump wants someone else to be president of Ukraine. “I don’t know,” he said. “He didn’t tell me.”\n\nZelensky spoke to CNN after an award ceremony for fallen Ukrainian soldiers. One after another, Zelensky spoke to loved ones of the dead, thanking them for their sacrifice and offering words of comfort.\n\nThe pain was clearly visible on his face when handing medals to sobbing mothers, wives and young children of those who have been killed in the relentless, bloody war.\n\n“It’s an honor … to give the order to the mother or to the father, husband, wife (of) heroic people who are not here with us, only in our hearts. But it’s very painful, very emotional,” he told CNN afterward.\n\n“I want to do it. I think it is important to (get) it from the president. And for me, it’s very important to give it to them. I always have to find time for this.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/world/zelensky-ukraine-war-last-four-years-intl",
      "text": "Ukrainian President Volodymyr Zelensky"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-23-26?post-id=cmlzdvcd600003b6rni2uhpfu",
      "text": "State of the Union"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/europe/zelensky-trump-ukraine-russia-war-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/europe/zelensky-trump-ukraine-russia-war-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "41af1850735311de9a6cf2f7a630de9cdb60ebf4768e99b2decacc4ac8fff7c6",
  "scraped_at": "2026-02-24T07:31:23.396242+00:00"
}