{
  "url": "https://lite.cnn.com/2026/02/15/sport/tyler-reddick-michael-jordan-daytona-500",
  "title": "Tyler Reddick wins the Daytona 500 for Michael Jordan-owned 23XI Racing | CNN",
  "date": "2026-02-16T07:34:13.738997+00:00",
  "authors": [],
  "text": "Source: AP\n\nTyler Reddick won theDaytona 500in a car owned byMichael Jordanwhen Chase Elliott crashed as he and Reddick were battling for the win.\n\nReddick, in a Toyota for 23XI Racing, led only one lap on Sunday: the one to the checkered flag for the team owned by the NBA Hall of Famer and three-time Daytona 500 winner Denny Hamlin.\n\n“Just incredible how it all played out. Just true Daytona madness,” Reddick said. “I’ve already lost my voice from screaming. Never thought I’d be Daytona 500 champion.”\n\nNeither did Jordan, who met Reddick in victory lane for a bear hug and the two then jointly hoisted the Harley J. Earl trophy into the air. Jordan, who turns 63 on Tuesday, will get a Daytona 500 ring for his birthday and made it known in victory lane he wears a size 13.\n\n“It feels like I won a championship, but until I get my ring, I won’t even know,” Jordan said.\n\nIt was a celebration that included multiple stars of NASCAR as Reddick is teammates with Bubba Wallace, who went to victory lane in tears after dominating a huge chunk of the race but finished 10th.\n\nJordan wrapped his arms around Wallace from behind and spoke closely into Wallace’s ear in a brief speech of encouragement.\n\n“I don’t want my emotions to take away from the monumental day they just accomplished. Happy birthday, MJ. That’s a massive birthday present,” Wallace said. “I thought this was our week, the best 500 I’ve ever had, and come up short, sucks.\n\n“Led a lot of laps, lap leader, I believe. It was a good day for us, but damn. Try again next year.”\n\nHamlin was also in victory lane after finishing 31st and falling short in his bid to become the third four-time Daytona 500 winner.\n\nHamlin, who drives for Joe Gibbs Racing, was involved in the final caution when he and teammate Christopher Bell collided with nine laps remaining. It set up the final push to the finish over the final four laps.\n\nElliott had control on the final lap after leader Carson Hocevar was spun off the track and it appeared the son of NASCAR Hall of Famer Bill Elliott would finally win his first Daytona 500.\n\nInstead, Reddick made a huge surge, hit Elliott to cause Elliott to crash and sailed past to take Jordan to the Daytona International Speedway victory lane.\n\nJordan was the face of the Decemberfederal antitrust lawsuitthat NASCAR settled on the ninth day of trial. The settlement changed the revenue-sharing model in the United States’ top motorsports series.\n\nThe victory marked a Daytona sweep for three team owners heavily involved in the trial. Bob Jenkins, who joined 23XI in suing NASCAR, opened the weekend with a victory when Chandler Smith won the Truck Series opener on Friday night for Front Row Motorsports.\n\nRichard Childress, who testified on behalf of 23XI and Front Row and was the subject of disparaging text messages by since-departed NASCAR chairman Steve Phelps, was the winning team owner Saturday when Austin Hill won.\n\nThen came “The Great American Race” and Jordan and Hamlin, the two front-facing litigants got their first Daytona 500 victory.\n\nFormer race winners Ricky Stenhouse Jr. and Joey Logano finished second and third as Toyota, Chevrolet and Ford each placed a driver on the podium. Elliott wound up fourth and sat dejected and in disbelief on the outside wall of the track after climbing from his car.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/02/sport/nascar-cup-series-championship-larson-hamlin",
      "text": "Daytona 500"
    },
    {
      "url": "https://www.cnn.com/2025/10/29/sport/basketball-nba-michael-jordan-load-management-intl",
      "text": "Michael Jordan"
    },
    {
      "url": "https://www.cnn.com/2025/12/05/sport/motorsports-nascar-michael-jordan-testifies-antitrust-trial",
      "text": "federal antitrust lawsuit"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/sport/tyler-reddick-michael-jordan-daytona-500",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/sport/tyler-reddick-michael-jordan-daytona-500",
      "text": "Cookie Settings"
    }
  ],
  "hash": "430f489e0ba7293c42e14ef59dba776d07c4ec99e5295ba874b3475ef7294453",
  "scraped_at": "2026-02-16T07:34:13.739014+00:00"
}