{
  "url": "https://lite.cnn.com/2026/02/17/politics/dhs-ice-trump-tricia-mclaughlin",
  "title": "The many claims by Trump’s DHS that have fallen apart | CNN Politics",
  "date": "2026-02-19T07:32:24.601164+00:00",
  "authors": [
    "Analysis by Aaron Blake, CNN"
  ],
  "text": "Source: CNN\n\nThe imminent exit of Department of Homeland Security spokeswomanTricia McLaughlinfrom the agency is the latest sign of a reset in the Trump administration’s aggressive deportation strategy, which hasfallen sharply out of favorwith the American people.\n\nAnd it’s difficult to overstate how big a role the department’s overly aggressive, poor and often bizarre messaging played in that.\n\nThe administration and McLaughlin, who’s set to leave next week, seemed to think they could say whatever they wanted about episodes such as the shootings of Renee Good and Alex Pretti by federal immigration agents, regardless of the evidence. But there proved to be political consequences to that approach.\n\nA Quinnipiac University poll earlier this month showed registered voters said by more than a2-to-1 margin (61%-25%)that they did not think the administration had given an “honest account” of Pretti’s shooting in Minneapolis in late January.\n\nEven among Republicans, 4 in 10 declined to vouch for the administration. (About half were neutral, while half distrusted it.)\n\nAnd that reputation was more than earned — if not just via the administration’s botched handling of Pretti’s shooting, but by its handling of many other high-profile incidents.\n\nOver and over again in recent months, DHS has made claims that were later undermined by video, other evidence, local police and/or judges. Its legal cases against people it accused of targeting federal agents repeatedly fell apart.\n\nAnd while Pretti’s killing was perhaps the most shocking example of the department’s botched messaging, it was of-a-piece with plenty of other examples – including some we learned more about in recent days, shortly before McLaughlin’s exit was reported. (CNN reports that she started to plan her exit in December but stayed on in the aftermath of those Minneapolis shootings.)\n\nLet’s review some examples of big DHS claims that fell apart.\n\nThe claims:McLaughlin said Good had “weaponized her vehicle in an attempt to kill or cause bodily harm to federal law enforcement.” Secretary of Homeland Security Kristi Noem called it “an act of domestic terrorism.” And President Donald Trump said Good “willfully and viciously ran over” the agent.\n\nThe evidence:Immigration and Customs Enforcement agent Jonathan Ross was not run over. There is some question about whether the vehicle made contact with him. But there remains no evidence that Good aimed to run over the agent; indeed, Good was turning away from the agent as she drove away and was shot. Andvideo evidenceshows Ross continuing to shoot her even from the side of the vehicle.\n\nThe claims:McLaughlin said it looked like Pretti had aimed to “massacre law enforcement.” Noem again invoked “domestic terrorism.” White House adviser Stephen Miller called Pretti an”assassin” who “tried to murder federal agents.”\n\nThe evidence:The video contradicted these claims even more strongly than with Good. There is no evidence that Pretti targeted the agents. He was legally armed but did not draw his gun, and he was disarmed before he was shot and killed. The administration has sincebacked off of these claims.\n\nThe claims:Good and Pretti were not the first US citizens to be accused of terrorism. After a Border Patrol agent shot Marimar Martinez several times in Chicago, a DHS statement said the agents involved were “ambushed by domestic terroriststhat rammed federal agents with their vehicles.” It said the shots were “defensive.” McLaughlin added: “We will not allow domestic terrorists to attack our law enforcement.”\n\nThe evidence:Video evidencereleased last week bolsters Martinez’s claim that it was her vehicle that was rammed, not the agent’s. And the prosecution of Martinez previouslyfell apartamid numerous problems, including the fact that the agent’s vehicle — which was due to be evidence — was driven more than 1,000 miles away after the incident.\n\nThe claims:DHS claimed in a statement that three migrants, including one who was shot in the leg in Minneapolis, Julio Cesar Sosa-Celis, “violently assaulted law enforcement with a shovel and broom.” Noem described an “attempted murder of federal law enforcement.”\n\nThe evidence:ICEadmittedlast week that its agents made “false statements” under oath, and Justice Department prosecutors moved to drop criminal charges against two of the men. Acting ICE Director Todd Lyons said the claims were contradicted by video evidence.\n\nThe claims:DHS accused Milwaukee resident Ramón Morales Reyes of writing a letter in which he “threatened to assassinate President Trump.” Noem urged Trump’s critics to tone down their rhetoric.\n\nThe evidence:Last month, another man admitted in court that theletter was a ruse, and was actually written by him. The man had allegedly stabbed Morales Reyes and wanted to get him deported before he could testify. DHS’ claim remains online, with no indication that it falsely accused Morales Reyes. (It instead says he was “no longer under investigation.”)\n\nThe claims:Greg Bovino, the Border Patrol official who formerly led the Minneapolis operation, claimed he deployed tear gas after being struck in the helmet by a rock in Chicago. DHS also said a rock “struck Chief Greg Bovino in the head.”\n\nThe evidence:In a case involving limits on federal agents’ use of force, a judge said Bovino “admitted in his depositionthat he lied multiple times” about the incident. The judge said Bovino’s claims shifted repeatedly, and he finally admitted no rock had been thrown at him before he deployed the tear gas.\n\nThe claims:After video emerged of an aggressive apprehension of a teenager in Hoffman Estates, Illinois, McLaughlin claimed it was old video and didn’t involve ICE. She called it “a video from a burglary arrest Chicago Police made over a year ago.”\n\nThe evidence:PolitiFact determined McLaughlin’s claims werefalse. The scene involved agents wearing uniforms that identified them as tied to ICE, and it would make no sense for the arrest to involve Chicago police, given it was in a suburb 30 miles away. The teenager’s family alsospoke out.\n\nThe claims:DHS claimed thattwo men were in a vanthat one of them drove “directly at ICE officers,” in Glen Burnie, Maryland. One of them was shot by an agent.\n\nThe evidence:Anne Arundel County police later said one of the two men was “already in custody” at the time. DHS later amended its claims to reflect that only one person was in the van.\n\nThe claims:McLaughlin said that a 13-year-old who was arrested and detained by ICE in Massachusetts “was in possession of a firearmand 5-7 inch knife when arrested.”\n\nThe evidence:Everett, Massachusetts, Mayor Carlo DeMaria strongly denied the teen had a gun, saying, “No guns were found.” (DeMaria confirmed the knife.) Asked by CNN for further comment, DHS did not respond.\n\nThe claims:Aftertwo children were hospitalized after being tear-gassedas their family drove near a protest in Minneapolis, DHS suggested their parents were “agitators.” DHS wrote in a post: “It is horrific to see radical agitators bring children to their violent riots.”\n\nThe evidence:DHS soon deleted the post, with McLaughlinacknowledgingthe people were not agitators but instead “victims.”\n\nThe claims:After the Tufts University PhD student was detained by masked federal agents last spring, McLaughlin told CNN that Rümeysa Öztürk had been found by investigators to be “engaged in activities in support of Hamas, a foreign terrorist organization.”\n\nThe evidence:Last month, a newly releasedState Department memosaid the investigators did not find that Öztürk had “made any public statements indicating support for a terrorist organization.” It said DHS found no grounds to remove her for “material support to foreign terrorist organization or terrorist activity.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/tricia-mclaughlin-homeland-security-spokesperson-leaving",
      "text": "Tricia McLaughlin"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/alex-pretti-shooting-minneapolis-crackdown-polls",
      "text": "fallen sharply out of favor"
    },
    {
      "url": "https://poll.qu.edu/poll-release?releaseid=3947",
      "text": "2-to-1 margin (61%-25%)"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/115855701696773990",
      "text": "willfully and viciously ran over"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/us/video/3d-imaging-examines-renee-good-shooting-john-miller-digvid-vrtc",
      "text": "video evidence"
    },
    {
      "url": "https://x.com/StephenM/status/2015133481261474030",
      "text": "”assassin” who “tried to murder federal agents.”"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/false-claims-trump-administration",
      "text": "backed off of these claims"
    },
    {
      "url": "https://www.dhs.gov/news/2025/10/04/update-dhs-deploys-special-operations-after-multiple-violent-attacks-federal-law",
      "text": "ambushed by domestic terrorists"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/chicago-border-patrol-shooting-video-evidence",
      "text": "Video evidence"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/us/marimar-martinez-shooting-case-what-we-know",
      "text": "fell apart"
    },
    {
      "url": "https://www.dhs.gov/news/2026/01/15/dhs-releases-more-details-about-three-violent-criminal-illegal-aliens-who-violently",
      "text": "violently assaulted law enforcement with a shovel and broom"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/us/ice-shooting-dhs-doj-false-statements",
      "text": "admitted"
    },
    {
      "url": "https://www.dhs.gov/news/2025/05/28/secretary-noem-releases-statement-after-ice-arrests-illegal-alien-who-threatened",
      "text": "threatened to assassinate President Trump"
    },
    {
      "url": "https://www.jsonline.com/story/news/crime/2026/01/27/trial-begins-for-man-accused-of-framing-crime-victim-for-threat-to-trump/88361647007/",
      "text": "letter was a ruse"
    },
    {
      "url": "https://x.com/dhsgov/status/1983186057798545573",
      "text": "struck Chief Greg Bovino in the head"
    },
    {
      "url": "https://cases.justia.com/federal/district-courts/illinois/ilndce/1:2025cv12173/487571/281/0.pdf?ts=1763733493",
      "text": "admitted in his deposition"
    },
    {
      "url": "https://x.com/TriciaOhio/status/1977378998071038129",
      "text": "a video from a burglary arrest Chicago Police made over a year ago"
    },
    {
      "url": "https://www.politifact.com/factchecks/2025/oct/15/tricia-mclaughlin/viral-video-shows-ice-activity-in-hoffman-estates/",
      "text": "false"
    },
    {
      "url": "https://www.cbsnews.com/chicago/news/teen-tossed-to-ground-by-ice/",
      "text": "spoke out"
    },
    {
      "url": "https://x.com/DHSgov/status/2003931344553095309",
      "text": "two men were in a van"
    },
    {
      "url": "https://wtop.com/maryland/2026/01/department-of-homeland-security-changes-its-account-of-christmas-eve-shooting-by-ice-officers/",
      "text": "already in custody"
    },
    {
      "url": "https://www.cnn.com/2025/10/15/us/13-year-old-detained-ice-boston",
      "text": "was in possession of a firearm"
    },
    {
      "url": "https://www.cnn.com/2025/10/15/us/13-year-old-detained-ice-boston",
      "text": "No guns were found"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/us/minneapolis-family-tear-gassed-ice",
      "text": "two children were hospitalized after being tear-gassed"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-01-16-26?post-id=cmkhhqzc700003b6qmyr3huy0",
      "text": "acknowledging"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/court-documents-student-israel-op-ed",
      "text": "State Department memo"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/dhs-ice-trump-tricia-mclaughlin",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/dhs-ice-trump-tricia-mclaughlin",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4315629a0f6433413e107d371e89e394d3c92bb62ccbe0e9e319ff747b95f8d5",
  "scraped_at": "2026-02-19T07:32:24.601178+00:00"
}