{
  "url": "https://lite.cnn.com/2026/02/19/europe/austria-climber-convicted-girlfriend-latam-intl",
  "title": "Climber is convicted in girlfriend’s death near Austria’s highest peak | CNN",
  "date": "2026-02-20T07:28:03.563665+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nAn Austrian court late Thursday found a 37-year-old amateur mountaineer guilty of manslaughter forhis girlfriend’s death of coldnear Austria’s highest summit after he left her to get help, local media reported.\n\nThe case is unusual because while climbing accidents are common, prosecutions over them are rare, even in situations like this one where various mistakes were made.\n\nThe court in the western city of Innsbruck handed the Austrian man a five-month suspended prison sentence and a 9,400 euro ($11,100) fine for causing her death in January 2025 by gross negligence, an offense that carries a maximum prison sentence of three years.\n\nThe trial has raised questions about the extent of legal liability in the high mountains, an inherently dangerous environment that climbers generally explore at their own risk.\n\nAfter a day’s climbing in which they fell far behind schedule, the woman was exhausted and unable to go on about 50 meters (164 feet) below the summit of the Grossglockner mountain on a freezing winter’s night, the court heard.\n\nThe defendant, identified only as Thomas P., left his girlfriend, Kerstin G., exposed to strong winds, without wrapping her in her emergency blanket or bivouac bag for reasons he could not fully explain, when he went to seek help in a shelter on the other side of the summit. The equipment stayed in her rucksack.\n\nA short call to the mountain police did not trigger a search, since the police said he did not make clear they needed rescuing, and he failed to answer calls back or WhatsApp messages asking if they needed help. The defendant said his phone had been in airplane mode to save battery power.\n\n“What I want to say is that I am so terribly sorry,” Thomas P., who pleaded not guilty, told the court.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/austria-climber-accused-left-girlfriend-die-latam-intl",
      "text": "his girlfriend’s death of cold"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/austria-climber-convicted-girlfriend-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/europe/austria-climber-convicted-girlfriend-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "43415ea196a718b5c0fcdd8e725e59041548aadf2a10956643fe6bc3c5558bf0",
  "scraped_at": "2026-02-20T07:28:03.563679+00:00"
}