{
  "url": "https://lite.cnn.com/2026/02/24/us/ruben-ray-martinez-shooting-witness-killed",
  "title": "Witness who saw friend Ruben Ray Martinez shot by ICE agent in Texas last year dies in car accident | CNN",
  "date": "2026-02-25T07:32:54.394494+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nThe passenger in the car when Texas driver Ruben Ray Martinezwas fatally shot last yearby a federal immigration agent gave a lengthy statement to lawyers for the slain man’s family disputing the government’s version of events.\n\nThat witness died Saturday in a fiery car crash in San Antonio, according to a lawyer for Martinez’s family.\n\nJoshua Orta rode with Martinez on a Spring Break trip last March when they came upon a group of local police and federal agents directing traffic around an accident at a busy intersection. In a statement issued Friday, the Department of Homeland Security alleged that Martinez “intentionally ran over a Homeland Security Investigation special agent,” thereby causing another agent to fire “defensive shots to protect himself, his fellow agents, and the general public.”\n\nThe Associated Press and other media outlets reported last week on details of Martinez’s death, which would mark at least six deadly shootings by federal officers since President Donald Trump’s coast-to-coast immigration crackdown. DHS made no public disclosure for 11 months that one of its agents pulled the trigger.\n\nAccording to the draft affidavit prepared following interviews in September, Orta reportedly said that Martinez did not hit an officer with his vehicle, that their car was “just crawling as we were trying to turn around” and that a federal agent fired into the driver’s side window from about two feet away without “giving any warning, commands, or opportunity to comply.”\n\nSan Antonio Police said a 25-year-old man was killed Saturday when he drove into a curved highway exit at a high rate of speed before losing control and slamming into a utility pole. Passengers were able to escape as the vehicle caught fire, but they were unable to pull out the driver.\n\nLawyers for Rachel Reyes, Martinez’s mother, said Orta was the man who was killed in the car accident. The draft affidavit indicated Martinez’s family is preparing to file a wrongful death lawsuit in the earlier shooting.\n\n“First and foremost, Joshua’s death is an awful tragedy for his family and friends,” said Alex Stamm, one of the lawyers representing the family. “In terms of Ruben’s death, the world has also now lost a critical eyewitness.”\n\nDHS on Monday said: “We stand by our original statement.”\n\nThe Texas Rangers confirmed last week they are investigating Martinez’s shooting. The agency did not respond to questions Monday about whether they had interviewed Orta prior to his death.\n\nOrta and Martinez decided to take a spontaneous trip to Texas’ South Padre Island to meet up with friends, according to Orta’s draft affidavit. After hanging out in a condo and having a “few drinks,” then a pool party and a trip to Whataburger, they arrived at the scene of an accident and slowed the car down, Orta said.\n\nA local police officer approached their car, saw an open alcohol container in the back, but told the two young men to turn around and leave, he said. As they tried to turn in the traffic, another officer walked up to their car and slapped the hood and “seemed to be trying to get in front of the car,” said Orta.\n\nMartinez “did not hit anyone,” Orta said.\n\nThen several more officers surrounded their vehicle, yelling at them to stop and drawing their guns, Orta recounted. “This was crazy to me because we were only crawling,” he said, adding that Martinez never hit the gas and the officers weren’t in any danger.\n\nAn officer standing by Martinez’s open driver’s side window then pulled his weapon and fired without warning, so close the bullet casings ejected from his weapon landed inside the vehicle, he said.\n\nOrta recounted hearing his friend say “I’m sorry” as he slumped backward unconscious after being stuck in the chest. He said agents then pulled Martinez from the car and handcuffed him, waiting at least 10 minutes before providing any medical aid.\n\nReyes, Martinez’s mother, told AP last week her son was shot three times. She also said an investigator from the Texas Rangers had obtained videos of the shooting that she said undercut DHS’s claim her son tried to run over the agent.\n\nAccording to an internal incident report from Immigration and Customs Law Enforcement that was released earlier this month after a Freedom of Information Act lawsuit, the HSI agents involved in the shooting were part of a maritime border enforcement security task force typically focused on combating transnational criminal organizations at seaports. Over the past year, however, officers from across multiple federal agencies have been reassigned to prioritize immigration enforcement.\n\nIn January,Renee Good, a 37-year-old mother in Minneapolis, was killed in the driver’s seat of her SUV by an ICE officer. Trump administration officials initially attempted to paint Good as a “domestic terrorist” who tried to ram officers with her vehicle beforemultiple videos emergedof the incident that cast doubt on the government’s narrative.\n\nLaw enforcement officers are typically trained not to step in front of vehicles due to the danger they might be struck. Like Good, Martinez had no criminal record.\n\nStamm, the family’s lawyer, said Orta’s account confirmed Martinez’s car was barely moving before the HSI officer opened fire.\n\n“He also told us unequivocally that Ruben did not hit anyone,” Stamm said. “We believe Joshua’s account, and, as we have seen recently in Minneapolis, Chicago, and elsewhere, it is critical that the public be shown every piece of evidence in the government’s possession, and that any witness come forward.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/texas-ruben-ray-martinez-shooting",
      "text": "was fatally shot last year"
    },
    {
      "url": "https://www.cnn.com/2026/01/10/us/ice-shooting-minneapolis-renee-good",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/us/ice-shooting-minneapolis-renee-good",
      "text": "multiple videos emerged"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/ruben-ray-martinez-shooting-witness-killed",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/us/ruben-ray-martinez-shooting-witness-killed",
      "text": "Cookie Settings"
    }
  ],
  "hash": "435a7fd21b91524cfe7a2181b3cc60cbefb9669c9602f447d5e758765641e44f",
  "scraped_at": "2026-02-25T07:32:54.394506+00:00"
}