{
  "url": "https://lite.cnn.com/2026/02/27/us/los-angeles-superintendent-carvalho-paid-leave",
  "title": "Alberto Carvalho, superintendent of Los Angeles schools, on paid leave after FBI searches of his home and office | CNN",
  "date": "2026-03-01T07:07:11.338218+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nLos Angeles School Superintendent Alberto Carvalho is being put on paid leave while he is part of a federal investigation. The move on Friday by the Los Angeles Unified School District Board of Education comes two days after the FBI served search warrants at his home and the district’s headquarters.\n\nAuthorities have not provided details of the nature of the investigation involving the nation’s second-largest school district, which serves more than 500,000 students.\n\nCarvalho became superintendent in 2022. He previously led the public schools in Miami.\n\nAndres Chait, the chief of school operations, will take over the helm while Carvalho is on leave, the district said.\n\nCarvalho has not responded to a request for comment. The FBI on Wednesday also searched a third location near Miami. The Miami Herald reported the Florida property belonged to Debra Kerr, who previously worked with AllHere, an education technology company that had a contract with Los Angeles schools before it collapsed and its leader was indicted for fraud. She could not be reached for comment Thursday.\n\nIn 2024, Carvalho heavily touted a deal with AllHere for an AI chatbot named “Ed” designed to help students. But about three months after unveiling the technology and paying the company $3 million, the district dropped its dealings with AllHere, which collapsed into bankruptcy. Months later, founder Joanna Smith-Griffin was charged with securities and wire fraud, along with identity theft.\n\nThe school district said in a statement Wednesday that it “is cooperating with the investigation and we do not have further information at this time.”\n\nCarvalho denied personal involvement in the selection of AllHere, according to the Los Angeles Times. After Smith-Griffin was indicted, Carvalho said he would appoint a task force to examine what went wrong with the LA school district’s project, but there have been no public announcements about it since.\n\nKerr, an education technology salesperson who connects companies with schools, said she was never paid her $630,000 commission for her work in closing the AllHere deal with the LA district, according to a news organization, The 74, that covered the company’s bankruptcy hearings in 2024.\n\nThe 74 reported that Kerr had longstanding ties with Carvalho from when he oversaw the Florida district and that her son who worked for AllHere pitched the technology to LA school leaders after he took over the helm there. The Associated Press was unable to reach Kerr for comment.\n\nOver the past five years in Los Angeles, Carvalho has been lauded for the district’s improvements to academic performance. He won similar praise while overseeing Miami-Dade County Public Schools, Florida’s largest school district, where the national superintendents association named him Superintendent of the Year in 2014.\n\nSpain knighted the Portugal-born administrator in 2021 for his work in expanding Spanish-language programs for Miami-Dade County schools.\n\nMonths later, Carvalho took the job in California and became a harsh critic of the Trump administration’s aggressive immigration crackdown, especially following raids in Los Angeles last year.\n\nCarvalho arrived in Los Angeles at a critical moment, as the district found itself flush with funding from state and federal COVID-19 relief money but still struggling with the impacts of the pandemic, including learning losses and declining enrollment. He previously sparred with Florida Republican Gov. Ron DeSantis over his order that schools not require masks during the pandemic.\n\nThe Miami-Dade school system said in a statement that it was aware of the investigation involving Carvalho but did not have any comment at this time.\n\nSee Full Web Article",
  "links": [],
  "hash": "438f6f611128383a1d578b0fec27eb90409b6ba6b766eaf81ab1f00c7b38d711",
  "scraped_at": "2026-03-01T07:07:11.338229+00:00"
}