{
  "url": "https://lite.cnn.com/2026/02/28/business/berkshire-hathaway-greg-abel-buffett",
  "title": "Berkshire Hathaway reports drop in quarterly profit on insurance operations weakness | CNN Business",
  "date": "2026-03-01T07:06:42.323672+00:00",
  "authors": [
    "Auzinea Bacon"
  ],
  "text": "Source: CNN\n\nBerkshire Hathaway (BRK.B), which wrapped up its final year under Warren Buffett’s leadership, reported Saturday that operating earnings for the fourth quarter totaled $10.2 billion, down 29.8% from last year, on weakness from its insurance business.\n\nLast year’s operating earnings totaled about $44.5 billion, down 6% from the previous year. The Omaha, Nebraska-based conglomerate reported that net income fell to $19.2 billion from $19.69 billion a year earlier.\n\nBerkshire earned $7.2 billion last year from insurance underwriting, a 19.5% drop from 2024. Berkshire’s insurance underwriting arm continues to be led by car insurer Geico, which has seen weaker customer retention due to broad rate increases in recent years, according to the report.\n\nThe report marks the first year Berkshire’s annual letter to shareholders wasn’t penned by Buffett, 95, whose folksy financial wisdom was a must-read for many investors. The Oracle of Omaha announced in May 2025 that he would step down at the end of the year and named long-time lieutenantGreg Abelas his successor. Abel has now taken the helm after Buffet’s six decades of leading the famed company.\n\nIn his first letter, Abel sought to reassure investors that Berkshire remains a reliable place to invest and that the core principles are still intact.\n\n“To invest in Berkshire has long been a vote of trust in our founder – a trust that now rests with Berkshire. Your capital is commingled with ours, but it does not belong to us. Our role is stewardship. That stewardship has shaped a culture and reinforced a set of values that are not the result of our success, but the reason for it,” Abel wrote in his first annual note to investors.\n\nAbel noted that while Buffett continues to serve as Berkshire chairman, the famed investor is in the office five days a week and continues to serve as an owner.\n\nIt’s been almost five years since Abel, who has worked for Berkshire since 2000, was first designated to take over as the next chief executive. Charlie Munger, who served as Berkshire’s vice-chair from 1978 until his death in 2023, once said Abel would “keep the culture,” and Buffett last year said his successor would be a “more active” leader.\n\n“We will encounter business successes and setbacks. When we fail, we will say so. Doing the right thing also means rectifying our errors,” Abel said, adding that the company would “act decisively and ruthlessly” when “a small minority” fails to meet standards.\n\nBerkshire’s cash pile is still flowing. Berkshire’s cash and treasury holdings reached a record $373.1 billion, though Abel said that Berkshire’s massive cash pile does not signal a “retreat” from investing, as the company will remain “patient and disciplined” to benefit owners.\n\nAbel will lead the company’s annual shareholder meeting, which has been deemed “Woodstock for Capitalists,” on May 2.\n\nWhile the event may not have Buffett as abrand mascotfor Squishmallows and cardboard cutouts, the former CEO noted last year that Abel “also understands that if you start fooling your shareholders, you will soon believe your own baloney and be fooling yourself, as well.”\n\n“I am honored by the responsibility of continuing to build our company and our partnership in the years ahead. We move forward with great intent and purpose,” Abel wrote.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/markets/stocks/BRK.B",
      "text": "BRK.B"
    },
    {
      "url": "https://www.cnn.com/2025/05/03/business/warren-buffett-berkshire-hathaway-meeting",
      "text": "Greg Abel"
    },
    {
      "url": "https://www.cnn.com/2025/12/27/business/warren-buffett-berkshire-hathaway-pitchman",
      "text": "brand mascot"
    }
  ],
  "hash": "4405ae3fd748e1eda8a0e6cd1359b4a52c40deed30184f2e926f8268f5904539",
  "scraped_at": "2026-03-01T07:06:42.323684+00:00"
}