{
  "url": "https://lite.cnn.com/2026/02/14/politics/casey-wasserman-talent-agency-epstein-maxwell",
  "title": "Epstein files: Hollywood mogul Casey Wasserman to sell talent agency over Maxwell revelations | CNN Politics",
  "date": "2026-02-15T07:11:00.677180+00:00",
  "authors": [],
  "text": "Source: CNN\n\nCasey Wasserman, a prominent entertainment and sports agent and the chair of the 2028 Los Angeles Olympics, is putting his eponymous talent agency up for sale after facing backlash over his appearance in files the US Justice Departmentreleasedlast month related to its investigations into convicted sex offender Jeffrey Epstein.\n\nIn an internal memo sent to agency staff on Friday, which was obtained by CNN,Wassermansaid he has “become a distraction” to the company’s “efforts.”\n\n“That is why I have begun the process of selling the company, an effort that is already underway,” Wasserman wrote.\n\nWasserman faced pressure from his talent to step aside in recent weeks, as well as calls to step down from the Olympics coordinating committee, after the files showed he held a deeper and more intimate relationship with Esptein’s accomplice, Ghislaine Maxwell, than had been previously known.\n\nWasserman has not been accused of criminal wrongdoing in relation to Epstein. CNN has reached out to a crisis communications firm representing him.\n\nWasserman rode on Epstein’s plane and exchanged suggestivemessageswith Maxwell, the files the DOJ released show.\n\nMaxwell, Epstein’s former girlfriend, was convicted of sex trafficking and other crimes in 2021 and is serving a 20-year sentence. Epstein died by suicide in 2019 while awaiting trial on federal sex-trafficking charges.\n\nIn Friday’s memo, Wasserman said he only had “limited interactions with those two individuals,” referring to Epstein and Maxwell.\n\n“It was years before their criminal conduct came to light, and, in its entirety, consisted of one humanitarian trip to Africa and a handful of emails that I deeply regret sending,” Wasserman said. “And I’m heartbroken that my brief contact with them 23 years ago has caused you, this company, and its clients so much hardship over the past days and weeks.”\n\nSources close to the business told CNN that Wasserman’s investors were upset over the situation and pushed him to make this move.\n\nIn an earlier statementreported by the Associated Presslast month, Wasserman clarified that his exchange with Maxwell “took place over two decades ago, long before her horrific crimes came to light.”\n\n“I never had a personal or business relationship with Jeffrey Epstein. As is well documented, I went on a humanitarian trip as part of a delegation with the Clinton Foundation in 2002 on the Epstein plane. I am terribly sorry for having any association with either of them,” his statement read.\n\nDetails of Epstein’s alleged secret lifefirst emerged in 2005when several underage girls accused him of offering to pay for massages or sex acts at his Palm Beach mansion. Epstein pleaded guilty to two state prostitutioncharges in 2008and served 13 months in prison.\n\nSince the release of the latest files, singerChappell Roanannounced she was leaving Wasserman’s agency. Singer Orville Peck quickly followed, and then singer-songwriter Weyes Blood, among others.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/jeffrey-epstein-files-release-doj",
      "text": "released"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/casey-wasserman-la-olympics-ghislaine-maxwell-epstein",
      "text": "Wasserman"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/entertainment/casey-wasserman-epstein-files-ghislaine-maxwell",
      "text": "messages"
    },
    {
      "url": "https://apnews.com/article/epstein-maxwell-wasserman-olympics-bf365cd5231304395af05abc3deb9cf7",
      "text": "reported by the Associated Press"
    },
    {
      "url": "https://www.cnn.com/2025/07/09/politics/what-to-know-about-the-jeffrey-epstein-saga",
      "text": "first emerged in 2005"
    },
    {
      "url": "https://www.cnn.com/2019/07/06/us/jeffrey-epstein-arrest-sex-trafficking-indictment/index.html",
      "text": "charges in 2008"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/entertainment/chappell-roan-casey-wasserman-intl-scli",
      "text": "Chappell Roan"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/casey-wasserman-talent-agency-epstein-maxwell",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/politics/casey-wasserman-talent-agency-epstein-maxwell",
      "text": "Cookie Settings"
    }
  ],
  "hash": "442b15739afd2aef3344a9a198c0e68267eb3d0a90c4eb80496a00d04dd1574f",
  "scraped_at": "2026-02-15T07:11:00.677192+00:00"
}