{
  "url": "https://lite.cnn.com/2026/02/25/tech/samsung-galaxy-s26-ai-google-gemini",
  "title": "AI is making waves everywhere – except where you’d expect it most. Two giant tech companies are working to change that | CNN Business",
  "date": "2026-02-27T07:17:43.185224+00:00",
  "authors": [
    "Lisa Eadicicco"
  ],
  "text": "Source: CNN\n\nArtificial intelligenceis starting to change the way people work, find information and even form social relationships. Yet very little has changed about the devices people often use to access AI: smartphones.\n\nSamsung wants to change that with its Galaxy S26, a new series of smartphones announced Wednesday.\n\nThe Galaxy S26, S26 Plus and S26 Ultra phones will use AI to try to predict what a user wants to do next, and in some cases accomplish tasks on their behalf. To this end, Google is previewing a new feature for itsGeminiassistant, starting with ride-sharing, grocery and food apps.\n\nGemini could look at a list of guests for a barbecue, then work in the background to build a shopping cart with the right amount of food and supplies for everyone attending. Or, if an S26 user has a flight coming up in a couple of hours, the phone may display a button to call an Uber from the home or lock screen without having to launch the app.\n\nAnalysts say it’s a sign of what’s to come for smartphones: a world where users do far less tapping and swiping between apps, and AI agents do the heavy lifting.\n\n“It makes complete sense for (phone makers) to focus on this, because that is where we are headed. That is going to be the future of smartphones,” said Nabila Popal, a senior director covering mobile phones for International Data Corporation, a market research company.\n\nWhat’s unclear, however, is when exactly that future will materialize, or if it will actually compel millions of people to buy a new phone. Smartphone makers have over the years gradually infused software with more AI tools—like the ability to search for something just by circling it on screen or erasing unwanted objects from photos. But analysts say most people buy new phones out of necessity and prioritize features like new colors, fancy cameras and better screens.\n\n“Nothing did more for smartphone sales last year than the color orange,” said Runar Bjorhovde, a smartphone industry analyst for market research firm Omdia, referring to the popular Cosmic Orange color Apple launched for the iPhone 17 Pro last year.\n\nBeyond AI tools, Samsung’s new phones do include popular upgrades like a more powerful processor, a camera that’s better at taking photos in the dark and new screen technology that preventsbystanders from seeing sensitive information like pin codes and passwords.\n\nBut Drew Blackard, senior vice president of mobile product management at Samsung Electronics America, told CNN that regardless of what consumers spend money on, AI agents are the “big theme” of this year’s phones, continuing the direction it’s taken over the last couple of years.\n\nGoogle is also focused on an agentic future, which is part of why it’s working so closely with Samsung. Although Google makes its own Pixel phones, Samsung’s phones are among the most widely used in the world — and therefore the most prominent way most people experience Google’s Android operating system.\n\n“Today, the way that we see AI primarily being used is through things like chatbot interfaces, where you go and you ask what you want, and you get a response,” Sameer Samat, president of the Android ecosystem at Google, said in an interview with CNN. “I think in the future, as this technology advances, there will be opportunities where the interface can be much more proactive as opposed to reactive.”\n\nGalaxy S26 users can also use voice commands to perform tasks like editing photos and finding device settings. If, for example, they tell Samsung’s Bixby AI assistant that their eyes get tired after looking at the screen for too long, the assistant will pull up screen brightness settings.\n\nPerplexity’s AI assistant will also be embedded in the S26 phones as an alternative option to handle requests.\n\nEven as usage soars for apps like OpenAI’s ChatGPT, Google’s Gemini and Anthropic’s Claude, AI isn’t among the top three purchase drivers for shoppers buying a new phone, according to Popal. She said price, camera and display quality are usually the biggest factors.\n\nWhen Omdia asked consumers about what they think of when they hear AI, 65% said ChatGPT, while 20% said they didn’t know, according to Bjorhovde.\n\n“They basically want a phone in which you can download the ChatGPT app,” he said.\n\nMeanwhile, AI usage in business has been picking up steam, witha Menlo Ventures reportfrom December calling enterprise AI the fastest-scaling software category in history. AndPew Research Center datasuggests US teens are increasingly using AI to help with homework.\n\nBut Samat points out that most enterprise AI tools are designed for specific tasks, while revamping how consumers interact with smartphones would be a sweeping change.\n\n“There’s an infinite number of things we’re all doing with our devices every day,” he said.\n\nRegardless of whether consumers are thinking about AI when buying a new phone, Blackard says they’re still likely using AI daily without realizing it. That’s because AI has long powered many phone features behind the scenes, such as the way the cameras process images.\n\nSamsung and Google aren’t the only companies racing to reinvent the smartphone for the AI age. Apple is developing an overhauled version of Siripowered by Google’s Gemini modelthat will provide more contextual answers, although that update has faced delays. Apple has been gradually rolling out other AI features to iPhones and other products since 2024.\n\nA big motivation for tech companies in that race, according to Bjorhovde, is a fear of missing out on the next big thing.\n\n“The industry is struck with some of these lessons that were taught in the past,” he said, “That if you don’t actually capture what happens in the market, it is so easy to fall behind just in a very low number of years.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/business/tech/ai-news-artificial-intelligence-updates",
      "text": "Artificial intelligence"
    },
    {
      "url": "https://www.cnn.com/2025/11/29/tech/ai-chips-google-gemini-3-tpu-nvidia",
      "text": "Gemini"
    },
    {
      "url": "https://menlovc.com/perspective/2025-the-state-of-generative-ai-in-the-enterprise/",
      "text": "a Menlo Ventures report"
    },
    {
      "url": "https://www.pewresearch.org/internet/2026/02/24/how-teens-use-and-view-ai/",
      "text": "Pew Research Center data"
    },
    {
      "url": "https://www.cnn.com/2026/01/12/tech/apple-google-gemini-siri",
      "text": "powered by Google’s Gemini model"
    }
  ],
  "hash": "4489346f960903fd12bd2494617189f906cf896b495dae1a9d91c368b8e16f21",
  "scraped_at": "2026-02-27T07:17:43.185237+00:00"
}