{
  "url": "https://lite.cnn.com/2026/02/13/politics/us-military-top-universities-tuition-assistance",
  "title": "Pentagon may bar tuition aid for top universities in Pete Hegseth’s crackdown on ‘biased’ schools | CNN Politics",
  "date": "2026-02-15T07:11:42.732483+00:00",
  "authors": [],
  "text": "Source: CNN\n\nMilitary officers could soon find dozens of top colleges and universities across the United States abruptly off limits for tuition assistance as part of Defense Secretary Pete Hegseth’s campaign against schools he describes as being biased against the US military and sponsoring “troublesome partnerships with foreign adversaries.”\n\nThe uncertainty about tuition assistance and eligible programs for Defense Department funding has led to confusion and concern amongst service members who have already applied or been accepted to these schools. Officials also said they were concerned it amounted to an attempt to purge diversity of thought from the military.\n\nThe policy was rolled out in a memo signed by Hegseth last week saying that beginning with the 2026-2027 school year, the Pentagon would be severing its relationship withHarvard Universityand discontinuing all graduate-level professional military education, fellowships and certificate programs there for active-duty service members.\n\nHegseth ordered the military services to “evaluate all existing graduate programs for active-duty members at Ivy League universities and any other universities that similarly diminish critical thinking and have significant adversary involvement, and determine whether they deliver cost-effective, strategic education for future senior leaders when compared to public universities and military masters programs,” according to a source familiar with the memo.\n\nThe guidance’s broad terminology has injected confusion and concern into the military branches, who have begun to compile lists of colleges and universities that may have a moderate to high risk of being impacted, meaning the Pentagon wouldn’t fund any service members’ higher education there.\n\nA preliminary list of at-risk schools compiled by the Army for troops enrolling in law school and reviewed by CNN characterizes the following schools as being at “moderate to high risk” of being banned: American University, Boston College, Boston University, Brown University, Carnegie Mellon, Case Western University, Columbia University, College of William and Mary, Cornell University, Duke, Emory, Florida Institute of Technology, Fordham, Georgetown, George Washington University, Harvard, Hawaii Pacific University, Johns Hopkins University, the London School of Economics and Political Science, MIT, Northeastern University, Northwestern University, New York University, Pepperdine, Princeton, Stanford, Tufts, University of Miami, University of Pennsylvania, University of Southern California, Vanderbilt, Wake Forest, Washington University in St Louis, and Yale.\n\nA source familiar with Hegseth’s guidance told CNN that the implication is that “graduate programs for highest performing officers and non-commissioned officers are almost certainly at risk.” This source and a military official added that it has created extensive uncertainty within the services about how to proceed with applying for advanced civil schooling, including top law programs, medical programs, and nuclear engineering programs.\n\nThe Office of the Secretary of Defense referred CNN to the services for comment. The Army did not respond to a request for comment.\n\nSeveral top political appointees at the Pentagon, including Hegseth himself, are graduates of Ivy League schools or other top universities. Hegseth attended Princeton and Harvard; Deputy Defense Secretary Steve Feinberg attended Princeton; Army Secretary Dan Driscoll obtained his law degree from Yale; Navy Secretary John Phelan holds anMBA from Harvard Business Schooland completed a general course degree in economics and international relations at theLondon School of Economics\n\nThe guidance was first mentioned publicly ina video Hegseth postedon social media last week, in which he bashed Harvard and other American universities that have “pervasive institutional bias” saying they “no longer live up to their founding principles, as bastions of free speech, open inquiry, and committed to the American values that make our country great.”\n\n“In two weeks time, components of all of our departments — Army, Navy, and Air Force — will evaluate all existing graduate programs for active duty service members at all Ivy League universities, and other civilian universities,” Hegseth said.\n\nEducational programs and opportunities are a key recruiting and retention tool for the military services, often exchanging mandatory years in uniform for tuition assistance to top schools in the country. Graduate programs have been lauded as a way to academically sharpen US military personnel, keeping the best and brightest in uniform, while also allowing them to invest in their futures after they’ve left military service.\n\nEligible schools are often those accredited by the major associations for those specialties. For qualifying service members who wish to go to law school, for example, schools are typically considered eligible for the Army to pay for them if they are accredited by the American Bar Association. The Armed Forces Health Professions Scholarship Program covers tuition for medical, dental, nursing, and psychology students in return for one year of active-duty service for each year of support. For medical programs, the military typically requires that the school is accredited by the American Medical Association or American Osteopathic Association.\n\nThe vagueness of the memo has also raised concern that tuition assistance could be impacted, which active-duty service members can use for other graduate or certification programs in their off-duty time that are not necessarily related to their day-to-day jobs. Service members can enroll in business administration courses, for example, or communication and marketing.\n\nBut the military also has extensive partnerships with various universities and colleges for professional military education opportunities. The Space Force, for example,announced in 2023a partnership with Johns Hopkins, which was included on the Army’s tentative list of universities that are considered at risk.\n\nThe military official said the guidance was akin to prohibiting officers from obtaining a top tier education, and said it amounted to the Pentagon “attempting to purge intellect, diversity of thinking, and critical thought from the military.”\n\n“The overall concern is that we want military officers and non-commissioned officers to have the ability to critically think and challenge ideas … and some of these institutions are great places to do that whether you agree with liberal or conservative thought or not,” said the source familiar with the matter. “It seems both very delicate — oh these words and ideas scare me, so I’ll preclude people from engaging — but also short-sighted and is generating confusion.”\n\nHegseth has been intensely focused on reshaping the culture of the military since taking office last year, which has involved everything from adding a secondary title for the Department of Defense as the “Department of War” to policy shifts that have deeply impacted servicemembers, like aban on transgender troopsand an evaluation of whether women should service in combat roles.\n\nLast year, he also ordered all military academies to identify and remove books from their libraries that deal with issues such as race, gender ideology, and other “divisive concepts” that are now considered “incompatible with the department’s core mission,” according to a memo he signed at the time.\n\nHegseth’s latest war on Harvard and other top universities has also mirrored one waged by President Donald Trump, who over the last year has targeted federal funding, research grants, and student visas at elite universities across the country — beginning with Harvard— unless they comply with his demands to dismantle Diversity, Equity and Inclusion programs and crackdown on pro-Palestine student protesters and antisemitism on campuses.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/us/harvard-admissions-documents-trump-lawsuit",
      "text": "Harvard University"
    },
    {
      "url": "https://www.youtube.com/watch?v=I9lSz8bZVpM",
      "text": "MBA from Harvard Business School"
    },
    {
      "url": "https://www.lse.ac.uk/united-states/about-the-us-centre/Introducing-John-Phelan",
      "text": "London School of Economics"
    },
    {
      "url": "https://x.com/SecWar/status/2019918910502457536?s=20",
      "text": "a video Hegseth posted"
    },
    {
      "url": "https://www.spaceforce.mil/News/Article-Display/Article/3476316/ussf-johns-hopkins-university-debut-new-era-of-officer-pme/",
      "text": "announced in 2023"
    },
    {
      "url": "https://www.cnn.com/2025/02/26/politics/pentagon-remove-transgender-service-members-new-policy",
      "text": "ban on transgender troops"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/us-military-top-universities-tuition-assistance",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/us-military-top-universities-tuition-assistance",
      "text": "Cookie Settings"
    }
  ],
  "hash": "45e638a9a348ce5a29a8ae133da0afbbe9623f57db4ea4610613b255b8b70731",
  "scraped_at": "2026-02-15T07:11:42.732494+00:00"
}