{
  "url": "https://lite.cnn.com/2026/02/28/us/minnesota-judge-protection-refugees-detention-deportation-hnk",
  "title": "Federal judge extends order protecting refugees in Minnesota from being arrested and deported | CNN",
  "date": "2026-03-01T07:06:50.603052+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nA federal judge on Friday extended an order protecting refugees in Minnesota who are lawfully in the US from being arrested and deported, saying a Trump administration policy turns the “American Dream into a dystopian nightmare.”\n\nUS District Judge John Tunheim granted a motion by advocates for refugees to convert a temporary restraining order that he issued in January into a more permanent preliminary injunction while the case develops further.\n\nThe order applies only in Minnesota. But the implications of a new national policy on refugees that the Department of Homeland Security announced February 18 were a major part of the discussion at a hearing held by the judge the next day.\n\n“Minnesota refugees can now live their lives without fear that their own government will snatch them off the street and imprison them far from loved ones,” Kimberly Grano, an attorney with the International Refugee Assistance Project, told The Associated Press.\n\nThe Trump administration asserts it has the right to arrest potentially tens of thousands of refugees across the US who entered the country legally but don’t yet have green cards. A new Homeland Security memo interprets immigration law to say that refugees applying for green cards must return to federal custody one year after they were admitted to the U.S. so that their applications can be reviewed.\n\nThe judge, however, expressed disbelief in a 66-page opinion.\n\n“This Court will not allow federal authorities to use a new and erroneous statutory interpretation to terrorize refugees who immigrated to this country under the promise that they would be welcomed and allowed to live in peace, far from the persecution they fled,” Tunheim said.\n\nHe said the US decades ago promised refugees fleeing persecution that they could build a new life after rigorous background checks.\n\n“We promised them the hope that one day they could achieve the American Dream,” Tunheim said. “The Government’s new policy breaks that promise — without congressional authorization — and raises serious constitutional concerns. The new policy turns the refugees’ American Dream into a dystopian nightmare.”\n\nHomeland Security and US Citizenship and Immigration Services said in a statement Friday night that the ruling was “yet another lawless and activist order from a federal judge” and that the Trump administration expected to be “vindicated in court.”\n\n“USCIS is committed to rooting out fraud and protecting the public safety and national security interests of the American people by screening and vetting aliens,” the statement said.\n\nJustice Department attorney Brantley Mayers said during a court hearing last week that the government should have the right to arrest refugees one year after entering the U.S., but he also indicated that would not always happen.\n\nThe judge noted that one refugee in the case, identified as D. Doe, was arrested in January after being told that someone had struck his car.\n\n“He was immediately flown to Texas, where he was interrogated about his refugee status. He was kept in ‘shackles and handcuffs’ for sixteen hours. D. Doe was ultimately released on the streets of Texas, left to find his way back to Minnesota,” Tunheim said.\n\nSee Full Web Article",
  "links": [],
  "hash": "46b0ddbbd0eb602e6447c508f270bd21ecdbe413fb14227bf1ab2bc53679d41d",
  "scraped_at": "2026-03-01T07:06:50.603065+00:00"
}