{
  "url": "https://lite.cnn.com/2026/02/26/us/vegans-maha-rfk-jr-cec",
  "title": "‘Meatheads Are Hijacking America’: Vegans feel betrayed by RFK Jr.’s beef boosting | CNN",
  "date": "2026-02-28T07:01:11.379492+00:00",
  "authors": [
    "Scottie Andrew"
  ],
  "text": "Source: CNN\n\nThe day after Robert F. Kennedy Jr., was sworn in as secretary of Health and Human Services on a self-described mission to “Make America Healthy Again,” the vegan podcast host and animal rights activist Bob Linden posted a missive in several vegan Facebook groups, declaring it a “beginning” and an “opportunity.”\n\n“as Vegans, we need to make sure that we have a place at the table to Make America Healthy ‘Again’(?)” hewrotein February 2025.\n\nFellow vegans in the comments were incredulous — what of the bear cub carcass Kennedy claimed to havedumpedin Central Park or his lifelong interest in hunting? But Linden saw in Kennedy a potential vegan ally who, despite his carnivorous diet, promised to advocate against vaccine mandates,endanimal testing and encourage Americans to quit processed foods.\n\nA year later, Kennedy has made“real food”a pillar of his Make America Healthy Again (MAHA) framework. But his new nutrition guidelines and inverted food pyramid place a much stronger emphasis on red meat, whole milk and other animal products than previous government-issued nutritional suggestions.\n\n“I feel like it’s a betrayal,” Linden said in January. “I believe these new dietary restrictions are anti-American.”\n\nLinden said he defines the MAHA acronym differently now: “Meatheads are hijacking America.”\n\nKennedy has never represented himself as a vegan — his infamous brain worm waslikely a pork tapeworm larva— but his emphasis on whole, natural foods and his hostility to vaccines, which some vegans view as the epitome of animal-tested medicine, suggested an opportunity to bend policy in a more animal-rights-friendly direction. The former Democrat, prominent vegan and vaccine opponent Alicia Silverstone, for instance, threw hersupportbehind Kennedy’s failed presidential campaign.\n\n“I’ve always been on board with the ‘real food’ movement,” said Brian Turner, a veganbodybuilderand trainer. “When RFK Jr. started focusing on cutting out ultra-processed junk, dyes and added sugars, I thought it was a great step forward, and it’s something most of the vegan community and the MAHA movement can actually agree on.”\n\nBut with the MAHA tent reserving a prominent space for beef and dairy farmers and carnivorous conservatives, the vegans who hoped he’d give them a voice are being squeezed out.\n\nKennedy’s status as perhaps the highest-profile vaccine opponent in office was exciting to Linden, who said he’s “anti-vax.” Most vaccines aretestedon animals before they progress to human trials and cancontain“animal-derived products”; therefore, he said, “vaccines aren’t vegan.” They are, though, safe and effective at protecting against harmful and preventable illnesses.\n\nAlong with undermining his department’s support for vaccination and criticizing the processed food industry, however, Kennedy has spent his time as health secretary speaking incessantly about his prolific consumption of red meat. Earlier this year, he said switching to a “carnivore diet” and eating beef aroundtwice a dayhelped him achieve “mental clarity” and shed 20 pounds. His wife, Cheryl Hines, said he cooks a steak with sauerkraut, his other main food, at 6:30 a.m. (Hines hassaidshe’s a vegetarian.) For his birthday in January, heposedwith a greasy, bone-in steak stuffed with three lit candles.\n\nKennedy’s taste for meat goes beyond personal preference and into the policy realm. This month, appearing at the beef industry convention CattleCon, Kennedyurgedcattle farmers to “increase the size of the herd to ramp up beef production.” He’s attacked seed oils and vowed to end a purported “war on protein.” He’s toutedbeef tallow, a lard derived from cow and sheep fat that’shigherin saturated fats than seed oils, as the“MAHA way”to fry food.\n\nThe message delivered from the top of the government’s health apparatus is that plant-based diets are feeble and inadequate. “I’ve never needed a ‘war on protein’ to get results,” the bodybuilder Turner said.\n\nKennedy’s choice to center animal products in American nutrition guidelines may mirror his own diet, but the changes were no doubt politically motivated, said Laura Wright, a professor of English at Western Carolina University who studies veganism.\n\n“Given this current administration and its focus on sort of hypermasculinity and lack of empathy for any being, whether human or non-human, that doesn’t fit a specific kind of ideological mold, this isn’t surprising,” Wright said.\n\nRed meat has long been associated with virility, masculinity and the national identity of America, Wright said.\n\n“To some, not eating red meat — the intentional not eating red meat — is seen as un-American,” said Samantha Mosier, an associate professor of political science at East Carolina University.\n\nKennedy’s MAHA coalition was assembled from a large and disparate collection of interest groups and some of its tenets contradict each other — like emphasizing unprocessed foods to reduce the amount of saturated fat in the American diet while encouraging increased consumption of red meat and whole milk, both of which arehigherin saturated fat than vegan alternatives. Splintering was inevitable, Mosier said.\n\n“It’s often seen, when you build coalitions in which you have multiple factors — Make America Healthy Again is combining things related to diet, and they’re relating things to the environment,” Mosier said. “If you are a vegan and you are part of that movement, there’s a chance that the entire movement may not represent your collective values.”\n\nVegans wanted Kennedy to radically reimagine the American diet, even if they didn’t expect him to convert millions to their cause. They’ve never had an advocate in high office before.\n\n“I don’t think vegans fit into any administration,” said Gary Yourofsky, another vegan and animal rights activist whose combative messaging includes describing the slaughter of animals for food as rape, slavery and a holocaust. “Nobody truly understands veganism. Everybody eats meat, cheese, milk and eggs.”\n\nKennedy has followed through on some of his pledges to supporters of animal rights. Late last year, US Centers for Disease Control and Prevention scientists were told to end research on macaque monkeys, who’d been primarily used to study HIV prevention. Sciencereportedthat the order came from Kennedy.\n\n“I’ve never seen anything do something so amazing on behalf of animals,” Yourofsky said.\n\nBut encouraging Americans to eat more meat is a policy ethics-focused vegans say they cannot abide. Most Americans never followed USDA’s MyPlate suggestions or the food pyramid to a T anyway, Mosier said, so it’s not clear whether the new inverted pyramid will directly influence anyone to ditch tofu for steak or oat milk for a glass of the full-fat dairy original.\n\nVeganism was never popular — only 1% of Americansidentifiedas vegan in a 2023 Gallup poll — but it’s no longer on trend. Sales of plant-based meat alternatives, which surgedduringthe Covid-19 pandemic, aredeclining.Consumptionof dairy milk continues to rise.Formerlyveganrestaurantsare adding meat to their menus.\n\n“I feel that veganism is a threat,” Wright said. “I’ve always felt that it’s so non-normative, and it’s so in many ways kind of anti-establishment, that the fact that it’s sort of been disappeared doesn’t surprise me.”\n\nGiven veganism’s minority position in the culture and in politics, Yourofsky said he can’t be particularly fazed by the meat-heavy adjustments to national nutrition guidelines.\n\n“I didn’t find that to be offensive,” he said of the changes. “I found it to be stupid.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.facebook.com/bob.linden.52/posts/pfbid0268yQaNTiFnNfczyNjukdXpakHAZnc67i3ERSTPcC6wckSmnWEWJSHtCPwi8aUsual",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2024/08/04/politics/rfk-jr-bear-central-park",
      "text": "dumped"
    },
    {
      "url": "https://www.science.org/content/article/kennedy-deeply-committed-ending-animal-experimentation",
      "text": "end"
    },
    {
      "url": "https://realfood.gov/",
      "text": "“real food”"
    },
    {
      "url": "https://www.nytimes.com/2024/05/08/us/rfk-jr-brain-health-memory-loss.html",
      "text": "likely a pork tapeworm larva"
    },
    {
      "url": "https://www.instagram.com/reels/CtKQ-ZPBy26/",
      "text": "support"
    },
    {
      "url": "https://www.instagram.com/brianturnerofficial/?hl=en",
      "text": "bodybuilder"
    },
    {
      "url": "https://www.cdc.gov/vaccines/basics/how-developed-approved.html",
      "text": "tested"
    },
    {
      "url": "https://www.fda.gov/vaccines-blood-biologics/bovine-derived-materials-used-vaccine-manufacturing-questions-and-answers",
      "text": "contain"
    },
    {
      "url": "https://www.tennessean.com/story/news/health/2026/02/05/rfk-jr-promotes-beef-in-nashville-tn/88525676007/",
      "text": "twice a day"
    },
    {
      "url": "https://www.thetimes.com/life-style/celebrity/article/cheryl-hines-husband-robert-f-kennedy-jr-rncpfhdmh",
      "text": "said"
    },
    {
      "url": "https://www.instagram.com/p/DTneu3GDrEi/?hl=en",
      "text": "posed"
    },
    {
      "url": "https://www.angus.org/angus-media/angus-beef-bulletin/abb-extra/2026/02/mkt_rfk-takes-center-stage-at-cattlecon",
      "text": "urged"
    },
    {
      "url": "https://www.cnn.com/2025/03/25/health/beef-tallow-healthy-seed-oils-rfk-wellness",
      "text": "beef tallow"
    },
    {
      "url": "https://hsph.harvard.edu/news/beef-tallow-not-a-healthier-option-than-seed-oils/",
      "text": "higher"
    },
    {
      "url": "https://x.com/RobertKennedyJr/status/1862252300695150655",
      "text": "“MAHA way”"
    },
    {
      "url": "https://publichealth.gmu.edu/news/2025-09/got-questions-about-milk-heres-whole-milk-truth",
      "text": "higher"
    },
    {
      "url": "https://www.science.org/content/article/exclusive-cdc-end-all-monkey-research",
      "text": "reported"
    },
    {
      "url": "https://news.gallup.com/poll/510038/identify-vegetarian-vegan.aspx",
      "text": "identified"
    },
    {
      "url": "https://www.nytimes.com/2020/05/22/dining/plant-based-meats-coronavirus.html",
      "text": "during"
    },
    {
      "url": "https://www.grubstreet.com/article/veganism-movement-decline-vegan-diet-popularity.html",
      "text": "declining"
    },
    {
      "url": "https://www.nytimes.com/2025/02/06/dining/milk.html",
      "text": "Consumption"
    },
    {
      "url": "https://www.today.com/food/news/vegan-restaurant-backlash-serving-meat-rcna150327",
      "text": "Formerly"
    },
    {
      "url": "https://www.nj.com/food/2025/11/nj-vegan-restaurant-adds-meat-to-menu-to-boost-business-customers-have-beef.html",
      "text": "vegan"
    },
    {
      "url": "https://www.elevenmadisonpark.com/stories/menu-update",
      "text": "restaurants"
    }
  ],
  "hash": "47bfdc9a788da6179f09e0464157975875132224c598ab7d775332eaeda2f4d9",
  "scraped_at": "2026-02-28T07:01:11.379504+00:00"
}