{
  "url": "https://lite.cnn.com/2026/02/15/politics/howard-lutnick-epstein-ties-trump",
  "title": "Howard Lutnick’s Epstein ties raise concerns on Wall Street but not in the White House | CNN Politics",
  "date": "2026-02-16T07:34:30.157305+00:00",
  "authors": [],
  "text": "Source: CNN\n\nWhen Howard Lutnick had a problem in 2018, he turned to his next-door neighbor for help: Jeffrey Epstein.\n\nLutnick emailed Epstein’s assistant in May 2018 about aproposed expansionto the Frick Collection, a museum one block south of Lutnick’s and Epstein’s adjacent townhouses on East 71st Street in Manhattan.\n\n“Are you aware as to them building to block our park views. What should we do about it? Time is of the essence,”wrote Lutnick,who was then the CEO of Wall Street firm Cantor Fitzgerald.\n\n“No i was not,” Epstein responded after his assistant forwarded Lutnick’s email.\n\nThe email exchange shows that Lutnick, now President Donald Trump’s commerce secretary, communicated with Epstein more than a decade after he claimed he cut off all contact with the convicted sex offender who died in 2019.\n\nA CNN review of the Epstein documents show numerous interactions between the two men, including aninvitation from Lutnickto attend a Hillary Clinton fundraiser in 2015,a $50,000 donationfrom Epstein for a 2017 dinner honoring Lutnick, a 2013 business ventureboth invested in, andmultiple emailsin which Lutnick set up a 2012 visit to Epstein’s infamous Caribbean island with his wife, nannies and children.\n\nLutnick, the highest-ranking Trump administration official prominently named in the Epstein files — outside of the president himself — has faced calls for his resignation on Capitol Hill,where he was grilledTuesday during a Senate hearing over his ties to Epstein andconfirmed he visitedEpstein at his island with his family for lunch. Lutnick has not been accused of any wrongdoing related to Epstein.\n\nInterviews with executives and others on Wall Street, where the former Cantor Fitzgerald CEO is viewed skeptically in some corners, show that the Epstein disclosures have sparked a fresh round of questions about Lutnick’s future andhis role as cheerleaderof Trump’s tariff-driven trade agenda.\n\n“Lutnick was grossly deceptive. And it’s not an ambiguous call,” Jeffrey Sonnenfeld, founder of the Yale Chief Executive Leadership Institute, said of Lutnick’s claims he ended all contact with Epstein in 2005. “Every CEO who shakes hands with Howard Lutnick will want to wash them afterwards.”\n\nBut inside the White House, there’s no indication that Lutnick — perhaps one of the few Cabinet secretaries Trump considers a personal friend — will face any repercussions. Lutnick traveled with the president on Friday on Air Force One to Fort Bragg, North Carolina, where Trump gave his commerce secretary a shoutout during his speech.\n\nIf the president’s support for Lutnick ever wavers, it won’t be over the Epstein files — an issue that Trump has sought unsuccessfully to bury for months, including urging Americans earlier this month to “get onto something else,” people familiar with internal White House discussions told CNN.\n\nA Commerce Department spokesperson said in a statement: “This is nothing more than a failing attempt by the legacy media to distract from the administration’s accomplishments including securing trillions of dollars in investment, delivering historic trade deals and fighting for the American worker.”\n\n“Mr. and Mrs. Lutnick met Jeffrey Epstein in 2005 and had very limited interactions with him over the next 14 years,” the spokesperson said.\n\nWhite House spokesperson Kush Desai said: “President Trump maintains complete confidence in Secretary Lutnick because he has been the most transformative Commerce Secretary in modern history and is a champion of the President’s America First trade and tariffs policies.”\n\nThe Epstein episode represents just the latest strike against Lutnick for many in Trump’s orbit, who have long regarded the commerce secretary as an irritant at best — and at worst, a running political liability, people familiar with the internal discussions said.\n\nWithin the White House, one of the people said, Lutnick is increasingly unpopular among aides who view him as an abrasive figure who frequently fans Trump’s worst impulses on issues like tariffs — and who has a knack for finding ways to be by the president’s side.\n\nYet even among the sharpest Lutnick detractors in Trump’s orbit, there’s been little visible effort to leverage the Epstein controversy against the commerce secretary largely because few think it’ll make a difference with the only person whose opinion matters: The president himself.\n\nLutnick alienated a swath of Trump advisers and allies shortly after the 2024 election over his campaign to become Treasury secretary, which touched off a bruising behind-the-scenes battle against Scott Bessent that delayed Trump’s decision on the critical Cabinet role for days.\n\nOthers still hold Lutnick responsible for cheerleading the rollout of Trump’s“Liberation Day” tariffs— a disastrous event that shook global markets and forced the administration to quickly walk back much of its disruptive trade strategy. The Commerce secretary fumbled the administration’s messaging on multiple occasions during that period, further irritating officials who were racing to contain fallout from the blanket tariffs and to soothe foreign allies.\n\nTrump has remained a strong supporter of Lutnick. They are fellow New Yorkers who have known each other for decades, and one person familiar with the internal discussions said Lutnick enjoys a protected status as an “FOT” — or Friend of Trump.\n\nAsked Thursday about Lutnick’s interactions with Epstein, Trump said he wasn’t aware while downplaying his own past relationship with Epstein.\n\n“From what I hear, he was there with his wife and children, and I guess in some cases some people were,” Trump said. “I wasn’t. I was never there.”\n\nIn October 2025, Lutnick told the New York Postin a podcast interviewthat he and his wife decided to cut off contact with Epstein in 2005 after the financier showed off a massage table and made suggestive comments while giving the Lutnicks a tour not long after they had moved in next door.\n\n“In the six or eight steps it takes to get from his house to my house, my wife and I decided that I will never be in the room with that disgusting person ever again,” Lutnick said. “So I was never in the room with him, socially, for business, or even philanthropy. If that guy was there, I wasn’t going, because he’s gross.”\n\nBut a CNN review of emails in the Epstein files shows that both Lutnick and his wife in fact communicated with Epstein for many years afterward, including on social, business and philanthropic matters.\n\nIn 2011, the Epstein emails show arrangements being made to set up several calls between Epstein and Lutnick.\n\n“Howard Lutnick is on an airplane headed overseas. His office would like to know if you would like to set up a call while he is away or if you prefer to speak with him on Monday April 4th when he is back,” a redacted person emailed Epstein inMarch 2011.\n\nThe next month, Epstein was toldin an emailfrom a redacted sender, “Howard Lutnick returned your call.”\n\nIn an October 2011 email,Epstein’s assistant wrote: “FYI-Howard Lutnik’s assistant called asking if you would be available =o speak with Howard today…”\n\nAcalendar with appointmentsshows that Epstein had a 5 p.m. drinks meeting set up with Lutnick on May 1, 2011, 90 minutes before a scheduled dinner with Woody Allen and others. The next day,someone emailed Epstein: “The phone was Howard Lutnicks, it has been collected.”\n\nIn 2012, Lutnick and his wife sent a series of emails coordinating a meal with Epstein. Lutnickaskedfor coordinates for his boat captain, proposing a dinner and noting he was accompanied by his wife, another couple and each family’s four children.\n\n“Below from Jeffrey: come sat or sunday lunch? little st jamcs on the map, behind christmans cove,” a redacted sender responded to Lutnick.\n\nLutnick’s wifefollowed up with Epstein’s assistantasking where to anchor, writing in a subsequent email that they were arriving on a “188 foot yacht.”\n\nAt Tuesday’s Senate hearing, Democratic Sen. Chris Van Hollen of Maryland pressed Lutnick about the lunch and his prior claims of cutting off contact in 2005.\n\n“The issue is not that you engaged in any wrongdoing in connection with Jeffrey Epstein, but that you totally misrepresented the extent of your relationship with him, to the Congress, to the American people and to the survivors of his despicable criminal and predatory acts,” Van Hollen told Lutnick.\n\nLutnick acknowledged visiting the island while on vacation, but said that he saw nothing untoward and that he was there only briefly with his family.\n\n“Probably the total, and you’ve seen all of these documents of these millions and millions of documents, there may be 10 emails connecting me with him, probably about 10 emails connecting me with him, over a 14-year period. I did not have any relationship with him,” Lutnick said. “I barely had anything to do with that person, OK.”\n\nLutnick’s dealings with Epstein continued in the years that followed.\n\nIn 2013, Lutnick and Epstein both appear to have invested together through their business entities in an advertising analytics firm,according to a contractincluded in the Epstein files.\n\nIn 2015, Lutnickinvited Epsteinto the Hillary Clinton fundraiser. It’s unclear whether Epstein attended. And in 2017, Epsteindonated$50,000 to a dinner honoring Lutnick hosted by the UJA-Federation of New York.\n\nBillionaire investor John Paulson, who was UJA’s chairman of its Wall Street & Financial Services division,wrotein an email invitation to Epstein’s assistant: “As Chairman of the Wall Street Division, I want to make sure that as a close friend of the Lutnicks, you are aware of the event and have the opportunity to support them.”\n\nEpsteinresponded, “50k from me, hope pr is ok”\n\nLutnick’s inclusion in the Epstein documents prompted calls for his resignation last week on Capitol Hill, includingfrom Rep. Thomas Massie, the Kentucky Republican who co-authored the legislation mandating the release of the files.\n\n“[Lutnick] said he knew Jeffrey Epstein was a despicable, abhorrent human being and had nothing to do with him, and then he partied on his island with his kids, with this guy. How do you trust that guy?” Massie said Wednesday.\n\nSenate Majority Leader John Thune told reporters that Lutnick will have to answer questions about his relationship with Epstein, but argued it is “up to the American people” to say whether his answers are “sufficient.”\n\nRep. Nancy Mace, a South Carolina Republican who also pressed for release of the Epstein files, said she was “concerned with anyone who would hang out with a convicted pedophile” when asked about Lutnick.\n\n“Anyone who hangs out with a guy like that, I’m sorry but I’m not hanging out with you,” Mace said.\n\nOn Wall Street, there was mixed reaction over the Lutnick disclosures.\n\nAn economist close to large institutional investors said that Lutnick has long been seen negatively by much of Wall Street thanks to his push for Trump to embrace tariffs, and that the markets might even react positively if he left the administration.\n\n“When a trade goes bad, you cut your losses and move on,” the economist said.\n\nBut one Wall Street executive told CNN that Lutnick has become a key part of the business side of the Trump administration, so investors might get concerned if he were pushed out.\n\n“He’s grown on investors,” the executive said. “Lutnick being on the outs would cause nerves.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nytimes.com/2018/04/04/arts/design/frick-collection-expansion-selldorf.html",
      "text": "proposed expansion"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00475738.pdf",
      "text": "wrote Lutnick,"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02671545.pdf",
      "text": "invitation from Lutnick"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00464309.pdf",
      "text": "a $50,000 donation"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00289560.pdf",
      "text": "both invested in"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA02151261.pdf",
      "text": "multiple emails"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/trump-epstein-files-lutnick-bondi-hearings-analysis",
      "text": "where he was grilled"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/howard-lutnick-jeffrey-epstein-island",
      "text": "confirmed he visited"
    },
    {
      "url": "https://www.cnn.com/2025/03/18/politics/howard-lutnick-trump-trade-war-cheerleader",
      "text": "his role as cheerleader"
    },
    {
      "url": "https://www.cnn.com/2025/04/02/economy/key-takeaways-from-trumps-liberation-day-tariffs",
      "text": "“Liberation Day” tariffs"
    },
    {
      "url": "https://www.youtube.com/watch?v=x8_s4Z2TQAE&list=PLHY8kGYAi5RLEf4OwozbCSlyF3wJoqcOB",
      "text": "in a podcast interview"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01998172.pdf",
      "text": "March 2011"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01871107.pdf",
      "text": "in an email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02546526.pdf",
      "text": "Epstein’s assistant wrote"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01733743.pdf",
      "text": "calendar with appointments"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA02016655.pdf",
      "text": "someone emailed Epstein"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA02151261.pdf",
      "text": "asked"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00398736.pdf",
      "text": "followed up with Epstein’s assistant"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00289560.pdf",
      "text": "according to a contract"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02671545.pdf",
      "text": "invited Epstein"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00464309.pdf",
      "text": "donated"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02229720.pdf",
      "text": "wrote"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00957552.pdf",
      "text": "responded"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/politics/massie-howard-lutnick-epstein-files",
      "text": "from Rep. Thomas Massie"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/howard-lutnick-epstein-ties-trump",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/politics/howard-lutnick-epstein-ties-trump",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4817909ef43451d6315f18032e0f2334b6da2941170d3da6a39445306b0d558f",
  "scraped_at": "2026-02-16T07:34:30.157321+00:00"
}