{
  "url": "https://lite.cnn.com/2026/02/10/style/vintage-stores-offering-cure-to-fashion-fatigue",
  "title": "The exacting vintage stores offering the cure to your fashion fatigue | CNN",
  "date": "2026-02-11T16:33:11.154355+00:00",
  "author": "Unknown",
  "text": "It’s widely understood that to shop secondhand is to enter into a treasure hunt, where messiness is permitted and persistence is rewarded with bargains and unique items. But today, Les Archives represents another type of vintage clothing store that is gaining traction — one where much less digging is required.\n\nContursi, a native Californian who moved to Paris ten years ago to study fashion history and marketing, opened the doors to her brick-and-mortar store in December 2023. She mostly sells designer clothes from the likes of Chanel, Yves Saint Laurent, Prada, Gucci, Jean Paul Gaultier, Versace and more, with each item made between the short window of 1980 and 1999, and prices ranging from $160 to $5,000. “I only buy pieces that I love, that I would want to wear,” she said. “I’m curating a collection that fits a certain aesthetic.” It means she rarely has any reserves in the store room. “I don’t have a backstock,” Contursi said. “I really operate the business on what goes out gets replaced.”\n\nMaria Francisca Machado, also 29, has taken a similar approach with her secondhand clothing shop in Lisbon, Portugal, which opened last summer. “I want people to feel like this is a highly curated store,” she said in a video interview. “Not like random things, like your grandma’s closet.” The retail space, conveniently titled Curated, is slick, silver and industrial. The till rests on a huge polished chrome desk, and the clothes — which are not designer, but selected for their construction quality and use of natural fibers — hang on a few rails of exposed pipe.\n\nThere’s demand for it, too. In October 2025, Google searches for “curated vintage”reached an all-time high. The phrase has been tagged in more than 550,000 posts on Instagram, while on TikTok the number of videos with the #curatedvintage hashtag increased by 50% in the past year. Ameli Lindgren, founder of the London archival fashion retailer Nordic Poetry, specializing in designer runway pieces largely from 1990 to the early 2000s, says she has noticed the shift firsthand. Lindgren opened this store in 2017 after moving from another location, but has been selling luxury vintage at markets and pop-up locations for years before. “When I started off, it wasn’t very curated at all,” she said of her business. “Most people are doing it now because it’s easier for the consumer.”\n\nOn the whole, the used fashion market is experiencing a boom. According to a2025 surveyfrom the Boston Consulting Group and Vestiaire Collective, the growth of the secondhand fashion and luxury market is outpacing that of newly-made clothes by as much as three times. Shopping vintage has become a legitimate way to build out one’s wardrobe, as consumers increasingly make decisions based on sustainability, affordability and personal style. “If you go and buy a jacket at Zara, the next day you wear it you walk past five people that are wearing the same jacket,” said Lindgren.\n\nThe image that usually beckons of a vintage store is one that is fusty, cramped and dimly lit, filled with garments organized without design or backstory. Both Machado and Contursi said they wanted their vintage shops to feel different to their traditional counterparts. For Machado, whose specialty is vintage clothes made in the 1990s and early 2000s, the mission at Curated was “to show people that vintage can be contemporary” but “with good quality and fair prices,” she said.\n\n“I like it to feel like a modern day retail store,” agreed Contursi. “Everything is pristine. Nothing smells weird. There’s space on the racks. Everything’s dry cleaned.” Most of the garments in Les Archives are given an inventory tag, inspired by those used in museum storage. They detail not just the brand, size, and material but also the fashion house’s creative director at the time, the collection date, season and sometimes even the specific order in which the garment appeared on the runway. If Contursi can find it, an image of the item, when it was first worn on the catwalk, is printed onto Polaroid film and attached to the tag — a memento each customer gets to keep.\n\nContursi says she has converted customers who had previously written off secondhand shopping — namely women coming in with their daughters, who are now more likely to be the ones walking away with a shopping bag. “I’ll notice the moms will sometimes leave with something and they’re like ‘Oh, I can do this,’” she said. She believes “positioning” Les Archives more like a luxury boutique allows her to “tap into a whole other clientele.”\n\nLindgren’s customers are stylists, celebrities and influencers, who often pop in, as Australian content creator Zofia Krasicki did last month, ahead of exclusive events like Paris Fashion Week or Sundance Film Festival. Krasicki, who spent around tens of thousands of pounds at Nordic Poetry ahead of a recent trip to Paris, said it was Lingren’s “incredible selection” that kept her coming back, and the fact “it’s more like walking into a designer boutique than your average vintage store.”\n\nAmong one of Krasicki’s purchases was an Alexander McQueen jumpsuit, which Lindgren later said was probably too rare to sell. “I should have archived it, to be honest with you,” she said. “But at the same time, if it goes to a good home, clothes need to be enjoyed.” The shop’s high-profile customers include Charli XCX, Alexa Chung, Lily Allen and Alex Consani, whose highly watchable dress-up sessions in archival Vivienne Westwood, John Galliano and Dolce & Gabbana are filmed and posted straight to the store’s Instagram.\n\nSupply is the biggest challenge, all three vintage sellers say. “My pieces are museum-worthy,” said Lindgren, who believes she has one of the largest collections of clothes made by Gucci under the creative direction of Tom Ford. “I hand-pick every single item, which is extremely time consuming.” Lindgren is keen to archive more of her rare pieces, but the costs of keeping up the business means she is forced to part with items she’d rather save.\n\nMachado takes great pains to stock Curated according to her vision, and refuses to display anything she isn’t 110% sure about. If she regrets a purchase, Machado says she’d rather give it away for free to friends than have it hanging in the shop window, potentially putting off her discerning customers — even if it means gaps on the rails. “I kind of stopped worrying about not having enough things,” she said.\n\nContursi, who says she is constantly searching online for new pieces in between serving customers, isn’t sure what the future holds for Les Archives. “I’m very interested to see what it’ll be like in 10 years from now,” she said, noting that vintage is currently “very trendy,” with many entrepreneurs opening their own resale stores. The prices of vintage items, she added, “have gone up a lot.” Plus, what’s being produced by luxury brands todayprobably won’t last long enoughto be resold in 20 years time. “I have some designer pieces that I’ve even bought a couple of years ago,” said Contursi. “And they’re not in nearly as good shape as, I don’t know, a pair of 1980s Saint Laurent trousers I have.”\n\nMachado’s “less is more” approach to her store runs deeper than just how she arranges her stock. If a customer is indecisive about a purchase, she’ll advise against it. That might run counter to her business’ bottomline, but she’s more interested in helping her customers shop better. “I actually advise people to think and be very thoughtful and intentional,” Machado said. “I have this thing written on my counter, saying ‘Think first, buy second.’”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://trends.google.com/explore?q=curated%20vintage&date=today%205-y&geo=Worldwide",
      "text": "reached an all-time high"
    },
    {
      "url": "https://www.bcg.com/publications/2025/how-fashion-luxury-brands-can-win-secondhand-market",
      "text": "2025 survey"
    },
    {
      "url": "https://www.cnn.com/2025/12/29/style/luxury-fashion-quality-issue",
      "text": "probably won’t last long enough"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/style/vintage-stores-offering-cure-to-fashion-fatigue",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/style/vintage-stores-offering-cure-to-fashion-fatigue",
      "text": "Cookie Settings"
    }
  ],
  "hash": "48cd2e97df55fe891d8263372db032d228b5fc0950eda1103a968a1abd4c1630",
  "scraped_at": "2026-02-11T16:33:11.154369+00:00"
}