{
  "url": "https://lite.cnn.com/2026/02/23/americas/jalisco-cjng-sinaloa-mexico-cartels-war-intl-latam",
  "title": "Will the killing of El Mencho set off turf wars between Mexican cartels Jalisco and Sinaloa? | CNN",
  "date": "2026-02-24T07:31:14.943571+00:00",
  "authors": [
    "Tim Lister",
    "Ruben Correa",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe killing of Jalisco cartel bossNemesio Oseguera, aka “El Mencho,” could fuel a turf wars among drug-trafficking gangs in Mexico and beyond, analysts say, with the rival Sinaloa cartel already riven by infighting.\n\nThe Jalisco and Sinaloa cartels have long fought to dominate the lucrative US market for illegal drugs, including cocaine, heroin and fentanyl trafficking, and they increasingly compete for control of illegal migration into the US.\n\nThe US government has described Jalisco New Generation Cartel (known by the Spanish-language abbreviation CJNG) as “one of the five most dangerous criminal organizations in the world,” with operations earning billions of dollars in revenue.\n\nThe US State Department designated the CJNG as aforeign terrorist organizationin February 2025.\n\nWho takes control of the group, or whether it splinters into factional bloodletting, following Oseguera’s death will have a huge impact on drug trafficking in the Americas.\n\nOseguera, founder of the CJNG, had taken advantage of the Sinaloa disarray, rapidly expanding the reach and activities of the group to include fuel theft, human trafficking and financial fraud. The Jalisco group even formed an alliance with part of Sinaloa to deepen its divisions.\n\nFormer Sinaloa leaders Joaquin “El Chapo” Guzman and Ismael “El Mayo” Zambada are now held in the United States. Guzman was extradited in 2017 and Zambada last year, spurring a battle for control of the group between Guzman’s sons and a faction loyal to Zambada.\n\nThe history of trafficking groups, in both Colombia and Mexico, is one of constant upheaval, driven by territorial rivalry and greed. Rivals pounce on any sign of weakness or division.\n\nThe Sinaloa conflict was fueled by the lack of a clear family successor, and the same may now apply to CJNG. El Mencho’s son Rubén Oseguera is currently serving a sentence in the United States, having been extradited in 2020. His wife was arrested in Mexico on money-laundering charges in November 2021. Two brothers are also in Mexican jails.\n\n“The Jalisco cartel’s line of succession has been broken,” according to Mexico City-based security expert David Saucedo. Only one brother remains, along with a stepson who, according to Saucedo, “still lacks influence among other cartel commanders.”\n\nFour CJNG commanders may be vying for supremacy and “may enter a succession war to define control of the cartel, though a negotiated transition is also possible,” Saucedo said.\n\nOseguera was unchallenged as the leader of the CJNG, but rumors that he was sick had already sparked defections. The Mezcales, a splinter faction of the CJNG in the state of Colima, declared four years ago that it was ending its affiliation with CJNG in the belief he had died. The defection led to weeks of gang-related violence.\n\nThe CJNG-Sinaloa contest spans several Mexican states as the two groups “dispute territorial control for various drug trafficking routes in central and northern Mexico,” according to InSightCrime, which tracks the cartels. One area of intense competition is Mexicali, capital of the Mexican state of Baja California, which borders the US. Roadblocks were erected there by cartel factions after El Mencho’s death.\n\nThe two groups are also embroiled in a struggle in the state of Chiapas, on the border with Guatemala, over control of migrant smuggling, according to InSightCrime.\n\nFor the Mexican government, the battle against the cartels risks provoking violence across the country, as gang members retaliate against the security forces and battle each other. Analysts say that CJNG has a presence in more than 20 Mexican states.\n\nThere is also the risk that CJNG, or factions of it, resorts to narco-terrorism akin to what Colombia endured in the 1980s, when Pablo Escobar essentially declared war on the state, marked by bombings, assassinations and kidnappings.\n\nSaucedo sees indications of that in the violent response of CJNG members so far: “narco-terrorism, blockades and fires in grocery stores across Mexico.”\n\nA “total war against the Mexican state” remains a possible scenario, Saucedo added. The CJNG has shown a taste for such attacks in the past. Six years ago, it tried to assassinate Secretary of Public SecurityOmar Garcia Harfuch, wounding him and killing two bodyguards and a bystander.\n\n“For now, it appears all the main CJNG commanders have united to launch this attack against the Mexican state,” Saucedo said, aiming to “paralyze economic activity and impose a national and international image cost on the government.”\n\nBut the death of El Mencho may also bring the Mexican government an opportunity — to keep the cartels off-balance with further precise operations against their leaders.\n\nFor now, the security forces are fully occupied with restoring order, after CJNG members set up hundreds of roadblocks across several states and attacked commercial property.\n\n“It’s not surprising that the bad guys are responding with terror. But we must never lose our nerve,” US Deputy Secretary of State Christopher Landau posted onX.\n\nTurmoil within CJNGcould also trigger a domino effectin Latin American countries that are part of the cartel’s cocaine production, transit, and export network — particularly Ecuador and Colombia.\n\nRegional competition over routes and territorial control could spark tensions and renegotiations that directly affect the operations of the gang’s partners, according to analysts.\n\nFormer Ecuadorian Army intelligence chief Mario Pazmiño told CNN en Español that competition over drug trafficking routes and control of portsfrom Ecuador could intensify as the rival Sinaloa cartel and its operational arm in Ecuador, the Choneros gang, seek to reconfigure territories and local leadership.\n\n“If these organizations worked for the CJNG and received support from Mexico, Sinaloa will automatically try to take over those spaces.” Pazmiño said.\n\n“The situation is critical and serious，” he said, adding that “a new internal confrontation could erupt between Los Lobos, Tiguerones, and Chonekillers,”\n\nIn Columbia, Oseguera’s death will directly affect the financial engine that supports some of the most dangerous armed structures in the country ––where armed groups, including FARC dissidents, have long supplied drugs to the Mexican cartels.\n\n“If internal violence erupts over CJNG leadership, the balance of power along Colombia’s borders with Venezuela and Ecuador, where drugs are trafficked, could also change,” said Néstor Rosanía, lawyer and specialist in national defense management.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/el-mencho-mexico-jalisco-cartel-profile-intl-hnk",
      "text": "Nemesio Oseguera"
    },
    {
      "url": "https://www.cnn.com/2025/02/22/americas/us-cartels-terrorist-explainer-latam-intl",
      "text": "foreign terrorist organization"
    },
    {
      "url": "https://www.cnn.com/2020/06/26/americas/omar-garcia-harfuch-mexico-city-shooting-intl",
      "text": "Omar Garcia Harfuch"
    },
    {
      "url": "https://x.com/DeputySecState/status/2025649436156989831?s=20",
      "text": "X"
    },
    {
      "url": "https://cnnespanol.cnn.com/2026/02/23/latinoamerica/impacto-mencho-violencia-carteles-ecuador-colombia-orix",
      "text": "could also trigger a domino effect"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/jalisco-cjng-sinaloa-mexico-cartels-war-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/americas/jalisco-cjng-sinaloa-mexico-cartels-war-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "48d1ba9945ee5d964a9b45fa45f5fbb836882274b5f2ad2a354a820fb28f2ae0",
  "scraped_at": "2026-02-24T07:31:14.943585+00:00"
}