{
  "url": "https://lite.cnn.com/2026/02/22/europe/france-bans-us-ambassador-deranque-death-latam-intl",
  "title": "France bans US ambassador Charles Kushner from meeting French ministers | CNN",
  "date": "2026-02-24T07:31:47.077610+00:00",
  "authors": [
    "Billy Stockwell",
    "Tim Lister",
    "Joseph Ataman",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US ambassador to France, Charles Kushner, has been blocked from directly accessing French government ministers after he failed to appear to a summons by French Foreign Minister Jean-Noël Barrot.\n\nKushner had been summoned over comments made about the death of aFrench far-right activistearlier this month, but “did not appear” on Monday, a statement from France’s foreign affairs ministry, the Quai d’Orsay, said.\n\n“Faced with this apparent misunderstanding of the basic expectations of an ambassador’s mission, the Minister has requested that he no longer have direct access to members of the French government,” the statement said.\n\nKushner will still be permitted to carry out his duties and have “diplomatic exchanges” with officials.\n\nCNN has reached out to the US embassy in France and the US State Department for comment.\n\nQuentin Deranque, 23, died two days after suffering severe head injuries in a brawl in the city of Lyon on February 12, drawing comment from the Trump administration which described the death as the result of left-wing violence.\n\nOn Friday, the US embassy in France shared an X post from the US State Department’s Counterterrorism Bureau which said reports that Deranque “was killed by left-wing militants, should concern us all.”\n\n“Violent radical leftism is on the rise and its role in Quentin Deranque’s death demonstrates the threat it poses to public safety,” the X post said.\n\nThe fatal brawl was caught on video, which showed several masked people kicking and punching a man on the ground, causing widespread shock and anger in France.\n\nThe French foreign minister said Sunday he would summon Kushner after he labeled his comments about the incident as “interference.”\n\n“We are summoning the US ambassador to France because the embassy issued a commentary on this event which concerns the national community. We reject any interference in this event,” Barrot said in an interview with radio station France Inter.\n\nAuthorities have charged two people with murder in connection with Deranque’s death, and altogether 11 have been arrested.\n\nThe incident has also sparked a diplomatic spat between France and Italy, after Italian Prime Minister Giorgia Meloni said Deranque’s death was caused “by groups linked to left-wing extremism” and condemned “a climate of ideological hatred sweeping several nations.”\n\nThis is not the first time that Kushner, father of President Donald Trump’s son-in-law Jared Kushner, has failed to appear after being summoned amid criticism from the French authorities.\n\nIn August 2025, the Foreign Ministrysummoned Kushnerafter he accused the French government of a “lack of sufficient action” in confronting antisemitism.\n\nA French diplomatic source told CNN that the US Chargé d’affaires was summoned to the ministry’s headquarters in Paris in Kushner’s absence, as he was not in Paris.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/world/quentin-deranque-death-france-intl",
      "text": "French far-right activist"
    },
    {
      "url": "https://www.cnn.com/2025/08/24/europe/france-us-kushner-ambassador-antisemitism-latam-intl",
      "text": "summoned Kushner"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/europe/france-bans-us-ambassador-deranque-death-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/europe/france-bans-us-ambassador-deranque-death-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4a0b6812890e59038792ac1851511724b6d1fd4929dad43535bb7ce25069a9a2",
  "scraped_at": "2026-02-24T07:31:47.077623+00:00"
}