{
  "url": "https://lite.cnn.com/2026/02/11/politics/house-republicans-trump-canada-tariff-vote",
  "title": "Six House Republicans defy Trump to block his Canada tariffs | CNN Politics",
  "date": "2026-02-12T21:30:47.819136+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIn a vote that GOP leaders fought hard to avoid, a half dozen Republicans sent a blunt message to PresidentDonald Trumpthat they do not support the tariff regime that he has made the centerpiece of his second term.\n\nSix Republicans joined with Democrats in the vote to effectively repeal the president’s tariffs on Canada, the culmination of months of consternation in the GOP over the president’s trade war that has quietly rattled even some of his staunchest loyalists in Congress.\n\nThe vote provoked a threat from Trump, who took to Truth Social to warn of consequences for any Republican who votes against his tariffs, including primary challenges.\n\nBut it won’t be the last tough tariffs vote for Trump: Democrats have successfully unlocked a procedural power to force more votes, including on the president’s tariffs on Mexico and his so-called “liberation day” tariffs in the coming weeks.\n\nIt’s a rare instance of GOP defections at a time when Trump still maintains a strong grip over the party — even withCongress’ narrow margins. But in recent days, Speaker Mike Johnson and Trump’s legislative team failed to convince enough in their party to block the Democratic-led vote.\n\nSpeaker Mike Johnson claimed President Donald Trump was “not upset” with House Republicans who have voted to curb his executive authority on tariffs. “He’s not upset. I just left the White House. He understands what’s going on. It’s not going to affect or change his policy. He can veto these things if they come to it,” he told CNN.\n\nBut moments later the president posted on Truth Social.\n\n“Any Republican, in the House or the Senate, that votes against TARIFFS will seriously suffer the consequences come Election time, and that includes Primaries!” Trump wrote in part.\n\nThe six Republicans who voted with Democrats in the bid to cancel the tariffs were: Reps. Thomas Massie, Don Bacon, Kevin Kiley, Jeff Hurd, Brian Fitzpatrick and Dan Newhouse.\n\nHurd told CNN that farmers and steel manufacturers in his district have been impacted by the tariffs, and “at the end of the day, I looked at the Constitution, I looked at what was in the best interest of my district, and I took the vote. It’s not easy, but it’s the right thing and I stand by it.”\n\nPressed on if he’s worried about Trump’s wrath, Hurd responded, “I do the right thing, and what the consequences are, we’ll have to see.”\n\nNewhouse, who is retiring from his Washington seat after this term, told CNN he was also looking out for his constituents’ interests, noting the close trade relationship his state has with Canada.\n\nHe said “absolutely” Trump’s tariffs have hurt his state because prices have gone up on “fertilizer, equipment, a lot of the inputs and agricultural producers or farmers need.”\n\nEarlier Wednesday, Bacon suggested that as many as 30 Republicans could join him in blocking the tariffs. But as pressure from GOP leadership offices and the White House escalated, the final number was far lower than many Republicans had been expecting.\n\nThe Senate has already passed a similar measure to cancel Trump’s tariffs on Canada, which — unlike most measures — can be passed with a simple majority rather than 60 votes.\n\nBut even if the Senate does agree to this same House measure, Trump would still have the power to veto it. The House did not secure enough votes — which requires two-thirds of the chamber — to protect a veto override.\n\nSpeaker Johnson later Wednesday evening downplayed the vote as a “fruitless exercise,” even while he said he was “disappointed” in the result.\n\n“I’m disappointed in the vote, but the president has veto power, and there’s not a two-thirds majority in both chambers to override the veto, so it’s not going to change the policy in the end anyway,” he told reporters.\n\nHe declined to comment on the president’s Truth Social post threatening Republicans who vote to repeal tariffs.\n\nFor some Republicans, the vote was not only a chance to push back on Trump’s tariffs, but to reassert some of Congress’ authority that has been diminished in recent months.\n\nBacon, an outspoken Nebraskan who is retiring this term, told CNN that he’s a free-trade Republican who opposes this kind of intervention. But he also believes it’s Congress’ duty to make the call on tariffs, not the White House.\n\n“He needs to know that we’re not a rubberstamp,” Bacon said of his reasons for supporting the measure. And he said he’s spoken with many Republicans who agree but have been reticent to speak out.\n\n“From my vantage point, people feel like they’re in between a rock or a hard place because they don’t want to get on the bad side of the president,” Bacon said.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/politics/narrow-house-majority-congress-dg",
      "text": "Congress’ narrow margins"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/house-republicans-trump-canada-tariff-vote",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/politics/house-republicans-trump-canada-tariff-vote",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4a469af65b9c615799f4f5cc7ef19acca4c251880d9f68555c155ec58a8a2b04",
  "scraped_at": "2026-02-12T21:30:47.819152+00:00"
}