{
  "url": "https://lite.cnn.com/2026/02/19/asia/south-korea-yoon-suk-yeol-verdict-insurrection-intl-hnk",
  "title": "Yoon Suk Yeol: Former South Korean President handed life sentence for leading insurrection | CNN",
  "date": "2026-02-19T07:30:24.770592+00:00",
  "authors": [
    "Helen Regan",
    "Yoonjung Seo",
    "Gawon Bae",
    "CNN"
  ],
  "text": "Source: CNN\n\nFormer South Korean President Yoon Suk Yeol was sentenced to life in prison Thursday after a court found him guilty of leading an insurrection during his short-lived imposition of martial law, which plunged the country into political chaos and threatened to unravel decades of democracy.\n\nThe verdict closes a chapter of one of South Korea’s biggest political crises, a saga that has been full of dramatic twists that have tested the country’s democratic guardrails.\n\nOn December 3, 2024, Yoondeclared martial lawin a late-night televised speech, saying there were “anti-state forces” within opposition parties that were sympathetic to North Korea.\n\nArmed soldiers descended on the parliament by helicopter and attempted to storm the chamber where lawmakers were gathered. Shocked and angry citizens, along with lawmakers and parliament staff, rushed to barricade the entrances and fought to block the soldiers from reaching the chamber, in chaotic scenes broadcast live on television.\n\nYoon’s shocking declaration revived dark memories of the country’s authoritarian past, plunged South Korea into a constitutional crisis and was widely condemned as striking at the heart of the nation’s democracy. He reversed course within six hours, after lawmakers forced their way into parliament and voted unanimously to block it.\n\nSince the late 1980s, South Korea has transformed into a robust democracy, with regular protests, free speech, fair elections and peaceful transfers of power. The country has also since grown into a major player in the global economy and remains acrucial US ally in Asia.\n\nBut its domestic political scene remains deeply polarized and fractious, with presidents on both sides of the political divide often facing calls for impeachment, criminal investigations and prosecution.\n\nA crowd of Yoon supporters gathered outside the the Seoul Central District Court, watching proceedings on a big screen as it was broadcast live to the nation.\n\nPresiding judge Ji Gwi-yeon said it was clear that Yoon’s intention in declaring martial law was to paralyze the National Assembly for a significant period of time, considering the words he used in the military decree and the fact he tried to arrest political opponents, including the leader of the opposition Democratic Party and his own ruling party’s leader Han Dong-hoo.\n\nThe very act of dispatching armed soldiers to the parliament building and transporting them by helicopter constituted acts of insurrection, Ji said.\n\nFormer defense minister Kim Yong-hyun was also found guilty Thursday of playing a major role in the insurrection and sentenced to 30 years in prison. Kim had previouslytaken responsibilityfor ordering soldiers to enact martial law.\n\nSong Hwa, 35, who rushed to the National Assembly on December 3 with her husband after hearing Yoon’s declaration, said the verdict was an “extremely important decision” that “will send a powerful message to the public.”\n\nCho Kuk, leader of the liberal-leaning Rebuilding Korea Party, said Yoon “tried to destroy South Korea’s democracy.”\n\n“There are many places where democracy is faltering,” he added. “South Korea’s experience shows that the power to protect and recover democracy lies within the people.”\n\nYoon, who can appeal the ruling, had denied the insurrection charge, saying his imposition of martial law was meant to alert the public to paralysing political gridlock caused by the opposition party’s majority in the National Assembly and its impeachment of several senior officials.\n\n“The National Assembly brought about the national crisis and there was no other way but to awaken the people,” he said in closing statements, arguing that as president he was exercising his constitutional authority.\n\nYoon, a former prosecutor, called the charge “a delusion and a work of fiction.” He had argued that there was no real intent to arrest lawmakers, no heavy weaponry was deployed, and there were no serious casualties.\n\nInsurrection is one of the few criminal charges from which a South Korean president does not have immunity. Prosecutors had sought the death penalty, a largely symbolic move as the country hasn’t executed anyone in decades.\n\n“The series of actions destroyed the liberal democratic constitutional order,” special counsel Park Eok-su said in closing arguments.\n\n“The shock, fear, anxiety, wounds, and sense of loss suffered by the people are beyond description,” he added.\n\nProsecutors said Yoon had not shown remorse and there remained a risk that his invocation of emergency martial law could be repeated in future.\n\n“The gravity of the crime of insurrection threatens the very existence of the community,” prosectors said.\n\nYoon was firstdetained in January2025 after resisting attempts to arrest him in aweeks-long standoffwith authorities at his home in Seoul. He was the first president in South Korean history to be arrested while in office. He was impeached 11 days after declaring martial law and removed from office four months later.\n\nYoon continues to face multiple charges related to his martial law declaration and for other actions during his time as president.\n\nLast month, Yoon wassentenced to five years in prisonfor obstructing authorities trying to detain him, abuse of power and fabricating a document.\n\nYoon also faces charges of aiding an enemy state after prosecutors claimed hedeployed secret dronesto provoke a military conflict with North Korea as a ploy for declaring martial law.\n\nOther key Yoon allies have already been prosecuted for their roles in the martial law decree.\n\nLast month, former Prime Minister Han Duck-soo was sentenced to23 years in prisonbecoming the first Yoon administration official convicted of insurrection charges. And last week, former interior minister Lee Sang-min was sentenced to seven years in prison for participating in a rebellion.\n\nYoon’s wifeKim Keon Heeis also in prison, serving a one-year-and-eight-month sentence for an unrelated charge of bribery.\n\nThursday’s verdict, however, marks the first time in 30 years that South Korea has sentenced a leader for insurrection.\n\nIn 1996, former PresidentChun Doo-hwan, an army major general, was convicted for seizing power in a 1979 military coup and presiding over the 1980 Gwangju massacre of pro-democracy demonstrators. He was initially sentenced to death, though the sentence was commuted to life imprisonment and he was later pardoned.\n\nThis is a breaking news story. More to come.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/12/03/asia/south-korea-martial-law-intl",
      "text": "declared martial law"
    },
    {
      "url": "https://www.cnn.com/2025/10/23/asia/south-korea-president-lee-jae-myung-trump-intl-hnk",
      "text": "crucial US ally in Asia"
    },
    {
      "url": "https://www.cnn.com/world/live-news/martial-law-south-korea-intl#cm49wym8800053b6m30xizol5",
      "text": "taken responsibility"
    },
    {
      "url": "https://www.cnn.com/2025/01/26/asia/south-koreas-president-charged-insurrection-intl",
      "text": "detained in January"
    },
    {
      "url": "https://www.cnn.com/2025/01/02/asia/south-korea-president-arrest-warrant-hnk-latam-intl/index.html",
      "text": "weeks-long standoff"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/world/video/yoon-south-korea-prison-sentencing-martial-law-mike-valerio-live-011603aseg1-cnni-world-fast",
      "text": "sentenced to five years in prison"
    },
    {
      "url": "https://www.cnn.com/2025/11/13/asia/south-korea-yoon-drone-charges-intl-hnk-dst",
      "text": "deployed secret drones"
    },
    {
      "url": "https://www.cnn.com/2026/01/21/asia/south-korea-han-yoon-jailed-intl-hnk",
      "text": "23 years in prison"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/asia/south-korea-kim-keon-hee-ruling-intl-hnk",
      "text": "Kim Keon Hee"
    },
    {
      "url": "https://www.cnn.com/2024/12/04/asia/south-korea-yoon-impeachment-presidents-fate-intl-hnk",
      "text": "Chun Doo-hwan"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/asia/south-korea-yoon-suk-yeol-verdict-insurrection-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/asia/south-korea-yoon-suk-yeol-verdict-insurrection-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4ac84587db1c1bbdf3484e54a4457bcf44742ded35e46faa85e35b465b212fe6",
  "scraped_at": "2026-02-19T07:30:24.770609+00:00"
}