{
  "url": "https://lite.cnn.com/2026/02/17/us/reverend-jesse-jackson-death",
  "title": "Reverend Jesse Jackson dies at age 84 | CNN",
  "date": "2026-02-19T07:33:10.116103+00:00",
  "authors": [
    "John Blake",
    "Alex Stambaugh",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Rev. Jesse Louis Jackson, the towering civil rights leader whose moral vision and fiery oratory reshaped the Democratic Party and America,has died, his son said. He was 84.\n\nJackson, a protégé of the Rev. Martin Luther King Jr., had beenhospitalizedin recent months and was under observation for progressive supranuclear palsy. He died Tuesday morning, surrounded by his family, according to astatementfrom his nonprofit social justice organization, the Rainbow PUSH Coalition.\n\n“His unwavering commitment to justice, equality, and human rights helped shape a global movement for freedom and dignity. A tireless change agent, he elevated the voices of the voiceless – from his Presidential campaigns in the 1980s to mobilizing millions to register to vote – leaving an indelible mark on history,” the statement read.\n\nJackson was what one pundit called “an American original.” He was born to an unwed teenage mom in Greenville, South Carolina, during the Jim Crow era but rose to become a civil rights icon and a groundbreaking politician who mounted two electrifying runs for the presidency in the 1980s.\n\nJackson’s dual bids for the Democratic presidential nomination inspired Black America and stunned political observers who marveled at hisabilitytodrawWhite voters. He was a Black crossover figure long before Barack Obama hit the national stage.\n\nJackson first rose to national prominence in the 1960s as a close aide to the Rev. Martin Luther King Jr. After King’s assassination in 1968, Jackson became one of the most transformative civil rights leaders in America — to the chagrin of some of King’s aides, who thought he was too brash.\n\nBut hisRainbow Coalition,a bold alliance of Blacks, Whites, Latinos, Asian Americans, Native Americans and LGBTQ people, helped pave the way for a more progressive Democratic Party.\n\n“Our flag is red, white and blue, but our nation is a rainbow – red, yellow, brown, Black and White – and we’re all precious in God’s sight,” Jackson oncesaid.\n\nOne of Jackson’s signature phrases was “Keep hope alive.” He repeated it so often that some began to parody it, but it never seemed to lose meaning for him. He was a force for social justice over three eras: the Jim Crow period, the civil rights era and the post-civil rights era that culminated with the election of Obama and the Black Lives Matter movement.\n\nThrough his eloquence and singular drive, Jackson didn’t just keep hope alive for himself. His dream of a vibrant, multiracial America still inspires millions of Americans today.\n\nJackson’s vision remade the Democratic Party. He was the first presidential candidate to make support for gay rights a major part of his campaign platform, and he made a concerted effort to challenge the Democratic Party’s prioritization of White, moderate, middle-class voters, saysDavid Masciotra, author of “I Am Somebody: Why Jesse Jackson Matters.”\n\n“A Democratic party that now represents a multicultural America and has someone like Kamala Harris as the (former) Vice President and Obama as the former President began in many ways with those Jackson campaigns,” Masciotra says.\n\nObama may have never made it to the White House without Jackson’s pioneering presidential runs. Jackson successfully fought tochangethe awarding of delegates during the Democratic primaries from a winner-take-all system that benefitted frontrunners to a proportional system that helped other candidates even if they didn’t win a state.\n\nThosechanges helpedObama mount a come-from-behind victory over frontrunner Hillary Clinton during the 2008 Democratic primaries, Masciotra says.\n\nJackson was once asked if it hurt that he didn’t become the nation’s first Black president.\n\n“No, it doesn’t,” he told aGuardiancolumnist, “because I was a trailblazer, I was a pathfinder. I had to deal with doubt and cynicism and fears about a Black person running. There were Black scholars writing papers about why I was wasting my time. Even Blacks said a Black couldn’t win.”\n\nJackson smashed the perception that a Black person couldn’t be a viable presidential candidate. Some pundits predicted he would be outclassed by his more experienced political opponents during the presidential debates. They grudgingly recognized his charisma, but many never gave him credit for his analytical ability and political savvy.\n\n“It turned out he not only held his own; he often won those debates,” Masciotra says.\n\nPolitical observers shouldn’t have been surprised. Jackson was one of the most gifted communicators in American history. Even as a child, he had a preternatural facility with words and metaphors. Like King, heinjectedthe rhyming, cadences and poetic imagery of Black church preaching into American political life.\n\n“Jesse was an unusual kind of fella, even when he was just learning to talk,”Noah Robinson, Jackson’s father,toldThe New York Times in 1984. “He would say, ‘I’m going to lead people through the rivers of the water.’’’\n\nJackson’s signature line, “I Am Somebody,” which he often chanted during speeches, was aimed as much at himself as it was to his audience. Marshall Frady, who wrote “Jesse: The Life and Pilgrimage of Jesse Jackson,”saidJackson was prodigiously gifted but was plagued by “chasmic insecurities despite all he’s done.”\n\nSome of those insecurities sprang from his childhood. Jackson was born on October 8, 1941, in Greenville, South Carolina — a double outcast because of his race and the circumstances of his birth. He was born in the Jim Crow South to Helen Burns, then an unmarried 16-year-old, and her married-next-door neighbor, Noah Robinson. Burns married a year later, and her husband, Charles Jackson, adopted her son.\n\nBiographers invariably describe Jackson as feelinglonelyand different as a child.  He wasteasedby classmates for being “anobodywho had no daddy.” Frady described Jackson as an “aggrieved and brooding little boy.”\n\nBut Jackson told a New York Times reporter that he had a “father surplus.” He said his biological and adoptive fathers were friends, and that he inherited his strong ego and “sense of dignity” from his biological father.\n\n”It is where I get the drive to think I could change the South through the civil rights movement and run for President,” Jacksonsaid.\n\nJackson was able to build the kind of stable family life that was denied to him as a kid. In1962 he married Jacqueline Lavinia Brown,who was in many ways as dynamic andstrong-willedas he was. They hadfive children andstayed together through the wild swings of fortune that Jackson endured during his six decades in public life.\n\nJackson oncesaidthat “both tears and sweat are salty,” but while tears will get you sympathy, “sweat will get you change.” He took his childhood tears and channeled them into a relentless activism that only flagged when heannouncedin 2017 that he was suffering from Parkinson’s disease. His family later said he had progressive supranuclear palsy (PSP), which has similar symptoms.\n\nJackson’s other frailties were evident long before that diagnosis. Hewas accusedof exaggerating his actions following King’s assassination andmaking anti-Semitic remarks.He also fathered a daughter after an affair with a former aide. There were few national leaders whose highs and lows played out on the national stage like Jackson.\n\nYet he continued to make change while making headlines. In 1984 henegotiatedthe release of 48 Cuban and Cuban-American prisoners held in Cuba and of Navy Lieutenant Robert Goodman, an African-American pilot held hostage inSyria.\n\nIn 1999 he negotiated the release of three US soldiers who had been held in what was then Yugoslavia for more than a month. A year later, he received the Presidential Medal of Freedom, the nation’s highest civilian honor.\n\nIn his later years, Jackson became an elder statesman in the civil rights movement.  He was a bridge between the civil rights movement of the 1960s and the contemporary era, when many young White Americans saw nothing odd about a Black man in the White House.\n\nWhen Obama delivered his election-night victory speech in Chicago’s Grant Park in 2008 to a massive crowd of cheering onlookers, the cameras caught Jackson looking on, tears in his eyes.\n\n“I cried because I thought about those who made it possible who were not there,” Jackson later explained. “People who paid a real price: Ralph Abernathy, Dr. King, Medgar Evers, Fannie Lou Hamer… those in the movement in the South.”\n\nJackson suffered additional health problems in recent years. He and his wife were hospitalized in August 2021 after testing positive for Covid-19. And in November 2021 he was hospitalizedafter falling and hitting his headduring a protest at Howard University in Washington.\n\nHe was arrested in 2021 while urging Congress toprotect voting rights, andled a marchfor criminal justice reform that same year.\n\nJackson announced plans to step down as president of the Rainbow PUSH Coalition in 2023, more than 50 years after he founded the international human and civil rights organization.\n\nHis legacy was celebrated the following year when he was honored on stage at the 2024 Democratic National Convention, which would see Kamala Harris become the first Black woman to lead a major-party ticket.\n\nJackson issurvivedby his wife, Jacqueline, and their five children, Santita, Jesse Jr., Jonathan, Yusef, and Jacqueline. He is alsosurvivedby a sixth child, Ashley.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/live-news/rev-jesse-jackson-death-reactions-tributes-02-17-26",
      "text": "has died"
    },
    {
      "url": "https://www.cnn.com/2025/11/12/politics/jesse-jackson-hospitalized-hnk",
      "text": "hospitalized"
    },
    {
      "url": "https://www.instagram.com/p/DU2mUvPDoh9/?hl=en",
      "text": "statement"
    },
    {
      "url": "https://www.pbs.org/wgbh/pages/frontline/jesse/fradyint.html",
      "text": "an American original"
    },
    {
      "url": "https://www.politico.com/magazine/story/2019/03/15/bernie-sanders-2020-race-jesse-jackson-1988-presidential-campaign-225809/",
      "text": "ability"
    },
    {
      "url": "https://apnews.com/article/2b7b20b42012a479f4934bfa55b9f0b6",
      "text": "draw"
    },
    {
      "url": "https://www.history.com/news/jesse-jackson-rainbow-coalition",
      "text": "Rainbow Coalition,"
    },
    {
      "url": "https://quotes.thefamouspeople.com/jesse-jackson-1816.php",
      "text": "said"
    },
    {
      "url": "https://www.bloomsbury.com/us/i-am-somebody-9781838604271/",
      "text": "David Masciotra"
    },
    {
      "url": "https://www.politico.com/story/2008/02/proportional-primaries-working-for-democrats-008698",
      "text": "change"
    },
    {
      "url": "https://www.uakron.edu/bliss/docs/state-of-the-parties-documents/Farmerconferencedraft.pdf",
      "text": "changes helped"
    },
    {
      "url": "https://www.theguardian.com/us-news/2020/may/18/jesse-jackson-the-gated-community-does-not-protect-you-from-the-pandemic",
      "text": "Guardian"
    },
    {
      "url": "https://www.nytimes.com/1988/04/16/us/jackson-s-rhymes-lilting-to-a-different-cadence.html",
      "text": "injected"
    },
    {
      "url": "https://www.nytimes.com/1997/01/31/us/noah-l-robinson-88-father-of-jesse-jackson.html",
      "text": "Noah Robinson"
    },
    {
      "url": "https://www.biography.com/activist/jesse-jackson",
      "text": "told"
    },
    {
      "url": "https://www.pbs.org/wgbh/pages/frontline/jesse/fradyint.html",
      "text": "said"
    },
    {
      "url": "https://aaregistry.org/story/jesse-jackson-born/",
      "text": "lonely"
    },
    {
      "url": "https://www.notablebiographies.com/Ho-Jo/Jackson-Jesse.html#ixzz6nRqRPBMt",
      "text": "teased"
    },
    {
      "url": "https://www.notablebiographies.com/Ho-Jo/Jackson-Jesse.html",
      "text": "nobody"
    },
    {
      "url": "https://www.nytimes.com/1997/01/31/us/noah-l-robinson-88-father-of-jesse-jackson.html",
      "text": "said"
    },
    {
      "url": "https://www.nps.gov/features/malu/feat0002/wof/Jesse_Jackson.htm",
      "text": "1962 he married Jacqueline Lavinia Brown,"
    },
    {
      "url": "https://www.latimes.com/archives/la-xpm-1988-05-18-vw-2904-story.html",
      "text": "strong-willed"
    },
    {
      "url": "https://www.biography.com/activist/jesse-jackson",
      "text": "five children and"
    },
    {
      "url": "https://quotes.thefamouspeople.com/jesse-jackson-1816.php",
      "text": "said"
    },
    {
      "url": "https://www.nytimes.com/2017/11/17/us/jesse-jackson-parkinsons.html",
      "text": "announced"
    },
    {
      "url": "https://www.nytimes.com/1988/04/18/us/koch-says-jackson-lied-about-actions-after-dr-king-was-slain.html",
      "text": "was accused"
    },
    {
      "url": "https://www.washingtonpost.com/wp-srv/politics/special/clinton/frenzy/jackson.htm",
      "text": "making anti-Semitic remarks."
    },
    {
      "url": "https://www.cnn.com/2013/02/28/us/jesse-jackson-fast-facts/index.html",
      "text": "negotiated"
    },
    {
      "url": "http://www.cnn.com/2013/06/18/world/meast/syria-fast-facts/index.html",
      "text": "Syria"
    },
    {
      "url": "https://www.cnn.com/2021/11/02/us/jesse-jackson-hospitalized-howard-university/index.html",
      "text": "after falling and hitting his head"
    },
    {
      "url": "https://www.washingtonpost.com/dc-md-va/2021/08/02/jesse-jackson-protest-voting-rights-dc/",
      "text": "protect voting rights"
    },
    {
      "url": "https://fox59.com/news/national-world/rev-jesse-jackson-to-join-kenosha-march-to-protest-rittenhouse-verdict/",
      "text": "led a march"
    },
    {
      "url": "https://d3n8a8pro7vhmx.cloudfront.net/rainbowpush/pages/77/attachments/original/1613886798/Rev._Jesse_Louis_Jackson_Sr_Biography.pdf?1613886798",
      "text": "survived"
    },
    {
      "url": "https://abcnews.go.com/2020/story?id=124046&page=1",
      "text": "survived"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/reverend-jesse-jackson-death",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/reverend-jesse-jackson-death",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4b03b87e86b352de3a16c23827c64fa87e6abfa5b19a75f056f8bc26498cfbf9",
  "scraped_at": "2026-02-19T07:33:10.116115+00:00"
}