{
  "url": "https://lite.cnn.com/2026/02/23/americas/mexico-tourists-stranded-scli-intl-latam",
  "title": "US tourists stranded in Mexico amid ‘really scary’ cartel violence | CNN",
  "date": "2026-02-24T07:30:58.288269+00:00",
  "authors": [
    "Jack Guy, CNN"
  ],
  "text": "Source: CNN\n\nThe killing of Mexican cartel leaderNemesio “El Mencho” Oseguera Cervanteson Sunday set off a wave of retaliatory violence from his gunmen, affecting areas popular with foreign tourists such as Puerto Vallarta and Guadalajara.\n\nThe US State Departmentadvised Monday that more areas of Mexicohave “returned to normal” following widespread unrest, but cautioned US citizens in Puerto Vallarta, Guadalajara, and Ciudad Guzman to continue to shelter in place. Several US airlines suspended flights to the popular resort town Puerto Vallarta, stranding many tourists who were desperate to escape the violence and return home.\n\nCNN spoke to a number of those affected, including American Yoni Pizer, who lives in Puerto Vallarta and told CNN he was attacked by gunmen during Sunday’s violence, when the car he was driving in was hijacked, torched, and used to barricade a road.\n\nPizer said he was on his way to go whale watching with his husband and two friends when they came across a white truck stopped at an intersection.\n\n“A young man came running with a gun pointed at our windshield to us, screaming in Spanish: Get out of the car! Get out of the car!” Pizer told CNN’s Jim Sciutto on Monday.\n\nThey jumped out of the vehicle. The gunman got into the driver’s seat and, with his gun in one hand, maneuvered the car to the intersection, Pizer said.\n\n“(The gunman) threw an incendiary device or some sort of bomb in the car, which immediately exploded in flames. And then two seconds later, the truck was also on fire,” Pizer said.\n\nAs Pizer and his friends ran away, they heard explosions from the car and gunfire.\n\n“Then they just started grabbing people as more traffic started coming toward the intersection. Some people were able to squeal and make u-turns and head away. Others were caught, and were dragged out of their cars. And their were cars were moved also to block the road.”\n\nDallas resident Adryan Moorefield, who was set to travel home from Puerto Vallarta on Sunday but awoke to the news that members of organized crime groups had set buses on fire, blocked roads and clashed with authorities.\n\n“It was such a complete shocker and it almost felt like being in the twilight zone,” Moorefield told CNN. “We’ve been to PV before and thought that this would be a no brainer place to come and do a quick, easy beach vacation.”\n\nAmerican tourist Jim Beck told CNN he ventured outside his hotel in Puerto Vallarta to get breakfast on Sunday and saw “taxi cabs blown up all over town, blocking the roads.”\n\n“Then immediately, everyone was running down the street, screaming and yelling, and they told everyone to get back to their hotels,” Beck said.\n\nMari, another tourist who asked to go by her first name for privacy reasons, said her young family had been sheltering in their vacation rental and watching the unrest unfold outside.\n\n“We have two little kids, and it’s really scary,” she said. “The entire bay was just covered in fire,” she added. “For hours, there was just a billow of smoke, hovering. You could not see anything across.”\n\nAnother US tourist, Travis Dagenais, told CNN that he was woken up in Puerto Vallarta on Sunday morning by so many loud noises that he initially thought construction work was underway.\n\n“We woke up this morning to a lot of what I thought was a building demolition,” Dagenais said.\n\nIt took him some time to figure out what was happening as reports of chaos gradually began to surface on social media, he said. Soon he could see the unrest unfold from his balcony.\n\n“I was able to see quite directly, a little too visibly, some of the tactics and some of the cars that were being set on fire, some of the looting that was taking place as local stores and buildings were being attacked,” he said, adding the city “smells like burnt rubber at the moment.”\n\nDagenais said he and other tourists are currently beset by a raft of uncertainties.\n\n“How long does this lockdown, so to speak, last? How long does the airport stay out of operation? What are some of the ways out? What (are) some of those answers, or just some of the plans we can make?” he wondered.\n\nDagenais added that most of his fellow tourists were dealing with the sudden chaos “with a certain degree of patience and understanding of things that are beyond the individual’s control.”\n\n“I really hope that everybody in this city, everybody in this country, is able to feel normalcy and is able to feel some degree of safety after this,” he added.\n\nAn American woman from California visiting family in Mexico told CNN that she had been temporarily separated from her son and left wondering where her next meal would come from.\n\nPriscilla, whose last name CNN is withholding for safety reasons, arrived in the city of Tepic on Saturday. Pricilla’s teenage son spent the night at a nearby cousin’s house, about 20 minutes from their hotel.\n\nDue to multiple shelter-in-place warnings, she couldn’t get her son, but said he’s safe.\n\n“I’ve been coming to Mexico all my life, ever since I was a little girl, and I’ve never encountered something like this,” she told CNN on Sunday.\n\nShe told CNN she saw several vehicles set on fire by suspected cartel members nearby. The streets later emptied, and only the sounds of ambulances could be heard, she added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
      "text": "Nemesio “El Mencho” Oseguera Cervantes"
    },
    {
      "url": "https://mx.usembassy.gov/security-alert-update-5-ongoing-security-operations-u-s-mission-mexico-february-23-2026/",
      "text": "advised Monday that more areas of Mexico"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/mexico-tourists-stranded-scli-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/americas/mexico-tourists-stranded-scli-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4be98f879e12a2405349eabf1926fc922608e39db0723710a10ece208a424d30",
  "scraped_at": "2026-02-24T07:30:58.288282+00:00"
}