{
  "url": "https://lite.cnn.com/2026/02/25/politics/immigration-democrats-republicans-midterms",
  "title": "Analysis: Immigration could be the caveat to Democrats’ midterm momentum | CNN Politics",
  "date": "2026-02-26T07:31:39.310199+00:00",
  "authors": [
    "Analysis by Aaron Blake"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump has keyed in on an old standard while framing up the 2026 midterm elections:immigration.\n\nAt one point during his State of the Union speech Tuesday night, he challenged Democrats to stand and show support for the statement that “The first duty of the American government is to protect American citizens, not illegal aliens.” (Democratsdid not play alongwith this bit of audience participation.) At another point, he claimed that Democrats would open the border up “all over again if they ever had the chance.”\n\nTrump has centered elections on immigration before, but now his numbers on the issue have declined significantly as Americans have decided his deportation operationshave gone “too far.”\n\nHis focus on it points to an unhappy reality for Democrats: Voters still tend to favor Republicans over Democrats on some key issues, including immigration.\n\nIt remains to be seen what impact that preference might have in the fall elections. Midterms are generally seen as a referendum on the incumbent president rather than a choice between the two parties.\n\nBut voters’ lack of faith in a historically unpopular Democratic Party looms as an unpredictable variable in the party’s designs on making 2026 a wave election year.\n\nPerhaps no issue tells that tale like immigration.\n\nTrump’s net approval rating on it has gone from double-digits positive a year agoto double-digits negative today, according to Nate Silver’s polling averages. Trump’s harsh deportation operations and the killings of Renee Good and Alex Pretti in Minneapolis have cost him — to the point that he’s felt compelled to signal a softer approach.\n\nBut in four recent polls that asked respondents to pick between Republicans and Democrats on immigration, Republicans led by between 4 and 11 points in all of them.\n\n(The polls come fromReuters and Ipsos,AP-NORCtheWall Street JournalandQuinnipiac University.)\n\nAnd on the related issue of “border security,” the Journal’s poll showed registered voters favored Republicans in Congress over Democrats by a whopping 28 points, 48%-20%.\n\nThe story is similar on the economy.\n\nTrump’s numbers have fallen even more on that issue amid persistent inflation, anemic job growth, middling economic growth and a high degree of pessimism. It might be his biggest political problem right now, given how much voters vote on the economy.\n\nBut all four polls show Republicans leading on that issue by either 5 or 6 points.\n\nEven as Trump’s tariffs are quite unpopular, the Journal’s poll showed 36% still prefer Republicans in Congress on the issue of tariffs, while 34% prefer Democrats. And Republicans even somehow led by 6 points on the issue of “inflation and rising prices” — despite inflation often being cited as Trump’s and the GOP’s biggest vulnerability in the 2026 election.\n\nThe polls also show Republicans leading on foreign policy (by an average of 6 points) and crime (by 12 points, in the Reuters poll).\n\nDemocrats have their strengths too. They lead by double digits or more on democracy, health care, the environment and women’s rights. But on the issues that are probably more front-and-center, Republicans still lead.\n\nHow to explain this?\n\nSome of this is undoubtedly that voters simply tend to favor the GOP on issues like the economy and immigration. And even if the GOP’s advantages are simply smaller than usual — rather than erased — that could be good for Democrats.\n\nBut that’s not the full story. Some of the GOP’s advantage appears to owe to people simply not having much faith in the Democratic Party to right the ship that they think Trump has failed to navigate.\n\nAP-NORC polling, for instance, showed Democrats faring better on the economy in 2021, 2017 and 2016. They fared better on immigration in 2021 and even had a small lead in 2019, during Trump’s first term.\n\nA newWashington Post-ABC News-Ipsos pollshows something similar. Back in 2018, when Trump’s numbers on immigration were also depressed, the Post’s polling showed voters favored Democrats in Congress over Trump on the issue by 8 points. Today, Trump leads by 4.\n\nAnd Democrats’ leads on the so-called “generic ballot” — i.e., do you prefer a generic Democrat or a generic Republican for Congress — are arguably underwhelming in some recent polls, given Trump’s problems.\n\nThePost-ABC pollshowed 47% of registered voters choosing Democrats and 45% picking Republicans compared to Democrats’ double-digit lead around this point during their wave election years in 2018 and 2006.\n\nAnd CNN’s recent poll showed Democrats leading on that measureby 5 points. They led by between 5 and 16 points around this point in the 2018 cycle, and by between 6 and 16 points around this point in the 2006 cycle.\n\nBut both of those polls also showed something very important for Democrats’ hopes: a huge enthusiasm gap in their favor. That suggests the GOP’s voters are simply much more likely to stay home. And as the polling models shift to likely voters rather than all registered voters later this year, Democrats’ leads could expand.\n\nIndeed, the generic matchup could wind up amounting to little or nothing as voters decide the election is really about voting for or against Trump, rather than for one of the two major political parties.\n\nBut if there’s one thing that should give Democrats at least a little pause about being able to seize on the opportunity in front of them in 2026, it might be that voters still just don’t see them as a great alternative.\n\nTrump still sees immigration as a winning issue for him, as long as he can keep the focus on the right aspects of the issue — i.e., the border, rather than Good and Pretti. And he might be on to something.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
      "text": "immigration"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
      "text": "did not play along"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/alex-pretti-shooting-minneapolis-crackdown-polls",
      "text": "have gone “too far.”"
    },
    {
      "url": "https://www.natesilver.net/p/trump-approval-ratings-nate-silver-bulletin",
      "text": "to double-digits negative today"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2026-02/Reuters%20Ipsos%20Core%20Political%20Topline%20February%202026_1.pdf",
      "text": "Reuters and Ipsos"
    },
    {
      "url": "https://apnorc.org/wp-content/uploads/2026/02/February-2026-Greenland_Topline.pdf",
      "text": "AP-NORC"
    },
    {
      "url": "https://prod-i.a.dj.com/public/resources/documents/Redacted_WSJ_Poll_Jan_2026.pdf",
      "text": "Wall Street Journal"
    },
    {
      "url": "https://poll.qu.edu/poll-release?releaseid=3943",
      "text": "Quinnipiac University"
    },
    {
      "url": "https://www.washingtonpost.com/documents/d1fa84e0-1aef-4fb2-b140-c872ca010279.pdf",
      "text": "Washington Post-ABC News-Ipsos poll"
    },
    {
      "url": "https://www.washingtonpost.com/politics/2026/02/25/poll-democrats-trump-republicans-midterms/",
      "text": "Post-ABC poll"
    },
    {
      "url": "https://s3.documentcloud.org/documents/26491962/cnn-poll-conducted-by-ssrs-2026-midterms-congress.pdf",
      "text": "by 5 points"
    }
  ],
  "hash": "4c07fc6121aa0367328ec3fd69efb22703ad893432ae91687ba21df6a00dba0a",
  "scraped_at": "2026-02-26T07:31:39.310210+00:00"
}