{
  "url": "https://lite.cnn.com/2026/02/26/politics/hillary-clinton-deposition-epstein-bill",
  "title": "Hillary Clinton says she answered every question on Epstein and decries GOP for keeping deposition private | CNN Politics",
  "date": "2026-03-01T07:08:57.022833+00:00",
  "authors": [
    "Annie Grayer",
    "MJ Lee"
  ],
  "text": "Source: CNN\n\nFormer Secretary of State Hillary Clinton defiantly faced lawmakers Thursday who sought to question her about her family’s past ties to Jeffrey Epstein, insisting that she had no information about the late convicted sex offender’s criminal activities and blasting Republicans for conducting the interview in private.\n\nEmerging after six-and-a-half hours with House Oversight Committee lawmakers behind closed doors, Clinton said she had “answered every one of their questions as fully as I could based on what I knew.” She stressed she had never met Epstein nor had communications with him.\n\n“I don’t know how many times I had to say, ‘I did not know Jeffrey Epstein,’” she told reporters.\n\nClinton said she knew Ghislaine Maxwell – who was convicted in connection with Epstein’s crimes – “casually as an acquaintance,” and that Maxwell “came as the plus one, the guest, of someone who was invited” to her daughter Chelsea Clinton’s 2010 wedding.\n\nAnd the former secretary of state criticized the GOP for having “refused to hold a public hearing,” forcing her to describe what had happened for members of the media afterward.\n\nThe deposition – which took place in New York, near where Hillary Clinton lives with former President Bill Clinton – is one of the highest-profile interviews yet in the Republican-led committee’s investigation into Epstein. It comes after both Clintons vigorously resisted testifying in what they denounced as a Republican plot against them, only to reverse course when faced with the prospect of being held in criminal contempt of Congress. Bill Clinton is set to testify Friday.\n\nFrom its beginning, the deposition was a rancorous, partisan affair. In her opening statement, Clinton asked lawmakers why the Republican-led committee had not questioned others with ties to Epstein, including President Donald Trump. Later, the proceedings had to be paused briefly after conservative podcaster Benny Johnsonposted a photofrom the ongoing interview on X – which Democrats asserted was a violation of House rules. The image, Johnson said, was provided by Republican Rep. Lauren Boebert.\n\n“I admired her blue suit,” the congresswoman quipped to reporters during a break in the proceeding.\n\nSpeaking to reporters during that break, Democrats blasted Republicans over the episode and called for members of the media to be allowed in the deposition room.\n\n“We are sitting through an incredibly unserious clown show of a deposition where members of Congress and the Republican Party are more concerned about getting their photo op of Secretary Clinton than actually getting to the truth and holding anyone accountable,” Arizona Democratic Rep. Yassamin Ansari said.\n\nClinton called the incident “very upsetting.”\n\nWhile the deposition was not conducted publicly, Rep. James Comer, chairman of the House Oversight Committee, said he would try to release video of it within the next 24 hours. The Kentucky Republican said the discussion was “productive” and that he “learned a lot,” but that Hillary Clinton frequently referred questions to her husband, saying, “I don’t know, you’ll have to ask my husband” more than a dozen times.\n\n“We have a lot of questions for her husband tomorrow,” Comer said.\n\nAsked by CNN whether she was confident her husband had no knowledge of Epstein’s crimes, Hillary Clinton responded, “I am.” That relationship, she said, “ended several years before anything about Epstein’s criminal activities came to light.”\n\nRep. Robert Garcia, the top Democrat on the committee, said Clinton was “completely cooperating with the deposition and the committee, and is answering questions in full faith and in good faith.” He declined to provide specifics, imploring Republicans to quickly release the full video of the deposition.\n\nRepublicans have insisted the Clintons’ testimony is vital to their probe, and noted that neither Bill nor Hillary had answered detailed inquiries about their ties to Epstein.\n\n“It is a bipartisan investigation. The American people have a lot of questions. To my knowledge, the Clintons haven’t answered very many if any questions about their knowledge or involvement with Epstein and Maxwell,” Comer said.\n\nRepublican Rep. Nancy Mace of South Carolina said at a press briefing after the deposition that Clinton “took every question from every single member.” During the interview, she asked Clinton a number of questions about her husband, including whether the former first lady had any feelings about young women massaging him, according to a source who watched the deposition. Clinton responded she would not speculate about events for which she was not present and was not there to discuss feelings.\n\nBill Clinton has never been accused by law enforcement of any wrongdoing related to Epstein, and a spokesperson has repeatedly said he cut ties before Epstein’s arrest on federal charges in 2019 and was unaware of any crimes.\n\nA CNN review showed the former president traveled on Epstein’s private plane at least 16 times, and he was pictured in Epstein case files released by the Justice Department with women in a jacuzzi, as well as with Maxwell.\n\nHillary Clinton was accompanied Thursday by her attorneys, who have been working through painstaking details of what areas could be covered during questioning.\n\nEven the location for the depositions, the Clintons’ hometown of Chappaqua, was negotiated between Clinton lawyer David Kendall and Comer in hopes of avoiding the indignity and precedent-setting move of summoning a former president to Capitol Hill for questioning.\n\nThe former first lady arrived out of direct sight of the gaggle of reporters who had gathered in front of the Chappaqua Performing Arts Center. But the two images of Clinton flanked by her attorneys that surfaced on social media during the proceeding briefly ground the deposition to a halt, with Democratic lawmakers accusing their Republican colleagues of breaking their own rules.\n\nThe Clintons and members of the House Oversight Committee agreed to five topic areas for the depositions, a person familiar with the agreement told CNN. They were:\n\nSurvivors of Epstein’s abuse and lawyers representing them told CNN that they believe it is important for the Clintons, and especially the former president, to testify. In interviews, they stressed that the presence of an individual in the Epstein files and their cooperation with Congress does not indicate wrongdoing.\n\nHillary Clinton said that toward the end of the hearing, GOP lawmakers inquired about UFOs and “Pizzagate,” a conspiracy theory that gained traction in the final days before the 2016 US presidential election that centered on a pedophilia ring supposedly being run out of a Washington, DC, pizza shop.\n\nThe questioning, she said, was “quite unusual.”\n\nThis headline and story have been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://x.com/bennyjohnson/status/2027067846417690630?s=20",
      "text": "posted a photo"
    }
  ],
  "hash": "4c2859d4636d6694f06b0bbc237762ee37f9905efc58839da152a9e87579876f",
  "scraped_at": "2026-03-01T07:08:57.022845+00:00"
}