{
  "url": "https://lite.cnn.com/2026/02/24/politics/takeaways-gavin-newsom-book",
  "title": "Four takeaways from Gavin Newsom’s new book, ‘Young Man in a Hurry’ | CNN Politics",
  "date": "2026-02-25T07:33:04.778854+00:00",
  "authors": [
    "Katherine Koretski"
  ],
  "text": "Source: CNN\n\nCalifornia Gov. Gavin Newsom’s new book, “Young Man in a Hurry,” details his political triumphs and downfalls, personal relationships and times of struggle.\n\nNewsom doesn’t say in the book, which comes out Tuesday, whether he’ll run for president – though he’s been open in interviews abouthis consideration of a 2028 run. Instead, he lays out personal stories and addresses controversies that would likely come up if he were to launch a bid.\n\nHere’s a look at some of the personal moments he addresses:\n\nNewsom describes his upbringing as sometimes turbulent.\n\nHe explains that his parents, who married young, lived mostly apart during his childhood. After multiple failed political runs, his father, William Newsom, moved to Lake Tahoe, California, leaving him and his sister Hilary to be raised mostly by his mother, Tessa Menzies Newsom.\n\nMoving around many times, he says they often lived with strangers as his mother worked multiple jobs. Newsom also explains how he struggled academically during his childhood and was eventually diagnosed with dyslexia.\n\nThe governor’s mother died at the age of 55, planning her own assisted suicide after suffering from breast cancer. He describes being at her bedside during her last moments, holding her hand “tighter and tighter and sobbing.”\n\nNewsom is married to Jennifer Siebel Newsom, a filmmaker and actress with whom he shares four children. The two were set up on a blind date by mutual friends. In the book, Newsom reveals that in 2020, at the age of 46, Siebel Newsom experienced a miscarriage with their fifth child and received emergency lifesaving surgery in California.\n\nNewsom also talks about his first marriage to Kimberly Guilfoyle, who later dated Donald Trump Jr. and is now serving as US ambassador to Greece. He writes that the two were introduced by friend and business partner, Billy Getty, ahead of a vacation to Hawaii. The pair was married for four years but mostly lived separately as Newsom was mayor of San Francisco and Guilfoyle was pursuing a media career on Court TV.\n\nIn the summer of 2004, the coupleappeared in Harper’s Bazaar magazinein an article titled, “The New Kennedys,” posing for a picture of the two lying on a carpet.\n\n“The critics mocked it, but none more than me,” Newsom writes.\n\nThe two divorced after four years of marriage and parted “as amicably as two people could,” he writes.\n\nFollowing his divorce from Guilfoyle, Newsom found himself wrapped in a political scandal when he had what he calls a brief affair with a staffer and wife of his deputy chief of staff, Alex Tourk. Ruby Rippey-Tourk revealed during a 12-step program meeting that the two had an affair and Newsomwas forced to comment publicly. He spoke on camera about the affair, saying, “Everything you’ve heard and read is true. And I’m deeply sorry about that.”\n\nNewsom reveals in his book that with time and reflection, that what he had done was, “the worst betrayal of my life.”\n\nIn 2004, Newsom was invited to former President George W. Bush’s State of the Union address, in which Bush criticized “activist judges” for redefining marriage. Newsom, who was mayor of San Francisco at the time, wanted to be “bold” regarding the topic when returning to California. Newsom allowed same-sex couples to get married at City Hall for 28 days. Over 4,000 couples were married, includingRosie O’Donnelland her partner, Kelli Carpenter, before the California Supreme Court later voided the marriages.\n\nNewsom received backlash from Republicans and even some Democrats, writing that among those who were angered were then-Gov. Arnold Schwazenegger, former California Attorney General Bill Lockyer and former Sen. Dianne Feinstein. Newsom also goes on to say that he was not asked to speak at the Democratic National Convention in Boston that year, and at a party with then-state senator Barack Obama, who would give a famous keynote address at the convention, he was told no pictures could be taken of the two together.\n\nThe state Supreme Court wouldstrike down a banon gay marriage in 2008. The US Supreme Courtruled seven years laterthat states must allow same-sex couples to marry.\n\nThrough his long career in Northern California, Newsom found himself in the same circles with people who went on to become tech giants. Newsom recalls a party he attended, standing with Google co-founders Sergey Brin and Larry Page, when Apple founder Steve Jobs pulls out what Newsom describes as a “sleek device” and “a solid piece of glass with no keyboard that could be held in one hand.”\n\nBrin and Page would later go on to create the Android version of the smartphone, Newsom recalls.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/gavin-newsom-book-tour",
      "text": "his consideration of a 2028 run"
    },
    {
      "url": "https://www.sfgate.com/entertainment/garchik/article/New-Kennedys-or-not-focus-is-on-city-s-first-3314198.php",
      "text": "appeared in Harper’s Bazaar magazine"
    },
    {
      "url": "https://www.cnn.com/TRANSCRIPTS/0702/02/ltm.01.html",
      "text": "was forced to comment publicly"
    },
    {
      "url": "https://transcripts.cnn.com/show/lol/date/2004-02-26/segment/07",
      "text": "Rosie O’Donnell"
    },
    {
      "url": "https://www.cnn.com/2008/US/05/15/same.sex.marriage/",
      "text": "strike down a ban"
    },
    {
      "url": "https://www.cnn.com/2015/06/26/politics/supreme-court-same-sex-marriage-ruling",
      "text": "ruled seven years later"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-gavin-newsom-book",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/takeaways-gavin-newsom-book",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4c8e7675604ad7283091d3af3821f8383f4181a454758ab879aebe274b543aa7",
  "scraped_at": "2026-02-25T07:33:04.778866+00:00"
}