{
  "url": "https://lite.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
  "title": "‘Not prepared to walk away’: Starmer defends premiership as UK government reels from Epstein fallout | CNN",
  "date": "2026-02-11T16:33:56.609692+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nKeir Starmerwas fighting to salvage his premiership on Monday after the resignations of key advisers and growing calls from senior Labour Party figures for the British prime minister to step down, following bitterfalloutfrom the release of the Jeffrey Epstein files.\n\nAddressing a packed room of Labour members of Parliament on Monday evening, Starmer urged his party to rally behind him, saying he had “won every fight I’ve ever been in,” the United Kingdom’s PA Media news agency reported.\n\n“After having fought so hard for the chance to change our country, I’m not prepared to walk away from my mandate and my responsibility to my country, or to plunge us into chaos as others have done,” Starmer vowed in an attempt to shore up his dwindling support, according to PA.\n\nThe meeting capped another turbulent day for the British leader.  Tim Allan, Starmer’s director of communications, said Monday that he was quitting the government. It came less than a day afterMorgan McSweeney, Starmer’s chief of staff and his closest adviser, resigned over his role in the appointment ofPeter Mandelson– a friend of Jeffrey Epstein – as Britain’s ambassador to the United States last year.\n\nAllan’s resignation adds to the sense that the scandal surrounding the Mandelson appointment cannot be contained and could spell the end of Starmer’s premiership, just 19 months after Labour swept to power in a landslide election that gave it the largest majority in Parliament this century.\n\nThat sense grew stronger after Anas Sarwar, the leader of the Scottish Labour Party, broke rank on Monday afternoon and called for Starmer to step down, becoming the first senior Labour figure to do so in public.\n\n“The distraction needs to end, and the leadership in Downing Street has to change,” Sarwar said. He said the decision to call for Starmer to go had caused him “personal hurt and pain,” but  he felt a change of direction was needed ahead of local elections in May, which have long been expected to serve as a referendum on Starmer’s leadership.\n\nThe British public soured on Starmer almost as soon as it elected him in 2024. Although Labour promised a “decade of national renewal” – which would require it to win two elections – a series of policy missteps andchurnat the top of government have driven Starmer’s approval ratings torecord lows. Labour’s woes have been to the benefit of the populist Reform UK party, which has led in the polls for more than a year.\n\nStarmer is facing his biggest crisis yet over his decision to appoint Mandelson – a veteran Labour politician – as ambassador to the US, despite his well-known friendship with Epstein, which continued after the disgraced financier’s 2008 conviction for soliciting prostitution from an underage girl. The Mandelson revelations have dominated British media for days, snowballing into one of the country’s biggest political scandals this century.\n\nStarmer fired Mandelson in September after a tranche of emails revealed uncomfortable details about his ties to Epstein. Further details of Mandelson’s connection to Epstein emerged when the US Department of Justice last month released millions of documents relating to the disgraced financier. Some of those documents appeared to show that Mandelson, while serving as Britain’s business secretary in 2009, passed Epstein market-sensitive information.\n\nHaving launched a criminal investigation into misconduct in public office, UK police searched two properties linked to Mandelson last week. CNN has been unable to reach Mandelson for comment.\n\nMeanwhile, opposition parties – and even figures inside Labour – have called on Starmer to release documents relating to his government’s decision to appoint Mandelson as ambassador to the US.\n\nIn a statement Sunday, McSweeney – a protégé of Mandelson’s – said he took “full responsibility” for advising Starmer to make the appointment.\n\n“The decision to appoint Peter Mandelson was wrong. He has damaged our party, our country and trust in politics itself,” McSweeney said, adding that he remained “fully supportive” of the prime minister.\n\nStarmer said last week that Mandelson had lied about the extent of his friendship with Epstein and that the revelations from the DOJ’s latest release of documents were “beyond infuriating.”\n\nIn a speech to his staff on Monday morning, Starmer again lambasted Mandelson, saying that his “shameful behavior” is “wholly incompatible with public service,” according to a readout from Downing Street.\n\nBut if Starmer had hoped to reassert his grip on power at the start of a new week, that grip was once again shaken by the resignation of Allan, another close ally, who joined as communications director around five months ago.\n\n“I have decided to stand down to allow a new No. 10 team to be built. I wish the PM and his team every success,” Allan said in a brief statement.\n\nStarmer now faces an uphill battle to convince his party that he remains the right person to lead the country. In a coordinated show of support Monday afternoon, members of Starmer’s cabinet took to X to argue the prime minister’s case.\n\nDavid Lammy, the deputy prime minsiter, said Starmer had won a mandate “for five years to deliver on Labour’s manifesto. … We should let nothing distract us from our mission to change Britain and we support the Prime minister in doing that.” Yvette Cooper, the foreign secretary, said Starmer’s leadership was needed “not just at home but on the global stage.”\n\nSarwar’s decision to call for Starmer to step down could embolden restive Labour lawmakers to do the same. The Scottish Labour leader said he had spoken to Starmer before calling for him to step down, “and I think it’s safe to say that he and I disagreed.”\n\n“There have been too many mistakes,” Sarwar said. “They promised they were going to be different, but too much has happened. Have there been good things? Of course, there have been many of them, but no one knows them and no one can hear them because they’re being drowned out. That’s why it cannot continue.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/02/05/politics/epstein-trump-starmer-global-controversy-analysis",
      "text": "Keir Starmer"
    },
    {
      "url": "https://cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "fallout"
    },
    {
      "url": "https://cnn.com/2026/02/08/uk/morgan-mcsweeney-resigns-mandelson-epstein-intl",
      "text": "Morgan McSweeney"
    },
    {
      "url": "https://cnn.com/2026/02/03/europe/peter-mandelson-epstein-ties-britain-intl-latam",
      "text": "Peter Mandelson"
    },
    {
      "url": "https://cnn.com/2025/09/05/uk/angela-rayner-resigns-labour-uk-deputy-prime-minister",
      "text": "churn"
    },
    {
      "url": "https://cnn.com/2025/09/30/uk/keir-starmer-labour-party-conference-intl",
      "text": "record lows"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4cfe93e0d6d4d060fbe0e6ff192f40b13578df7c2a6ce91f6db85a4eff2b87c1",
  "scraped_at": "2026-02-11T16:33:56.609704+00:00"
}