{
  "url": "https://lite.cnn.com/2026/02/23/americas/how-mexico-hunted-el-mencho-latam-intl",
  "title": "How Mexico hunted ‘El Mencho’ with help from his lover’s ‘trusted man’ and US intelligence | CNN",
  "date": "2026-02-24T07:31:02.451565+00:00",
  "authors": [
    "Mitchell McCluskey",
    "Gonzalo Zegarra",
    "Avery Schmitz",
    "Sol Amaya",
    "Mauricio Torres",
    "CNN"
  ],
  "text": "Source: CNN\n\nMexican security forces killed the country’s most-wanted cartel leader Nemesio “El Mencho” Oseguera Cervantes in a high-stakes operation on Sunday that set off a spiral of violence and chaos.\n\nOseguera was theleader and co-founderof the powerful Jalisco New Generation Cartel, a criminal group that hasrapidly expandedits influence in recent years, becoming one of the main traffickers of methamphetamine and fentanyl into the US.\n\nThe attack comes at a pivotal moment for Mexico, as President Claudia Sheinbaum faces increasing pressure from her US counterpart Donald Trump to clamp down on drug trafficking.\n\nIt also comes just months before the Mexican city of Guadalajara – which wasrocked by violencefollowing the drug lord’s capture – is set to host four group-stage matches of the 2026 FIFA World Cup.\n\nAfter years of pursuing Oseguera, Mexican forces on February 20 received a concrete tip about the feared cartel leader’s whereabouts.\n\nTheir investigation into Oseguera’s network had led them to a key person who could help access his hideout – a “trusted man” of one of Oseguera’s lovers, according to Mexican Defense Secretary Ricardo Trevilla Trejo.\n\nThe following day, the lover left Oseguera’s cabin complex on the outskirts of Tapalpa, but the drug lord remained at the hideout with his security detail.\n\nMexican special forces operatives and the National Guard’s Special Immediate Reaction Force then swooped into action, putting together a plan and launching a raid within the next 24 hours.\n\nTo avoid arousing suspicion, the mission was primarily carried out by ground forces with limited air support from helicopters, Trevilla said.\n\nSeveral Mexican army units were present in central Tapalpa on Sunday morning, according to CNN’s analysis of social media video.\n\nSheinbaum said the US shared intelligence that aided the operation but did not provide ground forces.\n\nThe Mexican troops established a perimeter around the complex and then closed in. As they did so, they came under fire from Oseguera’s lieutenants.\n\nUsing eyewitness video captured during the operation, CNN pinpointed El Mencho’s likely location in a wooded area which shelters several small, gated compounds just over three miles southwest of Tapalpa. The site, a vacation rental known as Cabañas La Loma, is near the Tapalpa Country Club down a long, remote driveway.\n\nCabañas La Loma was sanctioned by the US Treasury in 2015 and again in 2017 for providing “material assistance to the drug trafficking activities of (the Jalisco cartel).”\n\nEyewitness footage, first geolocated by online researcher Halipon and verified by CNN, shows dozens of uniformed people and armored vehicles advancing up a slope toward the site.\n\nIn other footage, filmed farther down the driveway, automatic gunfire can be heard, while a third video taken at the same time shows thick black smoke emanating from the site.\n\nThe exchange of fire killed eight cartel members and wounded two soldiers, Trevilla said.\n\nOseguera and several of his deputies then fled to a wooded area nearby, leaving behind a group “with a large quantity of weapons” who continued to fight.\n\nWhile some of the Mexican troops stayed to engage the group at the cabin, a team of Special Forces personnel split off in pursuit of Oseguera, who they found hiding in an area of forest undergrowth.\n\nAfter a further firefight, the Special Forces team captured the cartel leader and two of his bodyguards. All three had been seriously wounded, and it was determined that they would need to be evacuated if they were to survive, Trevilla said.\n\nAlong with a wounded soldier, the three cartel members were put on a helicopter that was supposed to take them to a hospital in the nearby city of Guadalajara.\n\nHowever, when all three died during the flight, authorities decided to reroute, fearing a violent response in Guadalajara, where the cartel has a large presence. The helicopter was then diverted to Morelia International Airport, where an Air Force plane was waiting to take them to Mexico City.\n\nThe news of Oseguera’s death plunged large swaths of Mexico into a state of chaos as cartel forces carried out a frenzy of retaliatory violence.\n\nGangs set up fiery blockades on the streets and engaged in shootouts with the military.\n\nAirlines suspended their flights to the region, and the US urged its nationals to shelter in place during the disorder.\n\nAmid the chaos, 25 members of the National Guard military police were killed.\n\nOn Monday, Sheinbaum made a plea for peace and tried to reassure her people.\n\n“The most important thing right now is to guarantee peace and security for the entire population of all of Mexico. And that is what is being done,” she said. “People can be assured that peace, security, and normalcy are being maintained in the country.”\n\nThe operation comes at a consequential time for Mexico. With Trumpthreateningcross-border intervention, Sheinbaum will have been keen to show she is clamping down hard on the drug gangs.\n\nHowever, it also represents a calculated risk, given the proximity of the World Cup to the cartel-fueled violence the drug lord’s death has unleashed. Guadalajara will be hosting matches this summer, in what’s expected to be an economic boon for the state of Jalisco, and Sheinbaum will no doubt be wary of scaring off would-be tourists.\n\nIt may be that the opportunity to capture Oseguera – a man who the US has classified as a Specially Designated Global Terrorist with a $15 million bounty on his head – was simply too good to pass up.\n\n“It seems to me that the Mexican state made a calculation where the numbers worked out in its favor; there wasn’t a better opportunity to capture him,” Armando Vargas, a security program coordinator at the think tank México Evalúa, told CNN.\n\nKnowing that the retaliatory violence was likely to occur, the government determined that it had the capacity to “contain the disruption and maintain governance and restore it in a short period,” Vargas said.\n\nVargas added that the possibility of the Jalisco cartel now splintering and descending into internal fighting seemed unlikely. “Much of their leadership remains free, operating through a kind of franchise system where local bosses have autonomy in decision-making,” he said, but “despite the potential violence, I don’t foresee a short-term fragmentation of the cartel that would lead to excessively intense violence.”\n\nIndeed, Oseguera had already had to cede some organizational control over the group because he was on the run from authorities, said Gustavo López Montiel, a political science professor at the Monterrey Institute of Technology and Higher Education.\n\nChoosing to eliminate Oseguera while some of his lieutenants remain demonstrates that “this capture is obviously important, but it’s also symbolic,” López Montiel added.\n\nDavid Mora, senior analyst at the International Crisis Group, said the drug lord’s death might weaken the Jalisco cartel and open “the possibility of further violence within the group” – while also presenting other cartels with an opportunity to encroach on the Jalisco cartel’s territory.\n\nStill, as Mora pointed out, whatever the effect on the Jalisco cartel, Mexico will be hoping that one man in particular sees Oseguera’s death as a meaningful development: Donald Trump.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/el-mencho-mexico-jalisco-cartel-profile-intl-hnk",
      "text": "leader and co-founder"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/jalisco-cjng-sinaloa-mexico-cartels-war-intl-latam",
      "text": "rapidly expanded"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/mexico-kill-drug-mencho-latam-intl",
      "text": "rocked by violence"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/world/greenland-cuba-iran-trump-warning-intl",
      "text": "threatening"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/how-mexico-hunted-el-mencho-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/americas/how-mexico-hunted-el-mencho-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4d339593197a87dc8f510921371fb0b94932150d3ddbad11b1ebc5832fb434d5",
  "scraped_at": "2026-02-24T07:31:02.451579+00:00"
}