{
  "url": "https://lite.cnn.com/2026/02/20/politics/steve-bannon-jeffrey-epstein-files-maga",
  "title": "Steve Bannon pushed hard for the release of the Epstein files. Then he was in them | CNN Politics",
  "date": "2026-02-21T07:06:17.149728+00:00",
  "authors": [
    "Steve Contorno",
    "Kristen Holmes",
    "Austin Culpepper",
    "CNN"
  ],
  "text": "Source: CNN\n\nEarlier this month, as the latest disclosures inthe Epstein filesrippled through right-wing media, the conservative morning television show “American Sunrise” devoted several segments to calls for harsher consequences and sustained attention on the scandal.\n\n“We need to make an example of all of this,” co-host Emily Finn said during the February 9 broadcast on the pro-Trump cable channel Real America’s Voice. “And not just let this go and let this slip under the radar.”\n\nMoments later, the program handed off to the conservative network’s marquee show, “War Room,” hosted by Steve Bannon, President Donald Trump’s former chief strategist. Over the next two hours, Bannon ticked through topics animating his audience — from Bad Bunny’s Super Bowl performance to a contentious Republican Senate primary in Texas.\n\nHe did not mention Jeffrey Epstein.\n\nSilence has largely defined Bannon’s public posture toward Epstein since the Justice Department released records on January 30 detailinga close personal relationshipbetween the two men. In the weeks that followed, Bannon has not broached the release of the files or the frequency with which his own name appears in the newly public records, a CNN review of dozens of hours of programming found.\n\nEven when Bannon showered praise on Attorney General Pam Bondi for her combative Capitol Hill appearance earlier this month, he didn’t explicitly mention the Epstein files, the subject of many of her heated clashes with lawmakers.\n\nIt’s similar to an approach Bannononce suggested for Epsteinas allegations about the financier’s sex crimes resurfaced. In February 2019, Epstein said in a text message he would like “true facts out.” Bannon replied, “you should just want this to go away.”\n\nAs Epstein contemplated responding to some of the coverage, Bannon was blunt. “Have you lost your f**king mind,” he wrote, “the moment you say ANYTHING this is global story #1!!!!!”\n\nBannon did not respond to CNN’s request for comment. Ina statementto The New York Times, Bannon said he was working on a documentary film about Epstein and “that’s the only lens through which these private communications should be viewed.” Bannon told the newspaper he captured 50 hours of footage of Epstein, and that the film would expose Epstein and “destroy the very myths he created.” Last month, the Department of Justice released two hours of Bannon interviewing Epstein.\n\nAs a leading voice in the GOP’s conspiratorial flank, Bannon has long trained his audience to distrust convenient explanations. Since its inception in 2019, his podcast has served as a platform for guests to push unproven theoriesabout election fraudand other topics. Until recently, a placard bearing one of his favorite sayings sat over his shoulder during broadcasts: “There are NO conspiracies but there are NO coincidences.”\n\nNow, some longtime allies are pressing him for answers.\n\nLaura Loomer, a Trump loyalist with a large online following, told CNN that Bannon should be “100% forthcoming” about his ties to Epstein. Trump’s former national security adviser Michael Flynn, another far-right figure,wrote on Xthat an explanation was overdue, a remark that came in response to the release of a 2018 text to Epstein in whichBannon suggested that the 25th Amendment could be invoked against Trumpto remove him from office.\n\nFormer Rep. Marjorie Taylor Greene, once a regular guest on “War Room,” wrote on X that her concerns extended beyond Bannon’s discussions with Epstein about Trump.\n\n“There is no excuse for having such a friendly relationship with Epstein, post conviction,” shewrote, referring to Epstein’s 2008 guilty plea to two state prostitution charges, one involving a minor. “None.”\n\nBut while the MAGA movement has spent years fixated on exposing Epstein’s network, there are so far few signs one of its most influential voices faces significant fallout. Bannon’s show has continued on Real America’s Voice without interruption, and high-profile guests have appeared even after his communications with Epstein were released, including Alabama Sen. Tommy Tuberville, White House trade adviser Peter Navarro, Texas Attorney General Ken Paxton and the chairman of the Virginia GOP, among many others.\n\nOne Trump administration official told CNN that Bannon’s audience was so big, he would likely survive.\n\nThe absence of Epstein discussion on “War Room” marks a stark programming shift from last year, when it served as a recurring source of intrigue for Bannon and his guests. Dozens of these clips wereposted to the War Room X account.\n\n“Democrats know Epstein’s black book is a ticking time bomb. That’s why they’ve switched their focus to affordability,” said oneJuly War Room post with a video of Bannon viewed 1.4 million times.\n\nHis podcast regularly amplified calls to release investigative records related to Epstein, who was arrested in July 2019 on charges he sex trafficked minors, and helped fuel a pressure campaign that culminated in Trump signing legislation to make additional files public.\n\n“Epstein is a key that picks the lock on so many things,” Bannon tolda July gathering of young conservativeshosted by Turning Point USA. “Not just individuals, but also institutions, intelligence institutions, foreign governments.”\n\nTurning Point USA spokesman Andrew Kolvet declined to comment when asked if Bannon would be invited to the organization’s future events, but he notably appeared on “War Room” earlier this month.\n\nWhat Bannon didn’t disclose in that July speech or others was his own conversations with Epstein — which included private discussions about reshaping global politics. In their exchanges, Bannon described plans to“take down” Pope Francisand sought Epstein’s help in advancing populist movements in Europe.\n\nEpstein at one pointwarns Bannon about potential headwinds he facessidestepping federal rules about representing foreign governments andlater suggests a media platform would avoid the scrutinya nonprofit or new political party might receive. The next year, Bannon launched his podcast.\n\nLoomer called it “a bit hypocritical” for Bannon to bang the drum for releasing the Epstein files without mentioning their shared history. Comedian Tim Dillon,who previously interviewed Bannon on his own popular podcast, recently said he would’ve asked about Epstein had he known about their relationship.\n\n“That’s uncomfortable,” Dillon said on “The Young Turks,” a progressive web show. “I guess for whatever reason, Bannon thought there was value in a relationship with a guy like Jeffrey Epstein, and that’s something he’s going to have to answer.”\n\nBannon, though, has so far offered little public explanation of how he first came to know Epstein or why he shared sensitive information with the disgraced felon in hundreds of text messages and emails.\n\nTheir exchanges include shared grievances about Trump — who dismissed Bannon as White House senior adviser in 2017 andonce counted Epstein among his friendsbefore a falling out in the mid-2000s. In August 2018,the two discussedthe need for an intervention for Trump and the potential liabilities the president faced in his mounting legal entanglements. Bannononce shared an article titled, “How close is Donald Trump to a psychiatric breakdown,” which Epstein then circulated to other close confidantes. In an exchange with Epstein, Bannon referred to Trump and his inner circle as “transitory figures” while suggesting he was the “center of gravity of this movement.”\n\nWhen Bannon launched a fundraising campaign to raise money for a wall at the US southern border, he told Epstein he needed to tread carefully. “can’t seem like I’m running (sic) trumps nose in his own incompetence,”he wrote. Federal prosecutors would later charge Bannon with defrauding donors, butthe case against him disappeared when Trump pardoned himbefore leaving office in 2021.\n\nThese messages have fueled private speculation within the president’s orbit about Bannon’s future in MAGA and his relationship with Trump. White House officials have often sought to keep Bannon at arm’s length and out of the president’s ear, but the two have managed to maintain a relationship.\n\n“He has a lot to answer for,” a Trump ally told CNN.\n\nAnother Trump adviser expected the controversy to follow Bannon as he navigates his role in the MAGA movement beyond 2028. While Bannon hasled calls for Trump to run for a third term, his own political aspirations — including long-rumored presidential ambitions — remain a source of intrigue in Washington.\n\n“He has zero chance now,” the adviser said. “It’s so sketchy.”\n\nIn 2019, texts between the two men turn toward an emerging issue for Epstein: an intensifying national focus on allegations that he had trafficked girls resurfaced in a Miami Herald series. In dozens of messages, Bannonadvises Epsteinon how to navigate the fallout,writing in April 2019: “first we need to push back on the lies; then crush the pedo/trafficking narrative ; then rebuild your image as philanthropist.”\n\nWhen federal prosecutors rejected a push by Epstein’s alleged victims to throw out his 2008 plea deal, Bannon appeared elated at the news.\n\n“Dude!!!!! Is this real,”he texted Epstein. “Tell me this is real.”\n\nBannon has not publicly addressed these messages, but he told the Times he was “a documentary filmmaker working, over a period of time, to secure 50 hours of interviews from a reclusive subject.” Their final correspondences include ongoing efforts to carve out time for Bannon and his crew to film Epstein.\n\nTom Fitton, the head of the conservative group Judicial Watch, said he was unaware of Bannon’s extensive history with Epstein when he appeared on the “War Room” podcast last year to share updates on his legal fight to force the release of the Epstein Files.\n\nFitton told CNN he watched footage of Bannon’s interview with Epstein and was left wondering why any public figure would seek out his company.\n\n“Epstein seemed like a sociopath to me,” said Fitton. “I don’t know how Bannon was able to keep on communications with him even for the reasons he says he was doing that.”\n\nOn “American Sunrise,” though, anticipation for an Epstein film from Bannon is already building.\n\n“War Room will be up next,” co-host Gina Loudon said at the end of Tuesday’s show. “How about when that Bannon documentary on Epstein comes out? That should be interesting.”\n\nBannon did not mention it during his broadcast.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/jeffrey-epstein-files-release-doj",
      "text": "the Epstein files"
    },
    {
      "url": "https://rumble.com/v75idw0-war-room-with-steve-bannon-am-edition.html?e9s=src_v1_cbl%2Csrc_v1_upp_l",
      "text": "War Room"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/steve-bannon-jeffrey-epstein-global-populism",
      "text": "a close personal relationship"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01616057.pdf",
      "text": "once suggested for Epstein"
    },
    {
      "url": "https://www.nytimes.com/2026/02/16/us/politics/jeffrey-epstein-steve-bannon.html",
      "text": "a statement"
    },
    {
      "url": "https://www.cnn.com/2021/11/07/politics/bannon-podcast-war-room-election-lies",
      "text": "about election fraud"
    },
    {
      "url": "https://x.com/GenFlynn/status/2023244842524917762",
      "text": "wrote on X"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615544.pdf",
      "text": "Bannon suggested that the 25th Amendment could be invoked against Trump"
    },
    {
      "url": "https://x.com/fmrrepmtg/status/2023368591710757166?s=12&t=eyFgGC7EnMhSDs2aBbaNHQ",
      "text": "wrote"
    },
    {
      "url": "https://x.com/search?q=epstein%20(from%3ABannons_WarRoom)&src=typed_query&f=live",
      "text": "posted to the War Room X account"
    },
    {
      "url": "https://x.com/Bannons_WarRoom/status/1948754406540796157",
      "text": "July War Room post with a video of Bannon viewed 1.4 million times"
    },
    {
      "url": "https://www.c-span.org/program/public-affairs-event/steve-bannon-speaks-at-turning-point-usa-summit/662940",
      "text": "a July gathering of young conservatives"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/world/bannon-epstein-take-down-pope-francis-latam-intl",
      "text": "“take down” Pope Francis"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615455.pdf",
      "text": "warns Bannon about potential headwinds he faces"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615316.pdf",
      "text": "later suggests a media platform would avoid the scrutiny"
    },
    {
      "url": "https://open.spotify.com/episode/6fpoT7EWVzejpSlBgRHioq",
      "text": "who previously interviewed Bannon on his own popular podcast"
    },
    {
      "url": "https://www.cnn.com/2025/08/12/politics/trump-epstein-relationship-timeline-invs-vis",
      "text": "once counted Epstein among his friends"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615273.pdf",
      "text": "the two discussed"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02496013.pdf",
      "text": "once shared an article titled"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615165.pdf",
      "text": "transitory figures"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615882.pdf",
      "text": "he wrote"
    },
    {
      "url": "https://www.cnn.com/2021/01/19/politics/steve-bannon-pardoned-by-trump",
      "text": "the case against him disappeared when Trump pardoned him"
    },
    {
      "url": "https://www.cnn.com/2025/10/24/politics/video/bannon-trump-third-term-vrtc",
      "text": "led calls for Trump to run for a third term"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01620912.pdf",
      "text": "advises Epstein"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01615720.pdf",
      "text": "writing in April 2019"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01621186.pdf",
      "text": "he texted Epstein"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/steve-bannon-jeffrey-epstein-files-maga",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/steve-bannon-jeffrey-epstein-files-maga",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4db7465055a474942422ddc772ddb571af04f1335c6c7b90db54c26f869bb1b8",
  "scraped_at": "2026-02-21T07:06:17.149741+00:00"
}