{
  "url": "https://lite.cnn.com/2026/02/12/politics/gallup-presidential-tracking-poll-approval",
  "title": "Gallup ends its presidential tracking poll, the latest shift in the public opinion landscape | CNN Politics",
  "date": "2026-02-12T21:29:54.449337+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nGallup, one of the country’s most well-known polling firms, announced Wednesday that it will no longer track presidential approval or favorability of political figures. The move ends the longest-running continuous effort to track USopinion of the nation’s president, dating back to the tenure of Franklin D. Roosevelt in the late 1930s.\n\nThe company attributes the change to a shift toward research on “issues and conditions that shape people’s lives.” Gallup has some of the longest trend data in polling on public opinion about prominent issues and the nation’s mood, which it plans to continue, and says that it will no longer “publish assessments of individual political figures.”\n\nThe end of presidential approval tracking at Gallup is the latest in a long line of shifts that have remade the landscape of polling over the last few decades.\n\nSome major public pollsters,including Gallup, stepped back from conducting polling on which candidate voters prefer, sometimes referred to as horserace polling. Changes in the ways people communicate made it harder, more time-consuming and more expensive to conduct polling by telephone, long the gold-standard of survey methodology and the methodology Gallup has used for its presidential approval tracking. That’s led tomajor shifts in how public pollsters do their work.\n\nAnd long-running, prominent public polling partnerships – such as CNN’s former partnership with Gallup and USA Today, the partnership between CBS News and the New York Times, and between NBC News and the Wall Street Journal – have ended or changed.\n\nThe standard job approval question used by Gallup sincethe presidency of Harry S. Truman– “do you approve or disapprove of the way (name) is handling his job as president” – has beenadopted and carried forward by hundreds of researcherssince. CNN’smost recent tracking of pollson President Donald Trump’s approval rating includes 134 high-quality polls on that metric conducted by someone other than Gallup since the start of his second term in office.\n\nTrump’s current average approval rating in the CNN Poll of Polls stands at 39% approve to 59% disapprove, similar to Gallup’s final measure in December 2025, which found 36% of Americans approving of Trump with 59% disapproving.\n\nCNN’s Ariel Edwards-Levy contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/polling/approval/trump-polls",
      "text": "opinion of the nation’s president"
    },
    {
      "url": "https://www.politico.com/story/2015/10/gallup-poll-2016-pollsters-214493",
      "text": "including Gallup"
    },
    {
      "url": "https://www.pewresearch.org/methods/2023/04/19/how-public-polling-has-changed-in-the-21st-century/",
      "text": "major shifts in how public pollsters do their work"
    },
    {
      "url": "https://news.gallup.com/interactives/507569/presidential-job-approval-center.aspx",
      "text": "the presidency of Harry S. Truman"
    },
    {
      "url": "https://ropercenter.cornell.edu/presidential-approval/",
      "text": "adopted and carried forward by hundreds of researchers"
    },
    {
      "url": "https://www.cnn.com/polling/approval/trump-polls",
      "text": "most recent tracking of polls"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/gallup-presidential-tracking-poll-approval",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/gallup-presidential-tracking-poll-approval",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4ebd303048d375afdf0133789c63c1e398aa05d8900923334e7026d71213d7d6",
  "scraped_at": "2026-02-12T21:29:54.449352+00:00"
}