{
  "url": "https://lite.cnn.com/2026/02/27/uk/britain-starmer-labour-defeat-hnk-intl",
  "title": "British prime minister suffers embarrassing election defeat in stronghold to Green Party | CNN",
  "date": "2026-02-27T07:15:00.021174+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nPrime Minister Keir Starmer’s Labour Party suffered an embarrassing election defeat on Friday in an area of Greater Manchester that it had dominated for almost a century, a loss that underscores the breakdown of Britain’s two-party politics.\n\nThe loss of one of Labour’s safest seats, in the biggest electoral test inalmost a year, puts further pressure on Starmer to prove that he should keep his job following weeks of political turmoil and calls for him to resign.\n\nThe left-wing Green Party’s Hannah Spencer won the contest for the vacant parliamentary seat of Gorton and Denton, with Nigel Farage’s anti-immigration Reform UK party coming second, and Labour pushed into third place.\n\nThe result was “clearly disappointing,” said Labour party chair Anna Turley.\n\nStarmer had staked his personal authority on Labour winning the seat byblocking one of his rivals, the popular Manchester mayor Andy Burnham, from standing, and by visiting the constituency this week when British leaders normally avoid campaigning in local areas if they risk losing.\n\nThe defeat comes after Starmer faced the most dangerous moment of his premiership this month when some of his lawmakers said heshould resignover his decision to appoint Labour veteran Peter Mandelson as ambassador to Washington, despite his links to the late sex offender Jeffrey Epstein.\n\nLabour won just over half the vote in Gorton and Denton at the last general election in 2024. But Starmer’s unpopularity, sluggish economic growth and a series ofscandalsand policy U-turns contributed to a deep fall in the party’s support.\n\nThe Green Party won 40.7% of the vote on Friday in an election triggered when a member of parliamentresignedfor health reasons. Nigel Farage’s Reform Party came second with 28.7% of the votes and Labour finished third with 25.4%.\n\nStarmer was unlikely to face an immediate threat to his position if he lost, Labour lawmakers said before the vote.\n\nBut he could be challenged after May elections, they added, when Labour is expected to fare badly in local and regional polls, including for the parliaments in Wales and Scotland.\n\nIt was the first time the Green Party, which supports leaving NATO and legalizing recreational drugs, had won a one-off election for a seat in parliament or one in the north of England.\n\nThat takes the party’s total number of seats in the House of Commons to five out of 650.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.reutersconnect.com/all?search=all%3AL1N3RA04R&linkedFromStory=true",
      "text": "almost a year"
    },
    {
      "url": "https://www.reutersconnect.com/all?search=all%3AL1N3YQ02Q&linkedFromStory=true",
      "text": "blocking one of his rivals"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "should resign"
    },
    {
      "url": "https://www.reutersconnect.com/all?search=all%3AL1N3Z402Z&linkedFromStory=true",
      "text": "scandals"
    },
    {
      "url": "https://www.reutersconnect.com/all?search=all%3AS8N3XT0BK&linkedFromStory=true",
      "text": "resigned"
    }
  ],
  "hash": "4ee5c25cd5769cc46416df97c9bb7f0c557ed78f9e9a94859c072e66a42525c9",
  "scraped_at": "2026-02-27T07:15:00.021187+00:00"
}