{
  "url": "https://lite.cnn.com/2026/02/17/us/kilmar-abrego-garcia-detention-deportation",
  "title": "Kilmar Abrego Garcia: Immigration authorities cant take the Maryland man back into custody, federal judge rules | CNN",
  "date": "2026-02-19T07:32:30.798732+00:00",
  "authors": [
    "Devan Cole, CNN"
  ],
  "text": "Source: CNN\n\nKilmar Abrego Garcia cannot be re-detained by Immigration and Customs Enforcement officials, a federal judge ruled Tuesday, dealing the Trump administration another blow in its effort to keep him locked up while it attempts to deport him again.\n\nTheinjunctionissued by US District Judge Paula Xinis, of the federal court in Greenbelt, Maryland, follows anemergency order she handed down in Decemberthat similarly blocked officials from taking Abrego Garcia into immigration custody. But unlike the earlier ruling, the government can appeal the new one up to a Richmond, Virginia-based federal appeals court.\n\nTuesday’s decision is the latest judicial rebuke of the government’s maneuvering in Abrego Garcia’s case, which has come to symbolize the administration’s hardline — and, at times, slapdash — approach to immigration enforcement. Abrego Garcia was unlawfully deported to El Salvador last year and, following a series of court rulings, brought back to the US to face federal human smuggling charges in Tennessee.\n\nAfter the judge overseeing his criminal case agreed to let him remain free ahead of trial, immigration officials took Abrego Garcia into custody and scrambled to find a country where they could deport him. Their bid to send him to several different African nations has so far ended in failure. Because of that, Xinis concluded, there was no lawful basis to keep him in immigration custody in the meantime.\n\n“The court easily concludes that there is no ‘good reason to believe’ removal is likely in the reasonably foreseeable future,” she wrote in the 10-page decision. Federal officials, Xinis continued, “have done nothing to show that Abrego Garcia’s continued detention in ICE custody is consistent with due process.”\n\nThough Abrego Garcia has for months said he would prefer to be sent to Costa Rica, where officials previously said they would give him some form of legal status, the Trump administration has given no support for that desire, mystifying both his attorneys and Xinis.\n\n“In her decision today, she recognized that if the government were truly trying to remove Mr. Abrego Garcia from the United States, they would have sent him to Costa Rica long before today,” said Simon Sandoval-Moshenberg, a lawyer for Abrego Garcia. “Instead, they’re flailing about trying to deport him to Africa – why? It’s clear that the only reason is to punish him for having the courage to stand up for his rights.”\n\nSince he was first released from immigration custody in December, Abrego Garcia has been living in Maryland under the strict pre-trial release conditions imposed on him by the judge in Tennessee. Those conditions include being under the custody of his brother and not being able to travel outside of Maryland without permission from the Tennessee court.\n\nHe also cannot leave his residence except to go to work, attend religious services, see a medical professional or attend court proceedings.\n\nThe legal saga surrounding Abrego Garcia first kicked off last March, when he was deported to a mega-prison in El Salvador in violation of a prior court order that expressly prohibited officials from sending him back to his home country because he feared gang violence there.\n\nA web of court rulings that followed repeatedly found in his favor, infuriating Trump administration officials, who, for months, resisted bringing him back to the US. He was finally returned in early June.\n\nMeanwhile, the legitimacy of his criminal case in Tennessee faces a major test next week as the federal judge overseeing his trial hears arguments over Abrego Garcia’s claim that he’s being unfairly targeted. The judge has already indicated throughseveral rulingsthat he’s sympathetic to those arguments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://storage.courtlistener.com/recap/gov.uscourts.mdd.589189/gov.uscourts.mdd.589189.141.0.pdf",
      "text": "injunction"
    },
    {
      "url": "https://www.cnn.com/2025/12/12/politics/kilmar-abrego-garcia-judge-order-custody",
      "text": "emergency order she handed down in December"
    },
    {
      "url": "https://www.cnn.com/2025/12/30/politics/kilmar-abrego-garcia-blanche-justice-department-kentucky",
      "text": "several rulings"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/kilmar-abrego-garcia-detention-deportation",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/kilmar-abrego-garcia-detention-deportation",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4fd9455b8353294ad0ca5817b9825259e3361681419e416b368ff0f63f2f8235",
  "scraped_at": "2026-02-19T07:32:30.798746+00:00"
}