{
  "url": "https://lite.cnn.com/2026/02/12/us/new-york-acid-attack-arrest",
  "title": "Terrell Campbell charged in 2021 acid attack on New York student Nafiah Ikram | CNN",
  "date": "2026-02-12T21:30:00.584325+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nNafiah Ikram was in the driveway of her home on New York’s Long Island one evening when she felt someone rush up behind her. A liquid splashed her in the face.\n\nShe screamed for her father.\n\n“I started … panicking. I was like, ‘Dad, someone threw something in my face!’Ikram saidfollowing the attack in Elmont, New York. “And he was like, ‘Oh my God, it’s acid.’ ”\n\nIt was March 17, 2021. The sulfuric acid scorched Ikram’s face, neck and chest, and permanently blinded her right eye, requiring numerous surgeries and reconstructive grafts.\n\nFor nearly five years, as she navigated the physical and emotional aftermath of the surprise attack, the case went unsolved. Her mysterious assailant, who fled in a red Nissan Altima, remained unknown.\n\nBut for Ikram and her family, the case this week took a welcome turn. Prosecutors on Tuesdaychargeda 29-year-old Brooklyn man, Terrell Campbell, with assault, criminal possession of a weapon and unlawful possession of noxious material. He pleaded not guilty and is being held without bail.\n\nTwo years after the incident, investigators said, the aspiring hip-hop artist posted a song to YouTube in which he boasted about an acid attack. One line goes, ‘On the street in the night like a hitman assassin, trying to run up and have your face burned in acid.”\n\nNassau County District Attorney Anne T. Donnelly described the song as “cruel and brazen,” and an attempt to further Campbell’s music career.\n\n“It’s sickening,” Donnelly told reporters Tuesday. “He bragged on the internet for everyone to see. He thought after several years without an arrest that he was home free.”\n\nCampbell’s attorney, Gregory Zak, declined to comment when contacted by CNN.\n\nAfter almost five years of living in fear, Ikram said the arrest has brought her some relief.\n\n“I’m glad that I’ve closed the chapter on the uncertainty and thesafety and the looking over the shoulder,” she told CNN affiliateNews 12 Long Island.\n\nIkram was 21 and a student at Hofstra University when the attack happened. She’d just returned home from her job at a local pharmacy and was gathering items from her car before going inside.\n\nInvestigators at the time said her attacker was wearing a black hooded sweatshirt and gloves.\n\nA nearby surveillance camera captured grainy video of the attack, but the assailant appeared mostly as a blur as he rushed up behind her, then fled into the night.\n\nThe attack stunned the suburban New York neighborhood and drew widespread attention. “Top Chef” host Padma Lakshmi, a friend of Ikram’s family, went on Instagram andurged peopleto share relevant information with police.\n\nIkram suffered first- and second-degree burns to her face, right eye, arms and throat. The injury to her throat was so severe she must undergo repeated operations to remove scar tissue, Donnelly said.\n\n“She survived the attack, but that was just the beginning of a painful journey for a beautiful young woman … for the past five years, she endured this unimaginable pain. She has also lived with two heartbreaking questions — who and why?” Donnelly added.\n\n“Today, I am proud that we are finally able to answer one of those questions…” she said. “As for the why, our investigation continues and we cannot provide any additional details at this time.”\n\nDespite her life-altering injuries, Ikram said she remains positive.\n\n“I’ve realized just being a good person and being true to who I am no matter what, is where Terrell lost and where his downfall was,” she told News 12 Long Island, “because I refuse to lose my morals and my humanity no matter what happens to me.”\n\nNassau County Police said the big break in the case came from a tip about a possible suspect from someone who’ll receive a $50,000 Crime Stoppers reward. Investigators declined to provide additional information about the tipster’s identity.\n\nAfter investigators identified Campbell, they worked with the New York Police Department to determine his address and found a red Nissan Altima parked outside, Donnelly said.\n\n“We later learned that he had regular use of a red 2015 NissanAltima back in 2021 that was registered to a family member,” Donnelly said. “As we continued our investigation, we reviewed Campbell’s internet search history. In the minutes following the 2021 attack, we found searches asking, ‘how do I remove sulfuric acid from my car’s fabric?’”\n\nThe district attorney’s office also discovered Campbell had posted a music video to his song, “Obsidian,” in October 2023 under the name YungBasedPrince. The song’s lyrics fit the narrative of the crime, Donnelly said.\n\n“Two years after he ambushed Nafiah and left her screaming in pain on her front lawn, he actually produced and uploaded a music video to YouTube boasting about throwing acid in a woman’s face … A harrowing attack boiled down to some lyrics to get him attention,” she said.\n\nAuthorities said they’re working to determine a motive for the attack but declined to provide additional details. They’re also looking into the possibility that someone paid Campbell to do it, Donnelly said.\n\nIkram said Campbell is a stranger to her and that the reason behind his alleged involvement is a mystery.\n\n“I hope that things come to light … the fact that I don’t even know this individual makes me question who else could possibly be involved?” she told the CNN affiliate.\n\nCampbell worked in flower delivery, his attorney told News 12 Long Island. His next court hearing is February 18.\n\nUS Congresswoman Laura Gillen, who represents the part of Long Island where Ikram lived, welcomed the arrest. “For years, her attacker remained at large, posing a continued threat to our communities and denying the Ikram family the justice they deserve …,” she said in a statement.\n\n“I’m relieved to see that an arrest has been made in the case. Now, Nafiah and her family are one step closer to receiving the justice and closure they deserve.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2021/04/22/us/new-york-long-island-acid-attack-college-student-trnd",
      "text": "Ikram said"
    },
    {
      "url": "https://nassauda.org/m/newsflash/Home/Detail/1925",
      "text": "charged"
    },
    {
      "url": "https://longisland.news12.com/law-enforcement-source-arrest-made-in-2021-elmont-acid-attack",
      "text": "News 12 Long Island."
    },
    {
      "url": "https://www.cnn.com/2021/04/22/us/new-york-long-island-acid-attack-college-student-trnd",
      "text": "urged people"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/us/new-york-acid-attack-arrest",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/us/new-york-acid-attack-arrest",
      "text": "Cookie Settings"
    }
  ],
  "hash": "4fd9e861649c11dff46a87b3e50028e14eb8e01b9962d9af16c8284e2086255f",
  "scraped_at": "2026-02-12T21:30:00.584339+00:00"
}