{
  "url": "https://lite.cnn.com/2026/02/27/europe/us-envoy-kushner-diplomacy-stuns-france-intl",
  "title": "Charles Kushner: How US envoy’s ‘incomprehension’ of diplomacy stunned France | CNN",
  "date": "2026-03-01T07:08:21.798285+00:00",
  "authors": [
    "Melissa Bell"
  ],
  "text": "Source: CNN\n\nAs far as the French are concerned, the case is now closed. The US ambassador to Paris, Charles Kushner’s access to the French government has been restored, allowing him to resume his diplomatic duties. But the row that briefly threatened to derail the Franco-US friendship in the year of its 250th anniversary illustrates a deeper problem now facing Europe as it tackles increasingly open US interference in its internal political affairs.\n\nFrance’s foreign ministersummoned Kushner this weekafter the embassy reposted comments from the US State Department saying the recent killing of afar-right activistin France showed that “violent radical extremism is on the rise,” then briefly blocked him from speaking to government ministers when he failed to show up.\n\nFrench President Emmanuel Macron called for calm ahead of a rally held on Saturday by far-right groups in memory of Quentin Deranque, the 23-year-old far-right activist whose killing earlier this month at a demonstration in Lyon had deepened political polarization ahead of next month’s municipal elections.\n\nFrench Foreign Ministry spokesperson Pascal Confavreux said the US ambassador had now provided assurances he had not meant to interfere in “the internal sphere of France.” As to Kushner’s initial no-show when summoned, Confavreux made allowances for the American real-estate magnate, who only took up his functions as ambassador to Paris in July, being relatively new to the more genteel world of diplomacy.\n\n“To summon an ambassador is completely part and parcel of diplomatic grammar. And so sometimes when you have ambassadors who are not career diplomats, it can lead to some incomprehension,” he said of the father of US President Donald Trump’s son-in-law Jared Kushner.\n\nYet beyond the ruffling of French feathers by a lack of diplomatic niceties lies the deeper question of how to handle increasingly obvious American attempts to interfere in European domestic matters – often using the very public platform X.\n\nThe US Ambassador to Poland Tom Rose recently posted that he was cutting off ties with the leader of the lower house of parliament after he spoke out against giving President Donald Trump the Nobel Peace Prize.\n\nIn Belgium, Ambassador Bill White has repeatedly weighed into an ongoing judicial investigation intocircumcision practicesin Antwerp’s orthodox Jewish community. Most recently, he posted on X that “the case should be immediately dropped,” although unlike Kushner, White did at least turn up at the country’s foreign ministry when summoned.\n\nAll three cases demonstrate at once a break with traditional diplomatic form, the use of social media rather than back channels, and a new willingness on the part of Washington to involve itself more aggressively in the judicial or political processes of other countries, and specifically European ones.\n\nThat, says Pierre Vimont, a former French ambassador to Washington, requires a new kind of vigilance from the Europeans. “American foreign policy has a very strong ideological content nowadays, and I think this is what needs to be handled very carefully,” he told CNN. “Interference in domestic politics is not the way diplomacy should unfold. I think it must be put very strongly to the American side that this is not what diplomacy is all about.”\n\nAs to why Europe appears to be a particular target for the American administration, Vimont also blames the ideology of the current American administration. “In theory, we share a common vision of what democracy is all about, democratic rules, free speech, the independence of the judiciary, and so on and so forth,” he said. “And we are witnessing slowly a split between our values and the way the MAGA movement and the current US administration see those same values.”\n\nWhich hints at why French Foreign Minister Jean-Noël Barrot reacted as furiously as he did when the US State Department initially weighed into the controversy over Deranque’s death, telling French media that the tragedy should not be exploited for political ends. France, he said, had “no lessons to learn from the reactionary international movement,” when it came to ideological violence.\n\nThe next step will be for Kushner and Barrot to meet in person, which the ministry spokesman expects to happen within the next few days. The truth is that no one wanted a diplomatic rupture in this of all years. In June the G7 summit of leading economic countries, which is to be held in Evian in France, was even moved to allow for Trump’s birthday; it will now start on June 15, rather than the day before, as originally planned. This year also marks the 250th anniversary of what Washington describes as its oldest alliance, with a series of events planned on both sides of the Atlantic.\n\n“I know it’s a very important date for the US, also for us.  And so there are ups and downs in such a relationship. We are allies, even if we are not aligned, which is also something that helps us tell the truth, or what we think is our truth, to our allies,”  Confavreux said.\n\nA point made repeatedly in recent months by representatives of the US: that friendship should allow for truth to be spoken to allies. The question is how diplomatically each truth can be told.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/22/europe/france-bans-us-ambassador-deranque-death-latam-intl",
      "text": "summoned Kushner this week"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/world/quentin-deranque-death-france-intl",
      "text": "far-right activist"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/europe/us-ambassadors-antagonism-europe-intl",
      "text": "circumcision practices"
    }
  ],
  "hash": "5031af33783c5ef2dcc90b2d58e025edcddd4b85177d80a01695e1a243df2047",
  "scraped_at": "2026-03-01T07:08:21.798296+00:00"
}