{
  "url": "https://lite.cnn.com/2026/02/18/europe/greece-eu-deportations-asylum-seekers-intl-latam",
  "title": "Greece working with other European countries to set up migrant deportation hubs outside EU. Here’s the latest on the plan. | CNN",
  "date": "2026-02-19T07:31:30.869954+00:00",
  "authors": [
    "Story by Associated Press"
  ],
  "text": "Source: AP\n\nGreece is working with four other European countries to set up deportation centers in third countries, most likely in Africa, for migrants whoseasylum applicationsare rejected, Greece’s migration minister said Wednesday.\n\nThanos Plevris said on Greek state broadcaster ERT television thatGreecewas working with Germany, the Netherlands, Austria and Denmark for the creation of so-called return hubs, “preferably in Africa.” Ministers from the five countries have already met to discuss the issue, and technical teams would be meeting next week, he said.\n\n“We are not speaking theoretically any more; we are speaking practically,” Plevris said. He didn’t specify which countries were being considered to host the return hubs and said the choice of the African continent was “not binding.”\n\nIt was the larger European countries that were speaking directly with the countries where the return hubs could be located, “but we are participating, too,” he added.\n\nThe use of return hubs would be for people whoseasylumapplications are rejected and whose countries of origin will not take them back, Plevris explained. He said their existence would act as a deterrent to prospective migrants who are unlikely to be granted asylum. The minister said the aim was for an initial plan to be in place in the next few months, although it wasn’t clear when any such return centers could be up and running.\n\nLocated on the southeastern fringe of Europe, Greece for decades has been one of the main entry points into the European Union for people fleeing conflict and poverty in the Middle East, Africa and Asia.\n\nTens of thousands make it into the country each year, the vast majority on dangerous sea journeys either from the Turkish coast to nearby Greek islands in the Aegean, or via a much longer Mediterranean crossing from North Africa to the southern Greek islands of Gavdos and Crete.\n\nAthens has taken an increasingly hard line in dealing with migration, and its coast guard has often been accused of carrying out so-called pushbacks: summary deportations of new arrivals without allowing them to apply for asylum. The government strenuously denies it carries out such practices.\n\nPlevris said there had been a 21% reduction in people arriving in the country illegally in 2025 compared to 2024, or 13,000 fewer arrivals last year compared to the previous year, and a 40% reduction over the last five months.\n\nLast week, European lawmakers voted to approve new immigration policies allowing nations to deny asylum and deport migrants because they either hail from a country designated safe or could apply for asylum in a country outside the 27-nation bloc.\n\nPlevris said the government was now focusing on returns of those whose asylum applications are rejected.\n\nThe country already carries out around 5,000 to 7,000 returns per year, but with around 40,000 to 50,000 new arrivals each year, roughly half of whose asylum applications are rejected. Plevris said the current rate of return is not enough.\n\nThe Greek minister said he would be traveling to Rome next week for meetings with his Italian and Spanish counterparts. He said they would also meet with “the equivalent minister” from Pakistan as part of talks with countries of origin for greater cooperation on returns.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/03/europe/italy-asylum-eu-court-ruling-intl",
      "text": "asylum applications"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/europe/greece-boat-collision-fifteen-migrants-dead-intl",
      "text": "Greece"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/europe/spain-legal-status-undocumented-migrants-latam-intl",
      "text": "asylum"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/europe/greece-eu-deportations-asylum-seekers-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/europe/greece-eu-deportations-asylum-seekers-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "506fda49dd7a3ad1c6c5b97a5212a2f63911614afe8e3b47b6cd037e0ca17654",
  "scraped_at": "2026-02-19T07:31:30.869967+00:00"
}