{
  "url": "https://lite.cnn.com/2026/02/15/us/ice-shooting-dhs-doj-false-statements",
  "title": "How the case against a Venezuelan man who was shot by an ICE agent fell apart | CNN",
  "date": "2026-02-16T07:34:38.550243+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAlfredo Alejandro Aljorna was on shift in Minneapolis on a Wednesday evening last month, making deliveries as a DoorDash driver, when he realized he was being followed by ICE agents, his attorney said.\n\nHe drove home and was tackled by an agent but broke free and ran into the house where his cousin Julio Cesar Sosa-Celis was standing, the attorney said. As he shut the door and was trying to lock it, Sosa-Celis said he was shot in the leg by an Immigration and Customs Enforcement agent.\n\nComing just seven days after a federal agent fatally shotRenee Good, the incident spawned renewed protests andheated clasheswith police. An account of the events fromthe Department of Homeland Securitysoon after the incident conflicted with the narratives from the two men and their family members.\n\nDHS claimed Sosa-Celis was driving the car and he, Aljorna and another man assaulted the agent before the agent fired his weapon.\n\nThe first inkling of the government questioning the DHS account came from the US Department of Justice. In a January 16 court filing supporting criminal charges against the two men, the DOJ asserted Aljorna was the one driving the vehicle.\n\nIn a stunning reversal, the Justice Department on Thursday filed a motion seeking to drop criminal charges against the two Venezuelan men. In it, the DOJ said federal prosecutors provided incorrect information to the court, while ICE issued a statement admitting its federal agents made “false statements” under oath.\n\nThe two federal agents involved have been placed on administrative leave while the Justice Department investigates their “untruthful statements,” which were revealed by a review of video evidence, ICE Director Todd Lyons said in a statement.\n\nThe two officers may be fired and potentially face criminal prosecution, Lyons said.\n\nDOJ’s motion cited “newly discovered evidence” contradicting statements the agency included as the basis for filing criminal charges against the men.\n\nIt’s not clear what video evidence was uncovered, described in the motion as “materially inconsistent with the allegations” from federal prosecutors in the charging document. CNN has reached out to DHS for further clarity on the evidence and whether it stands by the initial statement following the shooting but did not hear back. The DOJ declined to comment on the motion when contacted by CNN.\n\n“This was an absolute unreasonable use of force, and the officer was fabricating claims against my client to justify that,” said Aljorna’s attorney, Frederick J. Goetz.\n\nThe dismissed case fits into a larger pattern in which the federal government has been quick to release accounts after a shooting by its law enforcement agents, which were later proven to be false, misleading or incomplete, according to CNN senior legal analyst Elie Honig. Examples include video evidence after federal agents fatally shot Good andAlex Pretti, which appeared to undermine elements of the government’s accounts of what happened.\n\nSimilarly, prosecutors last year filed to drop charges againstMarimar Martinezin Chicago, who the government said rammed a federal agent’s vehicle before he shot her several times.       A judge, who noted the government’s case included omissions that caused her to tread carefully, dismissed the charges against Martinez last year.\n\nMartinez asked for evidence in the case to be released. When it was put out last week, the evidence bolstered Martinez’s account that hers was the vehicle rammed, not the agent’s. And text messages from the agent showed him bragging about the number of times he shot her. In anews release, the DHS called the shots “defensive fire.”\n\nThe shifting narratives from the federal government in the case of Sosa-Celis and Aljorna have further chipped away at the Trump administration’s credibility, as the motion to dismiss the charges with prejudice is a more dramatic admission from federal prosecutors because it indicates they put forth wrong information and means the case cannot be brought back, Honig said.\n\nLawyers for both Sosa-Celis and Aljorna commended the department’s motion, calling it “extraordinary” and “exceedingly rare” in statements to CNN.\n\nHere’s what we know about the case and how it fell apart:\n\nIn a January 15news release, DHS claimed federal agents were targeting Sosa-Celis in a traffic stop – not Aljorna – as part of an immigration enforcement operation on January 14 when he attempted to evade arrest, crashed into a parked car and tried to flee on foot.\n\nSosa-Celis allegedly began to “resist and violently assault” one of the officers and the two were in a “struggle on the ground,” then “got loose and began striking the officer with a shovel or broom stick,” at which point the officer fired a “defensive shot,” DHS said. Two other people came out of a nearby apartment and attacked the officer, the agency said.\n\nDHS Secretary Kristi Noem described the men’s actions as “an attempted murder of federal law enforcement.” The agency stood by its initial statement a few days after the shooting when contacted by CNN.\n\nOn January 16, however, the Justice Department offered an account painting a different picture of the events in a filing supporting criminal charges against Sosa-Celis and Aljorna. That document said the driver of the car was Aljorna, who prosecutors said was zigzagging through traffic while agents pursued the vehicle.\n\nAljorna, the affidavit claimed, hit a light pole before fleeing from the car, with an ICE agent chasing him on foot toward the home. Both Sosa-Celis and Aljorna were accused of hitting one of the agents with a shovel or broom before the agent pointed his weapon at the two men, causing them to run toward the home, the affidavit said.\n\nAs Sosa-Celis and Aljorna ran inside, the agent fired one round from his pistol “towards the vicinity” of the two men but at the time, the officer was “uncertain if his shot struck any of them,” the DOJ’s affidavit said.\n\nAljorna’s attorney told CNN the Trump administration’s claims his client and Sosa-Celis attacked federal agents with a broomstick or shovel “never happened.”\n\nSosa-Celis, speaking from a hospital room on a livestream video on his Facebook account, described engaging in some sort of struggle with federal agents as he was helping his cousin escape arrest and get inside their shared home.\n\nAs Aljorna was being followed in his car, the fatal shooting of Good the week prior was fresh in his mind and he was fearful, according to Goetz, his attorney. Aljorna called his family members, who told him to get home.\n\nApproaching his home, Aljorna lost control of the car due to ice on the roadway and hit a snowbank, Goetz said. Aljorna was then tackled by an ICE agent after running from the car, just 10 feet away from the door, where Sosa-Celis had walked out and called for him to get inside, the attorney said.\n\nAljorna was able to slip out of his jacket, freeing himself from the agent’s grasp, and ran to his cousin, Goetz said. They both got behind the door and closed it when a shot rang out, he added.\n\nThe accounts from the two men were reiterated by their family members in interviews and livestream videos of their 911 calls, which differed from DHS’ statement.\n\nOne of them showed a video call made by Sosa-Celis’ partner and reviewed by CNN, frantically describing to family members what she says happened, according to Alicia Celis, Sosa-Celis’ mother, who spoke to CNN.\n\nIn one video call, Sosa-Celis’ partner said, “Julio arrived first. They were chasing Alfredo – he had to jump from his car.”\n\n“He ran and they threw themselves on top of him. After, Julio threw open the door, and they shot,” she added.\n\nA different video obtained by CNN shows what was happening outside the home while the family waited inside, revealing agents approaching the home and setting off a flash-bang. Smoke can be seen, and ramming sounds are heard as someone says, “They’re in! There’s more than a dozen of them.”\n\n“He told me, ‘Mom, ICE was chasing me,” Aljorna’s mother Mabel Aljorna later said. “Once we were inside, they shot at Julio,’” she added.\n\nIn his livestream from the hospital, Sosa-Celis said, “The shot that was fired happened when my cousin managed to escape, and he entered inside. I closed the door and as I was locking it, I heard the shot, and that’s when I realized I had been shot in the leg.”\n\nSosa-Celis is “relieved that the federal criminal case is over,” his attorney Robin Wolpert said on his behalf, adding he is “determined to seek justice and hold the ICE officer accountable for his unlawful conduct.”\n\nConfrontations involving federal agents have routinely been captured on video from multiple angles, which later served to discount parts of the government’s narrative of events. Videos fromthe killing of Renee Good, a mother of three, in her vehicle, raised questions about the federal agent’s tactics and decision to use deadly force.\n\nSimilarly, footage showing federal agents killing Alex Pretti revealed the ICU nurse was holding a phone in his right hand, and an officer removing a gun from his back waistband before the shooting. The Trump administration claimed an agent “fired defensive shots” and asserted Pretti was “brandishing” a firearm.\n\n“It’s mind-boggling that DHS continues this pattern of making immediate, definitive statements about what happened that are very quickly disproved by actual evidence,” said senior CNN legal analyst Honig.\n\nJudges across the country who were appointed to the bench by presidents of both political parties have made findings on record about DHS not being forthcoming, truthful or credible, according to Honig.\n\nThe Trump administration has faced mounting credibility issues as its immigration crackdown has rolled out in blue cities nationwide. Even as several judges have acknowledged parts of its narratives may be true, others have described the government’s claims in court as “unreliable,” “untethered to the facts” and “simply not credible,”CNN previously reported.\n\nThe motion to dismiss the charges against Sosa-Celis and Aljorna with prejudice is “remarkably unusual,” said Honig. It speaks to how the government has rushed to put out possibly premature statements, which are at times incomplete or inaccurate, only later to be contradicted by emerging facts, he added.\n\nFederal prosecutors are put in a “very difficult position” when they realize later “that something they’ve said to a court is not true,” Honig said, but they nevertheless have a duty to correct the record.\n\n“While judges ordinarily give the Justice Department a lot of deference and a lot of implied credibility, that’s changing now,” he continued. “You have credibility only until you give it away.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/us/ice-shooting-minneapolis-renee-good-cell-phone-invs",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/us/minneapolis-person-shot-federal-agent",
      "text": "heated clashes"
    },
    {
      "url": "https://www.dhs.gov/news/2026/01/15/dhs-releases-more-details-about-three-violent-criminal-illegal-aliens-who-violently",
      "text": "the Department of Homeland Security"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/us/alex-pretti-shooting-trump-administration-narrative",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/us/marimar-martinez-shooting-case-what-we-know",
      "text": "Marimar Martinez"
    },
    {
      "url": "https://www.dhs.gov/news/2025/10/04/update-dhs-deploys-special-operations-after-multiple-violent-attacks-federal-law",
      "text": "news release"
    },
    {
      "url": "https://www.dhs.gov/news/2026/01/15/dhs-releases-more-details-about-three-violent-criminal-illegal-aliens-who-violently",
      "text": "news release"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/us/renee-good-shooting-incident-report",
      "text": "the killing of Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/federal-judges-trump-immigration-credibility",
      "text": "CNN previously reported."
    },
    {
      "url": "https://www.cnn.com/2026/02/15/us/ice-shooting-dhs-doj-false-statements",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/us/ice-shooting-dhs-doj-false-statements",
      "text": "Cookie Settings"
    }
  ],
  "hash": "52222a1cbe4e7d8361f9c5e467eb43f1745b64180f1424cceb3aa1b209cc3a77",
  "scraped_at": "2026-02-16T07:34:38.550257+00:00"
}