{
  "url": "https://lite.cnn.com/2026/02/18/sport/mlbpa-elects-bruce-meyer-to-be-new-executive-director",
  "title": "MLBPA elects Bruce Meyer to be new leader amid shocking upheaval at a critical time for baseball players union | CNN",
  "date": "2026-02-19T07:30:51.602477+00:00",
  "authors": [
    "Hannah Keyser, CNN"
  ],
  "text": "Source: CNN\n\nThe Major League Baseball Players Association has elected a new executive director following the sudden departure of Tony Clark, who had led the union for over a decade.\n\nBruce Meyer will serve as the sixth executive director in the history of the MLBPA, the union announced.\n\nPlayer leadership – 72 major and minor league members of the executive board – voted unanimously on Wednesday to make Meyer, previously the deputy director and lead labor negotiator, the interim executive director. Matt Nussbaum, previously the MLBPA general counsel, will serve as interim deputy executive director.\n\nMeyer, an at-times combative career litigator, was brought in from the NHL Players Association in 2018 to add muscle to a bargaining team that was viewed as having surrendered ground in the negotiations for the 2017-2021 CBA, which was almost immediately panned as a loss for the players.\n\nHe led the players in bargaining for the most recent CBA. Despite a 99-day lockout, no games were missed and the players were able to address some concerns like service-time manipulation and funneling more money to early career standouts.\n\nIn early 2024, a faction of players attempted to oust Meyer as part of an internal power struggle that followed the incorporation of minor league players into the union. The attempted coup failed and the players responsible were later voted off the executive subcommittee.\n\nMeyer was already set to lead the players’ side in the forthcoming CBA negotiations, which are expected to once again grapple with the existential question long facing baseball’s financial structure: The owners’ desire to implement a salary cap.\n\nNow he will do so as the preeminent union leader.\n\nClarkresigned abruptly this week as the executive director of the Major League Baseball Players Association after allegations of personal misconduct came to light.\n\nESPN first reported Tuesdaythat Clark’s resignation was prompted due to an inappropriate relationship with his sister-in-law, who was hired as a union employee in 2023.\n\nSources confirmed to CNN Sports on Wednesday that, after an outside firm was retained in response to federal investigations, Clark was discovered to have had an inappropriate with a subordinate who is also his sister-in-law.\n\nThe timing of the resignation shocked players and union staff. Clark was scheduled to start his annual tour of spring training camps on Tuesday. More critically, the current CBA is set tio expire on December 1 of this year, at which point it seems likely that the owners will lock out the players.\n\nClark, 53, is a former player who ascended to the union’s executive director role in 2013 following the death of Michael Weiner. But more recently, Clark’s tenure has been marred by dissent and distractions.\n\nIn 2025, it was revealed that Clark and the MLBPA were subjects of a federal investigation regarding revenue from licensing agreements. At the time, Clark and the MLBPA hired separate lawyers,according to reports.\n\nLater,ESPN reportedthat Clark was also the subject of an investigation into a youth baseball initiative by the MLBPA that appeared to be enriching executives.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/04/business/baseball-salary-cap-2027",
      "text": "Clark"
    },
    {
      "url": "https://www.espn.com/mlb/story/_/id/47954830/sources-tony-clark-resign-mlbpa-executive-director",
      "text": "ESPN first reported Tuesday"
    },
    {
      "url": "https://www.nytimes.com/athletic/6401524/2025/06/03/tony-clark-mlbpa-lawyers-federal-probe/",
      "text": "according to reports"
    },
    {
      "url": "https://www.espn.com/mlb/story/_/id/46770967/feds-probe-profit-venture-mlb-players-association-sent-millions",
      "text": "ESPN reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/sport/mlbpa-elects-bruce-meyer-to-be-new-executive-director",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/sport/mlbpa-elects-bruce-meyer-to-be-new-executive-director",
      "text": "Cookie Settings"
    }
  ],
  "hash": "526a6ac02c0770320785a25a23dcc8eae62d2bf6405c34bf04374f19d5507a79",
  "scraped_at": "2026-02-19T07:30:51.602491+00:00"
}