{
  "url": "https://lite.cnn.com/2026/02/21/australia/australia-truck-rammed-into-synagogue-intl-hnk",
  "title": "Man charged with hate crime after truck rammed into synagogue in Australia | CNN",
  "date": "2026-02-24T07:34:07.247773+00:00",
  "authors": [
    "Chris Lau, CNN"
  ],
  "text": "Source: CNN\n\nA man has been charged with committing a hate crime after a car smashed into the gates of the biggest synagogue in Brisbane, the latest of a series of attacks on Australia’s Jewish community.\n\nThe attack follows a string of assaults on Jewish people and their religious establishments in the country, as community leaders warn of a rise in antisemitism.\n\nIn December, two gunmenopened fireon families celebrating the first night of Hanukkah at Sydney’s famed Bondi Beach, killing 15 people, in the country’s worst mass shooing in almost 30 years.\n\nOn Friday evening, a black pickup truckcrashed intothe Brisbane Synagogue, knocking down its gates, before being driven away, Queensland Police said.\n\nA 32-year-old man was later taken into custody after investigators located the vehicle, they added.\n\nPolice said no one was injured.\n\nThe man is due to appear before Brisbane Magistrates Court Saturday, to face a raft of charges including wilful damage, serious vilification or hate crime, dangerous driving and possession of a dangerous drug.\n\nSeveral anti-Jewish incidents have been recorded across major Australian cities in recent years, linked in part to anger over Israel’s war in Gaza, which has killed tens of thousands of Palestinians since it was sparked by the deadly Hamas-led attacks of October 7, 2023.\n\nIsrael’s government has repeatedly criticized its counterpart in Australia for failing to address antisemitic attacks in the country.\n\nIsraeli President Isaac Herzog’s visit earlier this month following the Bondi attacksparked protestsat major Australian cities, including clashes between pro-Palestinian demonstrators with the police outside Sydney Town Hall.\n\nAfter Friday’s Brisbane attack, Queensland Premier David Crisafulli described the incident as “very concerning.”\n\n“This will be very distressing for the Jewish community in Queensland,” he wrote in a social media post, adding that he has already spoken with Jewish leaders and police.\n\n“I want to assure Queenslanders we are taking this seriously,” the premier said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/15/australia/australia-bondi-beach-shooting-victims-intl-hnk",
      "text": "opened fire"
    },
    {
      "url": "https://mypolice.qld.gov.au/news/2026/02/21/wilful-damage-brisbane-2/",
      "text": "crashed into"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/australia/australia-israel-herzog-visit-intl-hnk",
      "text": "sparked protests"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/australia/australia-truck-rammed-into-synagogue-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/australia/australia-truck-rammed-into-synagogue-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "52e53cb23a3d4963af599278d83b69c54a1c14c1fa9980d82b61e2571f2aafff",
  "scraped_at": "2026-02-24T07:34:07.247787+00:00"
}