{
  "url": "https://lite.cnn.com/2026/02/19/us/nancy-guthrie-genetic-genealogy-dna",
  "title": "Nancy Guthrie investigators turn to genetic genealogy to check for DNA match | CNN",
  "date": "2026-02-20T07:29:24.382486+00:00",
  "authors": [
    "Andy Rose, CNN"
  ],
  "text": "Source: CNN\n\nOnly a few years ago, Tuesday’s announcement that a glove believed to beconnectedto the disappearance ofNancy Guthriein Tucson, Arizona, had no match in a DNA database would have been a dead end. Now for investigators, it is just the beginning.\n\n“Investigators are currently looking into additional investigative genetic genealogy options for DNA evidence to check for matches,” the Pima County Sheriff’s DepartmentsaidTuesday.\n\nThat brings a whole new dimension to unlocking the secret of gloves found 2 miles from Guthrie’s home, said by investigators to be similar to those worn by a suspect in a disturbing video caught on a camera at Guthrie’s front door.\n\nSeparate DNAfoundat Guthrie’s property that does not match her or anyone “in close contact with her” also has not produced a match in the national law enforcement DNA database known as CODIS, Pima County Sheriff Chris NanostoldFox News Tuesday.\n\nComparing DNA collected in criminal investigations to publicly accessible databases of millions of people who have contributed genetic profiles – and thereby finding often distant relatives to piece together a family tree that can point to a suspect – has been a component of a number of recent cases, including theconvictionof Bryan Kohberger, who ultimatelyconfessedto murdering four college students in Idaho and was sentenced in life in prison.\n\n“From that, we get a list of people who share DNA with that unknown person. It can be as little as 1%, or even less,” genetic genealogy expert CeCe MooretoldCNN’s Kaitlan Collins.\n\nWhile there have been seemingly miraculous results from sifting through millions of DNA records based on a single sample, the process is still hit-or-miss and may not bring the Guthrie family the answers they want right away.\n\n“It can go as quickly as 20 minutes … and I have some cases I’ve been working on for seven-and-a-half years,” Moore said.\n\nSuccessfully using the DNA of distant family members to profile and narrow down suspects had an extraordinarily high-profile debut in 2018, when it was used to solve the cold case of theGolden State Killer.\n\nAfter authorities spent five decades fruitlessly searching for a suspect in dozens of murders and rapes across California, an investigator decided to put crime scene DNA – believed to be the perpetrator’s –into GEDmatch, a public database where people voluntarily upload their DNA data for genealogy research.\n\nIt took onlyfour monthsto identify possible relatives and narrow the search for possible suspects to just three people. One of them, former police officer Joseph DeAngelo, had been part of a task force investigating the Golden State Killer.\n\n“We collected his trash and found a piece of tissue that we tested for DNA that matched the killer from all these other locations,” lead prosecutor Thien Hotold CNNlast year.\n\nHe was 72 years old when he was caught and had never previously been a suspect.\n\nDeAngelo – now 80 years old – was convicted in 2020 and is serving a sentence of life without parole.\n\nSince then, the technology has been used to identify more than just suspects in ongoing criminal cases. Theidentityof a victim of the 1921 Tulsa Race Massacre, for example, was discovered through DNA genealogy, determining he was a veteran of World War I.\n\nIn the Kohberger case, investigatorsacknowledgedthe FBI used DNA from a a knife sheath found at the crime scene in a genetic investigation. Genetic genealogy “pointed law enforcement toward” Kohberger as a suspect, prosecutorssaid,though investigators ultimatelydid not usethat evidence to obtain the arrest warrant, saying they had enough other evidence including surveillance video and cell phone data to link him to the killings.\n\nEven in genetic genealogy’s biggest success stories, scouring DNA records narrowed down the suspects, but did not directly solve the crime. In the Golden State Killer case, once police had their eyes on DeAngelo, the definitive link was established only by following the suspect to a Hobby Lobby store, where theyswabbedhis car door handle when he wasn’t looking. Later, when rifling through his trash, a single piece of tissue proved DeAngelo’s DNA and the long-sought killer’s were one and the same.\n\nThe method of using DNA records that were primarily intended for family research and genetic curiosity as part of a criminal investigation is barely a decade old, andprivacy concernsabout how that incredibly personal information can be used are the biggest hurdles to its use.\n\nPrivacy concerns about using massive DNA databases in law enforcement investigations continue – especially for services that exist mostly to satisfy people’s personal curiosity about their heritage. The three largest commercial providers of DNA products –23andMe, AncestryDNA and MyHeritage – generallyprohibitlaw enforcement access to their genetic data and would release it only if compelled by a warrant orcourt order.\n\n23andMeaddsit has only received 11 requests from law enforcement over a decade-long period and has so far never given up a person’s DNA data to investigators without the person’s consent.\n\n“We can sometimes get lucky and get a closer relative, but because we are limited to the two smallest genetic genealogy databases, we only are able to compare against less than 2 million profiles,” Moore said.\n\nThose databases –GEDmatchandFamilyTreeDNA– are open-source services where people are informed that the information could be used by law enforcement.\n\nMoore is CEO of a third database,DNA Justice, that exists specifically to make DNA information available to law enforcement investigations. It has fewer than 7,000 DNA records.\n\nBesides the reluctance of many people to share their own DNA profile for investigations, the success rate also depends on people’s willingness to have their DNA catalogued at all. Those records exist more for Americans with western European ancestry than other backgrounds, according to Moore.\n\n“You’re mostly seeing White people with deep roots in the United States,” she said.\n\nWith the many complications involved in collecting DNA evidence – and time seeming to be a major enemy of finding Guthrie safe and sound – Moore said the Guthrie family could plead for more access to records from the top genealogy websites that have been very reluctant to take part.\n\n“I don’t believe they will allow it unless they are served with a warrant, and then I think there’s going to be a knock-down, drag-out fight,” she said.\n\nCNN’s Josh Campbell, Faith Karimi, Chelsea Bailey, Nicole Chavez, Eric Levenson and Sarah Dewberry contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-news-updates-02-15-26?post-id=cmlo0wby8000t3b6p9zsgdefr",
      "text": "connected"
    },
    {
      "url": "https://www.cnn.com/us/timeline-nancy-guthrie-search",
      "text": "Nancy Guthrie"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-search-update-02-17-26?post-id=cmlqymy5e0000356pd6txj1ay",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-13-26?post-id=cmllg8qzf000h356r0ur5bzje",
      "text": "found"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-search-update-02-17-26?post-id=cmlqx582z00003b6py3nhtlrq",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/2024/02/28/us/idaho-student-killings-genetic-genealogy",
      "text": "conviction"
    },
    {
      "url": "https://www.cnn.com/us/live-news/bryan-kohberger-idaho-murders-sentencing-07-23-25#cmdgcbyks001r3b6sv2zvk3x2",
      "text": "confessed"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/video/nancy-guthrie-pima-county-fbi-dna-evidence-genetic-genealogy-kaitlan-collins-cece-moore",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/2018/04/27/health/golden-state-killer-genetic-privacy/index.html",
      "text": "Golden State Killer"
    },
    {
      "url": "https://www.cnn.com/2018/08/03/health/dna-genealogy-cold-cases-trnd",
      "text": "into GEDmatch"
    },
    {
      "url": "https://www.cnn.com/2018/04/27/health/golden-state-killer-genetic-privacy/index.html",
      "text": "four months"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/us/golden-state-killer-case-update-cec",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/2024/07/12/us/tusla-race-massacre-victim-identified-reaj",
      "text": "identity"
    },
    {
      "url": "https://www.cnn.com/us/idaho-student-killings-timeline/index.html#:~:text=The%20next%20day%20%E2%80%9Cthe,the%20suspect%E2%80%99s%20biological%20father.%E2%80%9D",
      "text": "acknowledged"
    },
    {
      "url": "https://www.cnn.com/2024/02/28/us/idaho-student-killings-genetic-genealogy",
      "text": "said,"
    },
    {
      "url": "https://www.cnn.com/2024/02/28/us/idaho-student-killings-genetic-genealogy",
      "text": "did not use"
    },
    {
      "url": "https://www.cnn.com/2018/06/02/us/golden-state-killer-unsealed-warrants",
      "text": "swabbed"
    },
    {
      "url": "https://www.cnn.com/2018/04/27/health/golden-state-killer-genetic-privacy/index.html",
      "text": "privacy concerns"
    },
    {
      "url": "https://www.23andme.com/law-enforcement-guide/",
      "text": "23andMe"
    },
    {
      "url": "https://www.ancestry.com/c/legal/lawenforcement#:~:text=Ancestry%20does%20not%20voluntarily%20cooperate,or%20to%20identify%20human%20remains.",
      "text": "prohibit"
    },
    {
      "url": "https://www.myheritage.com/privacy-policy",
      "text": "court order"
    },
    {
      "url": "https://www.23andme.com/transparency-report/",
      "text": "adds"
    },
    {
      "url": "https://www.gedmatch.com/",
      "text": "GEDmatch"
    },
    {
      "url": "http://www.familytreedna.com/",
      "text": "FamilyTreeDNA"
    },
    {
      "url": "https://www.dnajustice.org/",
      "text": "DNA Justice"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/nancy-guthrie-genetic-genealogy-dna",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/us/nancy-guthrie-genetic-genealogy-dna",
      "text": "Cookie Settings"
    }
  ],
  "hash": "531ca09d34b33c633e3b41339b597324b7671d93edee220555e404afadac17a4",
  "scraped_at": "2026-02-20T07:29:24.382499+00:00"
}