{
  "url": "https://lite.cnn.com/2026/02/17/business/grok-ai-sexualized-images-eu-probe-intl",
  "title": "Grok AI: Europe’s privacy watchdog launches ‘large-scale’ probe into Elon Musk’s X | CNN Business",
  "date": "2026-02-18T07:32:35.123596+00:00",
  "authors": [
    "Hanna Ziady, CNN"
  ],
  "text": "Source: CNN\n\nThe European Union’s data privacy watchdog has launched an investigation into Elon Musk’s X over sexualized images generated by the social media site’s AI chatbot, Grok.\n\nThe move adds to mounting regulatory pressure on X, which is also facing probes in France and the United Kingdom after thousands of sexualised deepfake images — mainly of women, but also children — were generated using Grok last month, prompting aglobal backlash.\n\nIreland’s Data Protection Commission (DPC), which is chiefly responsible for enforcing the EU’s General Data Protection Regulation (GDPR), said in astatementTuesday that it has opened a “large-scale” inquiry into X concerning these images.\n\nIn particular, the commission will be looking into whether X complied with the EU’s flagship data privacy rules in the way that it handled the personal data of the bloc’s citizens.\n\n“The DPC has been engaging with X since media reports first emerged a number of weeks ago concerning the alleged ability of X users to prompt the @Grok account on X to generate sexualised images of real people, including children,” deputy commissioner Graham Doyle said.\n\nThe commission’s investigation will “examine X’s compliance with some of their fundamental obligations under the GDPR in relation to the matters at hand,” he added. CNN has contacted X for comment.\n\nDeveloped by Musk’s AI startup, xAI, whichacquired X last year, Grok is integrated into X’s social media feeds.\n\nUnder pressure from governments, including threats of bans and fines, Xrestricted Grok’s abilityto generate certain explicit images last month. Still, the company is facing multiple probes in Europe.\n\nThe United Kingdom’s Information Commissioner’s Officeannounced formal investigationsinto X and xAI earlier this month, “covering their processing of personal data in relation to the Grok artificial intelligence system and its potential to produce harmful sexualised image and video content.”\n\nMeanwhile, X offices in Paris wereraided by policeat the beginning of February as part of a widening probe into the company and Grok. Musk was also summoned for questioning.\n\nIn response, X’s global government affairs team denied any wrongdoing and said the allegations underlying the raid were “baseless.”\n\nThe European Union is alreadyinvestigating Xover the sexualised images, examining whether the platform “properly assessed and mitigated risks associated with the deployment of Grok’s functionalities into X in the EU.”\n\nThe controversy surrounding Grok has placed artificial intelligence and social media under renewed fire for potential harms to young people.\n\nOn Monday, the United Kingdomannounced plansto force AI chatbots, including Grok, ChatGPT and Google’s Gemini, to comply with strict laws to protect users from illegal content.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/tech/elon-musk-xai-digital-undressing",
      "text": "global backlash"
    },
    {
      "url": "https://www.dataprotection.ie/en/news-media/press-releases/data-protection-commission-opens-investigation-x-xiuc",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2025/03/28/business/elon-musk-sells-x-to-xai",
      "text": "acquired X last year"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/tech/grok-elon-musk-image-generation",
      "text": "restricted Grok’s ability"
    },
    {
      "url": "https://ico.org.uk/about-the-ico/media-centre/news-and-blogs/2026/02/ico-announces-investigation-into-grok/",
      "text": "announced formal investigations"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/business/x-paris-prosecutor-raid-intl",
      "text": "raided by police"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/tech/eu-probe-grok-sexualized-images-intl",
      "text": "investigating X"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/uk-ai-chatbots-online-safety-act-intl",
      "text": "announced plans"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/business/grok-ai-sexualized-images-eu-probe-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/business/grok-ai-sexualized-images-eu-probe-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "53b58d1d1142282a95ddf0b887ef6229f4b7a6de95cd447421f9abd299345444",
  "scraped_at": "2026-02-18T07:32:35.123609+00:00"
}
