{
  "url": "https://lite.cnn.com/2026/02/26/us/kouri-richins-trial-carmen-lauber-testimony",
  "title": "Kouri Richins: Housecleaner testifies in Utah woman’s murder trial she bought drugs allegedly used to kill Eric Richins | CNN",
  "date": "2026-02-28T07:00:30.629368+00:00",
  "authors": [
    "Nicki Brown"
  ],
  "text": "Source: CNN\n\nA key witness inKouri Richins’ murder trialtestified Thursday that she obtained the fentanyl that prosecutors allege Richins used to kill her husband of nine years.\n\nCarmen Lauber, a housecleaner who worked for Richins, testified she sold illicit pills to the Utah motherfour times in early 2022 at the defendant’s request.\n\n“She’d called me and asked me if I could reach out to somebody for some pain meds for an investor that she knew,” Lauber testified.\n\nA couple days after Eric Richins was found dead on March 4, 2022, Lauber said she spoke with Kouri Richins on the phone.\n\n“I said, ‘Please tell me these pills were not for him,’” Lauber recalled telling Richins. She said Richins responded:\n\n“No, they were not. Eric passed away from a brain aneurysm.”\n\nLauber’s testimony Thursday is pivotal to the prosecution of Kouri Richins, who is accused ofpoisoning her husbandwith a lethal dose of fentanyl. Prosecutors allege she killed him for his money and to start a new life with the man with whom she was having an affair.\n\nRichins, 35, haspleaded not guiltyto aggravated murder and other charges. If convicted of the most serious charge, she could face up to life in prison.\n\nUnder questioning Thursday by Summit County, Utah, prosecutor Bradley Bloodworth, Lauber confirmed she was granted immunity in exchange for her truthful testimony. She spoke with investigators several times before she was given immunity, which she said she did in part to take responsibility.\n\n“I already knew Eric had passed away. But when they told – when they had mentioned that it was from an overdose, that hit hard,” Lauber said, dabbing her eyes with tissues.\n\n“Only for the fact that, if that’s what happened, I needed to step up and take accountability of my part in this, what happened and what I was asked for.”\n\nOn cross-examination, the defense worked to undermine Lauber’s credibility, highlighting her history of drug use – including around the time she said she purchased the drugs in question – and the deal she reached with prosecutors to secure her testimony against Richins.\n\nLauber testified she began obtaining illicit drugs for Richins around late January or early February of 2022.\n\nLauber bought an envelope of opiate pills from a woman she worked with and then gave them to Kouri Richins in her driveway the next morning, she said. Richins later asked for drugs a second time, saying the investor wanted something stronger, Lauber said.\n\nLauber testified she got in touch with a man who said he had pills containing fentanyl. When she texted Richins about the fentanyl pills, Richins responded, “Okay, go ahead and get them,” according to Lauber’s testimony.\n\nRichins left Lauber approximately $1,000 cash inside of a house she was flipping, Lauber said. After she retrieved the money, Lauber said she met the man at a gas station on February 11, 2022.\n\n“He handed me a little clear baggie with some pills in it,” she said.\n\nLauber testified she left the pills in the outdoor firepit of the same home where she picked up the money.\n\nProsecutors allege Kouri Richins tried to poison her husband a few days later, on Valentine’s Day, by lacing his sandwich. Eric Richins told his friends he broke out in hives and thought he was going to die after eating the sandwich, according to charging documents.\n\n“I think my wife tried to poison me,” he told one friend, per court records.\n\nAround the end of February 2022, Richins again asked for stronger drugs, referencing “some of the Michael Jackson stuff,” Lauber confirmed in her testimony. Jackson died of apropofol overdosein 2009.\n\nLauber testified she asked the same manfor more pills and picked up $1,000 cash that Richins left in the same home. When she met the man at the gas station, he gave her a baggie of light blue pills, she said. Richins later picked up the pills in Lauber’s driveway, she testified.\n\nWhenEric Richins was found dead on March 4, 2022, he had roughly five times the lethal dose of fentanyl in his system, according to charging documents.\n\nThree days after her husband’s death, Richins texted Lauber “still have your hookup?” according to phone records displayed in court Thursday.\n\nLauber testified she then purchased drugs for Richins again after receiving a $1,300 check from her. The check, shown in court Thursday, was made out to Lauber for “Construction clean Midway.” At the time of Eric Richins’ death, his wife was working to flip a home in Midway, Utah.\n\n“I never cleaned a house ever in my life for thirteen hundred dollars,” Lauber said.\n\nLauber later asked Richins if she needed any more pills, she testified. Richins allegedly responded she did not because her investor had “left town.”\n\nRichins’ defense has worked to undercut Lauber, questioning her reliability based on purported inconsistencies in her statements and her history of drug use.\n\nLauber acknowledged her struggle with addiction Thursday, and said she has been sober for more than four years.\n\nIn her opening statement, defense attorney Kathy Nester said Lauber first told investigators Kouri Richins asked for another drug, oxycodone. After authorities offered her immunity, Lauber then “changes her story” to include fentanyl, Nester said.\n\nThe man alleged to have sold drugs to Lauber recently told investigators he gave her oxycontin, Richins’ defense attorneys have written in court filings, although he previously said he sold her fentanyl.\n\nAt points during Lauber’s testimony, she admitted some details were unclear and she was getting confused.\n\nUnder cross-examination Thursday by defense attorney Wendy Lewis, Lauber confirmed she tested positive for methamphetamine in late January, mid-February and early March 2022.\n\n“You were high that whole time,” Lewis asked, “February, March ’22?”\n\n“Not the whole time, no,” Lauber said.\n\n“You were using very regularly,” Lewis said.\n\n“I guess so, yes.”\n\nLewis also highlighted the deal Lauber reached with authorities in exchange for her testimony.\n\nLauber testified detectives began meeting with her about the Richins case in April 2023, when she was potentially facing new charges that could carry a long sentence.\n\nOne investigator told Lauber she may be spared from punishment “if you can help us out with this,” according to a recording of the meeting played in court Thursday.\n\n“He means, like, give us the details that will ensure Kouri gets convicted of murder,” another said.\n\nLauber confirmed on the stand she told authorities she would do “whatever it takes.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/23/us/kouri-richins-trial-murder-husband",
      "text": "Kouri Richins’ murder trial"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/us/kouri-richins-utah-trial",
      "text": "poisoning her husband"
    },
    {
      "url": "https://www.cnn.com/2024/08/27/us/kouri-richins-hearing-verdict-husband",
      "text": "pleaded not guilty"
    },
    {
      "url": "https://www.cnn.com/2013/09/24/showbiz/michael-jackson-death-trial",
      "text": "propofol overdose"
    }
  ],
  "hash": "53e00c97550a244112a64c83022992560b6478a8943f71f6ca7ac63723f87a37",
  "scraped_at": "2026-02-28T07:00:30.629381+00:00"
}