{
  "url": "https://lite.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
  "title": "The $134-billion question: Who will get a tariff refund? | CNN Business",
  "date": "2026-02-22T07:10:40.029589+00:00",
  "authors": [
    "Elisabeth Buchwald, CNN"
  ],
  "text": "Source: CNN\n\nThe battle is just starting for the 300,000 businesses that want $134 billion in tariffs refunded.\n\nAs it turns out, c﻿onvincing six Supreme Court justices that President Donald Trumpoverstepped his authorityin imposing sweeping tariffs relying on emergency economic powers was the easy part. The hard part: Getting a clear answer on what happens to the tens of billions of dollars that US companies forked over afterTrump jacked up tariffson every global partner last year.\n\nThe Trump administration — both formally and informally — has promised to refund duties collected if the Supreme Court issued a ruling against them. But neither the administration nor any of the justices have specified exactly how it would work.\n\nIn his dissenting opinion, Justice Brett Kavanaugh wrote, “Refunds of billions of dollars would have significant consequences for the US Treasury.”\n\n“The Court says nothing today about whether, and if so how, the Government should go about returning the billions of dollars that it has collected from importers. But that process is likely to be a ‘mess,’ as was acknowledged at oral argument,” he continued.\n\nOn Friday, President Donald Trump questioned why the justices didn’t state whether the tariff revenue needs to be returned. “I guess it has to get litigated for the next two years,” he told reporters. He then said it could be “the next five years.”\n\nThat likely means that businesses will have to fight tooth and nail for any chance at a refund — even though the government keeps meticulous records of all tariff payments.\n\n“The case was never about refunds, and it was inconceivable that the Supreme Court would get into the weeds of how you apply refunds,” said Ted Posner, a trade attorney and partner at Baker Botts.\n\n“We’re now talking to companies about the next steps, which means more waiting, this time for the Court of International Trade. Any refund process is going to require meticulous submissions, and for now, companies and even countries are left in limbo.” Essentially, that means individual importers will have to file their own lawsuits for a chance at a refund.\n\nTreasury Secretary Scott Bessent said in aReuters interviewlast month the agency has enough cash on hand to refund importers, but that the process could play out over a year.\n\n“It won’t be a problem if we have to do it, but I can tell you that if it happens — which I don’t think it’s going to — it’s just a corporate boondoggle,” Bessent said. Then Bessent asked whether companies like Costco, whichpreemptively sued the US governmentin an effort to secure its stake in a refund, would return any of the funds they receive to customers.\n\n“I’ve got a feeling the American people won’t see it,” Bessent said Friday at an event hosted by the Economic Club of Dallas.\n\nThis wouldn’t be the first time the government had to issue tariff refunds as a result of a Supreme Court decision. A 1998 decision resulted in $730 million in tariff refunds to American companies, though it took two years to accomplish.\n\n“It is an open question whether Customs and Border Protection will follow historical precedent or existing processes, or whether a new process will be needed to address the sheer scope and volume of the IEEPA tariffs,” Alexis Early a trade attorney and partner at BCLP, said, referring to the set of tariffs that the Supreme Court struck down.\n\nAs for the consumers who paid for the tariffs via higher prices, it’s looking like refunds won’t ever hit their bank accounts.\n\n“Companies are highly unlikely to start trimming their prices as a result,” said Stephanie Roth, chief economist at Wolfe Research. “Walmart is not going to give you a check for the 15% tariff on sneakers you bought from them four months ago.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "overstepped his authority"
    },
    {
      "url": "https://www.cnn.com/2025/04/02/economy/key-takeaways-from-trumps-liberation-day-tariffs",
      "text": "Trump jacked up tariffs"
    },
    {
      "url": "https://www.reuters.com/world/bessent-says-us-treasury-can-easily-cover-any-tariff-refunds-2026-01-10/",
      "text": "Reuters interview"
    },
    {
      "url": "https://www.cnn.com/2025/12/02/economy/why-costco-is-suing-trump",
      "text": "preemptively sued the US government"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
      "text": "Cookie Settings"
    }
  ],
  "hash": "545c59743b339ad201b0f3355c687f6db6d29f57500f90d80282655b6d16fa3e",
  "scraped_at": "2026-02-22T07:10:40.029603+00:00"
}