{
  "url": "https://lite.cnn.com/2026/02/19/politics/homeland-security-worst-immigrants-website",
  "title": "Exclusive: DHS admits ‘worst of the worst’ immigrants website had errors | CNN Politics",
  "date": "2026-02-20T07:28:39.987337+00:00",
  "authors": [
    "Michael Williams",
    "Alex  Leeds Matthews",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Department of Homeland Security admitted that its website featuring what it calls the “worst of the worst” arrested immigrants was rife with errors and changed the site this week after receiving questions from CNN about it.\n\nDHS created the website in December and the agency, its secretary Kristi Noem and the White House have all heavily promoted it on social media as the Trump administration has sought to justify itsaggressive and heavily scrutinizedimmigration enforcement operations.\n\nThe websitecurrently lists about 25,000 people, along with the crimes the agency says they were arrested for or convicted of — including many who were initially linked only to relatively minor offenses.\n\nBut DHS this week conceded its website was filled with inaccuracies. After receiving questions about a CNN analysis of the website, a DHS spokesperson admitted on Tuesday that the charges against hundreds of immigrants listed on the website were described incorrectly by the agency.\n\nThe spokesperson attributed the inaccuracies to a “glitch” that they said DHS worked to remedy. The spokesperson said on Wednesday that the glitch had been “resolved.”\n\nA CNN review of the website found that thousands of the people listed on the website were described by the agency as being convicted of or arrested for serious charges — including sex crimes or different forms of homicide. But hundreds more who DHS considered the “worst of the worst” were described as being arrested for or convicted of far less serious crimes, including single charges of traffic offenses, marijuana possession or illegal reentry, a federal felony that involves someone reentering the United States after having been previously deported.\n\nCNN could not independently verify the descriptions of each of the thousands of people listed on the website.\n\nAsked whether drawing an equivalence between traffic offenders and killers might undermine the agency’s public messaging about its operations, DHS said that many of those the agency listed with single minor crimes had actually been arrested for or convicted of multiple crimes, some of which were more serious: “This is a glitch on the WOW website the impacted about 5% of the entries.”\n\n“Many of these who are listed as traffic offense and illegal reentry, which is a felony, have additional crimes,” the spokesperson said, adding the agency was working “to fix the issue.” The spokesperson did not answer questions about what type of glitch could cause the people on the website to be described incorrectly.\n\n“All of these individuals have been arrested by ICE and all of them committed crimes breaking our nation’s laws, including some who had felonies for illegal re-entry,” the spokesperson said.\n\nBoth the White House and DHS have faced intense scrutiny for usingfalse or misleadingclaims about some immigrants as a pretext to justify enforcement operations, or describing certain incidents in ways which werelater contradictedby video or statements from local officials.\n\nFollowing the fatal shooting of Alex Pretti in Minneapolis last month, officials including Noem and White House immigration policy architect Stephen Millerrushed to describe Prettias “a domestic terrorist” who brandished his gun and intended to massacre law enforcement.\n\nVideo later showedthat Pretti never brandished the gun that he was carrying when he was shot, and both Miller and Noem blamed their premature descriptions of Pretti on information they received from officers on the ground.\n\nThis also isn’t the first time that the Trump administration has acknowledged its descriptions of some immigrants they described as the “worst of the worst” were inaccurate.\n\nIn another instance,first reported by NOTUS, the White House conceded it posted a picture of a man who the administration erroneously claimed had been convicted of a sex crime involving a child. (A White House official said the error has been corrected and the administration will continue publicizing “the dangerous criminal illegal aliens being removed from our streets.”)\n\nThe DHS “worst of the worst” website also includes immigrants’ countries of origin and the city where they were arrested. CNN’s analysis of the site shows that some of the locations representing the greatest number of arrests are relatively small cities – but they contain large prisons, a potential indication that those detained were already in federal prison or had been transferred from state custody. In those cases, that could undercut the agency’s claim that they were “public safety threats” who were “lurking” in communities.\n\nThe city representing the most arrests is Conroe, Texas, which is about 40 miles north of Houston and has an estimated population of about 114,000. That city is home to the Joe Corley Processing Center, a privately owned detention facility that Immigration and Customs Enforcement uses to house immigrants. Other top cities, including Lompoc, California, Yazoo City, Mississippi, and Eden, Texas, have relatively small populations, but large federal detention centers.\n\nThe social media feeds of DHS, Noem and the White House have displayed a stream of mugshots of people the administration says it has taken off the streets duringOperation Metro Surge, the immigration crackdown it has been conducting in the Twin Cities over the last two months. (The administration is nowwinding downits Minnesota immigration surge, though it is keeping a small footprint of officers there.)\n\nBut local officials in Minnesota have accused DHS of padding their publicized arrest numbers by taking credit for arrests made by local law enforcement, who were then transferred to immigration authorities through routine processes.\n\n“This is no longer a simple misunderstanding,” Minnesota Department of Corrections Commissioner Paul Schnell said during a news conference last month.\n\nAt best, Schnell said, “DHS fundamentally misunderstands Minnesota’s correctional system.”\n\n“At worst,” he added, “it is pure propaganda, numbers released without evidence to stoke fear rather than inform the public.”\n\nA DHS spokesperson said in a statement: “All of these individuals have been arrested by ICE and placed in removal proceedings.”\n\n“Under President Trump and Secretary Noem, we are not going to allow criminals to be released from jails and back into our communities,” the spokesperson said.\n\nAmong the people who DHS chooses to label the “worst of the worst,” almost half are from Mexico. More than 2,100 are from Honduras; Guatemala and Cuba account for about 1,900 each; El Salvador accounts for almost 1,200; while Iran, China, Nicaragua, Haiti and Jamaica account for scores of people each. Several dozen are from Somalia – a country that President Donald Trump has denigrated repeatedly and which has been a large focus of the administration’s recent crackdown in Minneapolis, where there is a large Somali diaspora.\n\nIt is not uncommon for law enforcement agencies large and small to publicize their efforts or arrests — and DHS has come under immense pressure from the Trump administration to boost its public-relations profile and publicize arrests.\n\n“Show the numbers, names, and faces of the violent criminals, and show them NOW,” the president wrote onTruth Social last month. “The people will start supporting the patriots of ICE, instead of the highly paid troublemakers, anarchists, and agitators! MAKE AMERICA GREAT AGAIN.”\n\nBut the problem, critics say, is that the proportion of “violent criminals” convicted of charges where there is a nexus to public safety is smaller than the administration presents, even if DHS does adjust its list to reflect a larger number of violent offenders.\n\n“The vast majority of so-called criminal aliens are individuals charged with or convicted of traffic offenses, DUIs and immigration-related offenses,” said John Sandweg, who served as acting ICE director during the Obama administration.\n\n“That was the challenge we faced during the Obama administration,” he added. “I’ll just put it this way – and I spent every day working on this – we are saying we are focused on the worst of the worst, we’re focused on serious criminals, that’s what our mission is, to get them off the streets.”\n\nBut when it comes to the scale of the problem as described by the Trump administration, Sandweg said, “That population is not out there. It’s just not there.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/us/ice-minnesota-immigration-federal-agents-somali",
      "text": "aggressive and heavily scrutinized"
    },
    {
      "url": "https://www.dhs.gov/wow",
      "text": "The website"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/federal-judges-trump-immigration-credibility",
      "text": "false or misleading"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/dhs-ice-trump-tricia-mclaughlin",
      "text": "later contradicted"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/us/alex-pretti-shooting-trump-administration-narrative",
      "text": "rushed to describe Pretti"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/invs-videos-show-federal-officer-recovered-gun",
      "text": "Video later showed"
    },
    {
      "url": "https://www.notus.org/whitehouse/white-house-x-images-detained-migrants-crimes",
      "text": "first reported by NOTUS"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "Operation Metro Surge"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "winding down"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/115928309252078004",
      "text": "Truth Social last month"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/homeland-security-worst-immigrants-website",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/homeland-security-worst-immigrants-website",
      "text": "Cookie Settings"
    }
  ],
  "hash": "546df2e50738a167d8ecabee2d8445b9d93439ea0a0c8cd8b2187780bfb533ed",
  "scraped_at": "2026-02-20T07:28:39.987350+00:00"
}