{
  "url": "https://lite.cnn.com/2026/02/13/science/spacex-crew-12-launch-nasa",
  "title": "SpaceX, NASA mission arrives at ISS, relieving bare-bones astronaut crew | CNN",
  "date": "2026-02-15T07:10:50.239440+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA SpaceX capsule carrying four astronauts arrived at the International Space Station on Saturday, bringing the orbiting laboratory back to full staff a month after a previous crew made an emergency exit due to a medical concern, leaving behind a skeleton crew.\n\nThe mission, called Crew-12, lifted off at around 5:17 a.m. ET Friday from Cape Canaveral Space Force Station in Florida. The spacecraft spent more than 30 hours free-flying through space, slowly making its way to an ideal docking position with the ISS, which orbits roughly 250 miles (400 kilometers) above Earth.\n\nNASA, which contracts SpaceX for the astronauts’ transport to and from the space station, had sought to expedite the Crew-12 launch due to the staffing situation. But the agency had to forgo two possible launch windows on Wednesday and Thursday because of unfavorable weather along the rocket’s flight path.\n\nSpaceX could have expedited the launch even more, as the spacecraft and rocket flying this mission were processed ahead of schedule, noted Steve Stich, NASA’s Commercial Crew Program manager, in a Friday morning news briefing. But NASA also had to get the astronauts ready to fly.\n\n“When you look at the totality of a mission, it’s getting the vehicles, the hardware and the software ready — and also the crew,” Stich said. “And so in this case, crew training was what drove the date that we selected.”\n\nThe International Space Station has been operating with three people on board — well below the seven-person staff the space agency desires — since mid-January.\n\nCrew-12’s arrival comes after a previous SpaceX staffing mission, Crew-11, was forced to make an early return because of an undisclosed medical issue by an unidentified member.\n\n“I’ll say it again, that this mission has shown, in many ways, what it means to be mission focused at NASA,” space agency chief Jared Isaacman said Friday.\n\n“Just to recap, in the last couple of weeks, we brought Crew-11 home early. We pulled forward Crew-12 to today — all while simultaneously making preparations for the Artemis II mission,” he added, referring to NASA’s upcoming moon mission that’s slated to take off as soon as March.\n\nUpon Crew-11’s splashdownreturnoff the coast of California on January 15, all four astronauts went to Scripps Memorial Hospital in La Jolla. The crew — which included NASA’s Zena Cardman and Mike Fincke, Japan Aerospace Exploration Agency astronaut Kimiya Yui and Roscosmos cosmonaut Oleg Platonov of Russia — later appeared at a news conference.\n\n“How we handled everything all the way through, from nominal operations to this unforeseen operation, really bodes well for future exploration,” Fincke said.\n\nOn board the Crew-12 mission are NASA’s Jessica Meir and Jack Hathaway, European Space Agency astronaut Sophie Adenot and Russian cosmonaut Andrey Fedyaev.\n\nNASA typically likes to have a direct handover between incoming and outgoing crews on the space station, a process that can bring staffing levels up to 11 as the arriving astronauts orient themselves on the laboratory with the help of the departing crew.\n\nGiven Crew-11’s emergency medical departure, the Crew-12 astronauts had no such handover period. But Meir said she and her crewmates were able to exchange information with the Crew-11 astronauts on the ground.\n\n“We ran into them several times and had a little bit of a debrief so they could pass along some pertinent things,” shesaidduring a February 8 news conference.\n\nThe Crew-11 astronauts’ premature departure left the football field-size space station with three remaining staff members: two Russian cosmonauts, Sergey Kud-Sverchkov and Sergei Mikayev,as well as NASA astronaut Chris Williams, who traveled to the orbiting laboratory as part of a rideshare agreement with Roscosmos, NASA’s Russian counterpart.\n\nThe situation is less than ideal. NASA has routinely indicated that a robust crew presence on the space station is crucial for maximizing value and productivity on board the orbiting laboratory — which costs about $3 billion per year to operate and maintain.\n\nHowever, as Meir noted, before SpaceX began offering NASA routine trips to orbit for the space agency’s astronauts, it was common for only three astronauts to helm the space station.\n\n“The time of my last flight — around six, seven years ago — we did these indirect handovers,” Meir said, referring to the process of conducting a handoff with new crewmates on the ground rather than in orbit. “It was more rare to have that direct handover where the other crew stayed on board before you arrived.”\n\nStill, temporarily having three crewmates aboard the station does limit the amount of research that can be carried out. And Isaacman has signaled that he considers novel research on the orbiting laboratory to be a priority.\n\nSuch work, Isaacman has said, can help pave the way for new, commercial space stations that can replace the aging laboratory.   NASA has long hoped that private-sector companies would build space stations in low-Earth orbit so that the space agency can focus on efforts to explore the deeper solar system.\n\n“I, like a lot of space enthusiasts, dream of the day where we have multiple commercial space stations in low-Earth orbit,” Isaacman said during aSenate confirmation hearingin December. “But I think in order for that to be a financially viable model, we have to absolutely maximize the remaining life of the International Space Station — get the highest potential science and research to the space.”\n\nDuring their roughly eight-month stay on the space station, the Crew-12 astronauts are slated to carry out an array of research projects, including ultrasound scans of their blood vessels to investigate changes in circulation and pharmaceutical research related to bacteria that cause pneumonia. The group will also conduct a simulated lunar landing — an effort to assess how abrupt changes in gravity affect the human body and cognition.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/science/nasa-astronauts-splashdown-iss-health-concern",
      "text": "return"
    },
    {
      "url": "https://www.youtube.com/watch?v=3CuHCROAwRI",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/science/nasa-astronauts-depart-iss-health-concern",
      "text": "Senate confirmation hearing"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/science/spacex-crew-12-launch-nasa",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/science/spacex-crew-12-launch-nasa",
      "text": "Cookie Settings"
    }
  ],
  "hash": "54737b64a38cd107004b887b6090888c0d4897dcfef9782272e1e4f60df929ba",
  "scraped_at": "2026-02-15T07:10:50.239453+00:00"
}