{
  "url": "https://lite.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-consequences-intl",
  "title": "UK government considers removing Andrew Mountbatten-Windsor from line of succession. Here’s what other consequences he could face | CNN",
  "date": "2026-02-24T07:33:58.922816+00:00",
  "authors": [
    "Lauren Said-Moorhouse",
    "James Frater",
    "CNN"
  ],
  "text": "Source: CNN\n\nSlouched in the back of a car, wide-eyed and unnerved,Andrew Mountbatten-Windsormakes his way home from the police station.\n\nIt’s an image that was splashed across pretty much every UK newspaper on Friday morning, a day after the brother ofKing Charles IIIwas arrested on suspicion ofmisconduct in public office.Within hours of those front pages, it emerged that once the investigation into him is finished, UK lawmakers will consider removing Andrew from the line of royal succession.\n\nPolice did not say what led to Mountbatten-Windsor’s arrest, but he spent a decade as a UK trade envoy. British authorities previously said they were reviewing claims that he shared sensitive information with the late convicted sex offenderJeffrey Epstein during his time as a representative for the British government.\n\nMountbatten-Windsor has not commented on the recent allegations against him, but he has previously denied any wrongdoing related to Epstein. He has also said that he never witnessed or suspected any of the behavior the sex offender was accused of.\n\nSeparately, London’s Metropolitan Police said Friday they had urged Andrew’s serving and former royal protection officers to “consider carefully whether anything they saw or heard” could be relevant to their investigation into Epstein and his associates.\n\nAfter Thursday’s dramatic developments, what could happen next in the saga surrounding the former prince?\n\nAfter spending his 66thbirthday in the custody of Thames Valley Police, Mountbatten-Windsor was released on Thursday evening and returned home 10 hours later to the Sandringham Estate.\n\nHe was released under investigation – meaning he’s not out on bail and therefore is not subject to any conditions.\n\nThat’s not to say he couldn’t have further conversations with the authorities. He can be rearrested or asked for follow-up interviews.\n\nWhile he was detained, he would have been questioned and could have put forward “things that he would like the police to look at,” including potential witnesses or explanations, which the police would then have a duty to explore as evidence, British solicitor Chloe Jay told CNN.\n\nOn Friday morning, detectives were seen arriving at Royal Lodge in Berkshire, west of London, to continue their search of Andrew’s former home.\n\n“When you arrest somebody, you are allowed to search the properties they have control of and the properties they own,” former Metropolitan Police Chief Superintendent Dal Babu explained on Thursday.\n\nPolice will be “looking for electronic devices, any information that’s held on those,” added Babu, who served in the Met for 30 years.\n\nThis next stage could be a lengthy process as police continue to gather any evidence that might be available. Following the police investigation, it’ll ultimately be up to the Crown Prosecution Service (CPS) to decide whether they have enough to charge and prosecute him.\n\nThe CPS has so far not offered “early investigative advice” to Thames Valley Police as part of the force’s misconduct in public office investigation. This means CPS lawyers have not given detectives any formal guidance on how to proceed.\n\nThere is no time limit for when charges can be brought.\n\nBritish lawmakers will consider introducing legislation to remove Andrew Mountbatten-Windsor from the line of royal succession, once the police have finished their investigation into him, CNN understands.\n\nThe new law, if implemented, would prevent Mountbatten-Windsor – who is eighth in line to the throne – from ever becoming King.\n\nBritish defense minister Luke Pollard said Friday the government had “absolutely” been working in conjunction with Buckingham Palace to bring about the move.\n\nPollard added it was the “right thing to do to stop someone potentially being a heartbeat away from the throne.”\n\n“It’s right that people know that there are consequences to behavior, and that should apply to everyone, no matter what station in life you’re born into,” he said.\n\nWhile incredibly rare, taking someone out of the line is not entirely unprecedented.\n\nA member of the royal family can be removed by legislation put through the UK Parliament. Additionally, consent from each of the other 14 Commonwealth realms – including Australia and Canada – would be required under a convention enshrined within the Statute of Westminster 1931.\n\nThe precedent the government could follow would be similar to the act that removed the Duke of Windsor (formerly King Edward VIII) from the line of succession following his abdication in 1936.\n\nUsing that example, the prime minister or a senior government minister would need to propose legislation for debate by lawmakers. Similar to any other piece of legislation, the bill would need to complete 10 stages of scrutiny and debate in both houses of Parliament. Once the bill has cleared all stages, it would then be sent to the monarch for royal assent before being passed on to each Commonwealth realm for approval.\n\nRachael Maskell, Labour MP for York Central, told the BBC earlier this week  that Andrew’s position as Counsellor of State should also be removed. “All of these titles and positions need to be addressed, so we are just left with Andrew the citizen, and a citizen that is fully accountable,” she said.\n\nCounsellors of State are certain royals who can be called on by the monarch to act on his behalf if the sovereign is temporarily unable to carry out official duties. Two counselors can be appointed through what’s known as a letters patent to help keep the state ticking over.\n\nThe current cohort of royals who can step in include Queen Camilla, Princes William and Edward, Princesses Anne and Beatrice. Prince Harry and Andrew are also in this pool of family members but given that they are no longer working royals, it is highly unlikely that they would be directed to step up.\n\nRemoving Mountbatten-Windsor from the line of succession would solve this dilemma as it would make him ineligible to serve as a counsellor.\n\nCNN’s Max Foster and Lauren Kent contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/king-charles-andrew-arrest-royal-crisis-intl-latam",
      "text": "King Charles III"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/misconduct-public-office-andrew-arrest-explained-intl",
      "text": "misconduct in public office."
    },
    {
      "url": "https://www.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-consequences-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/uk/andrew-mountbatten-windsor-consequences-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5538c678fefed52bbe5a0c3081068c6b3f2e2cfaac7ae1fbbffa11836ee725fa",
  "scraped_at": "2026-02-24T07:33:58.922828+00:00"
}