{
  "url": "https://lite.cnn.com/2026/02/21/us/caleb-flynn-ohio-murder-arrest",
  "title": "Former ‘American Idol’ contestant Caleb Flynn charged in Ohio killing | CNN",
  "date": "2026-02-24T07:33:33.789560+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nAuthorities in Ohio have arrested and charged a former contestant on “American Idol” with shooting and killing his wife and staging the crime scene to mislead investigators.\n\nCaleb Flynn, 39, pleaded not guilty Friday to charges of murder, assault and tampering with evidence.\n\n“I just want to take care of my daughters. I’m not a risk,” he told Judge Samuel Huffman in a video of his arraignment from jail.\n\nThe judge set his bond at $2 million.\n\nAshley Flynn, 37, was found dead Monday after officers received a report of a burglary and shooting at a Tipp City home, according to a news release by Tipp City Police. Her husband and two children were inside the home when officers arrived.\n\nIn a 911 call released by authorities, a frantic Caleb Flynn tells a dispatcher someone broke into his home and killed his wife. He says she was shot multiple times in the head and he doesn’t know whether the intruder was still there.\n\n“There’s blood everywhere, oh my God, oh my God, oh my God,” he says.\n\nHis attorney, Patrick Mulligan, said in a statement on Saturday he and Flynn were “disappointed and concerned about the short timeline and seeming rush to judgment in this case.” Police arrested Flynn on Thursday.\n\n“When the government runs out of leads or can’t develop leads and looks at a surviving spouse in cases such as these, the chance of a wrongful conviction increases,” the statement said.\n\nTipp City Police Chief Greg Adkins defended the investigation, saying in an email on Saturday that it had “not moved fast.”\n\n“Rather, it has progressed at a pace dictated by a thorough and deliberate investigative process,” he said.\n\nAshley Flynn was a middle school volleyball coach and substitute teacher, Tipp City Schools said on its Facebook page.\n\n“She was known for her beautiful smile, warmth, kindness, and the positive impact she had on so many—both in and out of the classroom and on the court,” the post said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/us/caleb-flynn-ohio-murder-arrest",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/us/caleb-flynn-ohio-murder-arrest",
      "text": "Cookie Settings"
    }
  ],
  "hash": "554588e5af76a6becf04859cfdc5408b26629b897effc0ff1540257d9431d889",
  "scraped_at": "2026-02-24T07:33:33.789574+00:00"
}