{
  "url": "https://lite.cnn.com/2026/02/25/china/csis-report-china-military-purges-intl-hnk-ml",
  "title": "Xi’s purges of Chinese military run deep, raising questions of readiness, think tank says | CNN",
  "date": "2026-02-25T07:31:19.063634+00:00",
  "authors": [
    "Brad Lendon",
    "Simone McCarthy"
  ],
  "text": "Source: CNN\n\nChinese leader Xi Jinping has taken hispurge of the country’s militaryto the very top, targeting his highest-ranked general in a stunning move last month. But Xi’s shake-up cuts across a much wider swath of his armed forces –– with more than 100 officers potentially ousted since 2022.\n\nA new report from a prominent Washington-based think tank reveals just how deeply the anti-corruption drive has reached into the ranks –– and why operationally, that could result in serious unintended consequences for Xi.\n\nThirty-six generals and lieutenant generals have been officially purged since 2022, while another 65 officers are listed as missing or potentially purged, the report published Tuesday by the Center for Strategic and International Studies found.\n\nThe sweeping clear outis part of Xi’s longstanding drive to clean up China’s military as he continues to tighten his grip on power and drives forward a major military modernization.\n\nBut the scope of this “unprecedented purge of China’s military,” raises questions aboutits readinessto carry out complex operations, the report’s authors say.\n\nWhen accounting for positions that have been purged more than once, 52% of the People’s Liberation Army’s (PLA) 176 top leadership positions have been affected, said the report.\n\n“This figure is striking and extraordinary, demonstrating the depth of Xi’s campaign and the unprecedented churn in the PLA leadership,” wrote M. Taylor Fravel, director of the Security Studies Program at the Massachusetts Institute of Technology and one of the report’s nine authors.\n\nCleaning up rampant graft in China’s military has been a cornerstone of Xi’s rule since he took power more than a decade ago. But a new wave of this purge in recent years has seen those close to, or appointed by, the leader himself taken down.\n\nOfficial notices typically accuse these officers of corruption or violations of “discipline and law,” but discerning the forces behind these moves is challenging within the notoriously opaque PLA.\n\nWhilethe targeting of top leaders–– like top-ranking general Zhang Youxia and joint operations chief Liu Zhenli, who were placed under investigation in January –– has drawn headlines, the report says the extension of the purge to lower-level officers means Xi would have to turn to officers with much less command experience, and zero experience in actual combat, to lead military operations.\n\nThat could limit the scope of military campaigns the PLA could take on, the report says.\n\nThe gaps left in PLA top ranks can be seen in the pool of officers in line to take over one of the military’s five theater commands. With the purge of 56 deputy theater commanders, the pool of those who can take over one of those five commands has been culled by more than 33%, the report said.\n\nBonny Lin, another of the report’s authors, says the purges might have already been reflected in PLA readiness.\n\nShe notes thatPLA exercises around Taiwanin response to “problematic” behavior by the self-governing island took substantially longer to implement in 2025 – 19 and 12 days – compared with just fourdays in 2024.\n\nThe loss of top leadership brings into question whether the PLA leadership could conduct an “incredibly complicated and risky” invasion of Taiwan in the next few years, especially noting moves by the United States and Japan to counter such a scenario, the report says.\n\nChina’s ruling Communist Party claims the self-governing island democracy as its own territory and has not ruled out taking control of it by force.\n\n“Xi’s demonstrated lack of faith in his military is good from the perspective of the United States and Taiwan for deterring an invasion,” wrote John Culver, a nonresident senior fellow at the Brookings Institution.\n\nBut the authors caution that despite the purges, the PLA still retains considerable clout.\n\nIn the Taiwan scenario, less-complex operations, such as a blockade, can still likely be implemented easily, the report says.\n\n“If Taiwan or the United States run over a red line for military force, China has a lot of options to punish, teach a lesson, and declare its own ‘victory’” that “do not require highly coherent command coordination,” Culver wrote.\n\n“China is still very capable of taking actions to attack Taiwan and, in the process, to spoil the United States’ whole day,” CSIS analyst Thomas Christensen wrote.\n\nBut Christensen sees reason for Xi to be cautious even in the less-complicated scenarios: Will he get honest, candid advice?\n\nFearing a similar fate to their predecessors, newly promoted leaders might not pass bad news up the line, the report said.\n\n“This is dangerous for crisis management because it could make Xi unrealistically confident in his military’s capabilities in future contingencies,” Christensen wrote.\n\nExperts have also argued, however, that Xi sees the current moment as a good time to clean house, especially as he deals with an American counterpart who doesn’t seem to be focused on the issue of Taiwan and whose security focus is elsewhere in the world.\n\nAnd while the purges raise many questions about PLA readiness in the short-term, China’s adversaries may need to be more wary around the end of the decade, author Joel Wuthnow, senior fellow at the National Defense University.\n\nBy then, newly promoted officers will havegained more experience with China’s modern hardware in exercises and in working with Xi, possibly boosting confidence and expectations of success, Wuthnow wrote.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/china/xi-jinping-zhang-youxia-military-probe-intl-hnk",
      "text": "purge of the country’s military"
    },
    {
      "url": "https://www.cnn.com/2025/02/16/china/china-military-readiness-rand-report-intl-hnk-ml",
      "text": "its readiness"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/china/china-top-general-under-investigation-intl-hnk",
      "text": "the targeting of top leaders"
    },
    {
      "url": "https://www.cnn.com/2025/12/28/china/china-taiwan-military-drills-hnk-intl",
      "text": "PLA exercises around Taiwan"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/china/csis-report-china-military-purges-intl-hnk-ml",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/25/china/csis-report-china-military-purges-intl-hnk-ml",
      "text": "Cookie Settings"
    }
  ],
  "hash": "55bc504ad6795403c2b0beca25d3a5587d1e4cc1626c3bb66107797a6fed483b",
  "scraped_at": "2026-02-25T07:31:19.063645+00:00"
}