{
  "url": "https://lite.cnn.com/2026/02/25/asia/bali-suitcase-murder-american-freed-hnk",
  "title": "Bali ‘suitcase murder’ case: Indonesia frees and deports American, Tommy Schaefer, after 11 years in prison | CNN",
  "date": "2026-02-26T07:32:08.240326+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nIndonesia freed and deported an American man Tuesday after he spent 11 years in prison for the premeditated murder of his then-girlfriend’s mother on the tourist island of Bali.\n\nTommy Schaefer was sentenced to 18 years in prison for the 2014murder of Sheila von Wiese-Mack, the mother of Heather Mack, during a luxury vacation in a case also known as the Bali “suitcase murder.”\n\nSchafer was deported back to the United States from Bali International Airport on Tuesday evening after serving his sentence and receiving a number of remissions for good behavior, said Felucia Sengky Ratna, head of the Bali Regional Office of the Directorate General of Immigration, in a statement.\n\nThe badly battered body of the 62-year-old von Wiese-Mack, a wealthy Chicago socialite, was found inside the trunk of a taxi parked at the upscale St. Regis Bali Resort in August 2014.\n\nHeather Mack, who was almost 19 and a few weeks pregnant at the time of the killing, and her then-21-year-old boyfriend, Schaefer, were arrested on the island a day after the body was found.\n\nMack served seven years of a 10-year prison sentence in Bali for helping to kill her mother and wasdeported in October 2021.\n\nShe was also sentenced to 26 years in prison in Chicago in January 2024, after she pleaded guilty to helping kill her mother and stuffing the body in a suitcase during their vacation.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2015/04/21/asia/bali-suitcase-murder",
      "text": "murder of Sheila von Wiese-Mack"
    },
    {
      "url": "https://www.cnn.com/2021/10/29/asia/us-woman-bali-suitcase-murder-intl-hnk",
      "text": "deported in October 2021"
    }
  ],
  "hash": "563fcf3c53dd1bf87acd80a2b3eb84e90d0d5f7243a0d5038e0d3e2af042156e",
  "scraped_at": "2026-02-26T07:32:08.240339+00:00"
}