{
  "url": "https://lite.cnn.com/2026/02/19/politics/florida-palm-beach-airport-rename-trump-hnk",
  "title": "Florida lawmakers vote to rename Palm Beach International Airport after Trump | CNN Politics",
  "date": "2026-02-20T07:27:45.398165+00:00",
  "authors": [
    "Kit Maher",
    "Lex Harvey",
    "CNN"
  ],
  "text": "Source: CNN\n\nFlorida lawmakers have passed a bill to rename Palm Beach International Airport after President Donald Trump.\n\nThe bill to rename the south Florida hub passed the state Senate Thursday with 25 votes in favor and 11 votes against, all from Democrats, two days after Florida’s House of Representatives passed the measure 81-30.\n\nThe bill now awaits Florida Gov. Ron DeSantis’ signature, and the name change is subject to the approval of the Federal Aviation Administration. According to the text, the act would take effect in the beginning of July.\n\nThe move comes as Trump has alreadyapplied his nameto a slew of things – renaming buildings and government initiatives after himself in ways unprecedented for a sitting president.\n\nFlorida GOP leaders said they wanted to rename the Palm Beach airport after Trump, the first president todeclare permanent residencyin Florida.\n\n“This is the President’s hometown, he lives five miles away from the airport,” said bill co-sponsor Republican Florida Rep. Meg Weinberger, according to CNN affiliateWLUK.\n\nTrump, a native New Yorker,changed his residencyto Florida in 2019, declaring his Mar-a-Lago club in Palm Beach his permanent residence.\n\nCNN has reached out to the White House for comment.\n\nCongresswoman Lois Frankel, a Democrat who represents West Palm Beach,said in a statementfollowing the vote it’s “misguided and unfair that the Republican-controlled Florida Legislature ignored the voices of Palm Beach County by pushing forward a bill to rename Palm Beach International Airport without giving County residents a real opportunity for input.”\n\nAhead of Thursday’s vote, some state Democrats hadraised concernsthat the Trump family was looking to profit from the potential name change, after related trademark applications were filed last week by the private entity that handles licenses and trademarks for the Trump Organization.\n\nDemocratic Florida state Sen. Shevrin Jones quickly filed an amendment in a Senate companion bill to explicitly prevent the Trump Organization from profiting off the trademark, but it failed. “No president, Democrat or Republican should be able to benefit” from an airport trademark license, he said.\n\nA spokesperson for the Trump Organization said that Trump and his family would not receive royalties or licensing fees from the renaming of the Palm Beach airport, and the House bill’s text specifies that the branding would come at no cost.\n\n“To be clear, the President and his family will not receive any royalty, licensing fee, or financial consideration whatsoever from the proposed airport renaming,” said Kimberly Benza, Trump Organization director of executive operations. She stressed that the Florida bill requires a license agreement from The Trump Organization but that they are “willing to provide this right to his hometown county at no charge.”\n\nStill, the trademark applications for “DONALD J. TRUMP INTERNATIONAL AIRPORT,” “PRESIDENT DONALD J. TRUMP INTERNATIONAL AIRPORT” and “DJT” raised eyebrows, givenTrump’s known interestin renaming buildings and major transport hubs after himself, the broad scope of the applications and the potential for his family to profit.\n\nTrump has already applied his name to the Kennedy Center, the US Institute of Peace, a class of battleships, savings accounts for children, and even a “TrumpRx” prescription drug platform.\n\nHe has also specifically pitched renaming Washington’s Dulles International Airport and New York’s Penn Station after himself,CNN previously reported.\n\nEfforts to have Congress rename Dulles after Trump, the legislation of which was cosponsored by a handful of Republicans and is still under discussion, could be complicated by the Palm Beach airport renaming, since two airports named after Trump could cause significant confusion.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/president-trump-name-brand-quest",
      "text": "applied his name"
    },
    {
      "url": "https://www.cnn.com/2019/10/31/politics/trump-florida-resident",
      "text": "declare permanent residency"
    },
    {
      "url": "https://fox11online.com/news/nation-world/florida-legislature-approves-legislation-to-name-airport-after-trump-ron-desantis-palm-beach-democrats-republicans",
      "text": "WLUK"
    },
    {
      "url": "https://www.cnn.com/2019/10/31/politics/trump-florida-resident",
      "text": "changed his residency"
    },
    {
      "url": "https://frankel.house.gov/news/documentsingle.aspx?DocumentID=4964",
      "text": "said in a statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/trump-airport-trademark-profit-name",
      "text": "raised concerns"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/schumer-trump-ny-funding-rename",
      "text": "Trump’s known interest"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/health/trumprx-website-launch",
      "text": "TrumpRx"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/schumer-trump-ny-funding-rename",
      "text": "CNN previously reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/florida-palm-beach-airport-rename-trump-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/florida-palm-beach-airport-rename-trump-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "566e7188895fe036b39a83c3cb95f5a656865168a26b84e09ebede4c8774c546",
  "scraped_at": "2026-02-20T07:27:45.398179+00:00"
}