{
  "url": "https://lite.cnn.com/2026/02/22/weather/zohran-mamdani-blizzard-nyc-snow-day-travel",
  "title": "Zohran Mamdani bans most travel across NYC due to blizzard – and gives in on a snow day for students | CNN",
  "date": "2026-02-24T07:32:43.736282+00:00",
  "authors": [
    "Katherine Koretski"
  ],
  "text": "Source: CNN\n\nNew York City Mayor Zohran Mamdani banned most travel across the nation’s largest city from 9 p.m. Sunday through noon Monday, an extraordinary measure reflecting the testa historic blizzardhitting the region poses.\n\nMamdani also canceled classes for the city’s public schools on Monday with no remote learning.\n\nThe incoming weather is Mamdani’ssecond major snowstormsince becoming mayor on New Year’s Day. Once again, the 34-year-old former state assemblyman’s decisions, and how they’ll affect 8.5 million New Yorkers, will be closely watched by supporters and detractors alike.\n\nHe drew some questions for having remote learning during the January snowstorm, given the difficulties virtual classes pose for many families. With this storm, he made the announcement of a snow day by posting a screen recording of a FaceTime call with a New York City student named Victoria. In the video, he greeted her with a cheerful “Hi, Victoria,” and shared the news.\n\n“No online school, no remote learning, full classic snow day,” he told her as she cheered. “My only ask to you is that you just stay safe, stay indoors during the height of the storm. Once that has passed, feel free to go out and sled.”\n\nOther nonessential city offices and services, including libraries, will also be closed to the public.\n\nTransportation will also be affected: The Staten Island ferry service will be suspended starting 5 p.m. Sunday and is expected to resume late Monday morning.\n\nAt least 18 people died during the January snowstorm and following cold snap.\n\n“We’re going to be doing everything within our power, across all of the city government, to respond to the storm as quickly as possible,” Mamdani said during a press conference on Sunday.\n\nThe city has issued a state of emergency and amplified its sanitation response, with more than 2,000 snow plows set to hit city streets as soon as 2 inches of snow accumulates, with more than 2,600 sanitation employees working 12-hour shifts.\n\nBut a large focus of the preparations includes enhancing the response for homeless New Yorkers, who made up a large number of the death toll in the previous winter weather event, Mamdani said. The city has enhanced their Code Blue operations, including upping warming centers and keeping overdose prevention centers open overnight.\n\nSome 84 people were moved into shelters on Saturday. Additional reports that come into the 311 hotline of vulnerable people outdoors will be rerouted to 911.\n\nThe administration announced earlier this week that they would resume sweeping homeless encampments, but the mayor said in a press conference on Saturday there would be no clean-ups during the winter weather. “So, our focus over the course of this storm is not going to be on physical infrastructure, it’s going to be on people getting homeless New Yorkers inside,” he added.\n\nThe mayor has been continuing his active TV and social media presence to get the word out. On Sunday, donning his custom Carhartt jacket, Mamdaniposted a video on X, joining Department of Transportation crews in the Bronx with their salting operations and appearing on The Weather Channel.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/weather/live-news/blizzard-snow-nyc-storm-forecast-02-22-26?t=1771790228491",
      "text": "a historic blizzard"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/zohran-mamdani-nyc-snowstorm",
      "text": "second major snowstorm"
    },
    {
      "url": "https://x.com/NYCMayor/status/2025570017362776085",
      "text": "posted a video on X"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/weather/zohran-mamdani-blizzard-nyc-snow-day-travel",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/weather/zohran-mamdani-blizzard-nyc-snow-day-travel",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5757ff64e065b6fd1b3569f15aa38ae4125f1a1c3b99826eb5e529cf6c1bac9b",
  "scraped_at": "2026-02-24T07:32:43.736295+00:00"
}