{
  "url": "https://lite.cnn.com/2026/02/28/politics/texas-senate-primary-james-talarico",
  "title": "James Talarico believes a Texas surprise is coming in November. First, he needs to win the Senate primary | CNN Politics",
  "date": "2026-03-01T07:06:46.458075+00:00",
  "authors": [
    "Jeff Zeleny"
  ],
  "text": "Source: CNN\n\nIt may sound likeJames Talaricois getting ahead of himself when he talks about delivering an election night surprise in November, right here in Texas, where a Democratic senator has not been elected in his lifetime.\n\nYet he insists he’s not being boastful or presumptuous, but rather sharing a central piece of his argument in the final days of a fiery Democratic primary.\n\n“There is something happening in the state and I think we’re going to surprise a lot of people on election night in November,” Talarico tells voters at one campaign stop after another, making the case for why he believes he can build a coalition to turn a US Senate seat blue in deep-red Texas.\n\nAll of that, of course, would come only if he wins a fiercely competitive Democratic primary on Tuesday against Rep. Jasmine Crockett, which remains something of an uphill climb.\n\nThe contest is one of the party’s first big tests ofthe midterm election year– closely watched as a measure of enthusiasm and as a guidepost for Democrats seeking to rebuild and find their way back to power.\n\nWhile electability is often a question in the closing days of a race, it hangs heavier over the contest between Talarico, a 36-year-old state representative and Crockett, a 44-year-old congresswoman. They are vying to challenge the winner of a spirited three-way Republican primary, where Sen. John Cornyn islocked in a bitter battlefor re-election to a fifth term.\n\nAs he traveled from city to city on his “Take Back Texas Tour” this week, Talarico didn’t dwell on any of his opponents as he assailed the political system as rigged against the working class and called for a new air of civility, with love a more potent weapon than hate.\n\nWhen asked to explain why he believes he is more electable in a general election, he minces few words as he talks about his quest to expand the traditional Democratic tent to build a broad-based coalition of support.\n\n“Well, I’m the only candidate in this primary who’s been in a competitive general election,” Talarico told CNN, recalling how he flipped a statehouse seat in 2018 to go Democratic for the first time in decades. “I did that by building a big coalition, a big tent, firing up Democrats, bringing in new voters, peeling off independents and some Republicans.”\n\nWhile Talarico and Crockett hold many of the same progressive policy positions, their candidacies offer a study in contrast that boils down to a stark choice facing Democrats: Does the best path to victory lie in firing up and motivating the Democratic base or by trying to expand it to include independents and disillusioned Republicans?\n\n“Whether you’re a Democrat or a Republican, whether you’re a progressive or a conservative,” Talarico said, “the real fight in this country is not left vs. right, it’s top vs. bottom.”\n\nCrockett, a civil rights attorney and former public defender, was elected to her Dallas-area congressional district in 2022 and has becomea leading voice of Democratic oppositiontoPresident Donald Trumpand Republicans. She has recoiled at the electability argument, calling such suggestions a “dog whistle” and “tearing down a Black woman.”\n\n“This isn’t about what can’t be done,” Crockett told CNN. “This is about imagining what it is that we want to get done. And frankly, right now, Texans need a fighter in this moment.”\n\nIn stops across Texas this week, Talarico was greeted by long lines of committed supporters and curious voters, including Ed and Elaine Barnes, former Republicans who waited to see him in College Station.\n\n“We really don’t like the direction things are going in the country with the current leadership,” Ed Barnes said. “We just want to be reasonable, somewhere in the sensible center, and maybe this is going in that direction.”\n\nHis wife, Elaine, added: “We used to vote Republican and 2016 changed us.”\n\nThose seated in his audiences were asked to introduce themselves and chat with their neighbors before Talarico walked into every room, an effort to build a community of supporters. They were all encouraged to reach out to 10 people before the primary on Tuesday.\n\nSandra Petty, a retiree who sat alongside some students during a stop at Texas A&M, said she was drawn to Talarico because of his positivity. She wore a blue T-shirt, with a message that read: “Never underestimate an old lady who votes.”\n\n“I think people are tired of fussing and fighting. I think they’re tired of every time we turn on the television, there’s negativity about races,” Petty said. “We need for him to carry us to our better selves.”\n\nOver the past year, Petty has watched as Talarico has grown into a rising Democratic star.\n\nHe vaulted to broader prominence after an appearance last summer on the hit podcast, “The Joe Rogan Experience.”  At one point, Rogan gushed: “You need to run for president because we need someone who’s actually a good person.”\n\nFivemonths ago, Talarico jumped into the Senate race, brushing aside suggestions from former Rep. Beto O’Rourke and other Texas Democrats that he should mount a campaign to challenge Republican Gov. Greg Abbott. Crockett declared her candidacy in December, setting up a primary fight that has become increasinglyheated.\n\nIn the closing stretch of the race, Talarico has been aggressively campaigning across the state and taking a star turn on “The Late Show” with Stephen Colbert. His appearance on the CBS broadcast was blocked by the FCC,Colbert told his audience, yet it wasreleased onlineand viewed by millions.\n\n“I think it’s safe to say their plan backfired,” Talarico told a campaign rally in Tyler, drawing thunderous applause.\n\nThe Colbert appearance contributed to even more of a substantial fundraising advantage for Talarico, who has raised more than $20 million since declaring his candidacy last September. Crockett has raised nearly $4 million since opening her campaign in December and transferred an additional $4.8 million from her House campaign account.\n\nTelevision ads from Talarico and groups supporting his campaign have far outpaced Crockett. As of Thursday, Talarico has spent about $14.7 million and Lone Star Rising PAC, which supports his candidacy, has spent about $7.5 million, according to a CNN analysis of AdImpact data.\n\nCrockett’s campaign has spent about $4.2 million, without any major outside support. But she entered the race with far higher name recognition than Talarico, which party strategists watching the race closely say could help blunt any spending disparity Crockett faces.\n\nThe outcome of the primary could offer clues for the party’s direction as Democrats work to rebuild and try to win back a majority in the House and Senate. As early voting ended Friday, a review of data suggested a sharp rise in Democratic turnout, pointing to a continuing trend of strong enthusiasm among the party’s base.\n\nMore than 1 million ballots have been cast in the Democratic primary, according to data from the Associated Press, which is far higher than the number of votes cast at the same point in the 2020 Democratic presidential primary, the last time the state had a competitive primary race.\n\n“We’re not just trying to win an election,” Talarico said. “We’re trying to fundamentally change how we do politics in this state and in this country.”\n\nYes, Talarico said with a smile, he is well aware of how Texas often manages to crush the dreams of aspiring Democratic candidates. He was born one year after the last Democratic senator, Lloyd Bentsen, was reelected in 1988.\n\n“There is a growing backlash in this state to the extremism and the corruption in our government,” Talarico said in an interview. “I can’t tell you how many people come up to me at the end of these events and whisper, ‘I’m not a Democrat,’ like it’s some kind of secret. We are building a bipartisan movement to combat that extremism and corruption.”\n\nThe grandson of a pastor and a seminary student himself, Talarico talks more about faith than most Democrats. He sprinkles in verses from the Gospel of Luke, along with the argument that love is a stronger motivating force than hatred. He raises his voice as he denounces the immigration crackdown of the Trump administration, casting it as moral and government failure.\n\n“We’re not supposed to fear our government. Our government is supposed to fear us,” Talarico tells audiences in a message that has become his closingTV ad, with images of masked federal agents arresting people and leading them away.\n\nConversations with several voters across Texas suggest that some are weighing what kind of fighter they are looking for in a US Senate candidate – a combative brawler taking specific aim at Trump, such as Crockett, or someone who embraces a broader economic argument against the establishment, like Talarico.\n\nSamantha Cardenas, who came to see Talarico at a campaign stop in Tyler, said she had been trying to decide whether to vote for Crockett because she wanted to support someone “who is going to ruffle people’s feather.” Yet after seeing Talarico up close, she said she felt more drawn to the movement he is trying to build.\n\nTo build a winning coalition, Cardenas is precisely the voter Talarico is trying to reach. The outcome of the primary Tuesday will reveal whether she is an outlier or represents a winning view – a metric Democrats are closely watching as they determine how much focus to place on Trump in the midterm elections ahead.\n\n“The reason politics sucks is not any one politician, it’s the system itself,” Talarico said, explaining his more nuanced approach. “Trump is a symptom and it’s going to take all of us, whether you voted for Donald Trump or not, to finally fix this broken, corrupt political system.”\n\nCNN’S Veronica Stracqualursi and Arlette Saenz contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/27/politics/video/james-talarico-texas-democratic-primary-digvid-vrtc",
      "text": "James Talarico"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/politics/2026-election-calendar",
      "text": "the midterm election year"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/politics/ken-paxton-john-cornyn-ad-family",
      "text": "locked in a bitter battle"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/jasmine-crockett-colin-allred",
      "text": "a leading voice of Democratic opposition"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/media/colbert-talarico-cbs-trump-fcc",
      "text": "Colbert told his audience"
    },
    {
      "url": "https://www.youtube.com/watch?v=oiTJ7Pz_59A",
      "text": "released online"
    },
    {
      "url": "https://www.youtube.com/watch?v=9Ic-Uc33-mo",
      "text": "TV ad"
    }
  ],
  "hash": "577ef20b3e804ff81d900b529e4e2819a6459627db72f4bb6c227c905f38561f",
  "scraped_at": "2026-03-01T07:06:46.458087+00:00"
}