{
  "url": "https://lite.cnn.com/2026/02/12/business/free-tax-filing-preparation-service",
  "title": "Who can get free tax preparation and filing services | CNN Business",
  "date": "2026-02-12T21:30:13.991251+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nWhen it comes to their federal income tax returns, tens of millions of US households pay for tax preparation and filing. Yet many might qualify to do so for free through IRS-approved programs.\n\nSo why don’t they use them?\n\nOne reason might be thecomplexityof the tax code.\n\n“Our ownresearchsuggests this complexity is a factor in driving families, including low-income families, to use tax preparation intermediaries,” Margot Crandall-Hollick, a principal research associate at the Urban-Brookings Tax Policy Center, told CNN in an email.\n\nThe Tax Policy Center, using IRS data,foundthat in fiscal year 2024, about 85.4 million returns were prepared by paid tax practitioners, while another 61.7 million were prepared by filers using commercial software (of which an estimated 26 million were done for free).\n\nFilers who explore free options may find them difficult to navigate. The services “differ in delivery method—from in-person assistance to guided online do-it-yourself tools—and in eligibility, scope, and availability of state return preparation,” the US Treasury noted in anOctober 2025 report.\n\nIn that same report, Treasury announced it was suspending Direct File — the newest entrant into the free-prep-and-file universe — due largely to the program’s cost to the federal government. The program, which was still in the pilot phase, aimedto eventually provide free guided tax preparation and filing directly through the IRS.\n\nWhile Direct File is now defunct, several free IRS-approved options remain available this tax-filing season.\n\nThis is the longstanding public-private partnership between the IRS and its “trusted partners” in the private tax-prep software industry.\n\nIt’s available to filers whose adjusted gross income for 2025 was $89,000 or less and who have returnsusing the most commonly filed federal forms.\n\nThe IRS provides aninteractive questionnaireto help you figure out if you qualify for Free File—and if so, which of itseight partnersmight provide you with the services you need. Note: Some of the partners may file your state income tax return for free, too.\n\nThe Free File Fillable Forms (FFFF) program gives taxpayers the option to fill out many (but not all) federal tax return forms on the IRS site. There are no income, age or residency limitations on who may do so.\n\n“These are identical to IRS paper forms, so this option is like the old ‘pencil and calculator’ method of filing,” notes theTaxpayer Advocate Service(TAS), an independent organization within the IRS that represents taxpayer interests﻿. “However, the fillable forms don’t come with any additional guidance. If you plan to use this option, you should be comfortable with the process of completing a tax return.”\n\nFor tax year 2024, only 400,000 returns out of roughly 161 million were prepared using Free File Fillable Forms, according to Treasury.\n\nTheVoluntary Income Tax Assistance (VITA)program primarily helps tax filers with incomes below $69,000, those who are disabled and those who are not proficient in English.\n\nTheTax Counseling for the Elderly (TCE)program is often paired with VITA and is geared toward seniors. Unlike VITA, however, there are no formal IRS income limitations.\n\n“TCE sites offer free federal and state tax preparation assistance to taxpayers who are 60 and older and often specialize in tax issuesunique to seniors, such as pension and retirement-related issues,” according to TAS.\n\nTreasury estimates that for tax year 2024, roughly 67 million filers were eligible for VITA, but only 1.6 million returns were filed through the program. And through TCE, only 1.2 million returns were filed out of an eligible 22 million.\n\nVITA and TCE services are provided through nearly 3,100 partner organizations, such as theAARP Foundation, at sites across the country, according to theNational Taxpayer Advocate.\n\nHere is anIRS listof the types of returns that VITA and TCE partner organizations typically will prepare – but specific organizations may have a more limited list.\n\nIn addition to using the IRS Free File program, members of the military – as well as qualifying veterans and family members – may get free tax prep and filing services for both federal and state returns fromMilTax, which is provided by the Department of Defense.\n\nThere are no income restrictions, according to the TAS.\n\nThe MilTax software, it added, “was developed specifically to address the unique circumstances of military life that can affect taxes such as combat pay and dealing with multiple moves within the same tax year.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/17/business/2025-filing-taxes-new-tax-provisions",
      "text": "complexity"
    },
    {
      "url": "https://taxpolicycenter.org/fact-sheets/how-people-choose-tax-filing-methods",
      "text": "research"
    },
    {
      "url": "https://taxpolicycenter.org/taxvox/we-dont-know-how-many-people-file-their-taxes-free-congress-could-fix",
      "text": "found"
    },
    {
      "url": "https://home.treasury.gov/system/files/131/Report-Replacement-of-Direct-File-2025.pdf",
      "text": "October 2025 report"
    },
    {
      "url": "https://www.irs.gov/filing/free-file-most-commonly-filed-federal-forms-are-available",
      "text": "using the most commonly filed federal forms"
    },
    {
      "url": "https://apps.irs.gov/app/freeFile/general/",
      "text": "interactive questionnaire"
    },
    {
      "url": "https://apps.irs.gov/app/freeFile/browse-all-offers/",
      "text": "eight partners"
    },
    {
      "url": "https://www.irs.gov/e-file-providers/free-file-fillable-forms-program-limitations-and-available-forms",
      "text": "but not all"
    },
    {
      "url": "https://www.taxpayeradvocate.irs.gov/#:~:text=The%20Taxpayer%20Advocate%20Service%20(TAS)%20is%20an,*%20Tax%20Counseling%20for%20the%20Elderly%20(TCE)",
      "text": "Taxpayer Advocate Service"
    },
    {
      "url": "https://www.irs.gov/individuals/free-tax-return-preparation-for-qualifying-taxpayers",
      "text": "Voluntary Income Tax Assistance (VITA"
    },
    {
      "url": "https://www.irs.gov/individuals/tax-counseling-for-the-elderly",
      "text": "Tax Counseling for the Elderly (TCE)"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/business/tax-refunds-increase-2026",
      "text": "unique to seniors"
    },
    {
      "url": "https://taxaide.aarpfoundation.org/types-of-tax-returns-tax-aide-can-prepare",
      "text": "AARP Foundation"
    },
    {
      "url": "https://www.taxpayeradvocate.irs.gov/reports/2025-annual-report-to-congress/",
      "text": "National Taxpayer Advocate"
    },
    {
      "url": "https://www.irs.gov/pub/irs-pdf/p3676bsp.pdf",
      "text": "IRS list"
    },
    {
      "url": "https://www.militaryonesource.mil/financial-legal/taxes/miltax-military-tax-services/",
      "text": "MilTax"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/business/free-tax-filing-preparation-service",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/business/free-tax-filing-preparation-service",
      "text": "Cookie Settings"
    }
  ],
  "hash": "57afcfa2cc674b9fca0c94b62f37e818f2627c8513589519b8d4cff45bbc3556",
  "scraped_at": "2026-02-12T21:30:13.991265+00:00"
}