{
  "url": "https://lite.cnn.com/2026/02/21/sport/bill-mazeroski-pittsburgh-pirates-death-baseball",
  "title": "Bill Mazeroski: Baseball Hall of Famer, known for walk-off home run in 1960 World Series, dies at 89 | CNN",
  "date": "2026-02-22T07:09:34.663899+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nBill Mazeroski, theHall of Famesecond baseman who won eight Gold Glove awards for his steady work in the field and the hearts of countlessPittsburgh Piratesfans for his historic walk-off home run in Game 7 of the 1960 World Series, has died at the age of 89.\n\nPirates chairman Bob Nutting said “Maz was one of a kind, a true Pirates legend … His name will always be tied to the biggest home run in baseball history and the 1960 World Series championship, but I will remember him most for the person he was: humble, gracious and proud to be a pirate.”\n\nMazeroski died Friday, the Pirates said. No cause of death was given.\n\nElected to the Hall by the Veterans Committee in 2001, he was, by some measures, no superstar. Mazeroski had the lowest batting average, on-base percentage and stolen base total of any second baseman in Cooperstown. He hit just .260 lifetime, with 138 homers and 27 stolen bases in 17 years, and had an on-base percentage of .299. He never batted .300, never approached 100 runs batted or 100 runs scored and only once finished in the top 10 for Most Valuable Player.\n\nHis best qualities were both tangible and beyond the box score. His Hall of Fame plaque praises him as a “defensive wizard” with “hard-nosed hustle” and a “quiet work ethic.” A 10-time All-Star, he turned a major league record 1,706 double plays, earning the nickname “No Hands” for how quickly he fielded grounders and relayed them. He led the National League nine times in assists for second basemen and has been cited by statistician Bill James as the game’s greatest defensive player at his position — by far.\n\n“I think defense belongs in the Hall of Fame,” Mazeroski said, defensively, during his Hall of Fame induction speech. “Defense deserves as much credit as pitching and I’m proud to be going in as a defensive player.”\n\nBut his career’s signature moment took place in the batter’s box, as the square-jawed, tobacco-chewing Mazeroski, a coal miner’s son from West Virginia, lived out the dream of so many kids who thought of playing professional ball.\n\nThe Pirates had not reached the World Series since 1927, when they were swept by the New York Yankees, and again faced the Yankees in 1960. While New York was led by Mickey Mantle and Roger Maris, Pittsburgh had few prominent names beyond a young Roberto Clemente. They relied on hitters ranging from shortstop Dick Groat to outfielder Bob Skinner, and the starting pitchers Vernon Law and Bob Friend. Mazeroski, who turned 24 that September, finished the season with a .273 average and usually batted eighth.\n\nThe series told one story in the runs column and another in wins and losses. The Yankees outscored the Pirates 55-27, and 38-3 in the three games they won. Mazeroski’s counterpart on New York, Bobby Richardson, drove in a record 12 runs and was named the series’ MVP — even though he was on the losing team. Whitey Ford shut out the Pirates twice, on his way to a then-record 33 2-3 straight scoreless World Series innings for the Yankees ace.\n\nThe Pirates’ first three wins weren’t nearly so spectacular, but they were wins — and Mazeroski helped. He hit a 2-run homer in the fourth inning off the Yankees’ Jim Coates in Game 1, a 6-4 Pirate victory, and a 2-run double in the second inning off Art Ditmar in Game 5, a 5-2 Pittsburgh win. In Game 7, he saved his big hit for the end.\n\nSome 36,000 fans at Pittsburgh’s Forbes Field, and many more tuning in on radio and television, agonized through one of the fall classic’s wildest and most emotional conclusions. The lead changed back and forth as Pittsburgh scored the game’s first four runs, only to fall behind as the Yankees rallied in the middle innings and went ahead 7-4 in the top of the eighth. Pittsburgh retook the lead with five runs in the bottom of the eighth, helped in part by a seeming double play grounder that took a bad hop and struck Yankees shortstop Tony Kubek in the throat. But the Yankees came right back and tied the score at 9 in the top of the ninth.\n\nThe bottom of the ninth has been relived, not always by choice, by the two teams and by generations of fans. The New York pitcher was Ralph Terry, a right hander whom manager Casey Stengel had brought in during the previous inning and would later acknowledge that he had a tired arm. The right-handed hitting Mazeroski, who had grounded into a double play in his previous appearance, was up first.\n\nTerry started with a fastball, called high for a ball. After conferring briefly with catcher Johnny Blanchard, who reminded him to keep his pitches down, he threw what Mazeroski would call a slider that didn’t slide. Mazeroski got under it and belted it to left, the ball rising and rising as it cleared the high, ivy-covered brick wall, with Yankees left fielder Yogi Berra circling under it, then turning away in defeat. The whole city seemed to erupt, as if all had swung the bat with him, as if he were every underdog who longed to beat the hated Yankees. Mazeroski dashed around the bases, grinning and waving his cap, joined by celebrants from the stands who had rushed on to the field and followed him to home plate, where his teammates embraced him.\n\n“I was just looking to get on base,″ he told The New York Times in 1985. ″Nothing fancy, just looking for a fastball until he got a strike on me. I thought it would be off the wall, and I wanted to make third if the ball ricocheted away from Berra. But when I got around first and was digging for second, I saw the umpire waving circles above his head and I knew it was over.”\n\nESPN has called it the greatest home run in major league history. It was the first time a World Series had ended on a homer, leading to enduring waves of celebration and despair. Pirates followers memorized the date, Saturday, Oct. 13, 1960, and the local time of Mazeroski’s hit, 3:36 p.m. Forbes Field was torn down in the 1970s, but a decade later fans began gathering every Oct. 13 at the park’s lone remnant, the center field wall, and listened to the original broadcast.\n\nMeanwhile, Mantle would sob on the plane ride home in 1960, insisting the better team had lost. Ford would for years remain angry at Stengel — fired five days after the Series — for using him in Games 3 and 6 and making him unavailable to start a third time. Singer Bing Crosby, a co-owner of the Pirates, was so afraid he’d jinx his team that he listened to the game with friends across the Atlantic Ocean, in Paris.\n\n“We were in this beautiful apartment, listening on shortwave, and when it got close Bing opened a bottle of Scotch and was tapping it against the mantel,” his widow, Kathryn Crosby, told the Times in 2010. “When Mazeroski hit the home run, he tapped it hard; the Scotch flew into the fireplace and started a conflagration.”\n\nMazeroski was a Pirate for his entire time in the majors and was a team man off the field. His wife, Milene Nicholson, was a front office employee whom he met through Pittsburgh manager Danny Murtaugh. They were married in 1958, had two sons and remained together until her death in 2024.\n\nWilliam Stanley Mazeroski was born in Wheeling, West Virginia, during the Great Depression, grew up in eastern Ohio, and lived for a time in a one-room house without electricity or indoor plumbing. His father, Louis Mazeroski, had hoped himself to be a ballplayer and encouraged his son’s love for sports, even practicing with him by having Bill field tennis balls thrown against a brick wall.\n\nAlthough a star in basketball and football, he favored baseball and was good enough to be drafted by the Pirates at age 17, in 1954. Mazeroski was a shortstop for a team with numerous prospects at that position, and had switched to second by his rookie year, 1956. Even as a part-time player at the end of his career, he was a leader and steady presence on the 1971 team that featured Clemente and Willie Stargell and defeated the Baltimore Orioles in the World Series.\n\nAfter his final season, 1972, Mazeroski coached briefly for the Pirates and the Seattle Mariners and was an infield instructor for Pittsburgh during spring training. In 1987, the Pirates retired his uniform number, 9. The 50th anniversary of his Game 7 heroics was marked in 2010 by the unveiling — on Bill Mazeroski Way — of a 14-foot, 2,000-pound statue of one of Pittsburgh’s greatest everymen, rounding the bases, on top of the world.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/sport/baseball-hall-of-fame-jones-beltran",
      "text": "Hall of Fame"
    },
    {
      "url": "https://www.cnn.com/2025/08/23/sport/baseball-mlb-pittsburgh-pirates-bubba-chandler",
      "text": "Pittsburgh Pirates"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/sport/bill-mazeroski-pittsburgh-pirates-death-baseball",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/sport/bill-mazeroski-pittsburgh-pirates-death-baseball",
      "text": "Cookie Settings"
    }
  ],
  "hash": "58228b50fe127e9fc7d84d0cf2e810e0f1979f0557b7b5def9ce042a5b2b5440",
  "scraped_at": "2026-02-22T07:09:34.663913+00:00"
}
