{
  "url": "https://lite.cnn.com/2026/02/25/australia/australia-baghsarian-kidnap-murder-intl-hnk",
  "title": "Chris Baghsarian: Grandfather kidnapped from his bed and murdered in case of mistaken identity, police say | CNN",
  "date": "2026-02-27T07:16:57.227435+00:00",
  "authors": [
    "Hilary Whiteman"
  ],
  "text": "Source: CNN\n\nAcross the world from the expansive US police search for the missing Nancy Guthrie, a family in Australia faced its own disappearance, this time with a tragic ending – an 85-year-old grandfather was kidnapped from his modest home in suburban Sydney and found dead in what police say was a case of mistaken identity.\n\nChris Baghsarian, a widower who lived alone, was ripped from his bed on the morning of February 13 by assailants who detectives believe were intending to target another man.\n\n“I suspect that the intended target was going to be kidnapped, where a ransom for money was going to be asked,” Detective Acting Superintendent Andrew Marks told reporters Wednesday.\n\nNew South Wales (NSW) Police immediately alerted the kidnappers to their mistake in successive press conferences, urging them to abandon the grandfather at a safe location.\n\nInstead, a video emerged of the older man tied up at a location later found to be an abandoned and derelict property in Dural, on the outskirts of Sydney, some 20 kilometers (12 miles) from his home.\n\nBy the time police had identified and searched the location, Baghsarian was gone.\n\nIn the days after his disappearance, the man’s family released a statement describing the situation as a “surreal nightmare.”\n\n“We are struggling to make sense of the fact that he has been taken and that our family has been caught up in something that has nothing to do with us,” they said.\n\n“Chris is a devoted father, brother, uncle, and grandfather. He is deeply loved, gentle, and the kindest person.”\n\nOn Wednesday, police confirmed Baghsarian’s body had been found the previous day near a golf course in a rural area west of Sydney. An autopsy is expected to reveal his cause of death.\n\n“It’s somebody’s worst nightmare, right?” Marks told reporters. “The fact that an innocent man was taken from his home is not acceptable.”\n\n“These people need to be held to account.”\n\nLess than 24 hours after Baghsarian’s body was found, police swooped on two properties, arresting two men, ages 24 and 29, and seizing items they say connect them to his murder.\n\nVideo released by police shows tactical squads pulling up in SUVs to a large suburban home on Sydney’s outskirts, jumping the fence, and banging on the front door, before breaking in.\n\nInside, a woman can be heard screaming. Later, officers escort a barefoot, disheveled man to a waiting police van. A separate raid led to the arrest of another man, who’s expected to face similar charges of kidnapping and murder.\n\n“We’ll allege in court that these men participated in a joint criminal enterprise with other persons to kidnap Mr Baghsarian,” Marks said.\n\nPolice suspect that at least three people are involved in the fatal abduction, and they expect to make further arrests.\n\nKidnappings are rare in Australia – even more so when victims have no prior history that would suggest they were a target, said criminologist Clarke Jones, a visiting fellow at the Australian National University. “In past situations, people are released once they realize they’ve got the wrong person,” he said.\n\nHe said technology had made it easier for criminal groups to conceal their activities – and to coordinate action from within Australia or anywhere in the world.\n\n“The tighter the law enforcement gets on these types of crimes, the more they then adapt to try and evade any type of detection,” he said.\n\nBaghsarian’s family has asked for privacy as they process the disturbing events of the past two weeks.\n\n“This is an extraordinarily distressing time, and we need space to support one another and focus on navigating what comes next,” they said in a statement.\n\nSee Full Web Article",
  "links": [],
  "hash": "58336c8b5f9ce4419a2f71cb02f8b8fd4c6df5819c46462079d47193674dbbcc",
  "scraped_at": "2026-02-27T07:16:57.227449+00:00"
}