{
  "url": "https://lite.cnn.com/2026/02/15/china/us-china-munich-rubio-wang-intl-hnk",
  "title": "As Rubio tries to make amends, China looks to woo Europe | CNN",
  "date": "2026-02-15T07:10:33.573353+00:00",
  "authors": [],
  "text": "Source: CNN\n\nMinutes after top diplomatMarco Rubioproclaimed that the United States and Europe“belong together”in a conciliatory speech at the Munich Security Conference, his Chinese counterpart took to the stage with his own pitch.\n\n“China and the EU are partners, not rivals,” Chinese Foreign Minister Wang Yi told his audience, speaking from the same stage Saturday.\n\n“As long as we firmly grasp this point, we will be able to make the right choices in the face of challenges, prevent the international community from moving toward division and promote the continuous progress of human civilization.”\n\nThe Rubio-Wang double bill came as an overhaul of US foreign policy has shaken up America’s longstanding bonds with Western allies, who now openly declare that the era of US-backed global security and rules is over.\n\nNow, the race is underway to shape what comes next.\n\nRubio used his address at the annual security establishment get-together toreassure European leadersthat President Donald Trump’s administration is committed to their alliance, even as it believes they need to do more to support it, and that the current international system should be “rebuilt.”\n\nAnd Wang, a veteran diplomat who’s been the face of leader Xi Jinping’s foreign policy for more than a decade, was ready with his carefully calibrated rejoinder.\n\nProblems with the current international system did not lie primarily with the United Nations, he said, but “certain countries that magnify differences, pursue a country-first approach, engage in bloc confrontation and revive Cold War thinking.”\n\nChina and Europe, he added – in an apparent admonition of US policy and statecraft  –should together reject “unilateral practices,” safeguard free trade and oppose bloc confrontation.\n\nBut Wang presented China’s pitch at a moment when Beijing is also looking to keep steady its ties with the US, ahead of an expected trip to China by Trump later this spring.\n\nStakes are high for the landmark meeting, which could cement the relative stability between the world’s two biggest economies that emerged after aXi-Trump meeting in South Korea last fall.\n\nWhen asked about the visit, Wang told a Munich audience that he was “confident” about the prospects for China-US relations but offered a warning of how their ties could go awry.\n\nThere were “two different prospects” for the countries’ relations: one in which the US can “understand China reasonably” and cooperate, and another in which the US seeks decoupling, opposes China in a “knee-jerk way” and steps on China’s “red lines,” including on Taiwan.\n\nThe latter path would likely “push China and the United States toward conflict,” he said.\n\nRubio also addressed the US-China relationship at the conference Saturday, with the known China hawk telling an audience during a Q&A that it would be “geopolitical malpractice” if “two of the big powers on the planet” didn’t communicate to manage areas where their interests don’t align.\n\nRubio and Wang also met on the conference sidelines Friday for talks that appeared to further set the stage for the expected Trump visit.\n\nWang said after the Friday sit-down that the top diplomats had “positive and constructive” talks and would “jointly implement the important consensus reached by” their respective leaders.\n\nThe key question that Wang and his delegation may be probing at Munich is how deeply Europe is listening to its broader pitch.\n\nBeijing has long looked to promote its own vision for a world no longer dominated by US-led alliances and institutions – and more friendly to its own interests. And it sees Europe as an important pole that shouldn’t readily side with the United States.\n\nChina is “a steadfast force for peace” and “a reliable force for stability,” Wang’s message at the gathering went, as he presented Xi’s initiative to reshape global governance as the answer for the current moment.\n\nBut Beijing’s message has a tough audience, as European leaders fret about a gaping trade deficit with China and the country’s grip over strategic supply chains.\n\nAnd ties have been strained in recent years overChina’s backing of Russia as it wages war on Ukraine, and as European leaders have grown increasingly wary of Chinese military aggression in the South China Sea and around Taiwan, the self-governing democracy Beijing claims as its territory.\n\nOn Sunday, Taiwan’s foreign minister Lin Chia-lung disputed Wang’s positioning of China as a peaceful power, saying the country’s recent “military provocations” fly in the face of UN principles. (China says its military drills defend its “national sovereignty,” and Wang in his on-stage remarks in Munich accused some countries of “trying to split Taiwan from China” and framed Japan, not itself, as the regional threat.)\n\nDespite the concerns, Beijing sees an opening as Western leaders recalibrate their foreign policy in the face of a shifting relationship with the US.\n\nAlready in recent months,a number of leaders of US-allied countries have visited Beijing, looking to deepen cooperation and dialogue with China as they face frictions with the US.\n\nAhead of the Munich event, organizers proclaimed that the US-led post-1945 international order is “now under destruction,” with the US acting as the most powerful “wrecking ball.”\n\nEuropeans may have breathed what the chairman of the conference referred to as “sigh of relief” after Rubio’s speech, but Trump’s threats last month to take control of Greenland – the territory of its NATO ally Denmark – are still echoing in European ears.\n\nAnd Beijing hopes Europe at least will listen a little more closely to its own pitch.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2015/02/20/politics/marco-rubio-fast-facts",
      "text": "Marco Rubio"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/europe/rubio-speech-us-europe-relations-latam-intl",
      "text": "“belong together”"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
      "text": "reassure European leaders"
    },
    {
      "url": "https://www.cnn.com/2025/10/29/asia/us-china-trump-xi-meet-south-korea-intl-hnk",
      "text": "Xi-Trump meeting in South Korea last fall"
    },
    {
      "url": "https://www.cnn.com/2025/07/04/europe/china-ukraine-eu-war-intl",
      "text": "China’s backing of Russia as it wages war on Ukraine"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/china/china-us-europe-allies-analysis-hnk-intl",
      "text": "a number of leaders of US-allied countries have visited Beijing"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/china/us-china-munich-rubio-wang-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/china/us-china-munich-rubio-wang-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "587a2d94adcf653a8689d925d7da48fe6eeddef4031b48b2dda6d79fc3bff572",
  "scraped_at": "2026-02-15T07:10:33.573366+00:00"
}