{
  "url": "https://lite.cnn.com/2026/02/18/politics/voting-citizenship-proof-risks-elections",
  "title": "The risks of requiring proof of US citizenship to vote in elections | CNN Politics",
  "date": "2026-02-19T07:31:20.529270+00:00",
  "authors": [
    "Analysis by Aaron Blake, CNN"
  ],
  "text": "Source: CNN\n\nAs Republicans’ fortunes have dimmed ahead of the 2026 midterm elections, they’ve increasingly turned a panicked eyetoward voting restrictions.\n\nAnd to many GOP lawmakers, nothing is as urgent as passing theSAVE Act. It’s a bill that would require proof of citizenship to register to vote, among other provisions. The bill recently got its 50th Republican co-sponsor in the Senate — after already passing in the House — and some want party leaders togut the filibuster to force it through.\n\nIt’s a push that makes logical and political sense for the GOP. Polls from 2024 showed support for requiring proof of citizenship to register to vote ranged from67%to83%of respondents. Some Republicans have argued that, even though it’s already illegal for noncitizens to vote and there’sscant evidence of undocumented immigrants voting, it’s a worthwhile safeguard.\n\nBut recent data and history suggest there could be real danger that such restrictions will create bigger problems than they solve.\n\nSpecifically, the risk is that they disenfranche people who are legally allowed to vote but either can’t satisfy the restrictions (due to a lack of documentation) or decline to go to the trouble of doing so.\n\n(Critics of the legislation have raised particular concerns about disenfranchising people who lack documents, including voters of color and young people, and women whose married names don’t appear on their birth certificates or passports.)\n\nAnd given the lack of evidence that noncitizen voting amounts to a significant problem, the risk of doing more harm than good is pretty high.\n\nWe have a growing number of cautionary tales, including in a recent effort by some red states to use a federal database to root out noncitizens on their voter rolls.\n\nProPublica and the Texas Tribune over the weekend publishedan investigationinto states that have sought to exclude noncitizen voters using a Department of Homeland Security tool called the Systematic Alien Verification for Entitlements, or SAVE.\n\nIn Missouri, state officials told counties to make voters who were flagged as potential noncitizens by the tool temporarily unable to vote. But the investigation found hundreds of examples of people being incorrectly flagged.\n\nCNN’s Fredreka Schoutenfound similar things earlier this month.\n\nIn Idaho, about 760 people were initially flagged, but only about a dozen cases were later referred to state police for possible criminal charges.\n\nIn Texas, state officials have given voters flagged by the system 30 days to verify their citizenship or be dropped from the voter rolls. In one county as of early February, 55 of 84 people flagged by the system hadn’t responded to notices. About half of the rest had been improperly added to voter rolls by administrators, while the other half proved their citizenship.\n\nThe numbers of mistakenly flagged voters, while not overwhelming, are quite notably more than the total number of known noncitizen voters in recent federal elections.\n\nThe pro-Trump Heritage Foundation keeps a database of voter fraud crimes. It includesfewer than 100 cases of noncitizen votingbetween 2002 and 2022.\n\nAnd a study from the left-leaning Brennan Center for Justice of the 2016 election likewise found just30suspectednoncitizen votesout of 23 million votes studied.\n\nThe situations are dynamic, and voters have chances to verify their eligibility. But the situations in Missouri and Texas raise the prospect that the number of eligible voters who could be incorrectly excluded will be greater than the number of noncitizen voters in recent elections. That’s especially the case in Texas, where the burden falls on the voter to correct any errors.\n\nAnd the experiences of states that have sought to require proof of citizenship in their elections also speaks to this potential problem.\n\nNew Hampshire lawmakers in 2024 passed one of the strictest proof-of-citizenship requirements in the country. A voting rights group later found that, during low-profile elections in the state in 2025,244 people who tried to vote were turned away.\n\nIn Arizona, the state has a bifurcated system in which people who don’t provide proof of citizenship can register to vote in federal elections, but not state elections. ABrennan Center studylast year found the resulting group of “federal-only” voters were disproportionately voters of color and significantly less likely to be Republican.\n\nAnd perhaps the most pertinent example is Kansas.\n\nA 2011 state law requiring proof of citizenship wound up blocking the voter registrations ofmore than 30,000 US citizens— about 12% of all people seeking to register for the first time.\n\nThe law was later struck down by the federal courts. In doing so, aUS district courtnoted that the state had just 39 noncitizens who registered to vote between 1999 and 2013 – while qualifying that many or most of them might have been registered through administrative errors.\n\nSo that’s more than 30,000 blocked registrations – to fix a problem that the data pegged to be in the dozens, if that.\n\nThe defendant in the lawsuit that ultimately resulted in the law being blocked was Republican Kansas Secretary of State Scott Schwab, who had supported it as a state legislator but has since cautioned states and the federal government about the potential risk of requiring proof of citizenship.\n\n“Kansas did that 10 years ago,” Schwabtold the Associated Pressin 2024. “It didn’t work out so well.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nytimes.com/2026/02/17/us/politics/republicans-vote-fraud-id-midterms.html",
      "text": "toward voting restrictions"
    },
    {
      "url": "https://www.cnn.com/2025/04/10/politics/save-act-noncitizen-voting-bill-house",
      "text": "SAVE Act"
    },
    {
      "url": "https://www.nbcnews.com/politics/congress/trumps-election-bill-save-america-act-50-senate-votes-democrats-block-rcna259351",
      "text": "gut the filibuster to force it through"
    },
    {
      "url": "https://apnorc.org/wp-content/uploads/2024/10/October-topline_final-2.pdf",
      "text": "67%"
    },
    {
      "url": "https://news.gallup.com/poll/652523/americans-endorse-early-voting-voter-verification.aspx",
      "text": "83%"
    },
    {
      "url": "https://www.cnn.com/2024/04/12/politics/fact-check-trump-johnson-elections",
      "text": "scant evidence of undocumented immigrants voting"
    },
    {
      "url": "https://www.propublica.org/article/save-voter-citizenship-tool-mistakes-confusion",
      "text": "an investigation"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/trump-voter-roll-audit-push",
      "text": "CNN’s Fredreka Schouten"
    },
    {
      "url": "https://www.cnn.com/2024/04/12/politics/fact-check-trump-johnson-elections",
      "text": "fewer than 100 cases of noncitizen voting"
    },
    {
      "url": "https://www.brennancenter.org/our-work/research-reports/noncitizen-voting-missing-millions",
      "text": "30suspectednoncitizen votes"
    },
    {
      "url": "https://www.unionleader.com/news/politics/state/voting-rights-group-new-election-reforms-turned-away-hundreds-of-potential-voters/article_1b52efd5-0186-4544-9dba-3aab0caa6ec9.html",
      "text": "244 people who tried to vote were turned away"
    },
    {
      "url": "https://www.brennancenter.org/our-work/analysis-opinion/arizonas-show-your-papers-requirement-hurts-voters",
      "text": "Brennan Center study"
    },
    {
      "url": "https://www.cnn.com/2020/04/29/politics/federal-appeals-court-kansas-voter-law",
      "text": "more than 30,000 US citizens"
    },
    {
      "url": "https://cases.justia.com/federal/appellate-courts/ca10/18-3133/18-3133-2020-04-29.pdf?ts=1588176048",
      "text": "US district court"
    },
    {
      "url": "https://apnews.com/article/kansas-noncitizen-voting-proof-of-citizenship-50d56a0b8d1f0fde15480aab3db67f4f",
      "text": "told the Associated Press"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/voting-citizenship-proof-risks-elections",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/politics/voting-citizenship-proof-risks-elections",
      "text": "Cookie Settings"
    }
  ],
  "hash": "58b057de59b6440539a2f290f6cb21832ec53c8734a98598f996dd26deb410ce",
  "scraped_at": "2026-02-19T07:31:20.529285+00:00"
}