{
  "url": "https://lite.cnn.com/2026/02/20/us/louisiana-ten-commandments-schools",
  "title": "Court clears way for Louisiana law requiring Ten Commandments in classrooms to take effect | CNN",
  "date": "2026-02-21T07:04:29.640744+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nA U.S. appeals court has cleared the way for a Louisiana law requiring poster-sized displays of the Ten Commandments in public classrooms to take effect.\n\nThe 5th Circuit Court of Appeals voted 12-6 to lift a block that a lower court first placed on the law in 2024. In the opinion released Friday, the court said it was too early to make a judgment call on the constitutionality of the law.\n\nThat’s partly because it’s not yet clear how prominently schools may display the religious text, if teachers will refer to the Ten Commandments during classes, or if other things like the Mayflower Compact or Declaration of Independence will also be displayed, the majority opinion said.\n\nWithout those sorts of details, the panel decided it didn’t have enough information to weigh any First Amendment issues that might arise from the law. In other words, there aren’t enough facts available to “permit judicial judgment rather than speculation,” the majority wrote in the opinion.\n\nBut the six judges who voted against the decision wrote a series of dissents, some arguing that the case was ripe for judicial review and others saying that the law exposes children to government-endorsed religion in a place they are required to be, presenting a clear constitutional burden.\n\nCircuit Judge James L. Dennis wrote that the law “is precisely the kind of establishment the Framers anticipated and sought to prevent.”\n\nThe ruling comes after the full court heard arguments in the cases in January following a ruling by a three-judge panel of the court that Louisiana’s lawwas unconstitutional.Arkansas also hasa similar lawthat has been challenged in federal court.\n\nTexas’ lawtook effect on Sept. 1, marking the largest attempt in the nation to hang the Ten Commandments in public schools. Multiple school districts were barred from posting them after federal judges issued injunctions in two cases against the law, but they have already gone up in many classrooms across the state as districts paid to have the posters printed themselves or accepted donations.\n\nThe laws are among the pushes by Republicans, including President Donald Trump, to incorporate religion into public school classrooms. Critics say it violates the separation of church and state while backers argue that the Ten Commandments are historical and part of the foundation of U.S. law.\n\nThe laws have been challenged by families representing a variety of religions, including Christianity, Judaism and Hinduism, and clergy, in addition to nonreligious families.\n\nIn 1980, theU.S. Supreme Court ruledthat a similar Kentucky law violated the Establishment Clause of the U.S. Constitution, which says Congress can “make no law respecting an establishment of religion.” The court found that the law had no secular purpose but served a plainly religious purpose.\n\nAnd in 2005, the Supreme Court held that such displays in a pair of Kentucky courthouses violated the Constitution. At the same time, the court upheld a Ten Commandments marker on the grounds of the Texas state Capitol in Austin.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/06/21/us/louisiana-law-ten-commandments-schools",
      "text": "was unconstitutional."
    },
    {
      "url": "https://www.cnn.com/2025/08/05/us/arkansas-ten-commandments-law-injunction-hnk",
      "text": "a similar law"
    },
    {
      "url": "https://www.cnn.com/2025/11/18/us/texas-judge-blocks-ten-commandments-law",
      "text": "Texas’ law"
    },
    {
      "url": "https://supreme.justia.com/cases/federal/us/449/39/",
      "text": "U.S. Supreme Court ruled"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/louisiana-ten-commandments-schools",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/louisiana-ten-commandments-schools",
      "text": "Cookie Settings"
    }
  ],
  "hash": "58b9904c591241af99c4daef52f87f035891523e2daef7b0af0d6e4e4250d0dd",
  "scraped_at": "2026-02-21T07:04:29.640757+00:00"
}
