{
  "url": "https://lite.cnn.com/2026/02/14/business/pro-wrestling-politics-cec",
  "title": "The new move shaking up pro wrestling: anti-ICE chants | CNN Business",
  "date": "2026-02-15T07:10:56.538205+00:00",
  "authors": [],
  "text": "Source: CNN\n\nBig Bad Brody King stood in one corner, long gray-streaked beard jutting out, all hulking muscle and tattoos above his barbed-wire logo trunks. In the other corner, hair combed neatly back and beard tidily trimmed, stood Maxwell Jacob Friedman, the reigning All Elite Wrestling World Champion. With the two pro wrestlers about to square up in a Wednesday night match in Las Vegas this month, the fired-up crowd spoke with one voice: “F**k ICE!”\n\nThe video, with a stiff-faced Friedman casting wide-eyed sideways looks at the crowd, quickly spread outside the circles of wrestling fandom. A great match is a great match, and a wildly charismatic babyface or heel has been known to make the leap to Hollywood stardom and beyond. But rarely does a crowd reaction at an event make a splash in the broader world.\n\nProfessional wrestling has always drawn on politics as a source of melodrama. There was Hulk Hogan, who stomped into the ring while his theme song, “Real American,” blared over the speakers, rousing the arena for him to fight the “foreign” Iron Sheik. Or Sgt. Slaughter, whose villainous persona made him a Saddam Hussein sympathizer at the height of the Gulf War.\n\nBut the chants at the recent AEW match showcased a new, more specific way that wrestling is grappling with politics. If American political life has, as commentators say, come more and more to resemble pro wrestling, then pro wrestling has also evolved to meet it. Where wrestlers used to work in broad, cartoonish themes that appealed to the agreed-on sympathies of the entire audience, today the question of what the good guys stand for is a live dispute, matching the conflicts playing out in the real world.\n\nKing has raised money to support immigrants in Minnesota and has worn an “Abolish ICE” shirt in the ring; “Hangman” Adam Page gave a speech in Spanish during a show in Mexico City, reminiscing to the roaring crowd about working side by side with Mexican farm workers in the US and praising their values and work ethic — and then declaring that he planned to hunt down his rival Jon Moxley and “Le voy a partir su madre!”\n\nThe most prominent political chant in wrestling history is the “USA” chant, for jeering wrestlers who hailed from outside the US, said Eero Laine, a professor of theater who studies the history of professional wrestling at the State University of New York at Buffalo. World Wrestling Entertainment also had a tag team named the Real Americans, portrayed by American wrestler Jack Swagger and Swiss wrestler Cesaro, who led crowds in a “We the People” chant.\n\nWrestlers, Laine said, “could embody an idea.”\n\n“You can actually watch two ideas fight each other in the ring, and you can cheer and boo for each of them,” he said. “So there’s a kind of morality play at work in the ring.”\n\nSometimes wrestlers have even portrayed real political figures, as when impersonators of then-Senators Barack Obama and Hillary Clinton squared off during the 2008 presidential campaign.\n\nBut the anti-ICE calls from the crowd at AEW, Laine said, “are interesting in that they support a political stance associated with one of the wrestlers, but they are not necessarily directly related to what’s happening in the ring. And the chant is not part of the repertoire of standard wrestling chants.”\n\nThe embrace of contemporary issues is part of a larger, politically shaded rivalry playing out in the industry, between the 7-year-old AEW and the industry’s ruling juggernaut for generations, WWE (Warner Bros. Discovery, CNN’s parent corporation, owns a minority stake in AEW).\n\nWWE, founded by the McMahon family, started in the 1950s as a relatively small company based in the northeastern United States, then rolled up its regional rivals in the 1980s to dominate wrestling coast to coast.  It is the largest wrestling promotion in the world, and it regularly garners double, if not triple the audience of AEW, according toWrestlenomics.\n\nAs WWE grew, the conservative political involvement of the McMahon family grew with it. Vince McMahon, who purchased the company from his father in 1982 and was executive chairman before resigning in 2024, is a personal friend of President Donald Trump. His wife, Linda McMahon, is the US education secretary. His son-in-law, Paul Levesque — also known by his wrestling name, Hunter Hearst Helmsley, or Triple H — is the vice chair of the President’s Council on Sports, Fitness, and Nutrition.\n\nTrump himself is a member of the WWE Hall of Fame.\n\nAEW’s willingness to have wrestlers take stances on contemporary issues has become, for fans, a point of distinction between the promotions, drawing audiences wary of the McMahons’ connections back to sports entertainment.\n\nScott Lange, of Atlanta, was a wrestling fan when he was in college. Wrestlers like former Olympic gold medal winner Kurt Angle and Dwayne “The Rock” Johnson were popular, and he enjoyed how it all seemed simultaneously over-the-top, yet self-aware.\n\nBut then there was a lot of “tawdry, ugly stuff,” he said. He stopped watching for 20 years.\n\nAEW brought him back, though. And in large part, he said, it was because the wrestlers were allowed to express themselves more freely. A lot of the main roster is “politically aware and seems to care about making the country a better place,” Lange said.\n\n(Representatives for King declined to comment. Representatives for AEW, Friedman, and WWE did not respond to requests for comment.)\n\nThe founding family of AEW, like the McMahons, rose from relatively humble origins. The father of AEW founder Tony Khan, Shahid Khan, was born in Pakistan in 1950, and moved to the US when he was 16 for college. While still in college, he began working for Flex-N-Gate, an automotive supplier. By the time he was 30, he bought the company. By 2012, he had bought the NFL’s Jacksonville Jaguars.\n\nTony Khan founded AEW in 2019. While Shahid Khan has called himself a “big fan” of President Trump’s economic policies, and donated to his 2017 inauguration, Shahiddid not donateto his 2025 inauguration and hassaidhe differs with Trump on social issues like religion and immigration. Both Khans have donated to both political parties, according to public filings.\n\nUnlike the McMahons, Tony Khan has said that he doesn’t like to publicly involve himself in politics.\n\nBut if wrestlers do so, it’s all part of the show.\n\n“The wrestlers, they are themselves and that’s part of what makes the show great,” Khansaidon a media call this past September. “Whether everyone agrees with everything every wrestler says or not is not the point of the show to me. It’s that it’s a great wrestling show.”\n\nThe key to understanding business strategy in wrestling, Laine said, is in the title of a book by the former wrestling executive and WWE Hall of Fame member Eric Bischoff: “Controversy Creates Cash.”\n\n“That’s the bottom line with wrestling, it’s attention,” Laine said. “They’re selling attention.”\n\nRegardless of its ownership’s Trump ties, the WWE shows signs it recognizes the usefulness of playing to the other side, too. Lately, Laine noted, the WWE’s star villain Becky Lynch has been using some familiar-sounding language while playing up her status as a sore loser. “I’ve gotten counsel from the best lawyers in the world,” Lynch declared in one recent in-storyinterview.“I have won 100% of my matches that haven’t been rigged!”\n\nThe real point, Lange said, is still the spectacle.\n\n“I don’t necessarily want didactic political speech out of wrestlers,” Lange said. “But I enjoy watching a company where I feel like people’s hearts are in the right place. They’re aware of what’s going on.”\n\n“You can subtly comment on the world and the things that are happening without beating your heads in about it,” he added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://wrestlenomics.com/tv-ratings/",
      "text": "Wrestlenomics"
    },
    {
      "url": "https://www.sportico.com/business/finance/2025/trump-inauguration-donors-sports-adelson-draftkings-1234849209/",
      "text": "did not donate"
    },
    {
      "url": "https://web.archive.org/web/20250722000237/https://finance.yahoo.com/news/nfl-team-owner-shad-khan-still-supports-trump-on-economy-not-on-social-issues-194957687.html",
      "text": "said"
    },
    {
      "url": "https://www.msn.com/en-us/news/other/tony-khan-politically-left-leaning-aew-stars-are-shown-as-their-authentic-selves/ar-AA1MVfEX#:~:text=SmartAsset-,During%20which%2C%20he%20was%20asked%20about%20his%20%22politically%20left%2D,LendingTree",
      "text": "said"
    },
    {
      "url": "https://www.youtube.com/watch?v=JXF0iG1P7XM",
      "text": "interview."
    },
    {
      "url": "https://www.cnn.com/2026/02/14/business/pro-wrestling-politics-cec",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/business/pro-wrestling-politics-cec",
      "text": "Cookie Settings"
    }
  ],
  "hash": "58dc6c1a4d57309be8f5decc5016a75cb56d3eb79df7523835796d37f86aecd7",
  "scraped_at": "2026-02-15T07:10:56.538218+00:00"
}