{
  "url": "https://lite.cnn.com/2026/02/12/politics/el-paso-trump-administration-finger-pointing",
  "title": "El Paso, Texas: Communications breakdown over airspace closure sparks finger pointing across Trump administration | CNN Politics",
  "date": "2026-02-13T07:30:55.643960+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Federal Aviation Administration’s abrupt and unexplainedclosure of airspace above El Paso, Texas,early Wednesday has given way to a blame game inside the administration, with key senior officials asserting they hadn’t been alerted to the decision beforehand, according to several people familiar with the matter.\n\nThe White House, which was furious with the FAA for the decision, blames the agency for failing to alert the appropriate people in the West Wing of its plan to shut down the airspace for 10 days, two senior administration officials told CNN. Senior aides to President Donald Trump view this as a FAA “f**k-up,” not a Pentagon one, one of the officials said.\n\nElsewhere in the administration, top officials were pointing fingers at the Department of Homeland Security and the Pentagon for using new counter-drone technology in civilian airspace without first alerting the FAA, sources familiar with the talks said.\n\nAnd one source disputed that the White House was kept in the dark, asserting that the FAA notified senior National Security Council staffers and the Homeland Security Council Tuesday evening that the airspace was going to be restricted and that they would issue the temporary flight restriction. The source said it was unclear if the officials who had been notified informed their agency’s principals.\n\nThe intense finger-pointing inside the administration more than 24 hours after the airspace had reopened underscored both the concerns raised by the series of events and the rush to find someone to blame for it.\n\nThe episode was met with heightened frustration as it threatened to taint the entire administration with a pall of incompetence and seemed to reveal communications problems among critical areas of Trump’s government, one official said. The White House was particularly concerned about the uncertainty created by the vague nature of the airspace closure notice, which classified the area around El Paso as “(National) Defense Airspace” and said pilots who violated the restriction could be intercepted.\n\nMuch of the internal White House frustration is now being directed at Transportation Secretary Sean Duffy, whose agency houses the FAA, the two senior officials said.\n\nDuffy was aware ahead of time the FAA was going to be shuttering the airspace, “but he didn’t tell anyone,” one of the officials told CNN.  He later told top White House officials that he knew about the announcement ahead of time, the official said. But another administration official blamed FAA Administrator Bryan Bedford, saying that he “decided to close the airspace without alerting White House, Pentagon, or Homeland Security officials.”\n\nA separate source familiar with the process strongly defended Duffy and disputed that the FAA kept the White House in the dark.\n\n“It’s baffling that White House officials are upset with Duffy for protecting the airspace and not the folks who launched the laser,” the source familiar with the talks said, blaming the Department of Homeland Security and the Pentagon for shooting “into commercial air space.”\n\nDespite many White House officials being “furious” with the FAA and Duffy, as one of the senior administration officials characterized it, it is unclear whether Trump will move to hold any specific individuals accountable.\n\nThere is a broad feeling in the Trump administration that the breakdown in communications was, in part, a result of the heavy distrust between the FAA and the Pentagon, which has existed ever since a military helicopter collided midair with a commercial plane in Washington, DC, last year, sources said. One of the sources said the Pentagon does not have a great track record when it comes to training operations in open airspace, referencing the DC crash that killed 67 people.\n\nThe administration officially blamed the closure on an incursion of drones from Mexican drug cartels. Duffy was among the first to do so publicly, saying on social media “the threat has been neutralized.”\n\nBut incursions along the southern border are extremely common, and historically do not prompt such airspace closures. And one of the administration officials denied that a Mexican drug cartel drone and the US response prompted any real danger to commercial travel, telling CNN that “at no point in the process of disabling these cartel drones were civilian aircraft in danger as a result of the methods used by DOW to disable the drones.”\n\nThe reality of the closure appeared more complicated.\n\nOfficials told CNN on Wednesday the decision to close the airspace was prompted after Customs and Border Protection officials deployed a high-energy counter-drone laser on loan from the Pentagon without having coordinated with the FAA about potential risks to civilian flights. A source told CNN the technology was used to shoot down four mylar balloons this week. In the minds of some, its use raised immediate concerns for civilian traffic arriving and departing El Paso International Airport.\n\nA source familiar with the process said the FAA had learned after the fact that the laser had been operationalized. It was only then that the FAA decided to issue the restriction on El Paso’s airspace.\n\nPreviously, the FAA, Pentagon, NSC and DHS had been engaged in back-and-forth discussions over the new counter-drone technology and what they deemed as its safe use, officials said. But the conclusion of those discussions appeared to be in dispute Wednesday.\n\nAccording to a source familiar with the discussions, the FAA told the agencies that if they chose to use the technology without first allowing the FAA to test it in commercial airspace, then the FAA would have to restrict the airspace. “The Pentagon refused,” the source said.\n\nFAA and Pentagon officials had been scheduled to meet February 20 to review potential impacts and mitigation measures for a test of the laser system, a technology the Pentagon has been testing in more remote areas of the country, multiple sources said. But, in their telling, the Defense Department sought to use the system sooner around El Paso, and the FAA imposed the temporary flight restriction until that coordination could occur.\n\nA senior administration official, though, said the Pentagon gave DHS the authorization to use the laser technology, and that they had been practicing and discussing the operation for months. The official argued that DOD and DHS did not need FAA approval to operationalize it.\n\nOn the morning the airspace was closed, officials in the West Wing, the FAA and the Pentagon held early meetings and exchanged urgent communications, and senior White House officials made clear the airspace needed to reopen, sources said. The aviation agency soon announced the closure was lifted.\n\n“When everyone saw the news, we called the FAA and told them to reverse course. And so that’s what they did,” one of the senior administration officials said.\n\nArea lawmakers from El Paso — with a population of nearly 700,000 — have bemoaned that the closure notice came without any warning.\n\n“What we were told was everything is grounded, and there was no information. But our city was going to be shut down for ten days, and that’s all the information we got and still today, we have no information and we have no correspondence with the FAA,” El Paso Mayor Renard Johnson told CNN on Thursday.\n\n“9/11 shut down our airport for only two days, but a drone was going to shut down our community for 10 days? It just doesn’t make sense to us here. We haven’t heard any good reasons of why they didn’t coordinate with us.”\n\nAnd some Democrats from the El Paso area, which is hub of cross-border commerce alongside neighboring Ciudad Juárez in Mexico, are now accusing the Trump administration of being duplicitous in the aftermath of the incident.\n\n“The amount of misinformation being spread — including by the White House — is alarming and unhelpful,” Rep. Veronica Escobar wrote on social media. “This was the result of incompetence at the highest levels of the administration.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
      "text": "closure of airspace above El Paso, Texas,"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/el-paso-trump-administration-finger-pointing",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/el-paso-trump-administration-finger-pointing",
      "text": "Cookie Settings"
    }
  ],
  "hash": "58ed6e9a063f4ae285d02f7da6ab31a0cc0790e7bae5fb526641c391e5bf65ae",
  "scraped_at": "2026-02-13T07:30:55.643973+00:00"
}