{
  "url": "https://lite.cnn.com/2026/02/26/asia/father-hong-kong-wanted-activist-jailed-intl-hnk",
  "title": "Hong Kong court jails father of US-based democracy activist under national security law | CNN",
  "date": "2026-02-27T07:16:59.267648+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nAHong Kongcourt on Thursday sentenced the father of a wanted pro-democracy activist to eight months in prison under the city’s national security law after he attempted to terminate her insurance policy and withdraw the funds.\n\nKwok Yin-sang, 69, was found guilty on February 11 for “attempting to deal with, directly or indirectly, any funds or other financial assets or economic resources” belonging to an “absconder” under the city’s homegrown national security law, also known as Article 23.\n\nHe is the first person in the city to be charged and convicted with the offense. He had pleaded not guilty and did not testify at the trial. In court on Thursday, he appeared calm and waved goodbye before being taken back into custody.\n\nHis daughter, Anna Kwok, helps lead the Washington-based advocacy group Hong Kong Democracy Council, and is one of 34 overseas activists wanted by Hong Kong national security police.\n\nShe is accused of colluding with foreign forces and police have offered a bounty of HK$1 million ($128,000) for her arrest.\n\nIn Washington, before her father’s sentence was handed down, Anna Kwok told Reuters she found it “utterly despicable” that the Hong Kong government was going after her dad.\n\n“This is the first case, but it is not going to be the last case,” she said.\n\nHer father was accused of trying to withdraw funds totalling HK$88,609 ($11,342) from an insurance policy that he bought for her when she was two years old.\n\nMagistrate Andy Cheng said Kwok’s case was a serious one under the national security law and had nothing to do with family ties.\n\n“There is no such thing as … collective punishment, and it has absolutely nothing to do with whether the defendant and the fugitive are family,” Cheng said.\n\nWhen asked what she would like to tell her dad, Anna Kwok said she wanted to hug him and apologize for putting him in such a difficult situation.\n\n“Asian dads are not very known for showing affection with hugs and I realized this year, I actually … don’t think I’ve ever hugged my dad since I became an adult,” she said.\n\nChina imposed a sweeping national security law on Hong Kong in 2020 and the city’s legislature passed a second set of national security laws -Article 23- in 2024, to plug what authorities called “loopholes” in the national security regime.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/world/asia/hong-kong",
      "text": "Hong Kong"
    },
    {
      "url": "https://www.cnn.com/2024/03/08/world/hong-kong-new-national-security-laws-china-intl-hnk",
      "text": "Article 23"
    }
  ],
  "hash": "59179881c57bf29068554a0a47263a3e32450e346d5cadb4ee6f7c9a11e69741",
  "scraped_at": "2026-02-27T07:16:59.267665+00:00"
}