{
  "url": "https://lite.cnn.com/2026/02/11/us/violent-crime-us-cities-report",
  "title": "Steep drop in violent crime in major US cities, data analysis shows | CNN",
  "date": "2026-02-11T16:38:14.016644+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nMajor US cities overall experienced a steep drop in violent crime last year, according to astatistical analysisreleased by the Major Cities Chiefs Association.\n\nThe analysis reflects an overall downward trend in recent years, after violent crime spiked during the Covid-19 pandemic, according to year-end statistics compiled by the FBI through 2024.\n\nThe most recentMajor Cities Chiefs Associationsurvey, which was made up of statistics compiled from 67 of 68 responding law enforcement agencies and released earlier in February, shows homicides were down just over 19% last year. The report also showed that robbery was down almost 20%, rape was down almost 9% and aggravated assault was down almost 10% last year compared to 2024, the statistics show.\n\nThe report is just the latest crime statistical analysis that shows declines in violent crimes in 2025. It joins areport from the Council on Criminal Justicethat was released in January that also showed steep declines in homicides and other crimes.\n\nThe think tank zoomed in on year-end crime statistics from 40 large cities and found that homicides dropped 21% last year when compared to 2024, the largest single-year decline on record. They also project that when the FBI puts out its year-end statistics, the homicide rate will likely be the lowest it’s been nationally since 1900.\n\n“It’s a dramatic drop to an absolutely astonishing level,” said Adam Gelb, president and CEO of the Council on Criminal Justice, told CNN in a recent interview. “It’s not just a drop, it’s an historic collapse in the homicide rate.”\n\nCNN on Wednesday requested comment from the Major Cities Chiefs Association, made up of police executives who represent the largest cities in the US and Canada.\n\nWhile it’s nearly impossible to zero in on any one reason for why murders and other violent crime have dropped nationally in 2025, analysts point to a combination of renewed precision policing tactics that have coupled with advancements in technology, along with preventative measures, such as violence interrupters and the court system getting through backlogs from the Covid-19 pandemic.\n\nHomicides dropped steeply in Chicago, from 587 in 2024 to 417 last year, the data shows. Columbus, Ohio, saw dramatic drops in every category, including rapes, down to 678 last year from 1,116 in 2024. Houston saw a drop in aggravated assault, from 18,590 in 2024 down to 15,378 last year, according to the report. Robberies were down in Los Angeles, from 8,593 in 2024 to 7,278 last year, the records show.\n\nMeanwhile, New York City saw the fewest number of shooting victims and shooting incidents in 2025 in its recorded history. Homicides were down over 20% and robberies were down nearly 10%, according to statistics released by the NYPD. Rapes did increase by 16%, a jump the NYPD attributed to legislative change that broadened the legal definition of rape.\n\nDespite the overall downward trend in homicides and other violent crimes, not all cities were down, according to the statistics from the Major Cities Chiefs Association.\n\nBoston saw more homicides last year, with 31, up from 24 in 2024. El Paso, Texas, also showed an increase of 30 homicides last year, up from 24 the previous year. Fort Worth, Texas, was up from 75 homicides in 2024 to 81 last year. Suffolk County on Long Island, New York, also saw a jump, from 11 homicides in 2024 to 26 last year, the data shows.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://majorcitieschiefs.com/wp-content/uploads/2026/02/MCCA-Violent-Crime-Report-2025-and-2024-Year-End.pdf",
      "text": "statistical analysis"
    },
    {
      "url": "https://majorcitieschiefs.com/",
      "text": "Major Cities Chiefs Association"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/us/us-cities-homicide-rate-report",
      "text": "report from the Council on Criminal Justice"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/violent-crime-us-cities-report",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/us/violent-crime-us-cities-report",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5959a6aca1058a08f76b7fe5c0b1c9b2c53478486032800602356c722ab71d34",
  "scraped_at": "2026-02-11T16:38:14.016659+00:00"
}