{
  "url": "https://lite.cnn.com/2026/02/18/politics/trump-launches-board-of-peace",
  "title": "Trump launches his ‘Board of Peace’ with billions pledged for Gaza, but many allies are wary | CNN Politics",
  "date": "2026-02-19T07:30:59.876298+00:00",
  "authors": [
    "Jennifer Hansler",
    "Kylie Atwood",
    "CNN"
  ],
  "text": "Source: CNN\n\nWhen President Donald Trump convenes the inauguralmeeting of his Board of Peaceon Thursday, he is expected to run it like one of his Cabinet meetings, a US official told CNN.\n\nInstead of his Cabinet officials, however, he will be joined by representatives from countries like Qatar, Saudi Arabia, Egypt, Hungary and even Belarus, which is a member of the board despite being under US and European sanctions for supporting Russia’s war against Ukraine. However, several key allies are still staying away from membership.\n\nIn addition to Trump, Secretary of State Marco Rubio; Trump’s son-in-law Jared Kushner; US Ambassador to the United Nations Mike Waltz; US special envoy Steve Witkoff, former British Prime Minister Tony Blair, who sits on the executive committee for the Board; and High RepresentativeNickolay Mladenov, who serves as the key link between the board and the Palestinian technocratic committee, are all expected to speak, along with other attendees, according to a senior US official.\n\nTwo sources familiar with the matter said the countries attending the meeting as members were told they will have two minutes each to speak, but another source said Wednesday that allotment was now expected to be 90 seconds. According to the US official, Trump may ask specific countries for updates or opinions. There are expected to be updates on issues of security, humanitarian efforts and the Palestinian technocratic committee meant to run Gaza, the senior US official said.\n\nTrump has previewed big announcements for the meeting, including billions of dollars to support the reconstruction of Gaza and personnel for the stabilization force there.\n\nBut there are lingering questions about the broad mission of the Board of Peace, its effectiveness and the broader future of Gaza.\n\nThere is some concern in the international community that Trump has established the body as a counterweight to the United Nations, of which he has been a sharp critic.\n\nIn remarks on Monday, Trump confirmed that he thinks the Board is “going to go far beyond Gaza,” but said “we’re working in conjunction with the United Nations.”\n\nTrump, who could serve indefinitely as chair of the board, has been eager to tout his credentials as a peacemaker and has argued he was snubbed for the Nobel Peace Prize last year. The meeting is happening at the US Institute of Peace, which Trump has recently renamed for himself.\n\nThe meeting – and the board itself – are a clear example of Trump pursuing a foreign policy goal without collective buy-in from America’s closest allies: Most of the US’ traditional European allies have rejected membership. As such, they will not attend or will only send representatives as observers for Thursday’s meeting.\n\nMany Middle Eastern countries will be present after having decided to join the Board, but it is unclear which, if any, of those countries will make the steep fiscal commitment of $1 billion to become permanent members. And many are sending their foreign ministers, rather than their heads of state, in part because the conference coincides with the start of Ramadan.\n\n﻿According to a senior Trump administration official, the following countries are expected to send representatives to the meeting either as observers or to represent a member state: Albania, Argentina, Armenia, Austria, Azerbaijan, Bahrain, Bulgaria, Cambodia, Croatia, Cyprus, the Czech Republic, Egypt, El Salvador, the European Union, Finland, Germany, Greece, Hungary, India, Indonesia, Israel, Italy, Japan, Jordan, Kazakhstan, Kosovo, Kuwait, Mexico, Mongolia, Morocco, Netherlands, Norway, Oman, Pakistan, Paraguay, Poland, Qatar, Romania, Saudi Arabia, Slovakia, South Korea, Switzerland, Thailand, Turkey, the United Arab Emirates, the United Kingdom, Uzbekistan and Vietnam.\n\nThe inaugural meeting comes as the US military buildup in the Middle East is growing, and the specter ofpotential US military action against Iranis expected to loom large over the meeting. Trump has threatened that the US could strike Iran if a nuclear deal is not agreed to in the coming weeks.\n\n“You can’t disassociate Iran from the Middle East or the Middle East from Iran,” one diplomat said.\n\nCountries in attendance are expecting to discuss the Iran situation on the sidelines, with plans to reiterate that miliary action against Iran should be avoided.\n\n“It’s not anybody’s preference to see a military action taking place in a region where we have at least 30% of the world’s oil concentrated, and around a place that is a basic passage of traffic for international trade,” the diplomat noted.\n\nWhite House press secretary Karoline Leavitt said Wednesday that more than 20 countries are expected to attend. The senior US official said the number includes countries participating as observers.\n\nHowever, according to sources and public statements, many of the nations are not sending leaders to the meeting. Instead, they will be represented by foreign ministers or lower-level officials.\n\nIsrael, Egypt, Indonesia, Pakistan, Qatar, Bahrain, the United Arab Emirates, Saudi Arabia, Hungary and Belarus have all signed on as members of the board and are among the nations expected to have representation at the meeting.\n\nAt least five countries that have not joined the Board of Peace as members, including Italy and Romania, are expected to send representatives as observers. The European Union will be represented by Dubravka Šuica, the commissioner for the Mediterranean, to the meeting, a spokesperson said.\n\nMany European countries have said they will not become members of the board, amid concerns about its broader mission, and its members. Russia and China were both invited to join but have not done so.\n\nOn the whole, Thursday’s conversation is viewed by participants as “exploratory,” said one diplomat from a member nation. And while most countries attending the meeting know very little about what to expect from the meeting, some say that it represents the best chance to drive progress in Gaza.\n\nThere is an acknowledgement among some diplomats that Trump is best positioned to pressure the parties, particularly the Israeli government.\n\n“Trump now has a big role and wants this to happen and he can control Bibi if he wants,” another source said, referencing Israeli Prime Minister Benjamin Netanyahu.\n\nIndonesia is expected to highlight its announcement in recent days that it is readying about 1,000 troops – and possibly thousands more – to possibly be part of the International Stabilization Force (ISF) in Gaza, according to two sources familiar with the matter. However, a final decision, to be made by the Indonesian president, has not yet been made.\n\nA pledge of troops to the ISF would be a victory for the Trump administration, which has been working to secure troop commitments for months, even before the Board of Peace was officially launched.\n\nHowever, as of now, there have been no public final commitments from governments to send troops to serve as part of the ISF. And the timeline for the deployment of the troops and whether or how they will be involved in demilitarization of Hamas – one of the biggest hurdles – remains unclear.\n\nIn a post on Truth Social on Sunday, Trump said the Board “will announce that Member States have pledged more than $5 BILLION DOLLARS toward the Gaza Humanitarian and Reconstruction efforts and have committed thousands of personnel to the International Stabilization Force and Local Police to maintain Security and Peace for Gazans.”\n\nTrump did not provide further details about the planned announcements. No country has publicly announced funding for the reconstruction effort.\n\nOn the issue of reconstruction, one source noted there are concerns about funding reconstruction only for Israel to bomb Gaza again, which has continually happened. US officials have offered private assurances that this won’t happen, the source said, and there is a belief among some that Trump will keep the Netanyahu government from doing so.\n\nThe source noted that many countries who will not commit troops to the ISF will be willing to give large amounts of money to support reconstruction.\n\nThe ISF, backed by the UN mandate, is a key component of the Trump administration’s peace plan. It is meant to deploy to Gaza in order to support a Palestinian police force and allow Israel to begin withdrawing from the territory it still occupies.\n\nAn Israeli official says the US is planning for 20,000 soldiers to be part of the ISF.\n\nOne of the thorniest parts of the Trump administration’s peace plan – the demilitarization of Hamas – has not yet been resolved.\n\nOne of the sources noted that there may be parallel tracks of deploying troops and beginning reconstruction while working on the issue of demilitarizing Hamas. Regional allies do not want Israel to use the lack of progress on phase two as an excuse, the source said, and there is an understanding by US officials and regional allies that demilitarization will be a long-term process.\n\nThe senior US official said they are under no illusions on the challenges regarding demilitarization but have been encouraged by what the mediators have reported back.\n\nCNN’s Oren Liebermann contributed to this report.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/politics/trump-board-of-peace-meeting-gaza",
      "text": "meeting of his Board of Peace"
    },
    {
      "url": "https://www.cnn.com/2026/01/18/middleeast/gaza-nickolay-mladenov-profile-intl-cmd",
      "text": "Nickolay Mladenov"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
      "text": "potential US military action against Iran"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/trump-launches-board-of-peace",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/politics/trump-launches-board-of-peace",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5a00b119fb069e5a8312951e91c5a2dee9a847a11abc54f8daed08ff8e4d6ba2",
  "scraped_at": "2026-02-19T07:30:59.876310+00:00"
}