{
  "url": "https://lite.cnn.com/2026/02/21/weather/blizzard-snowstorm-new-york-northeast-climate",
  "title": "Blizzard warnings in New York City, Northeast as snowstorm takes aim | CNN",
  "date": "2026-02-24T07:33:17.130859+00:00",
  "authors": [
    "Meteorologist Chris Dolce",
    "Andrew Freedman",
    "CNN"
  ],
  "text": "Source: CNN\n\nA high-impactnor’easteris about to crush parts of the Northeast with blizzard conditions, heavy snow and strong winds.\n\nThe forecast hasbeen fraught with uncertaintyfor days, but has finally homed in on a major storm from the Mid-Atlantic to New England, including New York City, Boston and other big cities.\n\nThe storm will rapidly intensify intoa bomb cycloneoff the Eastern Seaboard Sunday, meaning we’re just hours away from the arrival of its worst conditions.\n\nMajor to locally extreme impacts are expected from parts of the DelMarVa Peninsula into eastern Pennsylvania, much of New Jersey, the New York tri-state area and southern New England, according to the Winter Storm Severity Index from NOAA. This means travel will be dangerous or impossible and widespread closures are expected.\n\nThere are still some subtle differences in the forecast track of the storm that could make snow totals higher or lower in places, but the storm will pack a punch regardless. The most snow — potentially 12 to 24 inches — is most likely to fall near and east or southeast of Interstate 95 from around Philadelphia to New York City and Boston.\n\nThis would be the firstfoot-plus snowstormat New York City’s Central Park in just over five years. Amajor winter stormabout a month ago came close to that mark by dropping 11.4 inches.\n\nThe snow will be heavy and wet, the type that sticks to tree branches and power lines. When combined with winds gusting over 40 mph, tree branches could be snapped and scattered power outages are possible. Even higher gusts up to 55 mph are possible along the immediate coast.\n\nThe powerful winds will push ocean water onshore like storm surge in a hurricane, making moderate to locally major coastal flooding possible from the Delaware and New Jersey to Long Island and southern New England. Peak water levels are expected with high tide either late Sunday night or early Monday morning.\n\nIt all gets started during the day on Sunday when rain and snow develop from parts of New York into the Mid-Atlantic. Rain will change over to snow as colder air arrives.\n\nConditions will go downhill dramatically Sunday evening into the overnight hours as the storm intensifies quickly off the coast. Strong winds and snow falling at rates of an inch or more per hour at times will expand north from the Mid-Atlantic to southern New England.\n\nThe storm’s worst will still be hammering areas from Philadelphia to New York City and southern New England by sunrise Monday morning. Travel will be dangerous or impossible in these areas, with blizzard conditions expected along the coast.\n\nSnow and strong winds will ease up from south to north through the afternoon. By Monday evening, the storm will largely be wrapping up, but parts of New England will still be seeing the last of its impacts.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
      "text": "nor’easter"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/weather/winter-storm-forecast-models-disagreement",
      "text": "been fraught with uncertainty"
    },
    {
      "url": "https://www.cnn.com/2022/12/21/us/bomb-cyclone-xpn",
      "text": "a bomb cyclone"
    },
    {
      "url": "https://www.weather.gov/media/okx/Climate/CentralPark/BiggestSnowstorms.pdf",
      "text": "foot-plus snowstorm"
    },
    {
      "url": "https://www.cnn.com/weather/live-news/winter-storm-forecast-snow-ice-01-25-26-climate",
      "text": "major winter storm"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/weather/blizzard-snowstorm-new-york-northeast-climate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/weather/blizzard-snowstorm-new-york-northeast-climate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5a3921ec04d73c28ee60d2c781120cb245fdb1e3b4a6da9fa2c24ac0dabaccf8",
  "scraped_at": "2026-02-24T07:33:17.130871+00:00"
}