{
  "url": "https://lite.cnn.com/2026/02/10/americas/canada-british-columbia-school-shooting-intl-hnk",
  "title": "Tumbler Ridge, Canada shooting: At least nine dead in incident at school, and home, police say | CNN",
  "date": "2026-02-11T16:31:25.733089+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA remote mountain town in Canada has been shaken by the country’s deadliest school shooting in decades, when an armed assailant killed at least nine people.\n\nPolice found six people dead and dozens injured when they arrived at the high school in Tumbler Ridge, a town of just 2,400 people in northeast British Columbia, early on Tuesday afternoon. Another person died en route to hospital, police said.\n\nThe alleged shooter, who was found dead at the school with a self-inflicted injury, is believed to have killed two more people, whose bodies were discovered at a home in the township\n\nTwo victims were airlifted from the school to hospital with serious or life-threatening injuries. And about 25 other people were also being treated at a local medical center, police said.\n\nIn an emergency alert which went out to residents’ phones, authorities described the suspect as a brown-haired woman wearing a dress, according to CNN affiliate CBC News.\n\nPolice know the identity of the suspect but did not give further details, and declined to say if they were a child.\n\nOfficers did not name any of the victims on Tuesday night and would not say how many of the dead were children.\n\n“We are not in a place now to be able to understand why or what may have motivated this tragedy,” said Superintendent Ken Floyd, the North District commander of the British Columbia Royal Canadian Mounted Police.\n\n“I think we will struggle to determine the ‘why,’ but we will try our best to determine what transpired,” he said.\n\nMass shootings are rare in Canada, a country with much stricter gun laws than the US, and school shootings of this scale are almost unheard of.\n\nIn 2023, 38% of homicides in Canada involved a firearm, while 76% of homicides in the US were firearm-related, according to an analysis byCanada’s national statistics bodyusing police-reported data from the Uniform Crime Reporting programs in both countries.\n\nGun ownership in Canada is also far less common than in the US. According to theSmall Arms Research project, there are 121 firearms for every 100 residents in the US compared to an estimated 35 guns per 100 residents in Canada.\n\nTumbler Ridge is a picture-postcard town in the foothills of the Rocky Mountains in western Canada, 680 kilometers (422 miles) from the US border.\n\nThe massacre has left the tight-knit community reeling.\n\n“I will know every victim. I’ve been here 19 years, and we’re a small community,” the town’s mayor Darryl Krakowka told CBC. “I don’t call them residents. I call them family.”\n\nThe secondary school has just 175 students from Grades 7 to 12, according to the province’s website.\n\nDarian Quist, a 12th-grade student, told CBC that an alarm sounded soon after he got to class early Tuesday afternoon. When he realized it wasn’t a drill, Quist and his classmates “got tables and barricaded the doors,” he said.\n\nAs they waited in the barricaded room, Quist said some students began to share “disturbing” photos of “what was actually happening” elsewhere in the school, “showing blood and things like that.”\n\nPolice eventually arrived to escort the students outside of the building.\n\nWaiting outside in the parking lot was Shelley Quist, his mother. Earlier, one of her coworkers at a nearby laboratory had asked “if I knew what was happening at the high school.”\n\nAs reports trickled in, she began to realize what was unfolding. “It’s one of those things where you just never think this is going to happen.” she added.\n\nQuist said she felt “panic” until she could see her son among the students safely escorted from the building. Recalling the experience in the evening, her son said “the reality of it all” was only starting to set in.\n\nThe last school shooting of this scale in Canada was in 1989, when a gunman murdered 14 women at École Polytechnique in Montréal. The massacre prompted a national reckoning about violence against women and led to tighter gun laws.\n\n“This is the kind of thing that feels like it happens in other places, and not close to home,”British Columbia Premier David Eby said in a press conference Tuesday.\n\n“We can’t imagine what the community is going through. But I know it’s causing us all to hug our kids a little tighter tonight.”\n\nPolice have not given any information on the type of gun used in Tuesday’s attack. It is illegal to purchase an assault-style rifle in Canada – the class of weapons used in several of the deadliest school shootings in the US.\n\nThis is the second mass homicide in British Columbia in less than a year. Last April, a mandrove his SUV into a crowd at a Filipino street festivalin Vancouver, killing 11.\n\nIn the wake of the tragedy, schools in Tumbler Ridge have been closed for the rest of the week, according to the school district website.\n\nLarry Neufeld, the provincial member of parliament for Peace River South, which encompasses the town, called the shooting “tragic and deeply disturbing” in a statement posted to social media.\n\n“This is a small, close-knit town, and the impact of an event like this is felt by everyone,” Neufeld said.\n\nCanadian Prime Minister Mark Carney said his “prayers and deepest condolences are with the families and friends who have lost loved ones to these horrific acts of violence” in a post to X.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www150.statcan.gc.ca/n1/pub/75-006-x/2025001/article/00011-eng.htm",
      "text": "Canada’s national statistics body"
    },
    {
      "url": "https://www.cnn.com/2021/07/06/americas/canada-deadly-gun-violence",
      "text": "Small Arms Research project"
    },
    {
      "url": "https://www.cnn.com/2025/04/27/americas/canada-car-ramming-filipino-festival-intl-hnk",
      "text": "drove his SUV into a crowd at a Filipino street festival"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/americas/canada-british-columbia-school-shooting-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/americas/canada-british-columbia-school-shooting-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5aaf5fefa439cb8447cd86f6a6a8b93b5bea2c1d0685dd33d6994975a068bd42",
  "scraped_at": "2026-02-11T16:31:25.733103+00:00"
}