{
  "url": "https://lite.cnn.com/2026/02/25/americas/world-cup-2026-el-mencho-mexico-intl-latam",
  "title": "With World Cup looming, can Mexico contain the chaos unleashed by the killing of drug lord ‘El Mencho’? | CNN",
  "date": "2026-02-27T07:17:13.709291+00:00",
  "authors": [
    "Sol Amaya",
    "Gonzalo Zegarra",
    "Alessandra Freitas"
  ],
  "text": "The chaos unleashed by the killing of Mexican drug lordNemesio “El Mencho” Oseguerahas sparked fears that the country could face a new wave of violence just as it enters its final preparations to host the world’s biggest sports event.\n\nMexico is expecting to welcome more than 5 million visitors for the FIFA World Cup, which it is co-hosting with the US and Canada, and will be the center of global attention when the opening match kicks off at the Banorte Stadium in Mexico City on June 11.\n\nBut the killing of Oseguera, who led the Jalisco New Generation Cartel, has put Mexico – and Jalisco state in particular – into the headlines for all the wrong reasons. His death on Sunday at the hands of the Mexican military sparked days of violence, much of it centered in Jalisco, as gang members of one of the country’s most powerful criminal groups clashed with security forces, burning buses and businesses. So dire was the situation that the US State Department issued shelter-in-place warnings to travelers.\n\nWhile that initial burst of violence has subsided – President Claudia Sheinbaum insisted Tuesday there was “no risk” to fans, while FIFA president Gianni Infantino said he had “complete confidence” that everything would “turn out for the best” – not everyone is convinced.\n\nSome analysts fear a succession war among the commanders of the Jalisco cartel is now likely – a possibility acknowledged by Mexican authorities, with Security Secretary Omar García Harfuch saying Monday his team would be “very attentive” to “any type of reaction or restructuring within the cartel” and that there was “particular monitoring of several leaders.”\n\nSecurity analyst David Saucedo told CNN that such a scenario was highly likely – and warned that even if factions in the cartel could come to an agreement, that still might not rule out the possibility of further violence.\n\nIf the surviving leadership of the cartel interpreted the operation against “El Mencho” as an existential threat to its operations, the group might feel it had no option but to up the stakes.\n\n“(The cartel) may assume a posture of total war against the Mexican state,” Saucedo said.\n\nMexico is to host 13 of the World Cup’s 104 matches, but its first test will come months before the official kick-off when it hosts playoff matches and warm-up games next month.\n\nThe Estadio Akron in Guadalajara – the capital of Jalisco – is to host playoffs between Congo, Jamaica and New Caledonia from March 26-31, while Estadio Banorte, in Mexico City, is to host a friendly between Mexico and Portugal on March 28.\n\nWhile the Portuguese Football Federation has indicated the match in Mexico City will go ahead as planned – pending its ongoing assessment – more concerning to some analysts are those taking place in Jalisco, the epicenter of the recent violence. In addition to the playoffs, four World Cup matches are scheduled to take place in Jalisco’s capital of Guadalajara – involving the national team, South Korea, Colombia, Uruguay, Spain, and two others that will be determined by playoffs. Nearly 3 million tourists are expected to visit Jalisco, which borders the Pacific Ocean and is famous for tequila and mariachi music, during the tournament.\n\nFollowing the postponement of some Mexican league matches after El Mencho’s death, Jalisco Governor Pablo Lemus insisted the World Cup games would go ahead as planned. “There is absolutely no intention on FIFA’s part to remove any venues from Mexico. The three venues remain completely firm,” Lemus said.\n\nVictoria Dittmar, a researcher at InSight Crime in Mexico City, said that guaranteeing security in the region had always been a challenge. Following the government’s removal of “El Mencho,” that challenge had become one of “pacifying the country and the cities, especially those that will receive so many tourists,” she said.\n\nThe depth of that challenge was made clear in the hours following the drug lord’s capture. Mexico’s defense secretary Ricardo Trevilla Trejo revealed on Monday that authorities had initially planned to fly the wounded “El Mencho” to Guadalajara by helicopter to receive medical care, but after he died en route they felt compelled to change course and avoid the city due to fears over the violent reaction from the cartel his killing would provoke.\n\nOne option to de-escalate the situation, according to Dittmar, would be a pact between the government and the gangs. “The pacification of a territory often occurs through (such) agreements,” she said.\n\nAnother, more muscular, option, according to Marcelo Bergman, a sociologist and expert on criminality, would be a “massive deployment” of forces in the area to maintain peace – which might also help to placate US President Donald Trump, who has been pressuring Mexico to clamp down hard on organized crime.\n\nPart of the problem facing Mexican authorities is that “El Mencho” left no clear heir.\n\nWhile cartels are usually dynastic, security analyst Saucedo pointed out that Oseguera’s son, known as “El Menchito,” was imprisoned in the US, while his brother and his stepson had failed to “reach influence among the other commanders.”\n\n“The succession line was broken,” Saucedo said.\n\nDittmar said three possible scenarios now faced the cartel: a smooth transition; a limited power struggle between some factions; or, in the most extreme case, a complete breakup of the cartel into several smaller gangs amid a fight for control.\n\nIf the cartel were to fracture, it would present an opportunity to its rivals who would be keen to muscle in on its territory, Dittmar said, adding that some violence was “inevitable” given Oseguera’s unifying role was now vacant.\n\n“His role had a lot to do with maintaining the group’s unity. It was like this cult of personality,” she added.\n\nOther analysts stressed that uptick violence was not inevitable. Cecilia Farfán-Méndez, director of the Observatory of North America at the Global Initiative against Transnational Organized Crime, said the cartel leadership had an “interest in not wanting to attract attention at this moment.”\n\n“It would be inconvenient for its members to end up on the most wanted list because that generates a lot of attention and pressure from the state, and it makes businesses more complicated,” she said.\n\nEven so, Farfán-Méndez said the violence that followed the killing of “El Mencho” was of a greater magnitude than that prompted by previous military operations against drug cartels, with incidents recorded in more than 20 states.\n\n“These types of (incidents) have occurred in Jalisco before, but what is unprecedented is the magnitude and territorial reach of the response; I don’t think we’ve ever seen anything like it before,” she said.\n\nCNN’s Rubén Correa and Rey Rodríguez contributed reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/world/live-news/mexico-el-mencho-killed-travel-chaos-02-23-26-intl-hnk",
      "text": "Nemesio “El Mencho” Oseguera"
    }
  ],
  "hash": "5ab0cc1e425a68403060b44d02320381435df7cacc7f56588a538fae2018a71e",
  "scraped_at": "2026-02-27T07:17:13.709307+00:00"
}