{
  "url": "https://lite.cnn.com/2026/02/09/tech/instagram-youtube-social-media-trial",
  "title": "Lawyers argue that Instagram and YouTube intentionally addicted and harmed teen in landmark social media trial | CNN Business",
  "date": "2026-02-11T16:39:19.039690+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nLawyers for a now-20-year-old woman argued that addictive features harmed her mental health as opening statements began Monday in a landmark trial against Meta and YouTube, the first of hundreds of similar cases to go to trial.\n\nThe plaintiff — identified by her first name, Kaley, or her initials, KGM — and her mother accused the tech companies of intentionally creating addictive platforms that caused her to develop anxiety, body dysmorphia and suicidal thoughts. Lawyers for Meta and YouTube have indicated they will argue that a difficult family life, not social media, was responsible for her mental health challenges.\n\nSpeaking on Monday in front of a jury in state court in Los Angeles, Kaley’s lawyer Mark Lanier called social media apps like YouTube and Instagram “digital casinos,” saying the app’s “endless scroll feature” creates dopamine hits that can lead to addiction.\n\n“This case is about two of the richest corporations who have engineered addiction in children’s brains,” Lanier said in his opening statement. “The swipe, for a child, like Kaley, this motion is a handle of a slot machine. But every time she swipes, it’s not for money, but for mental stimulation.”\n\nParents and safety advocates, who for years have called for more online guardrails, say the trial is a crucial moment of accountability. Executives including Meta CEO Mark Zuckerberg, Instagram CEO Adam Mosseri and YouTube CEO Neal Mohan are expected to testify in the coming weeks.\n\nThe outcome of Kaley’slawsuit could help guide how around 1,500 similar lawsuits against social media companies are resolved. Losses could put the tech firms on the hook for billions of dollars in damages and force them to change their platforms.\n\nKaley also sued Snap and TikTok. Both companies agreed to settle the case ahead of the trial, although they remain defendants in other cases.\n\nThe tech giants have long denied that their platforms harm young users, and they’ve rolled out safety features such as parental control tools, “take a break” reminders and content restrictions.\n\nMeta’s lawyer, Paul Schmidt, also presented his opening statement on Monday, attributing Kaley’s family dynamics as responsible for her mental health struggles – and arguing that social media may have provided a healthy outlet for Kaley when she faced difficulties at home.\n\nA Meta spokesperson told CNN ahead of opening statements: “We strongly disagree with these allegations and are confident the evidence will show our longstanding commitment to supporting young people.”\n\nLuis Li, YouTube’s lawyer, began his opening statement on Tuesday with a simple statement: “Let me get right to the point: Ms. GM, Kaley GM, is not addicted to YouTube.”\n\nA YouTube spokespersontold CNNthe lawsuit’s claims are “simply not true” and that “providing young people with a safer, healthier experience has always been core to our work.”\n\nLi highlighted YouTube’s safety features and compared YouTube to entertainment streaming services like Netflix and Disney+, an argumentYouTube has made before.Pew Researchfound that YouTube is used by nearly all US teens and is more popular than TikTok, Instagram and Snapchat.\n\nHe told the jury that they should separate the claims against Instagram and YouTube in their minds.\n\n“What applies to Meta, I don’t think that necessarily applies to YouTube,” Li said.\n\nIn his opening statement, Lanier presented internal documents from Meta and YouTube that he said showed the social media platforms’ goal to attract young kids and teens.\n\nOne decade-old internal strategy document from Meta said that if the company wanted to “win big with teens,” it must “bring them in as tweens.” Another internal document Lanier showed from YouTube suggested that the video streaming platform be used as a short-term digital babysitter while parents cook, clean or do laundry.\n\nLanier argued the apps use several tactics to hook young users including “infinite scroll and autoplay,” the “like” button, which Lanier equated to a “chemical hit” that teens looking for validation from their peers grow to crave, and so-called beauty filters that can alter a user’s face.\n\nKaley began using YouTube at the age of 6 and Instagram at the age of 9, Lanier said. YouTube’s Li said during jury selection that Kaley claims that, at some points, she used YouTube for “six to seven hours a day.” Before she finished elementary school, Kaley had posted 284 videos to YouTube, Lanier said.\n\nShe also used Instagram “for several hours a day.” According to Kaley’s phone records, one day, in March 2022, at 16 years old, Kaley spent more than 16 hours on Instagram, Lanier said.\n\nKaley’s mother tried to implement parental controls, but she was unable to curb Kaley’s addiction, Lanier said.\n\nLanier cited an internal Meta study called “Project Myst,” which he said found evidence that children who had experienced “adverse effects” were most likely to get addicted to Instagram. The study also found that parents were powerless to stop the addiction, he said.\n\n“The moment Kaley was locked into the machine, her mom was locked out,” Lanier said.\n\nThat was despite Kaley’s mother’s attempts to use third-party software to block access to the platforms, according to her complaint.\n\nIn the lawsuit, Kaley alleged that on Instagram she experienced bullying and sextortion, a scam where a bad actor threatens to share explicit photos of a person if they don’t send money or more photos.\n\nYouTube wasn’t originally part of the lawsuit; Kaley and her mother decided to add it after learning about the platform’s addictive qualities, Lanier said.\n\nHowever, Li on Tuesday cited internal YouTube data to argue that Kaley had not been addicted to YouTube at all.\n\nWriting on a white poster board to illustrate his point, Li said the data showed Kaley used YouTube for an average of 29 minutes per day since 2020, “less than your average network television show,” he said. Kaley watched an average of four minutes and 9 seconds of videos recommended by YouTube’s autoplay feature per day, Li said.\n\n“Folks, infinite scroll is not infinite,” Li told the jury. “Her behavior doesn’t seem like she’s addicted, so why are we here?”\n\nLi said YouTube did not have access to Kaley’s user data from before 2020 because she had deleted her account history.\n\nLi also pointed to safety features, like options to turn off likes, comments or autoplay, that had been available to Kaley but not used, Li said.\n\nKaley experienced a difficult upbringing. Her mother divorced her abusive father when Kaley was 3 years old and raised three children mainly as a single mom, Lanier said during jury selection.\n\nMedical records shown during Meta lawyer Schmidt’s opening statement painted a picture of Kaley’s childhood. Throughout her life, Kaley reported to therapists that she faced verbal abuse from her parents, body image issues and bullying both in school and online.\n\nSchmidt argued that Instagram wasn’t a substantial factor in Kaley’s mental distress and showed the jury snippets of pre-trial testimony from multiple therapists who treated Kaley since she was young.\n\nOne therapist, Dr. Thomas Suberman, testified that he did not recall social media being in the “throughline of her main issues.” Another therapist, Allison Pratt, testified that Kaley never reported feeling addicted to Instagram during their sessions and that Kaley had told Pratt that she was participating in the lawsuit because “her mother wanted her to” and that “there might be compensation.”\n\nSchmidt also pointed to Kaley’s sworn testimony from last year, in which she agreed when asked whether Instagram served as a creative outlet and “a way to communicate your feelings.” In that same testimony, Kaley said she hoped to get a job in social media one day.\n\nSchmidt also highlighted newer time and content management tools that Instagram has introduced to its platform in recent years, like an option to opt out of triggering content and a “sleep mode,” which silences notifications and can set up automated replies to direct messages.\n\nJury selection also underscored how widely the impacts of social media — both good and bad — are felt among disparate groups of people. Potential jurors expressed a range of opinions on social media during jury selection questioning, with some appearing concerned about the companies’ impact on society, their children and their older parents. Still, other potential jurors said they believed parents have a responsibility to monitor their children’s social media use.\n\nMembers of the final 18-person jury panel will be allowed to maintain their normal social media use throughout the trial. But Los Angeles Superior Court Judge Carolyn Kuhl, who is overseeing the trial, has instructed them not to search for or view any information related to the case or to change their settings to evaluate claims made during trial.\n\nTech giants have repeatedly relied on Section 230, a federal law that shields them from liability over content that their users post, as a defense against safety claims. Kuhlsaid last yearthat jurors should have the chance to consider whether design features implemented by the companies, like endlessly scrolling feeds, have contributed to mental health harms, rather than content alone.\n\nOn Monday, the jury was instructed not to hold Meta and YouTube liable for allowing third-party content, failing to remove third-party content or recommending third-party content.\n\nCorrection: A previous version of this story incorrectly attributed the claim that Kaley once watched YouTube for hours each day. YouTube lawyer Luis Li was repeating a claim made by Kaley.\n\nThis story has been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/tech/social-media-youth-mental-health-trial",
      "text": "told CNN"
    },
    {
      "url": "https://www.axios.com/2023/03/29/youtube-social-media-ceo-neal-mohan",
      "text": "YouTube has made before"
    },
    {
      "url": "https://www.pewresearch.org/internet/2025/12/09/teens-social-media-and-ai-chatbots-2025/",
      "text": "Pew Research"
    },
    {
      "url": "https://www.bloomberg.com/news/articles/2025-11-06/social-media-giants-must-stand-trial-on-youth-addiction-claims?embedded-checkout=true",
      "text": "said last year"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/tech/instagram-youtube-social-media-trial",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/tech/instagram-youtube-social-media-trial",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5af28471db2c91aab4e2a085992d96d04147c3738fdfd4132a579321f931481e",
  "scraped_at": "2026-02-11T16:39:19.039703+00:00"
}