{
  "url": "https://lite.cnn.com/2026/02/19/us/sick-baby-deported-joaquin-castro-hnk",
  "title": "Joaquin Castro: Lawmaker says the US deported a sick baby, while authorities say the child was medically cleared | CNN",
  "date": "2026-02-19T07:30:28.862884+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nUS immigration authorities deported a 2-month-old baby with bronchitis to Mexico along with his family, a US representative from Texas said.\n\nThe child was so sick he had been unresponsive “in the last several hours” but was discharged from the hospital anyway, US Rep. Joaquin Castro said Tuesday in anX post.\n\nImmigration and Customs Enforcement deported the baby along with his 16-month-old sister, his mother and his father, Castro said. The Democratic lawmaker said he confirmed this with the family’s attorney.\n\n“To unnecessarily deport a sick baby and his entire family is heinous,” Castro said.\n\nHe vowed to “hold ICE accountable for this monstrous action.”\n\nA spokesperson for the US Department of Homeland Security, Tricia McLaughlin, said Wednesday that the child was in “stable condition and medically cleared for removal” and that pediatricians gave the parents a nasal saline spray with a nasal bulb syringe to continue care.\n\nMcLaughlin said Border Patrol apprehended the child’s mother, Mireya Stefani Lopez-Sanchez, crossing the border illegally near Eagle Pass, Texas, on January 21.\n\nLopez-Sanchez chose to take her child with her when Border Patrol transferred her to ICE custody, McLaughlin said.\n\n“All of her claims were heard by a judge and found not to be valid,” McLaughlin said.\n\nA judge issued Lopez-Sanchez a final order of removal on February 8, and she was removed from the US with her child on Tuesday, McLaughlin said.\n\n“She received full due process,” McLaughlin said.\n\nThe detention of children by US immigration authorities has come under heightened scrutiny since President Donald Trump’s administration began itsimmigration enforcement crackdown.\n\nImages of5-year-old Liam Conejo Ramoswearing a bunny hat and being surrounded by ICE officers in Minnesota last month sparked an outcry. The boy and his father were released shortly after on a judge’s orders.\n\nThe father and son were held at a family detention center in Dilley, Texas, which is where Castro said Lopez-Sanchez and her baby were held.\n\nLast year, court filings said families and monitors at federal facilitiesreported contaminated foodand a lack of access to medical care or sufficient legal counsel. The filings said hundreds of immigrant children also lingered in federal detention beyond a court-mandated limit, including some who were held more than five months.\n\nBronchitis is a condition that develops when airways in the lungs become inflamed and cause coughing, the National Institute of Health said on its website.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/JoaquinCastrotx/status/2023843875153211573",
      "text": "X post"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/immigration-enforcement-young-us-citizens-fears",
      "text": "immigration enforcement crackdown"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/us/images-minneapolis-immigration-crackdown-trump",
      "text": "5-year-old Liam Conejo Ramos"
    },
    {
      "url": "https://www.cnn.com/2025/12/09/politics/migrant-families-ice-detention-facility-texas",
      "text": "reported contaminated food"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/sick-baby-deported-joaquin-castro-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/us/sick-baby-deported-joaquin-castro-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5af95dd0f0b93ebc821724318e94d0223a7709d732475a6a4a0f8e8d2a2559a4",
  "scraped_at": "2026-02-19T07:30:28.862897+00:00"
}