{
  "url": "https://lite.cnn.com/2026/02/26/business/block-layoffs-ai-jack-dorsey",
  "title": "Block lays off nearly half its staff because of AI. Its CEO said most companies will do the same | CNN Business",
  "date": "2026-02-27T07:15:33.116514+00:00",
  "authors": [
    "Ramishah Maruf"
  ],
  "text": "Source: CNN\n\nBlock, the company behind Square, Cash App and Afterpay, is cutting its staff by 40%. The reason: “intelligence tools,” according to a letter to shareholders by co-founder Jack Dorsey.\n\nDorsey thinks most companies will follow suit in the near future.\n\nThe company is laying off more than 4,000 people, reducing the workforce to just under 6,000.\n\nThe cuts come as AI has reshaped jobs across the tech sector and is raising concerns about the future of the job market. Companies like Amazon, Meta, Microsoft and Verizon have all made sweeping cuts in the last year tangentially related to AI.\n\n“A significantly smaller team, using the tools we’re building, can do more and do it better. And intelligence tool capabilities are compounding faster every week,” Dorsey wrote.\n\nBlock CFO Amrita Ahuja said it more plainly in the tech company’s financial guidance: “We see an opportunity to move faster with smaller, highly talented teams using AI to automate more work.”\n\nIn aposton X, Dorsey guaranteed that the cuts weren’t happening because the business is struggling, but rather because “our business is strong… gross profit continues to grow.”\n\nThe co-founder of Twitter believes he’s ahead of the game.\n\n“I think most companies are late. Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes. I’d rather get there honestly and on our own terms than be forced into it reactively,” he wrote.\n\nMany of the companies that are cutting hordes of jobs – and blaming it on AI –had swelled in size during the pandemic years, when tech companies were meeting demand for online services. Block, for example,employed 3,835 peopleby the end of 2019 and had grown its headcount to over 10,000 before Thursday’s layoffs. Meta hadnearly doubled its headcountin roughly two years.\n\nNow, tech leaders are paring back and returning to those pre-pandemic numbers.\n\nOn X, Dorsey said he chose to be honest about the company’s position and act now, rather than “cut gradually over months or years.”\n\nDorsey said affected employees will have severance for 20 weeks or more depending on tenure, equity vested until the end of May and six months of health care as well as any corporate devices and an extra $5,000.\n\nInvestors have reacted well to the gutting of jobs. Block’s shares soared up to 24% after the announcement.\n\nThe cuts come amid rising concerns about how AI will impact the workforce as AI giants like Anthropic and OpenAI continue to push out new enterprise tools. Just this week, Anthropic updated its popular Claude model to perform better at office jobs in human resource, design and wealth management. Software stocks cratered earlier this month after Anthropic launched updates to its Claude Cowork tool.\n\nDorsey’s decision also reflects a growing sentiment among tech leaders to operate more leanly as AI evolves. Amazon said it needed “fewer layers” to “operate as quickly as possible,” calling AI is the “most transformative technology we’ve seen since the internet”in a memo from Octoberannouncing layoffs.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://x.com/jack/status/2027129697092731343?s=20",
      "text": "post"
    },
    {
      "url": "https://www.cnn.com/2023/01/22/tech/big-tech-pandemic-hiring-layoffs",
      "text": "had swelled in size during the pandemic years"
    },
    {
      "url": "https://s29.q4cdn.com/628966176/files/doc_financials/2019/Square-2019-10-K.pdf",
      "text": "employed 3,835 people"
    },
    {
      "url": "https://www.cnn.com/2022/11/10/tech/tech-layoffs-analysis/index.html",
      "text": "nearly doubled its headcount"
    },
    {
      "url": "https://www.cnn.com/2025/10/28/business/amazon-layoffs",
      "text": "in a memo from October"
    }
  ],
  "hash": "5b03abb9b68ee5d1d9098e70e40e2977ab1e5875ac2340c3e2f97c6daf229a91",
  "scraped_at": "2026-02-27T07:15:33.116527+00:00"
}