{
  "url": "https://lite.cnn.com/2026/02/13/us/au-pair-sentencing-brendan-banfield",
  "title": "Au pair who plotted elaborate double murder with Brendan Banfield sentenced to maximum 10 years in prison | CNN",
  "date": "2026-02-14T07:07:24.323216+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe au pair who crafted anelaborate double murder plotwith former IRS agent Brendan Banfield and later testified against him in court was sentenced to 10 years in prison Friday, the maximum sentence and well above the joint sentencing recommendation.\n\nJuliana Peres Magalhães, 25, pleaded guilty in October 2024 to involuntary manslaughter of Joseph Ryan. Prosecutors said she and Brendan Banfield lured Ryan to the Banfields’ Virginia home under the guise of a BDSM sexual encounter with Banfield’s wife, Christine, in the deadly plot.\n\nAs part of a plea deal, Peres Magalhães agreed to cooperate with prosecutors and testifyagainst Brendan Banfield. In exchange, prosecutors agreed to recommend she be sentenced to time served. She has been in custody since her arrest in October 2023.\n\nStill, the final sentencing decision fell to the court. Manslaughter is punishable by up to 10 years in prison.\n\nAfter hearing a tearful apology from Peres Magalhães and mournful statements from Ryan’s family, Judge Penney S. Azcarate said she could not accept the recommendation of time served. She called the case “the most serious manslaughter scenario the court has ever seen.”\n\n“Your actions were deliberate, self-serving and demonstrated a profound disregard for human life,” the judge said. “So let’s get straight: You do not deserve anything other than incarceration and a life of reflection on what you have done to the victim and his family. May it weigh heavily on your soul.”\n\nThe sentencing stems from thesalacious double killingof Christine Banfield, 37, and Ryan, 39, in a case that featured allegations of a love triangle, BDSM sexual role play and false 911 calls.\n\nAs prosecutors told it, Brendan Banfield began a romantic affair with Peres Magalhães, the family’s Brazilianau pair, in August 2022, and they hatched a convoluted plot to kill off Banfield’s wife and be together.\n\nAccording to Peres Magalhães’ testimony, they created fake accounts under Christine’s name on a sexual fetish website and then lured Ryan to the home under the guise of a consensual but violent sexual encounter.\n\nWhen Ryan came to the home in February 2023, Brendan Banfield fatally stabbed his wife and shot Ryan, Peres Magalhães testified. Peres Magalhães also shot Ryan, she said.\n\nBanfield then staged the scene to make it look like he had stumbled upon a violent attack and shot Ryan in self-defense, she testified.\n\nAfterward, Peres Magalhães moved into Brendan Banfield’s bedroom; investigators later found a framed photo of the two on his bedside table.\n\nBanfield was convicted of two counts of murder earlier this month. He is expected to be sentenced to life in prison May 8.\n\nAt Friday’s sentencing, two members of Ryan’s family told the court about their beloved “Joe,” who they said was killed and then falsely slandered as a rapist and murderer.\n\n“What I do hope is that even for a moment, that the world, and you, judge, will say Joe meant more than nothing,” his mother, Deirdre Fisher, said. “That he was someone worthy of dignity and life who didn’t deserved to be used and thrown away, treated as utterly disposable.”\n\nHis aunt, Sangeeta Ryan, said her nephew loved painting, martial arts and taking care of neglected animals, dogs in particular.\n\n“Joe cared for people, cared for animals, and Joe didn’t hurt people,” she said.\n\nShe said she hoped Peres Magalhães did not walk free and instead continued to reflect on the lives she destroyed.\n\n“While we acknowledge the defendant for eventually coming forward with the truth, telling the truth doesn’t absolve her of responsibility,” Sangeeta Ryan said.\n\nPeres Magalhães then spoke to the court for about four minutes, apologizing to Ryan’s and Christine Banfield’s families.\n\n“I lost myself in a relationship, leaving my morals and values behind,” she said.\n\n“I understand that I am to blame, and I am truly sorry for the pain I caused. I hope someday I can be forgiven, as I hope to be able to forgive myself,” she added.\n\nThe defense attorney for Peres Magalhães, Ryan Campbell, asked the judge to follow the recommended sentence of time served. The au pair’s testimony was “integral” to Brendan Banfield’s conviction and to the families learning the truth, he said.\n\nAzcarate was unconvinced. She said Peres Magalhães had, until her apology Friday, shown no empathy for Ryan. And the judge listed off a series of actions the au pair took to lure Ryan to his death and then cover it up.\n\n“At any point for at least the month prior, or that day, you could have stopped this,” Azcarate said. “The plan did not work without your full involvement.”\n\nFairfax County Commonwealth’s Attorney Steve Descano issued a statement acknowledging Peres Magalhães’ “invaluable” testimony to the case against Banfield.\n\n“Today’s hearing was dedicated specifically to Joe, a beloved son, nephew, and grandson, who was a perfect stranger to Magalhães and Brendan Banfield and tragically ensnared in their plot,” Descano said. “The court cannot bring Joe back to his loved ones, but the court can ensure that Brendan, the mastermind behind this scheme, faces a lifetime in prison for his murder.”\n\nPeres Magalhãeswasarrested and chargedwith second-degree murder and a firearm offense in October 2023. Brendan Banfield was indicted on murder charges in September 2024, just a month before Peres Magalhães officially agreed to her plea deal.\n\nAt Banfield’s murder trial last month,Peres Magalhães admitted to the double murder schemeand laid out its particulars over three days of testimony. She said she finally came forward with the truth because she felt guilt and shame.\n\n“I withheld the truth for a long time, just to myself, and it was a lot for me to deal with and I just couldn’t deal with this anymore,” she said.\n\nBanfield took the stand in his own defense and, while admitting to an affair, denied that he and the au pair came up with any murderous plot.\n\n“No, there was no plan,” he said. “I think that it’s an absurd line of questioning for something that is not serious, that a plan was made to get rid of my wife. That is absolutely crazy.”\n\nHe testified that he went to his home one morning and came upon a man raping and stabbing his wife, so he shot the man.\n\nThe jury convicted Banfield of two counts of aggravated murder, a firearms offense and child endangerment. His daughter, who was 4 at the time, was in the home at the time of the killings, prosecutors said.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/us/brendan-banfield-double-murder-trial-verdict",
      "text": "elaborate double murder plot"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/us/brendan-banfield-double-murder-trial-verdict",
      "text": "salacious double killing"
    },
    {
      "url": "https://www.cnn.com/2026/01/11/us/brendan-banfield-double-murder-trial",
      "text": "arrested and charged"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/us/brendan-banfield-trial-testimony",
      "text": "Peres Magalhães admitted to the double murder scheme"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/us/au-pair-sentencing-brendan-banfield",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/us/au-pair-sentencing-brendan-banfield",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5b601c596675b8331a030b175455b58d3f180a95f93e8be64c2c453853caef84",
  "scraped_at": "2026-02-14T07:07:24.323229+00:00"
}
