{
  "url": "https://lite.cnn.com/2026/02/17/us/rhode-island-ice-rink-shooting",
  "title": "Shooter killed ex-wife and a son in Rhode Island ice rink attack, police say | CNN",
  "date": "2026-02-19T07:32:18.402365+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "A person whoopened fire during a youth hockey gameat an ice rink in Rhode Island on Monday killed their ex-wife and one son, Pawtucket Chief of Police Tina Goncalves said Tuesday.\n\nGoncalves said the victims were the shooter’s ex-wife Rhonda Dorgan and adult son Aidan Dorgan. The shooter injured three others during the shooting Monday afternoon in Pawtucket, among them the shooter’s ex-wife’s parents and a family friend, Goncalves said. Police said the shooter died from an apparent self-inflicted gunshot wound.\n\nPolice identified the shooter as 56-year-old Robert Dorgan, who also went by the name Roberta Esposito.\n\nInvestigators had spoken to nearly 100 witnesses as of Monday evening as they attempt to piece together what happened earlier that afternoon inside the Dennis M. Lynch Arena in Pawtucket, a few miles outside Providence.\n\nGoncalves said Monday that the shooter died from an apparent self-inflicted gun wound, though authorities are still investigating.\n\nGoncalves credited an unnamed “good Samaritan” who intervened, bringing the attack “to a swift end.” She did not provide details.\n\nThe hockey game was livestreamed by LiveBarn, a streaming platform for youth sporting events, whose videos have been shared on social media showing players on the ice as popping sounds are heard. Chaos quickly unfolds as players on benches dive for cover, those on the ice frantically skate toward exits and fans flee their seats.\n\nLiveBarn’s social media account has been issuing warnings to those who shared the video that they do not have permission to do so.\n\nDorgan, who police identified as the shooter, was an employee of General Dynamics Bath Iron Works, a ship building facility in Bath, Maine, that contracts with the U.S. Navy, David Hench, a spokesperson for the shipyard, said Tuesday. Hench did not respond to questions about Dorgan’s job title or how long they worked at the shipyard.\n\nA colleague, Destiny Mackenzie, recalled that Dorgan used the women’s bathroom and that the two of them would often talk about family. Mackenzie said Dorgan’s ex-wife never came up in conversation but a hockey-playing son was a frequent topic.\n\n“What was supposed to be some seniors’ only chance at playoff games is now ruined,” she wrote in a message to The Associated Press. “Images that these kids and family’s now have to live with. That’s who I send my condolences to is those families. The reality of our gun laws needs a major reconsideration and it unfortunate guns land in the hands of such sick individuals.”\n\nMackenzie said the shooter, who was often called Roberta at work, had a bad temper that sometimes led to screaming matches with colleagues.\n\nAnother coworker said Dorgan appeared to be split on the issue of transgender acceptance, one second being proud of transitioning and the next, embarrassed. That coworker, who spoke on condition of anonymity for fear of workplace reprisals, said they knew Dorgan owned guns but was unsure how many.\n\nDorgan briefly served in the Marine Corps, enlisting on April 26, 1988, according to military records provided by the service, but his service was short-lived. Less than three months later, on July 13, he was separated from the service with the lowest military rank.\n\nMaj. Jacoby Getty, a Marine Corps spokesman, told The Associated Press that the rapid discharge indicated “the character of his service was incongruent with Marine Corps’ expectations and standards.”\n\nGetty declined to provide more detail.\n\nMichael Steven, who recorded video after the shooting, recalled crying parents trying to locate their children outside the arena and young people being taken out on stretchers.\n\n“It happens far too often in our nation,” Steven told reporters.\n\nMonday’s shooting came nearly two months after the state was rocked by a shooting atBrown Universitythat left two students dead and wounded nine others, as well as a Massachusetts Institute of Technology professor. Authorities later found Claudio Neves Valente, 48, dead from a self-inflicted gunshot wound at a New Hampshire storage facility.\n\n“Our state is grieving again,” Rhode Island Gov. Dan McKee said in a statement. “As governor, a parent, and a former coach, my heart breaks for the victims, families, students, and everyone impacted by the devastating shooting at Lynch Arena in Pawtucket.”\n\nCasey contributed from Boston and Whittle contributed from Portland, Maine. Associated Press reporter Konstantin Toropin in Washington contributed.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/pawtucket-hockey-rink-shooting-rhode-island-c8ac3e8067ce2f2ce07e4d98009ecdaa",
      "text": "opened fire during a youth hockey game"
    },
    {
      "url": "https://apnews.com/article/brown-university-shooting-public-records-police-6c2eaf5e0048f69bcb13792cbfab446a",
      "text": "Brown University"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/rhode-island-ice-rink-shooting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/rhode-island-ice-rink-shooting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5b7720ea947a468032af9e127d24340be968dff7a61c1e57a719f2a7db6855e2",
  "scraped_at": "2026-02-19T07:32:18.402378+00:00"
}