{
  "url": "https://lite.cnn.com/2026/02/12/politics/jeremy-carl-state-department-nomination-bipartisan-opposition",
  "title": "Jeremy Carl: Bipartisan opposition over inflammatory comments likely to sink Trump State Dept. nominee | CNN Politics",
  "date": "2026-02-13T07:31:05.966556+00:00",
  "authors": [],
  "text": "Source: CNN\n\nJeremy Carl, the Trump administration’s pick for a top State Department position, is unlikely to get the job after a bipartisan group of senators grilled him over his history of racist, sexist and reported antisemitic comments and posts.\n\nRepublican Sen. John Curtis of Utah said in a statement following the heated Senate Foreign Relations Committee confirmation hearing Thursday that he would not support Carl’s nomination for assistant secretary of state for international organizations.\n\n“After reviewing his record and participating in today’s hearing, I do not believe that Jeremy Carl is the right person to represent our nation’s best interests in international forums, and I find his anti-Israel views and insensitive remarks about the Jewish people unbecoming of the position for which he has been nominated,” Curtis said.\n\nThe Republican’s opposition is likely to sink Carl’s nomination – if all Democrats on the committee also vote no, he will not have the votes to advance. Senate Minority Leader Chuck Schumer has also opposed his nomination.\n\nA White House official told CNN on Thursday evening that Carl is still the nominee.\n\nCNN’sKFile uncovered in September 2025that Carl deleted thousands of social media posts, many demonstrating a history of inflammatory commentary – including incendiary posts about race, claims that “peaceful coexistence” with Democrats is impossible, and even a call for a political opponent to face the death penalty.\n\nCarl also repeatedly wrote about the “Great Replacement,” a conspiracy theory that posits there is a plot to intentionally bring non-White immigrants into Western countries to “replace” White populations.\n\nIn his hearing Thursday, Carl was pressed on those past comments and others, including a 2024 podcast appearance in which he reportedly said, “Jews have often loved to play the victim,” and that “the Holocaust dominates so much of modern Jewish history,” according to Sen. Jeanne Shaheen, a New Hampshire Democrat.\n\nShaheen, the ranking member of the committee, said that since his nomination, Carl had “tweeted more than 850 times, appeared on five podcasts and repeated this language.”\n\n“This is a pattern,” she said.\n\n“It’s hard to understand how we can trust you if you can’t even restrain yourself during the period in which you’ve been nominated,” she told him.\n\nCarl argued that he understands “the importance of restraint and conduct.”\n\n“I unfortunately have to balance that with my current job which involves advocacy. I can’t, as I’ve explained, just totally put away my day job,” he said. Carl is a senior fellow at the Claremont Institute, a conservative think tank. He served as a former deputy assistant secretary at the Interior Department during President Donald Trump’s first term.\n\nIn an exchange with Democratic Sen. Cory Booker, Carl said he regretted some of his past comments about Jewish people.\n\n“I made some comments in interviews about minimizing the effect of the Holocaust that were absolutely wrong. And I’m not going to sit here and defend them here,” he said.\n\nHowever, pressed on whether he regretted comments he has made about other races, Carl said he was “echoing” Trump that “unity rather than diversity is a strength.”\n\nSen. Chris Murphy said that Carl’s nomination was “heartbreaking,” calling him “wildly unqualified” for the position. The Connecticut Democrat spent several minutes questioning Carl on views about “anti-White discrimination” and “the erasure of White culture.”\n\nCarl struggled to answer Murphy’s questions on what constitutes “White culture,” but alluded to “mass immigration” erasing “common American culture” and saying that it “weakens us.”\n\nCurtis, the Utah Republican, pressed Carl on how he would be able to stand up to alleged anti-Israel bias at the United Nations given his previous comments.\n\nAnd Democratic Sen. Jacky Rosen, who is Jewish, called Carl’s past comments “vile” and said his nomination “should alarm every Senator who believes in basic decency.”\n\nCNN has reached out to the State Department about Carl’s nomination. InSeptember 2025, spokespeople for both the department and the White House defended the nominee.\n\nCNN’s Andrew Kaczynski, Em Steck and Morgan Rimmer contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/politics/kfile-jeremy-carl-state-department-deleted-tweets",
      "text": "KFile uncovered in September 2025"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/politics/kfile-jeremy-carl-state-department-deleted-tweets",
      "text": "September 2025"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/jeremy-carl-state-department-nomination-bipartisan-opposition",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/jeremy-carl-state-department-nomination-bipartisan-opposition",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5bc194dd61c4ffe60cc9355e3fde54fd891cd537623cfe824e28b57fdbb5d352",
  "scraped_at": "2026-02-13T07:31:05.966568+00:00"
}