{
  "url": "https://lite.cnn.com/2026/02/12/business/cost-of-living-us-heating-bills",
  "title": "Home heating bills are soaring as temperatures plunge. It’s yet another rising cost for Americans | CNN Business",
  "date": "2026-02-12T21:30:09.090140+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nLaura Kotting figured her home heating bill would be higher than usual because of the recent polar temperatures. But she was not prepared for the latest monthly tab to jump nearly 30% to $200 compared to last year.\n\n“My first thought was ‘I’m not going shopping. I’m going to live on what’s in this house’,” said Kotting, 67, a retiree who lives in a 100-year-old home in Clarkston, Michigan. That means eating pasta, spaghetti sauce, sweet potatoes, frozen fruit and yogurt, while forgoing items like clementines and fresh vegetables.\n\nKotting, who is also trying to absorbhigher Medicare premiumsandgrocery prices, was hoping to keep her natural gas bills down this winter by sealing two upstairs bedrooms and leaving them unheated. She also shuts her curtains and covered her fireplace and windows with plastic to keep out drafts. Plus she bought fleece-lined leggings so she’s more comfortable at home, since she sets the thermostat at 64 degrees during the day and 62 degrees at night.\n\n“I know I’m not the only senior citizen wondering how they’re going to make ends meet,” said Kotting, who sold custom closets before being let go during the pandemic.\n\nRising prices fornatural gas,electricityand home heating oil, combined with sustained frigid temperatures in much of the country, are burning yet another hole in many Americans’ wallets.\n\nHome heating costs are expected to jump 11% this winter season, which runs from November to March, according to a revised estimate by the National Energy Assistance Directors Association. Earlier in the season, the group projected a 9.2% increase, but swiftly rising energy prices led it to bump up its forecast.\n\nThe vast majority of Americans heat their homes with electricity and natural gas, and their costs are forecast to soar by 14% to $1,242 and by 9.5% to $712, respectively, according to the association. Heating oil customers will see a 4.6% increase to $1,587, while the cost for propane users will edge up 1.1% to $1,339.\n\n“It’s now part of the affordability discussion,” said Mark Wolfe, the association’s executive director.\n\nElectric and natural gas prices will likely keep rising for the next few years, Wolfe said. Utilities are spending billions of dollars upgrading their aging infrastructure, while data centers are prompting a surge in demand for electricity. Meanwhile, the growth in natural gas exports is driving up that fuel’s prices.\n\nThe higher heating bills will likely leave more Americans behind on their utility bills. Already, one in six families are in arrears, Wolfe said, noting the association’s preliminary review shows that household utility debt climbed to roughly $25 billion at the end of last year, up from about $23 billion the prior year.\n\n“As winter shutoff moratoriums begin to expire at the end of March, many households will face disconnection risk,” he said.\n\nThe higher costs are forcing many Americans to find yet another way to pinch pennies.\n\nKeith Green was in shock when he received a $540 electric bill for December, and he’s bracing for a $504 bill for January. The lumber yard manager typically pays in the $300 range to heat his 1,500-square-foot house in Cincinnati, Ohio. He thought putting plastic film on the windows and redoing the seals and trim on his exterior doors would help keep price hikes in check.\n\nWhat’s particularly troubling Green is that his utility company gave him no warning or explanation for the spike in costs.\n\n“It just slaps you in the face,” said Green, who is now trying to reduce the cost of traveling to his sister’s wedding in Phoenix later this year. “It’s not like my job is paying me more money. I constantly have to rebudget and refigure something out.”\n\nEven though Diane Bricker doesn’t live in her Ocean City, New Jersey, condo during the winter, the retiree shelled out $698 last month for electricity to keep the heat at55 degrees and to power the refrigerator. That’s at least triple what she paid in 2023 and has prompted her to say she may sell the place, her son, Nick, told CNN.\n\n“My mom didn’t spend one day in that condo since September,” Nick Bricker said, noting the apartment is less than 1,000 square feet. “It’s insane what they are charging her.”\n\nHeating bills are also coming up in more conversations when people are looking to buy houses, said Nick Bricker, a Realtor based in the area. Would-be buyersare factoring heating expenses into the cost of living in a home as a residence or renting it as an investment property.\n\nJohn Gaspar was not expecting the winter heating bills for his Chicago studio apartment to top $160 a month, especially since runningthe air conditioning over the summer was not particularly expensive.\n\nTo try to minimize costs, Gaspar unplugs his computer, coffee maker and other electronics when not in use and keeps the thermostat at 64 degrees. During super cold days, he’ll turn on a space heater for a short time. Otherwise, he grabs a sweatshirt or blanket – or snuggles with his cat, Kit.\n\nGaspar works for a nonprofit transitional housing group until he returns to his job as a senior deckhand at a tour boat company in a few months. The higher bills are weighing on him, limiting the amount he can save and spend.\n\n“It adds an extra level of stress of just trying to balance your comfort with ‘I don’t want my bills to go up any higher than they are,’” Gaspar said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/politics/medicare-premiums-rise-health-care",
      "text": "higher Medicare premiums"
    },
    {
      "url": "https://www.cnn.com/2025/10/24/politics/fact-check-grocery-prices-trump",
      "text": "grocery prices"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/business/weather-snow-storm-natural-gas-price",
      "text": "natural gas"
    },
    {
      "url": "https://www.cnn.com/2025/12/04/climate/electricity-bills-high-infrastructure-wires-demand-cost",
      "text": "electricity"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/business/cost-of-living-us-heating-bills",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/business/cost-of-living-us-heating-bills",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5c7f6a738f9d292242358df5fb9fe1fdcd88975ea4ca28bf80155a8fc5e4f6d1",
  "scraped_at": "2026-02-12T21:30:09.090153+00:00"
}