{
  "url": "https://lite.cnn.com/2026/02/23/politics/tony-gonzales-affair-allegations-mike-johnson",
  "title": "Speaker Johnson tells Rep. Tony Gonzales to address affair allegations but says he shouldn’t resign | CNN Politics",
  "date": "2026-02-24T07:31:38.526987+00:00",
  "authors": [
    "Ellis Kim",
    "Manu Raju",
    "Sarah Ferris",
    "CNN"
  ],
  "text": "Source: CNN\n\nHouse Speaker Mike Johnson is resisting calls, including from within his own ranks, to pressure Rep. Tony Gonzales to resign amidallegations he had an affairwith a district staffer who later died by suicide, telling reporters he wants investigations to play out first.\n\nJohnson conceded the accusations were “very serious” and that he has urged the San Antonio Republican to address them with his constituents directly. But the Republican leader insisted ongoing investigations should play out before he would step down.\n\n“There are serious accusations, and it must be taken seriously, and I’ve told him he’s got to address that with his constituents and, and he’s in the process of doing that,” the speaker told CNN.\n\n“It is my understanding there’s an investigation in the state of Texas on these matters and has been going for some time, and the Office of Congressional Conduct has also, it’s been reported, they’ve been looking at it and all of that was news to me. But I … think as in every case like this, you have to allow the investigations to play out and all the facts to come out.”\n\nAs the March 3 primary in the state draws nearer, allegations that Gonzales had an affair with a staffer who died by suicide last year have taken new hold. Gonzales has denied the affair and said he’s being blackmailed. But new text messages provided to CNN by the staffer’s husband show that Gonzales sent lewd messages to her, including in one exchange asking for a “sexy pic.”\n\nJohnson had endorsed Gonzales’ bid for reelection to his San Antonio-area seat, which he is defending against Brandon Herrera – a YouTube personality who ran against him in 2024 – in a tough GOP primary fight.\n\n“I endorsed Tony before all these allegations came out. They’re obviously very serious, and I’ve spoken with him and told him he’s got to address that in an appropriate way with his constituents and all of that,” Johnson said earlier Monday when asked if he still supported the congressman.\n\n“So it’s too early for anybody to prejudge any of that, but we’ll see how it develops,” he continued.\n\nGonzales is facing calls from his own party to step down. Reps. Lauren Boebert of Colorado and Nancy Mace of South Carolina called for his resignation Monday, and still others have called on him to drop his reelection bid.\n\nTop House Republicans have been closely tracking the allegations against Gonzales but are also aware that they cannot afford to have any members leave Congress unless there is a significant reason to do so, multiple people close to leadership have told CNN in recent days.\n\nJohnson is dealing with one of the House’s smallest margins in history. With full attendance in the House, Johnson and his team can only afford to lose one GOP vote or a measure will fail on the floor. Further complicating matters, there are two GOP vacancies and one Democratic vacancy.\n\nRepublicans will fill one of those vacancies after a special election in March, though that race is expected to go to a runoff in April. Democrats will also add one additional member in April after a New Jersey special election. Then the GOP will fill another seat, formerly held by the late Rep. Doug Lamalfa, after a special election in August.\n\nBut Republican leaders are also facing an unexpected challenge in Florida, where 73-year-old Rep. Neal Dunn is considering retiring early from the House.\n\nJohnson argued Monday that he’s been “intellectually consistent” on the matter of whether members facing allegations of misconduct should be forced to step down or not.\n\n“You know, I’ve been intellectually consistent about this. Whether you’re talking about Republicans or Democrats, you have to let the system play out. … I was against, for example, the expulsion of George Santos, a while back, because he had been accused of a crime and indicted but not found guilty,” he said.\n\n“If the accusation of something is going to be the litmus test for someone being able to continue to serve in the House, you’ll have a lot of people would have to resign or be removed or expelled from Congress. So, I think you got to allow this to play out,” he added, stressing again the claims against Gonzales are “very serious.”\n\nAttorney Bobby Barrera, who represents Adrian Aviles, said his client’s spouse – Regina Ann Santos-Aviles, who died by self-immolation last year – had confessed that she had been having an affair with the congressman in June 2024.\n\nGonzales has repeatedly criticized what he called the “personal smears” against him and has also accused Aviles of trying to blackmail him. Barrera has denied Gonzales’ claim, saying that the “assertion of extortion is ridiculous.”\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
      "text": "allegations he had an affair"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/tony-gonzales-affair-allegations-mike-johnson",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/tony-gonzales-affair-allegations-mike-johnson",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5dbbfecda449ff4d2262feb5f701c746732ef3ac2383bf4853335c0fed02bc95",
  "scraped_at": "2026-02-24T07:31:38.527001+00:00"
}