{
  "url": "https://lite.cnn.com/2026/02/24/us/colin-gray-trial-georgia-shooting",
  "title": "Colin Gray trial: Georgia school shooter’s father asked daughter to ‘cover for him,’ teen testifies | CNN",
  "date": "2026-02-25T07:31:52.387335+00:00",
  "authors": [
    "Eric Levenson",
    "Ray Sanchez"
  ],
  "text": "Source: CNN\n\nThe day of his teenage son’s deadly rampage at a Georgia high school, Colin Gray asked his daughter to “cover for him” if investigators questioned her about what he knew leading up to the shooting, the girl testified Tuesday at her father’s murder trial.\n\nJenni Gray, who was 13 at the time, testified her father specifically asked her to avoid mentioning his knowledge of images and articles ofNikolas Cruz, the imprisoned Florida school shooter, her brother had posted in his bedroom.\n\nThroughout her testimony, Jenni appeared to avoid eye contact with her father, who seemed to lean forward in his chair, listening intently as she calmly took the stand for much of the afternoon.\n\nShe recalled her father suggesting what she should tell investigators during an interview after the shooting.\n\n“He told me if they ask me anything about if he knew that Colt had problems, and his problems would lead up to this, that I should basically try to cover for him, and specifically about the pictures on the walls he told me not to tell them that he knew what they were,” the teen recalled her father instructing her.\n\n“Do you mean the pictures of Nikolas Cruz?” prosecutor Alix Daniel asked.\n\n“Yes, ma’am.”\n\nJurors earlier heard a recording of an interview with police in which Colin Gray said he asked Colt about a person in an image hanging on the wall.\n\n“He goes, ‘You really don’t know who that was?’ I’m like, ‘I’m asking who it is. He goes, ‘Oh, that’s one of the guys that did that last school shooting,’ ” Colin Gray is heard telling police in the recording, recalling an exchange with Colt days before the rampage.\n\nAt one point, a defense lawyer asked the court to disallow Jenni’s testimony but the judge allowed it to continue, noting she will remain under a subpoena in case she needs to be recalled to the stand.\n\nJenni testified she now lives with a foster family and has broken all contact with her biological family. She uses a different last name.\n\n“You certainly don’t want to go through life known as the sister of the school shooter,” defense attorney Brian Hobbs asked during cross examination.\n\n“Yes, sir.”\n\nThe sister’s testimony and the recording played earlier Tuesday provided key insights about Colin Gray’s actions and knowledge before Colt Gray, then 14, brought an AR-15-style rifle to Apalachee High School in Winder, Georgia, andopened fireon September 4, 2024. Four people were killed and nine were injured, before the teen surrendered to police.\n\nColin Gray has pleaded not guilty to nearly 30 charges, including two counts each of second-degree murder and involuntary manslaughter.\n\nProsecutors allege he allowedColt Gray access to the firearmdespite previous warnings that his son was a danger to others, actions that constitute criminally reckless conduct.\n\nHis defense attorney said in opening statements Colin Gray was unaware his son was planning the shooting and had taken steps to try to get him help.\n\nEarlier Tuesday, jurors heard Colin Gray’s comments during a 1.5-hour interview with Georgia Bureau of Investigation special agent Kelsey Ward shortly after the shooting.\n\nThe eldest Gray explained to police why he bought the boy an AR-15-style rifle, despite his son’s increasingly aggressive behavior and need for mental health counseling.\n\nColin Gray said he wanted to get his son Colt into deer hunting as a hobby to help him cope with histumultuous family life. He said Colt shot a deer in their first outing, leading Colin Gray to believe he had “turned a corner” with his son.\n\n“In my mind, I swear to God, I thought he was gonna be perfect from then on,” he said.\n\nBut the rifle Colt was using jammed, so Colin said, “We keep doing good, you’re doing good, maybe Santa Claus will bring you one.”\n\nHe then bought his son a rifle as his “big Christmas present” and gave him “the whole speech and everything” about gun safety, he said.\n\nIt’s not clear if he will testify in his own defense, so the recording could fill in that gap. While the recording offered key evidence for the prosecution, it also illuminated Colin Gray’s efforts to help his son and keep together a struggling family.\n\n“I’m trying to be the glue that holds this whole family together,” he said.\n\nColin Gray’s trial is part of a broader push to hold more people accountable for a school shooting, including the shooter’sparentsandresponding law enforcement officers. This case bears close similarities to the trials ofJames and Jennifer Crumbley, whose then-15-year-old son killed four students in 2021 at his high school in Oxford, Michigan.\n\nThe trial began last week and has featuredemotional testimony from students and teacherswho survived the shooting,police interviewswith Colin Gray, Colt Gray’s spotty school attendance,photos showing unsecured firearms and ammoin the home and testimony from the teen’s mother and grandmother about their unsettled family life.\n\nColt Gray hasadmitted to the shooting, according to authorities. Now 16, he has pleaded not guilty to55 felony counts, including four counts of malice murder. A trial date has not been set.\n\nIn his interview with police, Colin Gray said his son’s behavior had escalated and become more aggressive in the last five to seven months.\n\nHe said he and Colt had gotten into physical altercations when Colt “bull-rushed” him, and Colin tried to hold him down until he became calm. Colt Gray had also not been attending school and was dealing with bullying, the father said.\n\nHe told the GBI interviewer he had been trying to get Colt into counseling to deal with his issues.\n\n“We need to get him to go somewhere, that’s what we’ve been trying to do here for the last week or so,” he said in the recording.\n\n“I know he needs somebody – not to this level, clearly – like, I know he’s like a normal kid and he’s dealing with a bunch of crap,” he added. “I swear to God this is the last thing (I expected) … This was not on my damn radar.”\n\nColin Gray told police he had given his son a “pep talk” the morning of the shooting to encourage him to go to school, saying he was “super proud” of him, according to the recording.\n\n“There’s nothing we can’t overcome that you already have not overcome. You’ve been through a lot and you’ve done the hard part,” he said.\n\nColin Gray also proudly told police about his son’s musical talents and ability to take apart and rebuild computers.\n\nHe laid out his immediate reaction on the morning of the shooting. He said he received texts from Colt saying “I’m sorry” and “It’s not your fault,” causing him to become concerned.\n\n“I can tell something is wrong,” Colin Gray told police in the interview, saying he initially thought his son had gotten into a fight.\n\nWhen he heard that there had been a shooting at Apalachee High School, he went home to look for the AR-15-style rifle, which he said Colt Gray had been keeping in his room, he told police. The gun wasn’t there, he said.\n\n“I’m upset and sad but I’m really pissed,” he said to police. “That kid, man. This is just so wrong.”\n\nFor the defense, the recording humanized Colin Gray as a working father trying to care for his three children while helping his wife recover fromdrug and alcohol addiction. He said he did not believe in “old-school” belt-beatings and had created a safe “bubble” for his kids to tell him about their problems without fear.\n\nToward the end of the recording, Colin Gray appeared to be crying and breathing heavily. Ward, the special agent interviewing him, offered words of personal praise.\n\n“This is not your fault,” she said in the recording. “You sound like a great dad.”\n\n“Apparently not,” Colin Gray said in the recording. “I just know something bad has happened, and I want to apologize to somebody, but I don’t know who.”\n\nAs that part of the recording played in court, Colin Gray shook his head and covered his face with his hand.\n\nWard testified her goal in making that comment was to get him to remain cooperative and maintain a rapport with him. Indeed, after the interview, he agreed to give her access to his phone history, she testified.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2022/11/02/us/parkland-shooter-nikolas-cruz-sentencing-wednesday",
      "text": "Nikolas Cruz, the imprisoned Florida school shooter"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "opened fire"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "Colt Gray access to the firearm"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "tumultuous family life"
    },
    {
      "url": "https://www.cnn.com/2024/03/03/us/james-crumbley-trial-mass-shooting-accountability",
      "text": "parents"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/school-shooting-trials-police-officers",
      "text": "responding law enforcement officers"
    },
    {
      "url": "https://www.cnn.com/2024/03/16/us/james-jennifer-crumbley-trials-differences/index.html",
      "text": "James and Jennifer Crumbley"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "emotional testimony from students and teachers"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "police interviews"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "photos showing unsecured firearms and ammo"
    },
    {
      "url": "https://www.cnn.com/2024/10/22/us/apalachee-school-shooter-colt-gray-has-waived-arraignment-and-entered-a-not-guilty-plea",
      "text": "admitted to the shooting"
    },
    {
      "url": "https://www.cnn.com/2024/10/17/us/colt-colin-gray-apalachee-school-shooting",
      "text": "55 felony counts"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/colin-gray-trial-georgia-shooting-mother",
      "text": "drug and alcohol addiction"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/colin-gray-trial-georgia-shooting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/us/colin-gray-trial-georgia-shooting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5dd8f87272f8ba64cbacafcb061add29919be9c96328e9d2c2e8c17bca7da502",
  "scraped_at": "2026-02-25T07:31:52.387345+00:00"
}