{
  "url": "https://lite.cnn.com/2026/02/12/middleeast/netanyahu-trump-israel-elections-meeting-intl",
  "title": "Netanyahu leans on Trump ties as Israel heads toward elections | CNN",
  "date": "2026-02-12T21:29:19.482586+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nOnly one image was released fromDonald Trumpand Benjamin Netanyahu’smeeting Wednesday:a handshake in the Oval Office, distributed by the Israeli Prime Minister’s Office. Beyond that single frame, there were no reporters, no statements, no spontaneous gaggle with shouted questions.\n\nThe discretion added intrigue to what was already an unusuallyurgent meeting,brought forward by a week at Netanyahu’s request. The US has been continuing to build up its military forces in the Middle East, even as Trump pursues negotiations with Tehran.\n\nTrump, who rarely avoids cameras, limited his post-meeting comments to a social media post. Netanyahu’s office issued a brief readout reaffirming “the close coordination and relationship” without offering much detail.\n\nTrump’s Truth Social statement indicated his insistence that talks continue, in an apparent contrast to Netanyahu’s long-standing opposition to any nuclear agreement and his desire to discuss plans for another strike on Iran during his trip to Washington.\n\nNetanyahu later acknowledged conveying his reservations to Trump. “He wanted to hear my opinion,” Netanyahu said Thursday before departing for Israel. “I will not hide from you that I expressed general skepticism regarding the quality of any agreement with Iran.”\n\nHe stressed that any future deal must address not only Iran’s nuclear program but also itsballistic missile programandregional proxy networks, arguing that these issues are vital not only for Israel’s security but for regional stability more broadly.\n\nWhether the private setting and lack of cameras allowed both leaders to mask disagreements or rather quietly coordinate their mutual future actions remains unclear.\n\nBut even without cameras, any meeting in the Oval Office plays into Netanyahu’s immediate political needs: a domestic message, even more so in an election year. He publicly boasts about the number of times he has met with Trump since he returned to office — seven, more than any other world leader. And every presidential encounter guarantees that the story will dominate headlines for days, enabling the prime minister to dodge — even if briefly — mounting political problems at home, which caught up with him upon his return.\n\nElections are mandated for late-October, and Netanyahu has told his associates he aims to serve his full term. But his coalition risks fracturing in a looming crisis over the 2026 state budget, which requires approval by March 31. Failure to pass it would trigger the automatic dissolution of parliament, the Knesset, with elections typically held within 90 days — suggesting a potential June timeline for the vote.\n\nThe ultra-Orthodox parties, key partners in Netanyahu’s governing coalition, have tied their support for the budget to preserving their constituents’ long-standing exemption from mandatory military service, and they have pressed for passage of a divisive bill to enshrine it in law. Months of negotiations have failed to produce a compromise acceptable to both the coalition and the High Court, which has ordered enforcement against draft evasion. With no tangible compromise in sight, most political observers believe the clock is already ticking for Netanyahu’s government.\n\nPolitical consultant Nevo Cohen, who previously advised far-right politician Itamar Ben-Gvir, projects the coalition will fracture even if the budget passes and that an election will be called within weeks.\n\n“The Haredim (ultra-Orthodox) need the money, so the budget will probably pass,” Cohen said. “But they won’t get a conscription law, and on that, they’ll break the coalition. I estimate that in about a month and a half, the Knesset will dissolve.”\n\nCohen says a key pillar of Netanyahu’s reelection strategy is centered on his relationship with Trump, presented as proof that he is “in a different league” from competitors.\n\nInside Netanyahu’s Likud party, officials believe the prime minister’s decision on how to time elections is closely tied to his interactions with Trump. “Netanyahu will make his decision (on) how far he will go to save his coalition only when he returns from (visiting) Trump,” a senior Likud source said.\n\nNetanyahu has invited Trump to Israel’s Independence Day celebrations in May to receive the prestigious Israel Prize — the first ever awarded to a non-Israeli. Trump has not yet accepted, but if he does, the source predicted that the prime minister “will want to hold elections close to the visit,” using images of the two leaders together in Jerusalem for a reelection campaign crescendo.\n\nTies between the two leaders may be more transactional than they appear, as a veteran Israeli political insider suggests, describing Trump and Netanyahu’s current relationship as “an implicit deal.”\n\nTrump openly extends displays of support — meetings in the White House and calls to pardon Netanyahu in his corruption case — while acting independently on US regional policy: advancing the Gaza ceasefire plan, restarting diplomatic contacts with Iran and pushing Israel to calm tensions in Syria. All of these are moves that Netanyahu has historically resisted.\n\n“Publicly, Trump offers (Netanyahu) hugs and meetings by demand,” the Israeli insider said. Netanyahu, in return, refrains from criticizing moves that he would be “blasting as contrary to Israel’s interests” if any other US president had made them. With Trump, the source said, “he risks undercutting one of his central electoral assets.”\n\nOn Thursday, Trump called Israel’s president “disgraceful” for not granting Netanyahu a pardon amid an ongoing corruption trial.\n\nTrump has been pressuring President Isaac Herzog for months to pardon Netanyahu, including during a high-profile speech in Israel’s Knesset last year. But his latest attack marked an escalation in the pressure campaign, and it came a day after Trump met Netanyahu at the White House.\n\nIn response, Herzog’s office stressed in a statement Thursday that he “has not yet made any decision on this matter.” When he does, the statement said, it will be “without any influence from external or internal pressures of any kind.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/carrie-prejean-boller-religious-liberty-commission-removed",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-11-26",
      "text": "meeting Wednesday:"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/middleeast/netanyahu-visit-washington-iran-talks-intl",
      "text": "urgent meeting,"
    },
    {
      "url": "https://www.cnn.com/2025/10/29/middleeast/iran-rebuilding-ballistic-weapons-program-intl",
      "text": "ballistic missile program"
    },
    {
      "url": "https://www.cnn.com/2025/07/19/middleeast/iran-rearm-proxies-us-talks-stall-intl",
      "text": "regional proxy networks"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/middleeast/netanyahu-trump-israel-elections-meeting-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/middleeast/netanyahu-trump-israel-elections-meeting-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "5edf62447a403e8d0538f7a0535931b9aa3be307c285a1c4b4b3fc356d071e6b",
  "scraped_at": "2026-02-12T21:29:19.482599+00:00"
}