{
  "url": "https://lite.cnn.com/2026/02/26/politics/kilmar-abrego-garcia-nashville-hearing",
  "title": "Kilmar Abrego Garcia: Justice Department prosecutor says in court he wasn’t told by higher-ups to prosecute | CNN Politics",
  "date": "2026-02-27T07:15:41.423431+00:00",
  "authors": [
    "Devan Cole"
  ],
  "text": "Source: CNN\n\nA federal prosecutor in Nashville who secured criminal charges last year against Kilmar Abrego Garcia, the Salvadoran national who was illegally deported by the Trump administration, attempted to convince a federal judge on Thursday to not toss out the case based on a finding that it was likely vindictively pursued.\n\nThe high-stakes hearing was the latest flashpoint in a sprawling web of court cases Abrego Garcia has been ensnared in since his hasty deportation last March to a notorious mega prison in El Salvador and the administration’s initial reluctance to bring him back came to symbolize President Donald Trump’s slapdash and contentious approach to immigration enforcement.\n\nBut the criminal case Abrego Garcia was brought back to the US to face last year has essentially been on life-support in recent months after US District Judge Waverly Crenshaw found evidence of a “realistic likelihood” that he’s the target of a vindictive prosecution that was pursued, in part, by high-ranking Justice Department officials in Washington, DC.\n\nOver several hours of testimony before Crenshaw on Thursday, Robert McGuire, who is leading the prosecution, repeatedly stressed that department leaders in Washington played no role in bringing the pair of human smuggling charges against Abrego Garcia and that he was the one calling all the shots in the matter.\n\n“Who made the decision to seek an indictment of Mr. Abrego?” Associate Attorney General Stan Woodward asked McGuire at one point.\n\n“I did,” McGuire replied, adding that nobody at the Department of Justice’s headquarters asked him to pursue the charges.\n\n“The charging decision – that was my decision,” McGuire said. “I wanted to feel good about it on my own.”\n\nThat Thursday’s hearing happened at all is a remarkable turn of events in a criminal case that Deputy Attorney General Todd Blancheonce described as “strong.”The department had for months tried to avoid being put in the awkward position of having to defend its prosecution of Abrego Garcia but amid the legal wrangling, it’s been forced to turn over some internal communications that appeared to undermine the assertions made by McGuire last year and again on Thursday.\n\nThe integrity of the case has come under serious doubt by Crenshaw in recent months as he’s assessed Abrego Garcia’s claim that he’s being prosecuted in retaliation for successfully challenging his wrongful deportation, concluding that the Maryland father of three has shown evidence of a “realistic likelihood” that he’s the target of a vindictive prosecution. That determination could soon lead him to throw out the case.\n\nRequests by criminal defendants for judges to toss out charges based on their claim that they’re being vindictively prosecuted face extremely high hurdles in court and are overwhelmingly unsuccessful because of how difficult it can be to connect prosecutors’ decisions to a retaliatory motive.\n\nMcGuire on Thursday tried to brush aside any notion that such a connection exists in Abrego Garcia’s case. He said communications he had last spring about the case with an official working under Blanche were only meant to keep his office abreast of key developments in his pursuit of charges.\n\n“I wasn’t asking Mr. Singh’s permission or asking him to buy in on it,” he said, referring to Associate Deputy Attorney General Aakash Singh, who oversees dozens of US attorneys around the country.\n\nBut those comments could do little to sway Crenshaw, who said in a major ruling last year that a trove of internal documents “suggest” the prosecutor worked with department officials in Washington, “who may or may not have acted with an improper motivation.” The judge specifically pointed to Singh, saying he played a “leading role” in prosecutorial decisions in the case.\n\n“The court said (Singh) played a leading role. That’s just not true,” said McGuire, who now serves as a top-ranking prosecutor in the office.\n\nMcGuire also insisted that Abrego Garcia’s case was similar to other human smuggling cases he’d handled in the past. He said that after reviewing an officer’s body camera footage from a 2022 Tennessee interstate highway traffic stop the charges stem from, “I was immediately struck by how similar what was being depicted in the body cam was to those other” human smuggling cases.\n\nBut, he added, he wouldn’t have pursued charges based on the footage alone. Other evidence gathered before charges were sought bolstered his decision to ask a grand jury last May to approve the two counts.\n\n“There were a lot of things that told me … ‘OK, this really looks like a human smuggling operation,’” he said.\n\nTwo key decisions last year by Crenshaw revealed the shaky ground the case was on. The appointee of former President Barack Obama said that the burden is on the government to fend off a presumption that officials only reopened a yearsold probe into Abrego Garcia, and subsequently asked a grand jury to approve charges, to punish him for filing a lawsuit challenging his deportation.\n\n“The government had a significant stake in retaliating against Abrego’s success in the Maryland lawsuit and deterring any future efforts in that lawsuit,” Crenshaw wrote in his first ruling in October.\n\nIn that decision, the judge carefully laid out key moments leading up to Abrego Garcia’s indictment that appeared to support his claim that officials only reopened their investigation into him in response to his winning streak in the deportation case. He specifically called out public statements made by Blanche on the day Abrego Garcia was arrested that “directly linked the Maryland lawsuit to the investigation of criminal behavior by Abrego.”\n\n“At minimum, this suggests the (administration’s) frustration with Abrego, and that his case was not a run-of-the-mill prosecution,” he wrote. “Even assuming the individual motive of Acting US Attorney McGuire was pure, others’ motives, like fruit from a poisonous tree, may taint this prosecution.”\n\nTwo months later, Crenshaw made public excerpts of several emails between McGuire and Singh in which Singh said prosecuting Abrego Garcia is a “top priority” for the department and subsequent messages that showed McGuire providing updates and draft charging documents to Singh as he moved toward asking a grand jury to approve the charges.\n\nUnder questioning from David Patton, an attorney for Abrego Garcia, McGuire said he didn’t know whether Singh was sharing information from their conversations with Blanche, Attorney General Pam Bondi or other Trump administration officials.\n\n“Nothing happened that came back to me,” he testified.\n\nThat the government decided against calling Singh or Blanche as witnesses at the hearing could prove consequential since the judge has already signaled dissatisfaction with the representations made by McGuire about the charging decisions.\n\nBut if Crenshaw decides that the testimony provided Thursday is enough to refute his preliminary finding from last year, it’ll set up another round of court proceedings in which he’ll have to resolve a request from Abrego Garcia’s lawyers for him to summon Blanche and Singh to Nashville to testify at yet another hearing.\n\nMcGuire has previously argued that even if others in the administration “have alleged ill will” toward Abrego Garcia, “there is nothing before the court to establish that such alleged ill will actually motivated the prosecution.”\n\nHe said in a sworn statement last September that he “never received any direction” from officials at DOJ headquarters “that was unethical or inappropriate” and that choosing to charge Abrego Garcia “was the correct legal decision.”\n\nAlso on the witness stand Thursday was Rana Saoud, a former agent with the Department of Homeland Security’s investigatory office in Nashville, who similarly testified that her decision to reopen a yearsold probe into Abrego Garcia was not the result of any undue influence from officials in Washington.\n\nSaoud said she first learned about the 2022 traffic stop that the investigation – and criminal charges – stems from after someone sent her a local news article about it and that Abrego Garcia’s lawsuit challenging his deportation “had nothing to do with it at all.”\n\n“We’re not swayed by political posturing,” she said, adding later that at the time, she wouldn’t have talked to any leaders at the department, including Secretary Kristi Noem, about the newly reopened probe.\n\n“That is well above my level,” she said.\n\nLegal experts said that Crenshaw’s earlier rulings have put the government on notice that the case is quickly unraveling.\n\n“It is exceedingly rare that, as here, the evidence triggers the presumption of a vindictive prosecution that the government must rebut. This puts the government’s counsel on their heels,” said retired federal Judge John Jones.\n\n“The government’s witnesses are going to have to try to explain away a determination to prosecute Abrego Garcia that came from Main Justice and only after he was released,” Jones added. “From the defense’s standpoint, this is a lawyer’s dream.”\n\nAbrego Garcia has been on pre-trial release in Maryland and is simultaneously fighting off efforts by the administration to re-deport him, this time to a country other than El Salvador. He attended Thursday’s hearing, but sat silently in the well of the courtroom as the two witnesses took the stand, following their testimony with the help of interpreters.\n\nHis initial deportation to that country, which he is from, violated a 2019 court order that expressly prohibited officials from sending him back because he feared gang violence there.\n\nAfter a federal judge in Maryland said the government needed to work to “facilitate” his return, officials resisted complying with her order for months, but eventually partnered with El Salvador to return him in early June. He was arrested on the human smuggling charges when he returned to American soil.\n\nAbrego Garcia has pleaded not guilty to the pair of charges, which stem from  the 2022 stop that was the subject of a federal investigation that closed days before he was deported last March.\n\nProsecutors elected to not bring charges following the stop, but in the indictment secured last year, they alleged that the nine Hispanic male passengers who were in the car with Abrego Garcia were being smuggled as part of a yearslong international smuggling ring that he was involved in.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.foxnews.com/video/6373969491112",
      "text": "once described as “strong.”"
    }
  ],
  "hash": "5fe975e3285ddd56b36470b9b2f28d8eadf9969c585939de233bb57f0dc3c43f",
  "scraped_at": "2026-02-27T07:15:41.423444+00:00"
}