{
  "url": "https://lite.cnn.com/2026/02/20/us/nevada-counterterrorism-incident-investigation-fbi",
  "title": "Officials investigating terrorism-related event after driver rammed car into Nevada power substation | CNN",
  "date": "2026-02-21T07:04:38.033794+00:00",
  "authors": [
    "Alaa Elassar",
    "Bill Kirkos",
    "CNN"
  ],
  "text": "Source: CNN\n\nA driver is dead after he rammed a vehicle through the gate of a power substation in Boulder City, Nevada, on Thursday in what authorities are investigating as a terrorism-related event, according to the Las Vegas Metropolitan Police Department.\n\nThe driver, who was found with a self-inflicted gunshot wound, has been identified as 23-year-old Dawson Maloney of Albany, New York, Sheriff Kevin McMahill said during a news conference on Friday.\n\nEvidence recovered during the investigation included multiple books related to extremist ideologies — spanning right- and left-wing extremism, environmental extremism, white supremacy and anti-government beliefs — as well as explosive materials and components, according to McMahill.\n\nMaloney had recently been reported missing out of New York and had communicated with family members before the incident, making statements referencing self-harm and suggesting he intended to commit an act that would put him “on the news,” McMahill said. Maloney had also messaged his mother and referred to himself as a “dead terrorist son” and said he felt obligated to carry out the attack.\n\nMaloney had rented a car on February 12 and left Albany around February 14, driving across the country to Boulder City, FBI Special Agent in Charge Christopher Delzotto said during the news conference.\n\nA search of the rental vehicle also uncovered two shotguns, an AR-style pistol, numerous loaded AR magazines and shotgun shells, two devices described as flamethrowers containing thermite material, a crowbar, a hatchet and a cellphone currently undergoing forensic analysis, McMahill said.\n\nTwo search warrants were executed in Albany, Delzotto said. Electronics were also recovered from one residence and are being processed for evidence, while a second residence yielded several firearm components and a 3D printer.\n\nAn FBI spokesperson told CNN that bureau personnel in Nevada and New York were assisting the Las Vegas Metropolitan Police Department, which is the lead agency for the investigation.\n\nAlbany Law School confirmed Maloney was a student in an email to CNN. “We are heartbroken to hear of the tragic passing of one of our law students, Dawson Maloney, in an off-campus incident,” a spokesperson said in a statement.\n\nThe “critical incident” began late Thursday morning at a Los Angeles Department of Water and Power facility located near Boulder City, according to McMahill.\n\nAt approximately 10 a.m., Boulder City police dispatch received a 911 call reporting a vehicle had crashed through a secured gate at the power substation. The caller told dispatchers the driver appeared to be dead and gunshots had been heard after the crash, McMahill said.\n\nWhen officers arrived, they observed a broken perimeter fence consistent with a vehicle being intentionally driven through it. Investigators also saw a debris field leading to a silver Nissan Sentra bearing New York license plates. The vehicle had come to rest against large industrial wire reels inside the facility.\n\nAs officers approached the car, they found the driver with what appeared to be a self-inflicted gunshot wound, according to McMahill.\n\nSurveillance video shown during the news conference captured the vehicle approaching the facility before crashing through the gate and into the power infrastructure area.\n\nThere was no indication of major damage to the facility or any other critical infrastructure, and no service disruptions were reported as a result of the incident,Tim Shea, chief of the Boulder City Police Department, said during the news conference.\n\nAttacks on the United States’ power grid havelong been a focus of concernfor law enforcement and intelligence agencies. Extremist chatter around targeting critical infrastructure notably increased in 2020, the same year a 14-page guide circulated among extremist communication channels detailing low-tech attacks, including assaults on power grids using firearms.\n\nIntelligence reports have described the electric grid as an “attractive target” for such extremists, highlighting its vulnerability and symbolic significance,CNN previously reported.\n\nWhen asked about a previous incident during the news conference, McMahill referenced a past incident near the Boulder City power substation facility, noting the ongoing need to address vulnerabilities at power plants.\n\n“In this particular case, there are private security officers that are out there. There’s video, unlike we had in the previous incident. So there are things that they’ve done to target harden that,” he said. “We’ll continue to look at how we target harden those locations.”\n\nCNN’s John Miller and Josh Campbell contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2022/12/05/us/us-power-grid-attack-north-carolina-extremist-terrorism",
      "text": "long been a focus of concern"
    },
    {
      "url": "https://www.cnn.com/2022/01/25/politics/electric-grid-attractive-target-domestic-violent-extremists/index.html",
      "text": "CNN previously reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/nevada-counterterrorism-incident-investigation-fbi",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/nevada-counterterrorism-incident-investigation-fbi",
      "text": "Cookie Settings"
    }
  ],
  "hash": "60149078d799a7fc8fbfdebd63640ef7932af0ee2f864d7ee4d72ceb0f907a2f",
  "scraped_at": "2026-02-21T07:04:38.033806+00:00"
}
