{
  "url": "https://lite.cnn.com/2026/02/10/world/french-wine-exports-intl-hnk",
  "title": "French wine, spirits export volumes sink to at least 25-year low | CNN",
  "date": "2026-02-11T16:39:02.789679+00:00",
  "author": "Unknown",
  "text": "Source: Reuters\n\nFrench wine and spirits exports fell last year to their lowest volume in at least 25 years as US tariffs and Chinese duties hit sales and a strong euro made some alcohol more expensive, industry group FEVS said on Tuesday, warning of no imminent relief.\n\nTotal French wine and spirits exports dropped 3% in volume last year to 168 million cases, their lowest level since at least the beginning of the century, according to a spokesperson for FEVS. They fell 8% in value to a five-year low of 14.3 billion euros ($17.03 billion).\n\nFrench wine and spirits exports have slipped from being traditionally France’s second-largest export sector to third, behind aerospace and cosmetics, as trade tensions intensified.\n\nLooking ahead, FEVS chair Gabriel Picard said the sector should benefit from new EU trade deals with the South American Mercosur bloc and India, though 2026 could remain difficult without improved market access.\n\nLast year, higher tariffs on shipments to the United States and threats of a further hike, up to 200%, cooled demand, especially in the second half, with 2025 sales dropping 21% to 3.0 billion euros and volumes falling below 30 million cases.\n\n“There is a real decline in the United States and the volume correction may not have been sufficient, and perhaps we will see another volume correction in 2026,” Picard told Reuters ahead of the Wine Paris exhibition.\n\nSales to China dropped 20% to 767 million euros in 2025 as anti-dumping duties sharply curbed shipments of cognac, armagnac and other wine-based spirits, FEVS said.\n\nExports of cognac, the French industry’s flagship spirit, plunged 15% in volume and 24% in value, becoming one of the biggest casualties of escalating trade tensions.\n\n“Geopolitical tensions between France and China marked the end of cognac in China. Now stopping something doesn’t take long, but rebuilding takes a long time,” Picard said.\n\nWithin Europe, wine and spirits exports held broadly stable at 4.1 billion euros, with resilience in markets such as the UK, where volumes rose 3% despite fiscal pressure, FEVS said.\n\nChampagne exports, which amount to 35% of the value of all wine exports, slightly rose in volume but fell 4.5% in value. The fall was due to the sharp rise of the euro against the dollar that started early last year, David Chatillon, co-chair of the Comite Champagne, said at Wine Paris.\n\n“We hope to see a rebound in sales in 2026 but it will likely not be significant because the environment is not very different,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/world/french-wine-exports-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/world/french-wine-exports-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "60748fd0a220a1f774dca146f82c6f47c7f073f56c9664f0c8b925a9b4518a41",
  "scraped_at": "2026-02-11T16:39:02.789692+00:00"
}