{
  "url": "https://lite.cnn.com/2026/02/12/americas/tumbler-ridge-shooting-suspect-online-posts-intl-hnk",
  "title": "Canada school shooter: What the apparent online footprint of Jesse Van Rootselaar tells us | CNN",
  "date": "2026-02-14T07:07:01.596059+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe suspect in Canada’sTumbler Ridge mass shootingposted about guns and hunting on her YouTube channel and appeared to have written about her struggles with mental health online, according to social media posts.\n\nCanadian policenamed 18-year-old Jesse Van Rootselaaras the shooter who killed her mother and 11-year-old stepbrother before opening fire at Tumbler Ridge Secondary School, killing five students and a teacher and then fatally shooting herself. Police are still investigating and have not determined a motive.\n\nVan Rootselaar, who was transgender, transitioned about six years ago, according to police. She was a resident of the remote town in the foothills of the Rocky Mountains in British Columbia and had dropped out of school about four years ago.\n\nAccording to social media posts, verified by CNN, Van Rootselaar had access to guns and was enthusiastic about hunting.\n\nJennifer Strang, the suspected shooter’s mother, posted a photo to Facebook in 2024 of a cabinet holding what appears to be six hunting rifles, with the caption “Think it’s time to take them out for some target practice.”\n\nAt a press conference Friday, police told reporters that Strang held a firearms license, but there were no weapons registered to it.\n\n“There are certain types of firearms unrestricted that do not have to be registered,” said Deputy Commissioner Dwayne McDonald of the Royal Canadian Mounted Police (RCMP). “So, we’re trying to determine and trace the origin of all firearms.”\n\nVan Rootselaar spoke about hunting and guns on a YouTube channel, according to a 2021 Facebook post by Strang.\n\nStrang posted a link to what she described as Van Rootselaar’s YouTube channel, which contains “posts about hunting, self-reliance, guns and stuff (she) likes to do.” Strang encouraged her friends to check it out and subscribe.\n\nThat YouTube channel had been taken down as of Thursday. An archived search showed several videos posted on it with titles related to firearms.\n\nA Reddit user with the same username as the YouTube channel, and whose activity is consistent with the channel and the age of the suspected shooter, posted a video in 2023 of themself using a gun at a firing range.\n\nRoblox, a popular game creation platform that has beenunder scrutiny over reports of violence and child grooming on its platform, said it deleted an account belonging to Van Rootselaar followingreportsthat the suspect had created a game simulating a mass shooting at a mall. Roblox said the game had only been visited seven times.\n\n“We have removed the user account connected to this horrifying incident as well as any content associated with the suspect. We are committed to fully supporting law enforcement in their investigation,” a Roblox spokesperson told CNN.\n\nWhileCanada has far stricter gun laws than the US, it is legal to own certain types of guns with a valid license. Children between 12 and 17 can use a firearm for an approved purpose such as hunting or target practice with a Minor’s License.\n\nPolice recovered two firearms, a long gun and a modified rifle at the scene on Tuesday, though neither was registered to Van Rootselaar, whose license expired in 2024.\n\nIn an update on Friday, the RCMP said that it was also analyzing a shotgun and another firearm from Van Rootselaar’s home.\n\nHunting is a common pastime in Tumbler Ridge, Rev. Gerald Krauss of the town’s New Life Assembly Church told CNN.\n\nThe small town is best known for its nature and is surrounded by wildlife including deer, moose, elk, wolves, and grizzly and black bears.\n\nThe community is no stranger to guns but a fatal shooting was “brand new,” according to Krauss. “Everybody hunts and no one did something stupid,” he said, calling them “very responsible people who live here.”\n\nPolice seized firearms from Van Rootselaar’s residence a couple of years ago but later returned them when the owner petitioned for them, McDonald said on Wednesday. Police did not specify the owner of the firearms.\n\nMcDonald said police had also visited Van Rootselaar multiple times in recent years regarding mental health issues, and that on some occasions “the suspect was apprehended for assessment and follow up.”\n\nThe most recent visit, last spring, was over “concerns regarding mental health, self-harm,” he said.\n\nOn Friday, the RCMP said that neither the shotgun from Van Rootselaar’s home nor “the main firearm believed to be used in the mass shooting at the school” had ever been seized by police. The shotgun was unregistered, and the RCMP is still investigating the origin of the firearm used at the school.\n\nOn the Reddit account which matched the username of Van Rootselaar’s YouTube channel, several posts openly discussed struggles with mental health issues, with the poster saying they had sought psychiatric help in 2023. The Reddit posts also detailed drug use.\n\nWhen asked if the town had adequate support for mental health services, the town’s mayor, Darryl Krakowka, said it was something the community was short on.\n\nThis story has been updated with additional information, as well as a clarification from police on the type of gun recovered at the school.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/americas/canada-mass-shooting-school-latam-intl",
      "text": "Tumbler Ridge mass shooting"
    },
    {
      "url": "https://www.cnn.com/world/live-news/tumbler-ridge-canada-shooting-02-11-26",
      "text": "named 18-year-old Jesse Van Rootselaar"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/nihilistic-violent-extremism-fbi-documents-invs",
      "text": "under scrutiny over reports of violence and child grooming on its platform"
    },
    {
      "url": "https://www.404media.co/tumbler-ridge-shooter-created-mall-shooting-simulator-in-roblox/",
      "text": "reports"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/americas/canada-british-columbia-school-shooting-intl-hnk",
      "text": "Canada has far stricter gun laws than the US"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/americas/tumbler-ridge-shooting-suspect-online-posts-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/americas/tumbler-ridge-shooting-suspect-online-posts-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "60a1f1b29e194aa41d80255acfc390a85eb5c9507f5c23980bc884c47d6ed950",
  "scraped_at": "2026-02-14T07:07:01.596073+00:00"
}