{
  "url": "https://lite.cnn.com/2025/02/12/style/bridget-jones-clothes-50s-frazzled-englishwoman",
  "title": "Dressing Bridget Jones in her 50s: The ‘Frazzled Englishwoman’ grows up | CNN",
  "date": "2026-02-18T07:32:28.927472+00:00",
  "authors": [
    "Kati Chitrakorn, CNN"
  ],
  "text": "Source: CNN\n\nTwenty-four years since actor Renée Zellweger first appeared in the film adaptation of Helen Fielding’s literary bestseller “Bridget Jones’s Diary,” she’s back for her fourth turn as an endearing, klutzy character looking for love. Although this time, in “Bridget Jones: Mad About the Boy,” she’s no longer a carefree young woman, but a widow in her 50s, with two kids.\n\nJones’s personal style — a quirky, at times ill-fitting wardrobe of short skirts, cleavage-revealing tops, mumsy cardigans, granny pants and long scarves — helped cement her character into an unforgettable part of noughties pop culture history. Though, this wasn’t the intention of costume designer Rachael Fleming.\n\nWhen creating the outfits for the first 2001 Bridget Jones cast, Fleming sought to give Jones — whose diary entries detailed her romantic adventures, weight, and alcohol and cigarette consumption — a pragmatic, somewhat disheveled look that would feel relatable to busy women. It’s a perspective that feels even more pertinent now in a glossy world of seemingly perfect and photoshopped images.\n\nThe style has since spawned a microtrend coined as the “Frazzled Englishwoman” aesthetic, which encompasses the kind of haphazard layering often seen on British people because of the country’s unpredictable weather. Think of a jilted Kate Winslet in “The Holiday” or a befuddled Keira Knightley in “Love Actually.” Such archetypes have also inadvertently appeared on the runways of luxury brands such as Chanel and Miu Miu.\n\nMaintaining a feeling of “authenticity” and being “rooted in reality” was crucial to Molly Emma Rowe, the costume designer for Bridget Jones’s latest big screen adaptation. “Bridget has some nice clothes, and she tries her best, but she sort-of always gets it a bit wrong. There’s always something a little bit off, whether it’s the fit, or the pattern or color clashing,” she told CNN over a phone call.\n\nIn the new film, which releases in UK cinemas and on Peacock in the US on February 13, Rowe said there are fewer “iconic clothing moments” — such as the Playboy bunny outfit that Jones wore to the Tarts and Vicars party where almost nobody else is in costume, or the racy tiger-print underwear styled with nothing but a camisole and cardigan as she chased Mark Darcy (Colin Firth) in the snow. This time round, those kinds of “uncomfortable situations” simply don’t feature, added Rowe.\n\nWith Jones now juggling a career with parenting, friendships and dating, “it’s a very emotional film,” Rowe explained. “We’re trying to bring Bridget back to life and help her navigate through her grief. It was important for us that as she was finding her way, her clothes didn’t sort of challenge that.”\n\nJones’s wardrobe, like the character, is palpably more grown up. Cocktail dresses and cozy twinsets have been swapped out for work-appropriate blazers and cardigans layered over shirts, though Rowe retained some of Jones’s flirty personality by dressing her in pieces such as a mini skirt, made more demure styled with stockings. There are also plenty of subtle, nostalgic references to previous films, such as an emerald green dress, which Jones, in the opening scene of the new movie, struggles to zip up without Darcy — a nod to her look in the third film when she reunites with Darcy.\n\nWith only 12 weeks to pull together a wardrobe for the cast, and few of Jones’s old clothing in the archives, Rowe recreated some historical looks— such asthe infamous red penguin-print pajama set(a version of the pajama top is worn by Jones on a school run in the new film). “The original ones no longer exist, so we had to recreate them,” explained Rowe. “We color-tested loads of reds on screen to make sure that after filming it would still look like the original red. That required fading out (the fabric), pulling threads and breaking buttons, to make them look like they’d been worn and washed over 20 years.”\n\nThat was a key premise of the clothes worn by Jones: “Fashion is cyclical. You might find things that you’ve worn many years ago that you try out again later. We saw Bridget doing that,” noted Rowe. Many of the pieces Zellweger wore in the film were thrifted from charity and consignment stores, such as Mary’s Living and Giving in Hampstead, the north London neighborhood where her character lives. “Mark died four years ago and Bridget’s not out buying clothes. She’s struggling to keep it together, which is one of the reasons why nothing (in her life) looks new,” Rowe said.\n\nCoping with grief and its subsequent impact on how one dresses was another focal point. Rowe drew on her personal experience having lost her father as a teenager, a “confusing time” that changed how her mother dressed. “My mom wore a lot of his clothes during that period. I think it was like reaching for a comfort blanket.” That inspired the oversized bobbly gray cardigan and shirts, monogrammed with Mark Darcy’s initials, which Jones is seen wearing throughout. For Rowe, it also added a nuanced perspective that wasn’t part of the script: “We could create the idea of what Mark Darcy might have been wearing at home with Bridget and the kids, which is not something you ever see on screen.”\n\n“Bridget Jones: Mad About the Boy” also follows the recent releases of films that center on women in their 50s, such as “The Substance,” the provocative horror-comedy starring Demi Moore as a former A-lister past her prime and drawn to the potential benefits of a mysterious new drug, and “Babygirl,” an erotic thriller featuring Nicole Kidman as a high-flying CEO who begins an illicit affair with a young intern. It’s a welcome development after years of inequality in the representation of middle-aged and older females in film and television (female characters aged 50 and above continue to have a limited presence on screen and are far less likely to have a romantic storyline, according toa 2024 reportby the Geena Davis Institute in collaboration with the NextFifty Initiative.)\n\nIf Rowe has a message for viewers, it’s that she hopes they’ll be “empowered to feel comfortable in their vulnerabilities,” she said. “To be a woman approaching or in her 50s and having these kinds of films to watch is very inspiring.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/style",
      "text": "Style"
    },
    {
      "url": "https://www.cnn.com/style/fashion",
      "text": "Fashion"
    },
    {
      "url": "https://www.cnn.com/2024/04/11/opinions/bridget-jones-hugh-grant-mad-about-the-boy-thomas/index.html",
      "text": "the infamous red penguin-print pajama set"
    },
    {
      "url": "https://geenadavisinstitute.org/wp-content/uploads/2024/01/GDIGM-Next50-WomenOver50-Study.pdf",
      "text": "a 2024 report"
    },
    {
      "url": "https://www.cnn.com/2025/02/12/style/bridget-jones-clothes-50s-frazzled-englishwoman",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2025/02/12/style/bridget-jones-clothes-50s-frazzled-englishwoman",
      "text": "Cookie Settings"
    }
  ],
  "hash": "61f1cf8844456ffb8f58999533d163e8b3da3fab12431d954e76684434f292e1",
  "scraped_at": "2026-02-18T07:32:28.927485+00:00"
}
