{
  "url": "https://lite.cnn.com/2026/02/24/entertainment/scrubs-new-season-cec",
  "title": "‘Scrubs’ revival season returns with a new heartbeat | CNN",
  "date": "2026-02-27T07:17:03.360779+00:00",
  "authors": [
    "Radhika Marya"
  ],
  "text": "Source: CNN\n\nFor Donald Faison, stepping back into the shoes of Turk — the lovable surgeon who for about a decade was one half of the zaniest bromance on television — was like riding a bike.\n\n“By the time I got to the end of the block, I’m already doing wheelies and all of that stuff again,” Faison said.\n\nFaison is back — along with Zach Braff as J.D. and Sarah Chalke as Elliot — for a revival season of “Scrubs,” right when a lot of viewers could use a good laugh.\n\nThe new season, which premiered Wednesday on ABC, features more familiar faces, including John C. McGinley as Dr. Cox and Judy Reyes as Carla. Even creator Bill Lawrence, whose recent hits include “Shrinking” and “Ted Lasso,”is back as executive producer.\n\nLike the original “Scrubs,” which premiered in 2001 and began by chronicling J.D.’s journey as a medical intern, the revival serves up a healthy dose of comedic and heartfelt moments interspersed with J.D.’s signature wacky daydream sequences and voiceovers.\n\nBut not everything’s the same. J.D., now divorced from Elliot, is back at Sacred Heart Hospital to take over as chief of medicine while Dr. Cox retires. The characters have grown and medicine has changed since “Scrubs” went off the air in 2010 (Lawrence and revival showrunner Aseem Batra confirmed the new series ignores the ninth season, effectively a spinoff that featured little of the original cast).\n\n“I was just trying to figure out what the 50-year-old father, excellent teacher version of J.D. is and have it be real, while still being a guy who’s sort of goofy and silly like I think I am in real life,” Braff said.\n\nThe celebrated bromance between Turk and J.D. remains a key part of the show. Braff and Faison are famously good friends offscreen, and have appeared together inT-Mobile commercialsand also collaborated on the podcast, “Fake Doctors, Real Friends.”\n\n“I think that’s one of the reasons ‘Scrubs’ worked is that Donald and I just instantly clicked. And then obviously with Sarah as well, we loved each other,” said Braff.\n\n“Scrubs” is far from the first show to be revived in recent years, but bringing it back felt right to much of the cast and crew, who said there’s always room for a tribute to medical professionals. Plus, the cast still has chemistry.\n\n“Now more than ever, we need to laugh,” said Faison.\n\nThenew“Scrubs” Season 1 works hard to bring the show into 2026, while also capturing the essence of classic “Scrubs” episodes that balanced comedy with heart, Batra said. To help accomplish this, Lawrence wrote the revival’s first episode, and weighed in on the rest of the season where he could. The appeal of Lawrence’s shows, Chalke noted, is that he “always writes with a real element of hope.” It’s a large part of why Lawrence is glad to see the story revisited today.\n\n“A lot of TV I do right now has an undercurrent of hopefulness and optimism in humanity,” Lawrence said. “If anyone’s working in a teaching hospital, they’re doing it because they want to be of service, and they’re doing it because they think there’s a greater good out there. And stories like that mean more to me right now than ever.”\n\nFor the younger cast members, being the new “newbies” could have been intimidating — some of them admitted to being around a year old when “Scrubs” first premiered. But series veterans made a point of welcoming everyone into the fold. Braff, for example, hosted Saturday night dinners for the cast every week.\n\n“We’d go to set, do our work and every Saturday, we’d bond and have a drink and laugh, and the director of the episode normally would come and join us,” said Layla Mohammadi, who plays surgical intern Amara.\n\n“I felt like I was in college all over again,” said Ava Bunn, who plays the perpetually online medical intern Sam Tosh — or“TikTok Doc,”as Dr. Cox calls her. “It was very, very fun.”\n\nThe new class of characters also includes Jacob Dudman and David Gridley as medical interns Asher and Blake, as well as Amanda Morrow as surgical intern Dashana.\n\n“They bring in that new vibe of what the changes in the medical industry have been, but also they bring in a complete transparency and lack of apology in approaching their work,” said Morrow.\n\nMeanwhile, some of the show’s legacy characters present a more cynical point of view. “It’s the same group of mediocrity,” said McGinley of surly Cox’s feelings about teaching yet another batch of interns.\n\nWhile returning characters are still passionate about taking care of people, signs that the job has taken its toll show. “So, you see how much Cox and Carla have changed and have been affected in the world of these Bambis, who are just excited for life and the opportunity to do what we’ve been doing for years,” Reyes said, using her character’s early nickname for then-intern J.D.\n\nThe blending of old and new storylines and perspectives serves as a natural entry point for potential new viewers.\n\n“If you knew about Turk, J.D. and Elliot from before or if you didn’t, this is a story that everyone can relate to,” Faison said.\n\nThat applies to different generations, too.\n\nBraff said fans anticipating the revival have written to him via Instagram about the show’s connection to their own homes and lives — people who watched it with their parents and now have kids of their own.\n\n“I think there’s a lot of people that grew up with the show, and it meant a lot to them,” he said. “I think that if we do it right, they’ll be happy to watch it again and also share it with their kids.”\n\nSeason 1 of the “Scrubs” revival airs Wednesdays at 8 p.m. ET/PT on ABC. Episodes stream on Hulu the next day.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2024/10/16/entertainment/shrinking-scrubs-season-2",
      "text": "Shrinking"
    },
    {
      "url": "https://www.cnn.com/2025/07/21/entertainment/ted-lasso-stateside-season-4",
      "text": "Ted Lasso,”"
    },
    {
      "url": "https://www.cnn.com/2024/02/05/entertainment/zach-braff-donald-faison-super-bowl-jason-momoa",
      "text": "T-Mobile commercials"
    },
    {
      "url": "https://www.instagram.com/p/DUQ8n1mEStl/",
      "text": "“TikTok Doc,”"
    }
  ],
  "hash": "6283a445053f8a2e7ec00de19b1328779367259f3f10bb646d2b9bd4927c84b4",
  "scraped_at": "2026-02-27T07:17:03.360794+00:00"
}