{
  "url": "https://lite.cnn.com/2026/02/12/politics/cia-recruiting-china-military-officers",
  "title": "CIA pitches Chinese military officers on helping the US in new video amid officer purge in China | CNN Politics",
  "date": "2026-02-14T07:08:33.503032+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe CIA is ramping up itsefforts to recruit Chinese spiesby releasing a new Mandarin-language video on Thursday that appeals directly to the country’s military officers who may be disillusioned with the corruption in their current government and President Xi Jinping’sextensive purges of top generals.\n\nIt portrays a fictional mid-level military officer “making the difficult decision to stay true to his values and forge a better path for his family by contacting CIA,” a CIA official told CNN.\n\n“Anyone with leadership ability will inevitably be feared and ruthlessly eliminated,” the video’s narrator says. “I cannot allow these madmen to shape my daughter’s future world.”\n\nThe new video seeks to build upon a recruitment push that the agency launched last year and helped cultivate new sources within China that are critical for collecting human intelligence, the CIA official said, suggesting the agency has had some recent success targeting a government it has historically struggled to penetrate.\n\n“We’re going to continue offering Chinese government officials and citizens an opportunity to work toward a brighter future together,” CIA Director John Ratcliffe said in a statement to CNN.\n\nDuring his confirmation hearing, Ratcliffe emphasized that China would be a top priority for the agency, and US officials have indicated that the CIA has made strides in reestablishing its network of sources inside the country that was thought to be lost just a few years ago.\n\n“China will take all necessary measures to firmly combat infiltration and sabotage activities by overseas anti-China forces, and resolutely safeguard national sovereignty, security and development interests,” foreign ministry spokesperson Lin Jian told a regular press briefing on Friday, when asked about the video.\n\n“The schemes of anti-China forces will not succeed.”\n\nStarting in 2010, the US lost a string of spies in China as part of a two-year counterintelligence campaign that The New York Timesdescribedas “crippling intelligence gathering.” Rebuilding that network has been a yearslong campaign for intelligence chiefs.\n\nA CIA official told CNN that the videos have successfully led to the recruitment of new intelligence sources inside the country.\n\n“The videos are working, and their wall isn’t perfect,” the official said, referring to the perception that Xi’s government had largely shielded itself from the prying eyes of US intelligence agencies.\n\nThe CIA believes it has an opportunity to potentially expand its visibility into Xi’s government – in part – by exploiting his intensifying crackdown on China’s military leadership.\n\nSince taking power in 2012, Xi has consistently soughtto keep China’s military hierarchy in checkthrough periodic purges of top leaders, which are part of a broader anti-corruption drive that has punished more than 200,000 officials to date.\n\nIn recent years, Xi’s purge has depleted the military’s upper echelon, with more than 20 senior military officials placed under investigation or ousted since 2023.\n\nAnd now, US officials believe Xi may be moving to consolidate power even further – pointing to the removal of China’s top general earlier this year in an unprecedented shake-up that analysts say was likely intended to further ensure the loyalty of officers within the military’s ranks.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/05/02/china/cia-recruitment-videos-chinese-officials-intl-hnk",
      "text": "efforts to recruit Chinese spies"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/china/xi-jinping-zhang-youxia-military-probe-intl-hnk",
      "text": "extensive purges of top generals"
    },
    {
      "url": "https://www.nytimes.com/2017/05/20/world/asia/china-cia-spies-espionage.html",
      "text": "described"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/china/china-top-general-under-investigation-intl-hnk",
      "text": "to keep China’s military hierarchy in check"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/cia-recruiting-china-military-officers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/cia-recruiting-china-military-officers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "62c1f93a36e9110e8d99613042ebcbd10f3c4d942f8f36c4861f8aecaeee63a8",
  "scraped_at": "2026-02-14T07:08:33.503046+00:00"
}