{
  "url": "https://lite.cnn.com/2026/02/21/us/california-cold-case-cigarette-dna",
  "title": "DNA from cigarette helps identify California teenager’s killer, solves 1982 cold case | CNN",
  "date": "2026-02-23T07:36:47.797403+00:00",
  "authors": [
    "Maria Aguilar Prieto, CNN"
  ],
  "text": "Source: CNN\n\nMore than four decades after a teenager was murdered in California, DNA found on a discarded cigarette has helped authorities catch her killer.\n\nSarah Geer, 13, was last seen leaving her friend’s house﻿in Cloverdale, California, on the evening of May 23, 1982.\n\nThe next morning, a firefighter walking home from work found her body, the Sonoma County District Attorney’s Officesaid in a news release. She had been dragged down an alley to a secluded area near an apartment building and behind a fence, where she was raped and strangled, according to authorities.\n\nHer death was ruled a homicide, but due to the “limited forensic science of the day,” no suspect was identified and the case went cold for decades, prosecutors said.\n\nNearly 44 years after Sarah’s murder, a jury found James Unick, 64, guilty of killing her on February 13. It would have been the victim’s 57th birthday, the Sonoma County District Attorney’s Office told CNN.\n\nGenetic genealogy, which combines DNA evidence and traditional genealogy, helped match Unick’s DNA from a cigarette butt to DNA found on Sarah’s clothing, according to prosecutors.\n\n“This guilty verdict is a testament to everyone who never gave up searching for Sarah’s killer,” District Attorney Carla Rodriguez said in the release. “This is the coldest case ever presented to a Sonoma County jury. While 44 years is too long to wait, justice has finally been served, both to Sarah’s loved ones as well as her community.”\n\nA break in the case first came in 2003, when investigators developed a DNA profile based on sperm collected from Sarah’s underwear, prosecutors said.\n\nHowever, the profile did not match anyone whose DNA was available for comparison in law enforcement databases at the time, according to the release, and the investigation came to a halt again. Those databases include information of known criminal offenders.\n\nIn 2021, the Cloverdale Police Departmentreopened the investigationinto Sarah’s death. The department said it had been in communication with a private investigation firm in late 2019 and had partnered with them in hopes the firm could revisit the case’s evidence “with the latest technological advancements in cold case work.”\n\nThe investigation also enlisted the FBI to help identify a potential match to the 2003 DNA profile.\n\n“The FBI, with its access to familial genealogical databases, concluded that the source of the DNA evidence collected from Sarah belonged to one of four brothers, including James Unick,” prosecutors said.\n\nOnce investigators narrowed down the list of suspects to the four Unick brothers, the FBI “conducted surveillance of the defendant and collected a discarded cigarette that he had been smoking,” prosecutors said.\n\nA DNA analysis of the cigarette confirmed James Unick’s DNA matched the 2003 profile, along with other DNA samples collected from Sarah’s clothing the day she was killed.\n\nInvestigators were able to crack the case thanks to the emerging field ofgenetic genealogy, which combines DNA analysis and family tree research.\n\nEssentially,a DNA sample is comparedto publicly accessible databases of millions of people who have contributed their genetic profile, and investigators can then piece together a family tree that leads to a suspect.\n\nIn 2018, genetic genealogy led to the arrest of theGolden State Killer, and it has recently helped solve several other cold cases, including a1974 murder in Wisconsinand a1988 murder in Washington. Investigators inNancy Guthrie’s disappearancerecently announced they would turn to genetic genealogyto analyze unknown DNA found in her house.\n\nPolice arrested Unick in July 2024 at his home in Willows, California.\n\n“Today represents a bittersweet victory for justice,” Cloverdale Chief of Police Chris Parker said in a2024 statementfollowing Unick’s arrest. “While nothing can undo the pain inflicted upon the Geer family and our community, we can finally offer some solace in knowing that the perpetrator will be held accountable.”\n\nAt the time of his arrest, Unick maintained he did not know Sarah or remember the events of the night of her death. During the monthlong trial, his story changed.\n\nUnick testified the teenager “propositioned him for sex while he had been playing a video game” at an arcade in Cloverdale, and claimed the two had engaged in consensual sex on a hillside near a local river, according to prosecutors.\n\nProsecutors also said Unick impliedSarah had been assaulted and killed by someone else later that night.\n\nJurors additionally heard from friends ofSarah who had spent time with her during her last weekend alive in 1982.\n\nFollowing two hours of deliberations, the jury rejected Unick’s account of events and convicted him ofmurder, prosecutors said.\n\nAs a result of the guilty verdict and since the jury found “the defendant committed a special circumstance related to the sexual assault during the commission of the murder,” Unick will be sentenced to life in prison without the possibility of parole, according to prosecutors.\n\nHe is scheduled to be sentenced on April 23.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://da.sonomacounty.ca.gov/sonoma-county-jury-returns-guilty-verdict-on-1982-cloverdale-murder",
      "text": "said in a news release"
    },
    {
      "url": "https://www.facebook.com/CloverdalePoliceDepartment/posts/pfbid02H2Z9LEwj2XXS5EvcT4KSk7zHwgLZsK2Bwvyd3z225LE8wTE12zanYw8VZizksD3kl",
      "text": "reopened the investigation"
    },
    {
      "url": "https://www.cnn.com/2018/08/03/health/dna-genealogy-cold-cases-trnd/index.html",
      "text": "genetic genealogy"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/nancy-guthrie-genetic-genealogy-dna",
      "text": "a DNA sample is compared"
    },
    {
      "url": "https://www.cnn.com/2019/06/12/us/cold-case-genetic-genealogy-washington/index.html",
      "text": "Golden State Killer"
    },
    {
      "url": "https://www.cnn.com/2024/11/08/us/mary-schlais-wisconsin-cold-case-killer-arrested/index.html",
      "text": "1974 murder in Wisconsin"
    },
    {
      "url": "https://www.cnn.com/2024/12/08/us/tracy-whitney-cold-case-dna-evidence/index.html",
      "text": "1988 murder in Washington"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/nancy-guthrie-genetic-genealogy-dna",
      "text": "Nancy Guthrie’s disappearance"
    },
    {
      "url": "https://www.facebook.com/CloverdalePoliceDepartment/posts/pfbid0YoJ5QQ3LrdqT2kZ2nQtk1p48SUBAjF83LVvHv5rCPUu6BLkwj3JRjCaecq4Wo4xQl",
      "text": "2024 statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/us/california-cold-case-cigarette-dna",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/us/california-cold-case-cigarette-dna",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6324ecb0bc2f5c1996dffa58647985276fe14a638382b2e793ea31df197df81f",
  "scraped_at": "2026-02-23T07:36:47.797417+00:00"
}