{
  "url": "https://lite.cnn.com/2026/02/19/americas/venezuela-political-prisoners-amnesty-law-latam-intl",
  "title": "Venezuela’s amnesty law: Caracas approves law to free hundreds of political prisoners | CNN",
  "date": "2026-02-24T07:33:25.456847+00:00",
  "authors": [
    "Alessandra Freitas, CNN"
  ],
  "text": "Venezuelan lawmakers on Thursday passed new legislation that givesamnestyto hundreds of people who were prosecuted or convicted for political reasons during 27 years of authoritarian rule.\n\nRights groups and opposition members havecautiously welcomedthe law, saying it offers an opportunity to ease the suffering of many, but that the process must be transparent and held to account.\n\nSome say the bill didn’t go far enough, and have questioned whether an amendment to one of the articles could prevent activists and opposition members in exile from receiving amnesty.\n\nActing Venezuelan President Delcy Rodríguez, who came to power after a US military operationremovedPresident Nicolás Maduro, proposed the new amnesty law last month under pressure from Washington.\n\nAfter signing the amnesty law, she described the moment as “an extraordinary door for Venezuela to reunite, for Venezuela to learn to coexist democratically and peacefully, for Venezuela to rid itself of hatred, of intolerance, let it open up to human rights.”\n\nMany in Venezuela – and the United States – will now be watching closely to see whether the country’s remaining political prisoners will soon walk free.\n\nNational Assembly President Jorge Rodriguez said more than 1,500 requests for amnesty were received by Venezuelan authorities on Saturday and that in the coming hours there will be “hundreds” of people released.\n\nVenezuela’s leading human rights organization Foro Penal confirmed to CNN that the first two detainees to be freed under the new law were released from prison on Saturday.\n\nCourt records show that Luis Alberto Linares Sánchez and Milton José Hidalgo Mendoza, both teachers, were detained and accused of “inciting hatred and treason.”\n\nA court in the state of Barinas ordered that the charges against the two men be dropped in line with the Amnesty Law, and that they be released immediately, the document shows.\n\nThe law will grant general amnesty to political prisoners processed or convicted since 1999 – the start ofHugo Chávez’s presidency– through to the present day. This includes many opposition figures, activists, journalists, students and others detained during protests in 2014, 2017, 2019 and beyond.\n\nHowever, the amnesty explicitly excludes those convicted or prosecuted for homicide, drug trafficking, corruption, grave human rights violations, crimes against humanity and war crimes. Lawmaker Jorge Arreaza, who presented the bill, highlighted these carve-outs to ensure the measure does not shield serious offenses.\n\nThe text, published by the assembly, frames the law as a tool to “repair deep wounds” from political confrontation and promote peaceful coexistence.\n\nHundreds of political prisoners are still locked up, according to human rights groups, and many of those released so far have faced restrictions and conditions such as travel bans, periodic court appearances and gag orders.\n\nIn Caracas, thousands of students held a rare mass protest on February 12, during a congressional debate on the bill, to demand the unconditional release of political prisoners and the end of what they consider persecution against dissidents.\n\nThe government announced last month it would free “a significant number” of prisoners in response to US pressure. Since then, more than 400 people have been released, according to Foro Penal, though the tally lags official claims of over 800. Among those released are a mother and her 6-month-old baby, who had been born in prison, the opposition said Thursday.\n\nNo official public list of released individuals has been issued, but Rodríguez said she would invite the UN High Commissioner for Human Rights office to verify releases.\n\nUpon full passage, the law could trigger immediate mass liberations, with National Assembly President Jorge Rodríguez assuring families that releases would occur swiftly post-approval.\n\nThe bill passed its first discussion unanimously earlier this month, then advanced to public consultation before the final vote.\n\nOpposition leader María Corina Machado said the amnesty proposal was the result of “real pressure” from the United States, which has been demanding the release of all political prisoners since it ousted Maduro. Machado expressed hope it would free hundreds of remaining detainees but doubted Delcy Rodríguez’s capacity to lead a genuine transition.\n\nRights organizations have also expressed cautious optimism. Foro Penal President Alfredo Romero said an amnesty was “welcome” if it was inclusive, non-discriminatory, free of impunity and contributed to the dismantling of political persecution mechanisms.\n\nThe Venezuelan Education-Action Program on Human Rights said that amnesty should not be seen as a “pardon” or state grace, given that many detainees were arbitrarily imprisoned for exercising rights protected by the constitution and international law.\n\nForo Penal Vice President Gonzalo Himiob added that amnesty does not imply admission of guilt or responsibility for any crime.\n\nSome have questioned if the law will truly guarantee the liberty of ex-detainees. Those concerns were heightened after Venezuelan opposition figureJuan Pablo Guanipa, who had spent eight months as a political prisoner, was re-arrested earlier this month, just hours after being released.\n\nVenezuelan Interior Minister Diosdado Cabello said Guanipa had been detained for “calling people to the streets” – an apparent breach of his release conditions.\n\nThe opposition denounced the move, with the party Alianza Bravo Pueblo saying, “The so-called amnesty, that veneer of false dialogue, is dead before it was born.”\n\nGuanipa is now under house arrest.\n\nAlong with the amnesty bill, the government announced last month that it would close and repurpose the notorious El Helicoide detention center in central Caracas. Once envisioned as a futuristic shopping mall, the spiral-shaped building became synonymous with repression under the Maduro government, housing the headquarters of the Bolivarian Intelligence Service (SEBIN) and holding many political detainees.\n\nReports from former prisoners and rights organizations describe overcrowding, poor sanitation, extortion and abuse inside its cells. Rodríguez said the facility would stop functioning as a prison and be transformed into “a center of social, sports, cultural and commercial services” for the community.\n\nThe move is meant to symbolize a shift away from the era’s repressive stance, though some critics argue the site should be preserved as a memory space for victims rather than repurposed commercially.\n\nThe amnesty push comes against the backdrop of Venezuela’s fragile post-Maduro landscape, with the acting government under Rodríguez navigating US pressure, economic challenges and calls for stability.\n\nIf enacted as promised, the law – and the expected closure of El Helicoide – could represent tangible progress toward reducing political tensions. However, rights groups say implementation, transparency in releases and broader reforms will determine its lasting impact on Venezuela’s pursuit of peace and democratic coexistence.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/americas/venezuela-amnesty-law-political-prisoners-latam-intl",
      "text": "amnesty"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/americas/venezuela-month-after-maduro-capture-latam-intl",
      "text": "cautiously welcomed"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/americas/venezuela-maduro-fort-tiuna-compound-operation-reconstruction-intl-invs",
      "text": "removed"
    },
    {
      "url": "https://www.cnn.com/2013/03/05/world/americas/venezuela-chavez-legacy",
      "text": "Hugo Chávez’s presidency"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/americas/venezuela-political-prisoners-opposition-released-latam-intl",
      "text": "Juan Pablo Guanipa"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/americas/venezuela-political-prisoners-amnesty-law-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/americas/venezuela-political-prisoners-amnesty-law-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "633368967481f02a8b663c5a57c07c53ae81a3425f06e92d0b0b0d4bf840d54e",
  "scraped_at": "2026-02-24T07:33:25.456860+00:00"
}