{
  "url": "https://lite.cnn.com/2026/02/22/americas/what-to-do-stranded-mexico-intl-hnk",
  "title": "What to do if you’re stranded in Mexico | CNN",
  "date": "2026-02-23T07:35:32.640336+00:00",
  "authors": [
    "Lex Harvey, CNN"
  ],
  "text": "Source: CNN\n\nThe US governmenturged Americansin several Mexican states, including popular vacation spots in Jalisco, Baja California and Quintana Roo, toshelter in placeas violence erupted across the country following the death of cartel leader Nemesio “El Mencho” Oseguera Cervantes.\n\nWhile airports are operating normally, some domestic and international flights have been cancelled in the western Mexican cities of Guadelajara and Puerto Vallarta.\n\nDallas resident Adryan Moorefield was set to travel home from Puerto Vallarta on Sunday but awoke to the news that members of organized crime groups had set buses on fire, blocked roads, and clashed with authorities.\n\n“It was such a complete shocker, and it almost felt like being in the twilight zone,” Moorefield told CNN. “We’ve been to PV before and thought that this would be a no brainer place to come and do a quick, easy beach vacation.”\n\nAmerican tourist Jim Beck told CNN he ventured outside his hotel in Puerto Vallarta to get breakfast on Sunday and saw “taxi cabs blown up all over town, blocking the roads.”\n\n“Then immediately, everyone was running down the street, screaming and yelling, and they told everyone to get back to their hotels,” Beck said.\n\nHe’s been locked inside his hotel since then, waiting for guidance about when it might be safe to go outside.\n\nMari, another tourist who asked to go by her first name for privacy reasons, said her young family has been sheltering in their vacation rental and watching the unrest unfold outside.\n\n“We have two little kids, and it’s really scary,” she said. “The entire bay was just covered in fire,” she added. “For hours, there was just a billow of smoke, hovering. You could not see anything across.”\n\nIf you are currently in the affected areas in Mexico, here is what to do, as per the US State Department guidance:\n\nAnyone who needs help can contact these numbers:\n\nFrom US & Canada: 1-888-407-4747\n\nFrom Overseas (including Mexico): +1 202-501-4444\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://mx.usembassy.gov/security-alert-update-ongoing-security-operations-u-s-mission-mexico-february-22-2026/",
      "text": "urged Americans"
    },
    {
      "url": "https://www.cnn.com/world/live-news/mexico-el-mencho-killed-travel-chaos-02-23-26-intl-hnk?post-id=cmlykomjz000n3b6pt5dklwas",
      "text": "shelter in place"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/americas/what-to-do-stranded-mexico-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/americas/what-to-do-stranded-mexico-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "641ecc622646834b98ca4ea6351654b4e955b8a41ebf479ddfb9987f016e1994",
  "scraped_at": "2026-02-23T07:35:32.640350+00:00"
}