{
  "url": "https://lite.cnn.com/2026/02/15/middleeast/israel-advances-registration-of-west-bank-territory-as-state-land-intl-latam",
  "title": "Israel advances registration of West Bank territory as state land in move decried as “de facto annexation” | CNN",
  "date": "2026-02-16T07:34:22.002380+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Israeli government has advanced the registration of territory in theoccupied West Bankas state land in a move that Palestinians have decried as “de facto annexation.”\n\nFor the first time sinceIsrael occupied the territory in 1967,the government will create a mechanism to officially register large swaths of land under the state.\n\nIsrael’s Foreign Ministry defended the move as an “administrative measure” which would “bring order” to land registration. But government ministers made clear the intent was to increase settlement and entrench Israel’s grip on the land.\n\nFar-right Finance Minister Bezalal Smotrich said the land registry would continue “the settlement and governance revolution across all parts of our land” as he referenced Judea and Samaria, the biblical term for the West Bank. And Justice Minister Yariv Levin said Israel is “committed to strengthening its hold over all parts of our land, and this decision expresses that commitment.”\n\nThe government’s new measure will apply to what is known as Area C of the West Bank, about 60% of the territory and home to an estimated 180,000-300,000 Palestinians and to a settler population of at least 325,500, according to Israeli human rights group Btselem.\n\nThe Palestinian Presidency said the decision violated international law and amounted to “de facto annexation of occupied Palestinian territory.” In a statement, the president’s office warned that the move was a “declaration of the annexation plans aimed at entrenching the occupation through illegal settlement activity.”\n\nIsrael captured the West Bank from Jordan in the 1967 war and subsequently began establishingJewish settlementsthere, which are considered illegal under international law, by the United Nations and by much of the international community. The UN also regards the West Bank and East Jerusalem as occupied territory, which the Palestinians seek for a future state.\n\nPeace Now, an Israeli settlement watchdog, described the government’s move as “a massive land grab in the West Bank … completely against the will of the people and contrary to Israel’s best interests.”\n\nThe Israeli government approved the measure despite US President Donald Trump’s stated opposition to annexation of the West Bank.\n\n“We warn President Trump - Netanyahu is deceiving you! You said you wouldn’t allow annexation, but he’s carrying it out right under your nose,” Peace Now said, adding that the move would lead to the dispossession of thousands of Palestinians from their land.\n\n“The process requires landowners to prove ownership in ways that are almost impossible for most Palestinians to do; if they fail, the land will be automatically registered as state land,” Peace Now asserted.\n\nThis latest measure comes after Israel’s securitycabinet approved a move last weekthat expanded Israeli rule and governance over the West Bank. The move drew international condemnation, with UN Secretary-General Antonio Guterres calling it as a flagrant violation of international law and the European Union saying it is a “step in the wrong direction.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/middleeast/palestinians-west-bank-erasure-israel",
      "text": "occupied West Bank"
    },
    {
      "url": "https://www.cnn.com/2024/07/19/middleeast/israel-west-bank-jerusalem-occupation-icj-opinion-intl",
      "text": "Israel occupied the territory in 1967,"
    },
    {
      "url": "https://www.cnn.com/2024/02/02/middleeast/who-are-israeli-settlers-palestinian-land-intl",
      "text": "Jewish settlements"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/middleeast/israel-netanyahu-west-bank-dc-intl",
      "text": "cabinet approved a move last week"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/middleeast/israel-advances-registration-of-west-bank-territory-as-state-land-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/middleeast/israel-advances-registration-of-west-bank-territory-as-state-land-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6484a4c04ba1f5dad94bb14cab94966fb100d3606080c5ea15a2fec1156a4402",
  "scraped_at": "2026-02-16T07:34:22.002394+00:00"
}