{
  "url": "https://lite.cnn.com/2026/02/17/americas/kurt-van-dyke-surfer-dead-costa-rica-intl-hnk",
  "title": "American surfer Kurt Van Dyke found dead in apparent robbery at his home in Costa Rica | CNN",
  "date": "2026-02-17T07:29:45.459215+00:00",
  "authors": [
    "Djenane Villanueva",
    "Rocío Muñoz-Ledo",
    "Jessie Yeung",
    "CNN"
  ],
  "text": "Source: CNN\n\nAmerican surfer Kurt Van Dyke was found dead in an apparent robbery at his apartment in Cahuita, a Caribbean coastal town in Costa Rica, on Saturday. He was 66.\n\nThe incident was reported around 10:50 a.m. when authorities received a call about a man found dead in a room, according to Costa Rica’s Judicial Investigation Agency (OIJ).\n\nLaw enforcement went to the location, in the municipality of Talamanca about 105 miles east of the capital San Jose, and confirmed the death, according to OIJ spokesman Carlos Valverde.\n\nVan Dyke was in the apartment with a woman when they were allegedly approached by two armed men, Valverde said. According to preliminary reports, the suspects threatened them with a firearm and held them for several minutes while stealing valuables.\n\nAuthorities indicated that Van Dyke died at the scene. “He was asphyxiated and had several stab wounds,” said the OIJ spokesperson. The woman who was with him suffered minor injuries that are not life-threatening.\n\nThe body was taken to the forensic morgue to determine the exact cause of death. The OIJ stated that the case remains under investigation to clarify the circumstances of the incident and identify those responsible.\n\nVan Dyke, originally from Santa Cruz, California, was recognized in the international surfing community for his participation in competitions and his influence in promoting the sport in the Caribbean region.\n\nHe was also part of a well-known California surfing family.\n\nA 2021 obituary of his mother Betty Van Dyke said that she was part of a pioneering group of early female surfers, and her first husband Gene Van Dyke was also a well-known northern California surfer, the Associated Press reported.\n\nKurt’s brother Peter Van Dyke told theSan Francisco Chroniclevia text: “My brother was a very benevolent, giving person who would help just about anybody. Kurt would never hurt anybody, and he was always there when you needed him. Everyone that he met knew this about him.”\n\nRaw Surf, a global media platform dedicated to sharing surf culture and stories worldwide, expressed its condolences for the tragedy. “Our hearts go out to Kurt’s family and the Costa Rican surfing community for this unimaginable loss,” reads a post on their Instagram account.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.sfchronicle.com/us-world/article/kurt-van-dyke-santa-cruz-costa-rica-21355095.php",
      "text": "San Francisco Chronicle"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/americas/kurt-van-dyke-surfer-dead-costa-rica-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/americas/kurt-van-dyke-surfer-dead-costa-rica-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "654a9e17ed552b460bba23e0b14095a12d918e8828dd9f5cd039c387984b8f01",
  "scraped_at": "2026-02-17T07:29:45.459230+00:00"
}