{
  "url": "https://lite.cnn.com/2026/02/10/politics/pride-flag-removed-stonewall-monument-trump-administration",
  "title": "Trump admin removes Pride flag from Stonewall National Monument | CNN Politics",
  "date": "2026-02-12T21:30:26.574113+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Trump administration has removed anLGBTQ Pride flagfrom theStonewall National Monumentin New York City, the United States’ first national monument to LGBTQ rights, following a directive restricting what kinds of flags can be flown on National Park sites.\n\nThe removal is the latest change to the monument, as the administration movesto alter what is on displayat national parks across the country and impose President Donald Trump’s views on other US cultural and historical institutions.\n\nAccording to a National Park Servicememorandum, the agency prohibits “non-agency flags and pennants” that are not the US flag or the Interior Department flag. NPS acting Director Jessica Bowron signed the directive in January, and there are exceptions for historical flags, military flags, or flags of federally recognized Tribal nations within the parks.\n\nThe Interior Department told CNN in a statement Wednesday, “Recent adjustments to flag displays at the monument were made to ensure consistency with federal guidance and applicable executive order.”\n\n“Stonewall National Monument remains committed to preserving and interpreting the history and significance of this site through its exhibits, programs, and educational initiatives,” the department added.\n\nGay City Newsfirst reportedthe Pride flag’s removal.\n\nIn February 2025, NPS removed references to transgender and queer peopleon its web page for the Stonewall monument,which consists of the area around the Stonewall Inn in Greenwich Village.\n\nThe iconic gay bar is widely viewed as the birthplace of the modern LGBTQ rights movement in the US: It was the site of a 1969 police raid that sparked a fierce backlash from its patrons and led to days of protests and skirmishes between LGBTQ rioters and police. Former President Barack Obamadesignated the monumentin 2016 during his second term.\n\nStacy Lentz, co-owner of the Stonewall Inn, slammed the removal in a statement to CNN on Wednesday, saying the flag is “not partisan it is historical.”\n\n“We will continue to fly all the flags that represent our community at the Stonewall Inn which is separate from the park/monument and independently owned and operated,” Lentz said.\n\nLocal leaders have slammed the administration’s move, with NYC Mayor Zohran Mamdani saying he was “outraged” by the removal. “New York is the birthplace of the modern LGBTQ+ rights movement, and no act of erasure will ever change, or silence, that history,” he said in apostto X on Tuesday.\n\nManhattan Borough President Brad Hoylman-Sigal told CNN, “It’s part of the Trump administration’s attempt to reshape the Park Service in a manner that conforms with his right-wing base of support, excluding minority groups and LGBTQ people.”\n\nHoylman-Sigal said he was working to raise the flag again at the site of the federal monument on Thursday, despite the new federal guidance.\n\n“We’re just going to try to fly it again. It may be taken down. We may be blocked from even doing so, there may be federal officers preventing us, but we certainly are going to try in the spirit of stonewall,” he added.\n\nSenate Minority Leader Chuck Schumer of New York called the flag’s removal “deeply outrageous,” adding in a post on X, “If there’s one thing I know about this latest attempt to rewrite history, stoke division and discrimination, and erase our community pride it’s this: that flag will return. New Yorkers will see to it.”\n\nThe NPS memo is the latest action in the Trump administration’s sweeping efforts to purge cultural institutions of materials that conflict with the president’s political directives — and expunge references to trans and nonbinary people across federal agencies.\n\nTrump issued a directive at the start of his second term that the federal government only recognize two genders: male and female. Since then, agencies including theState Department and CDChave truncated the “LGBTQ+” acronym to simply “LGB”; erased references to trans, queer and intersex people; and removed web pages and data sets relating to the groups.\n\nLast October, FBI Director Kash Patelfired a longtime bureau employee who displayed a Pride flagin his workspace during a past assignment, CNN previously reported.\n\nIn notifying the individual of their dismissal, Patel did not specifically mention the Pride flag by name but said the agent trainee was being summarily dismissed for past “poor judgment” and “an inappropriate display of political signage,” sources previously told CNN.\n\nThe move also comes as the Trump administration has more broadly removed NPS materials focused on diversity.\n\nIn January, NPSremoved a long-standing exhibit on slaveryin Philadelphia’s Independence National Historical Park, prompting the city to sue the administration.\n\nThe exhibit, located at the President’s House Site where Presidents George Washington and John Adams lived, features displays honoring individuals enslaved by Washington and a historical timeline of American slavery.\n\nAnd last year, the American Battle Monuments Commission, a small, little-known federal agency,took down a cemetery displayin the Netherlands that commemorated the contributions of African American WWII soldiers and highlighted the discrimination they faced.\n\nThis story has been updated with additional reporting.\n\nCNN’s Gloria Pazmino and Elizabeth Wolfe contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/interactive/2019/06/us/stonewall-pride-fred-mcdarrah-cnnphotos/",
      "text": "LGBTQ Pride flag"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/us/stonewall-monument-protest-nyc",
      "text": "Stonewall National Monument"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/philadelphia-sues-nps-removal-slavery-exhibit",
      "text": "to alter what is on display"
    },
    {
      "url": "https://home.nps.gov/subjects/policy/upload/Flag_Guidance_Memorandum_1-21-2026.pdf",
      "text": "memorandum"
    },
    {
      "url": "https://gaycitynews.com/trump-rainbow-flag-stonewall-national-monument/",
      "text": "first reported"
    },
    {
      "url": "https://www.cnn.com/2025/02/13/us/stonewall-inn-national-monument-transgender",
      "text": "on its web page for the Stonewall monument,"
    },
    {
      "url": "https://www.cnn.com/travel/article/stonewall-inn-first-lgbt-national-monument",
      "text": "designated the monument"
    },
    {
      "url": "https://x.com/NYCMayor/status/2021308844308045912",
      "text": "post"
    },
    {
      "url": "https://www.cnn.com/2025/01/31/politics/us-government-agencies-order-employees-to-remove-gender-pronouns-from-email-signatures/index.html",
      "text": "State Department and CDC"
    },
    {
      "url": "https://www.cnn.com/2025/10/02/politics/kash-patel-fires-fbi-trainee-for-displaying-pride-flag",
      "text": "fired a longtime bureau employee who displayed a Pride flag"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/philadelphia-sues-nps-removal-slavery-exhibit",
      "text": "removed a long-standing exhibit on slavery"
    },
    {
      "url": "https://www.cnn.com/2025/11/13/politics/black-soldiers-world-war-ii-cemetery",
      "text": "took down a cemetery display"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/pride-flag-removed-stonewall-monument-trump-administration",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/pride-flag-removed-stonewall-monument-trump-administration",
      "text": "Cookie Settings"
    }
  ],
  "hash": "656d4b6205ca06de9df972ee5cb04e134df7dfe322a97dd8892b95371eb02a51",
  "scraped_at": "2026-02-12T21:30:26.574127+00:00"
}