{
  "url": "https://lite.cnn.com/2026/02/26/asia/afghanistan-pakistan-border-attack-intl-latam",
  "title": "Afghanistan and Pakistan exchange cross-border strikes in escalating retaliatory attacks | CNN",
  "date": "2026-02-28T07:00:36.751117+00:00",
  "authors": [
    "Sophia Saifi",
    "Saleem Mehsud",
    "Hira Humayun"
  ],
  "text": "Source: CNN\n\nPakistan continued to strike areas in several provinces of Afghanistan early on Friday morning, including the capital, Kabul, according to the Afghan Taliban, as Islamabad said it was responding to an attack launched by Kabul on Thursday.\n\n“The cowardly Pakistani military has carried out airstrikes in certain areas of Kabul, Kandahar, and Paktia,” said Taliban spokesman Zabiullah Mujahid, adding that there were no reported casualties, but that retaliation against those strikes had begun.\n\nPakistan said its military forces were responding to an attack launched by the Afghan Taliban earlier on Thursday, marking the latest escalation of violence between the neighboring countries.\n\n“Taliban regime forces are being delivered punishment in Chitral, Khyber, Mohmand, Kurram and Bajaur sectors,” Pakistan’s information ministry said, calling an earlier Afghanistan assault “unprovoked.”\n\n“Pakistan will take all necessary measures to ensure its territorial integrity and the safety and security of its citizens,” the Pakistani ministry said.\n\nPakistani security sources shared video with CNN, purporting to show Pakistani strikes on Kabul. CNN cannot independently verify the video.\n\nThe two sides reported widely differing casualty figures. Pakistan claimed that its military had killed 133 Afghan Taliban fighters, injured hundreds of others, and that multiple Afghan military posts and equipment have been destroyed. Afghanistan however, said only eight of its soldiers had been killed and 11 injured.\n\nThirteen Afghan civilians, including women and children, were also injured when Pakistani strikes hit a refugee camp in Nangarhar, Afghanistan’s defense ministry said.\n\nEarlier on Thursday evening, Afghanistan’s military launched an offensive against Pakistani positions, calling it a retaliation for Pakistan’sairstrikeson militant camps across the border in Afghanistan over the weekend that left at least 18 people dead.\n\nAfghan forces released video of military vehicles moving at night, and the sound of heavy gunfire on Thursday.\n\nAfghanistan’s Defense Ministry said the retaliatory attacks were occurring along the border in six provinces and that they ended at midnight. But following Pakistani strikes in Kabul, Kandahar and other provinces, Mujahid, the Taliban spokesman, said “extensive retaliatory operations have once again begun against Pakistani military centers from Kandahar and Helmand.”\n\nHamdullah Fitrat, the Taliban government’s deputy spokesman, claimed that Afghan forces had killed 55 Pakistani soldiers, captured some troops alive and taken 19 Pakistani military outposts, adding that Kabul’s troops were deployed along the “Durand Line,” the 1,600-mile disputed border between the two countries. CNN is unable to independently verify the claims.\n\nPakistan’s information minister Attaullah Tarar admitted that Pakistan had suffered casulaties but gave much lower figures than the Afghan claims, saying two Pakistani soldiers had been killed and three were injured.\n\nWithout pointing to specific claims by Afghanistan, Tarar accused the government in Kabul of “spreading false and baseless propaganda.”\n\n“After the defeat in the field, the Afghan Taliban regime is resorting to lies and propaganda,” he posted to X.\n\nThe strikes inside Afghanistan carried out by Pakistan over the weekend targeted camps belonging to thePakistani Taliban– also known as Tehrik-e-Taliban Pakistan (TTP) – and its affiliates, as well as a group associated with the Islamic State, which Islamabad blames for a series of attacks in Pakistan, the information ministry said Sunday.\n\nPakistan has seen weeks of deadly attacks and says it has “conclusive evidence” that they were carried out by militants at the “behest of their Afghanistan based leadership and handlers.”\n\nAfghanistan had gathered “all the terrorists of the world” and began “exporting terrorism” while depriving Afghan people of human rights, Pakistan’s Defense Minister Khawaja Asif posted on social media early Friday.\n\nThe minister highlighted Pakistan’s role in hosting millions of Afghan refugees over the past 50 years, and being home to millions of Afghans “earning their livelihood on our soil.”\n\n“Our patience has run out,” Asif said. “Now it is open war between us and you.”\n\nA fragile ceasefire between the two countries has been in placesince October, following the deadliest wave of cross-border violence in years.\n\nIn a November interview with CNN, Asif said his country wanted to “take out” the TTP’s leadership in Afghanistan, stating that it would employ “whatever means are available to us.”\n\nThis story has been updated to include additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/22/asia/pakistan-strikes-afghanistan-militant-camps-intl-hnk",
      "text": "airstrikes"
    },
    {
      "url": "https://www.cnn.com/2016/01/20/asia/pakistan-taliban-profile-2016",
      "text": "Pakistani Taliban"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/asia/pakistan-afghanistan-attacks-intl-hnk",
      "text": "since October"
    }
  ],
  "hash": "6584315ad8a99d923535136c314ba80493e551ea6b37763e461db470e55371a0",
  "scraped_at": "2026-02-28T07:00:36.751138+00:00"
}