{
  "url": "https://lite.cnn.com/2026/02/26/politics/white-house-ballroom-ruling",
  "title": "White House ballroom: Judge lets project continue, but suggests path for future challenges | CNN Politics",
  "date": "2026-03-01T07:09:11.498221+00:00",
  "authors": [
    "Betsy Klein"
  ],
  "text": "Source: CNN\n\nA federal judge on Thursdayrejected the nation’s top historic preservation group’s attempt to blockto President Donald Trump’s White House ballroom project, but also suggested a possible roadmap for the group to revive the challenge.\n\nThe National Trust for Historic Preservation sued the Trump administration in December over the sprawling ballroom project and asked for a preliminary injunction, claiming the White House has been carrying out the construction unlawfully because Trump hadn’t gotten approval from Congress or submitted his plans to the National Capital Planning Commission and the Commission of Fine Arts for review, which would give the public a chance to weigh in.\n\nThe president has been personally involved in ballroom details, from floor plans to marble selection. The sprawling ballroom project has an estimated size of approximately 89,000 square feet, according to lead architect Shalom Baranes. By contrast, the primary White House structure, the Executive Mansion, is just 55,000 square feet.\n\nTrump has maintained that the project isn’t subject to any oversight and that he should be able to continue with it without any serious scrutiny.\n\nThursday’s ruling from senior US District Judge Richard Leon focuses on the Trust’s choice to use the Administrative Procedure Act to challenge the project. The judge concluded the law was an an inappropriate tool for the Trust, in part because the White House office for the president’s executive office and the office over his residence – which are managing the ballroom’s construction – aren’t agencies that a court could curtail under the law.\n\n“Unfortunately for Plaintiff, its challenge fails because the White House office in question is not an ‘agency’ under the APA and because Plaintiff did not bring theultra viresclaim necessary to challenge the President’s statutory authority to complete his construction project with private funds and without congressional approval!” Leon wrote.\n\nThe Trust, Leon said, raised “novel and weight issues” in the case and could potentially restructure the lawsuit to test the president’s authority in a different legal approach.\n\n“While we are disappointed that the Court did not issue the preliminary injunction, we were pleased that Judge Leon ruled that the National Trust has standing to bring this lawsuit, as we have asserted from the start,” Carol Quillen, president and CEO of the National Trust, said in a statement to CNN.\n\n“We are also pleased that he encouraged us to amend our complaint – specifically, to assert that the President has acted beyond his statutory authority — and we plan to do so promptly,” Quillen added.\n\nIn a Truth Social post, Trump called the ruling “Great news for America, and our wonderful White House!”\n\nHe added: “The Ballroom construction, which is anticipated to also handle future Inaugurations and large State Visits, is ahead of schedule, and under budget. It will stand long into the future as a symbol to the Greatness of America!”\n\nThe Commission of Fine Artsapproved the projectafter the lawsuit was filed.\n\nThe lawsuit, filed last year after the East Wing had been completely demolished, hasforcedthe administration to make public details about the project that had otherwise been kept under wraps, including plans for a reimagined two-story East Colonnade revealed in December filings; information about the preservation of existing artifacts from the now-destroyed East Wing; and an expected timeline for construction.\n\nCNN’s Austin Culpepper, Devan Cole, Tierney Sneed, Katelyn Polantz and Kit Maher contributed.\n\nThis story has been updated with a response from the Trust.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.documentcloud.org/documents/27419928-leon-ruling-on-wh-ballroom/",
      "text": "rejected the nation’s top historic preservation group’s attempt to block"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-white-house-ballroom-commission",
      "text": "approved the project"
    },
    {
      "url": "https://www.cnn.com/2025/12/16/politics/white-house-ballroom-lawsuit-tro-hearing",
      "text": "forced"
    }
  ],
  "hash": "65f833b7c68dc9ed23a75c10433add11f9aef24c1421addf1cf997f3c0bdefb9",
  "scraped_at": "2026-03-01T07:09:11.498233+00:00"
}