{
  "url": "https://lite.cnn.com/2026/02/20/business/iran-us-attack-oil-prices",
  "title": "A US attack on Iran could send oil prices surging at precarious time for Trump | CNN Business",
  "date": "2026-02-22T07:11:29.156762+00:00",
  "authors": [
    "Analysis by David Goldman, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump is weighing whether the United States should attack Iran, a country thatcontrols both the third-largest proven oil reserves on Earthand one of the world’s most important oil shipping lanes. The consequences for oil prices and Americans’ wallets could be swift and severe.\n\nThe United States has been building up its military presence in the Middle East in recent weeks, and Trump has suggested a US-led strike could be imminent. That’s sent oil prices up sharply.\n\n“We may have to take it a step further, or we may not,” Trump said Thursday about Iran. “Maybe we’re going to make a deal. You’re going to be finding out over the next probably 10 days.”\n\nBrent crude, the global benchmark, has surged 7% since Tuesday andtopped $70 a barrelWednesday for the first time since July – shortly after thelast time the United States attacked Iran. US crude has gained $10 over the past month.\n\nBut America’s escalating conflict with Iran threatens to send oil prices significantly higher, potentially reversing the yearlong slide in gas prices that Trump has boasted about for months. Cheaper fill-up costs helped offset some of the sting of high prices from a combination of Biden-era inflation, Trump’s tariffs and a stubbornly stuck housing market.\n\nAffordability concerns have made Trump and Republicans politically vulnerable ahead of this year’s midterms. The last thing they need is an all-out oil price shock.\n\nThe good news: that remains unlikely. But it’s not out of the question.\n\nIf the US attacks, Iran could hit back with missiles or other similar weapons, as it did againsta US military base and Israel last summer. That could disrupt the oil-rich region, but the effects on oil would almost certainly be temporary.\n\nBut Iran also holds an X-factor: control of the northern side of theStrait of Hormuz.\n\nThe narrow waterway, just 21 miles wide, serves as a pinch point for 20 million barrels of crude every day, about one-fifth of global production.\n\nThe strait is the only way to ship crude from oil-rich Persian Gulf countries to the rest of the world. Oil’s bullish run in recent days is largely a reaction to worries Iran will restrict that supply.\n\nIran partiallyclosed the strait earlier this weekfor military drills. That’s what sent Brent prices about $5 a barrel higher.\n\n“A prolonged disruption in the Strait of Hormuz would send oil above $100,” said Rob Thummel, a senior portfolio manager at Tortoise Capital.\n\nBut the odds of that happening are low for a few reasons.\n\nFirst, Iran would have to be able to control the strait after a strike. The US already has a robust and growing military presence in the region, and it’s not clear Iran would have the wherewithal to support an oil blockade while under attack.\n\nSecond, the Iranian government would be depriving itself of a key source of revenue. Iran has a surprisingly diversified economy for a sanctioned nation – oil makes up only about 10% to 15% of the country’s overall gross domestic product. But Iran’s government relies heavily on the oil industry for its finances, bringing in half of its revenue from crude exports.\n\nThird, the region has recovered from attacks quickly in the past – including the attack on Iran last year.When dronesattacked Saudi Aramco facilities in Abqaiq, Saudi Arabia, in 2019, taking out 5% of the country’s oil production, prices spiked but surprisingly returned to normal within a matter of weeks. The United Statesattributed that attack to Iran.\n\nEven if a blockade in the Strait remains unlikely, disruption caused by a US attack could nevertheless send oil prices even higher, above their the recent gains – perhaps by another $10 a barrel, Tuttle said.\n\nIran produces about 3.2 million barrels of oil per day on average, according toOPEC, accounting for roughly 4% of global crude production. That makes Iran the world’s sixth-largest oil producer – an impressive feat, considering Iran faces worldwide sanctions that have severely limited its potential customers. To skirt sanctions, Iran operates a shadow fleet of vessels to export oil at a steep discount.\n\nOil at $80 a barrel could send gas prices, on average, back above $3 a gallon.\n\nA month ago, US gas prices fell to about $2.80 a gallon on average, according to AAA. Now they’re sitting at $2.92 a gallon.\n\n“It’s been really nice to have low gasoline prices, but it’s creeping up on us, and high prices could be here sooner than you know – right before the midterms,” Tuttle said. “Where affordability is a big issue, if gasoline prices come into the mix, the goal will have to be to keep oil prices lower to keep gasoline prices lower.”\n\nTrump has long touted – and exaggerated – the effects of lower gas prices. A year ago, gas prices were 21 cents a gallon more expensive. That roughly adds up to between $100 to $200 in annual savings per driver in 2025, depending on drivers’ locations and habits, according to theUS Energy Administrationand theDepartment of Transportation.\n\nBut those savings pale in comparison to the average of $1,000 in additional tax burdens paid by each US household as a result of Trump’s tariffs, according to theTax Foundation.\n\nAmericans’ opinions of the US economy remain near all-time lows. Higher gas prices aren’t going to make Americans any happier about that.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/business/oil-reserves-trump-iran",
      "text": "controls both the third-largest proven oil reserves on Earth"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/investing/oil-gold-prices-us-iran-tensions",
      "text": "topped $70 a barrel"
    },
    {
      "url": "https://www.cnn.com/2025/06/21/politics/trump-iran-air-strikes",
      "text": "last time the United States attacked Iran"
    },
    {
      "url": "https://www.cnn.com/2025/06/23/business/strait-of-hormuz-iran-israel-explainer-intl-hnk",
      "text": "Strait of Hormuz"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-iran-talks-02-17-26?post-id=cmlqfx1qp00143b6nxe9oivvk",
      "text": "closed the strait earlier this week"
    },
    {
      "url": "https://www.cnn.com/2019/09/17/middleeast/saudi-attack-iran-base-intl",
      "text": "attacked Saudi Aramco facilities in Abqaiq"
    },
    {
      "url": "https://www.cnn.com/2019/09/16/middleeast/saudi-oil-attacks-explainer-intl",
      "text": "attributed that attack to Iran"
    },
    {
      "url": "https://www.opec.org/assets/assetdb/asb-2025.pdf",
      "text": "OPEC"
    },
    {
      "url": "https://www.eia.gov/tools/faqs/faq.php?id=23&t=10",
      "text": "US Energy Administration"
    },
    {
      "url": "https://www.fhwa.dot.gov/policyinformation/statistics/2023/dl201.cfm",
      "text": "Department of Transportation."
    },
    {
      "url": "https://taxfoundation.org/research/all/federal/trump-tariffs-trade-war/",
      "text": "Tax Foundation"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/business/iran-us-attack-oil-prices",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/business/iran-us-attack-oil-prices",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6634892a15d32955fd861411b24a4019b390699bdcee870d8e320cc34ec3ec44",
  "scraped_at": "2026-02-22T07:11:29.156773+00:00"
}