{
  "url": "https://lite.cnn.com/2026/02/21/politics/trump-greenland-hospital-boat",
  "title": "Trump says he’s sending a hospital boat to Greenland as territory says ‘no thanks’ | CNN Politics",
  "date": "2026-02-23T07:35:51.348702+00:00",
  "authors": [
    "Riane Lumer",
    "Aleena Fayaz",
    "CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump said Saturday that he is sending a hospital boat to Greenland, the Danish territoryhe has sought to acquire, even as the Arctic island says it doesn’t want it.\n\n“Working with the fantastic Governor of Louisiana, Jeff Landry, we are going to send a great hospital boat to Greenland to take care of the many people who are sick, and not being taken care of there. It’s on the way!!!” the presidentpostedon social media alongside an illustration of the naval hospital ship the USNS Mercy.\n\nIt is unclear what Trump was referring to in his post. Greenland and Denmark have free, nationalized health care systems.\n\nCNN has reached out to the White House and Landry’s office for more details. The Pentagon referred questions to US Northern Command, which in turn referred questions to the US Navy. The Navy did not respond to a request for comment.\n\nLandry, whom Trump tapped in December to serve as special envoy to Greenland, said onsocial mediahe is “proud to work” together with Trump on “this important issue.”\n\nGreenlandic Prime Minister Jens-Frederik Nielsen said “no thank you” in a statement responding to Trump’s announcement.\n\n“President Trump’s idea of sending an American hospital ship here to Greenland has been noted. But we have a public healthcare system where treatment is free for citizens,” Nielsen said. “That is a deliberate choice — and a fundamental part of our society. That is not how it works in the USA, where it costs money to see a doctor.”\n\nHe added that Greenland is “open to dialogue and cooperation. But please talk to us instead of just making more or less random statements on social media. Dialogue and cooperation require respect for the fact that decisions about our country are made here at home.”\n\nDanish Prime Minister Mette Frederiksen defended the country’s health care system Sunday, writing on Facebook that she was “happy to live in a country where there is free and equal access to health for all. Where it’s not insurances and wealth that determine whether you get proper treatment,” according to theAssociated Press.\n\nTrump’s post came after Denmark’s Joint Arctic Command said in astatementSaturday it had evacuated a crew member needing urgent medical treatment from a US submarine in Greenlandic waters. The crew member was transferred to the Greenlandic health authorities and a hospital in Nuuk.\n\nThe US Navy hastwo mobile hospital ships, the USNS Mercy and the USNS Comfort, that support troops during deployments and provide services for US disaster relief and humanitarian operations. During the height of the Covid-19 pandemic in 2020, the Navydeployedthe USNS Comfort to New York City, the epicenter of the virus outbreak in the United States.\n\nThe Mercy is moored in Mobile, Alabama, according to the ship tracking websiteMarinetraffic.com. It’s not clear where the Comfort is located, though the website indicated it was also in Mobile earlier this month.\n\nNeither ship appears ready to immediately deploy.\n\nStrategically locatedGreenlandis the world’s least densely populated country and, due to the limited network of roads, its 56,000 residents travel by boat, helicopter and plane between the island’s towns. The US has one military base in Greenland, the Pituffik Space Base, which is on the western coast of the island.\n\nTrump’s post comes a month after hisescalated effortsto obtain Greenlandshook European alliesas he asserted the US would settle for nothing less than total control of the country.\n\nIn late January, Trump announced “the framework of a future deal” on Greenland with the NATO chief, but his continued interest in the Arctic island raises questions about Greenland’s sovereignty.\n\nThe idea of US leadership has rattled Greenlanders, including municipal engineer Ludvig Petersen.\n\nHe previouslytold CNNthat his main aversion to American control stems from the issue of private health care.\n\n“I don’t like the idea of becoming part of America,” he said. “My primary concern is all this privatization of health care and education. It’s not something we are used to.”\n\nThis story and headline have been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/us-greenland-framework-1951-deal",
      "text": "he has sought to acquire"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/116111420567451198",
      "text": "posted"
    },
    {
      "url": "https://x.com/JeffLandry/status/2025370429083226238?s=20",
      "text": "social media"
    },
    {
      "url": "https://apnews.com/article/greenland-trump-denmark-us-b2624bb6ed7d66de874e333779c505fe",
      "text": "Associated Press"
    },
    {
      "url": "https://www.facebook.com/100064381613758/posts/pfbid0342g5CoV6UKJwE7Kgy1eCCR1J5jVzBgM2yNUNnCwgVRu9TKALU6ck5jKxzK7BpNZvl/",
      "text": "statement"
    },
    {
      "url": "https://www.msc.usff.navy.mil/Ships/Ship-Inventory/Hospital-Ships/",
      "text": "two mobile hospital ships"
    },
    {
      "url": "https://www.cnn.com/2020/04/03/politics/navy-hospital-ship-comfort-new-york-coronavirus",
      "text": "deployed"
    },
    {
      "url": "https://www.marinetraffic.com/en/ais/details/ships/shipid:453534",
      "text": "Marinetraffic.com"
    },
    {
      "url": "https://www.cnn.com/2026/01/06/europe/why-trump-wants-greenland-importance-intl",
      "text": "Greenland"
    },
    {
      "url": "https://www.cnn.com/2026/01/06/politics/us-options-greenland-military",
      "text": "escalated efforts"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/europe/analysis-europe-new-reality-greenland-trump-latam-intl",
      "text": "shook European allies"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/europe/greenlanders-fear-trump-takeover-threat",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/trump-greenland-hospital-boat",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/politics/trump-greenland-hospital-boat",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6699e3a60b961f91b04ae09993bc792a02b7b51d7fefc382957043290127597c",
  "scraped_at": "2026-02-23T07:35:51.348714+00:00"
}