{
  "url": "https://lite.cnn.com/2026/02/27/politics/supreme-court-tariffs-opinion-too-long-analysis",
  "title": "Everyone has something to say at the Supreme Court. Why the tariffs ruling had more than 160 pages | CNN Politics",
  "date": "2026-03-01T07:08:25.976983+00:00",
  "authors": [
    "Joan Biskupic, CNN Chief Supreme Court Analyst"
  ],
  "text": "Source: CNN\n\nThe extraordinary number of dueling opinions in the Supreme Court’s tariff case,laying bare divisions among the justices, also became the basis for a punch line.\n\nAt the courtroom lectern this week in a dispute between an energy-pipeline company and the state of Michigan, lawyer John Bursch contended his position could lead to an easy decision: “I mean, it could be an opinion that’s 160 pages less than the tariffs opinion last week.”\n\n“Well,” said Justice Samuel Alito as he and other justices began laughing, “That’s certainly a goal to aim for.”\n\nChief Justice John Roberts’ face brightened, and he appeared especially amused as the exchange played out. Roberts hadwritten the court’s main opinionstriking down the Trump administration tariffs, then waited weeks as colleagues finished their various additional opinions.\n\nThe seven separate opinions in theLearning Resources v. Trumptariffs case demonstrated how a case can become a forum for airing larger doctrinal differences.\n\nOr, sometimes, the justices simply want to vent.\n\nThe result can be a lack of clarity in the law as the general public, along with lawyers and judges, navigate competing views.\n\nThe number of concurrences – writings by a justice who signs onto the majority’s bottom-line but adds a separate angle – has been rising at the contemporary court. That’s a reflection of increased polarization and shows that justices within the standard conservative and liberal blocs often splinter in their legal reasoning and approach.\n\nRoberts’ opinion for the majority in the tariffs dispute was an efficient 21 pages. The principal dissenting opinion, written by Justice Brett Kavanaugh, stretched to 63 pages. But then four other justices, who’d sided with Roberts, wrote concurring opinions: Neil Gorsuch, Amy Coney Barrett, Elena Kagan, and Ketanji Brown Jackson. The most expansive came from Gorsuch, at 46 pages. Clarence Thomas added a separate dissenting opinion.\n\nThe writings totaled 164 pages, with another six for the accompanying syllabus.\n\n“I felt very left out in the tariffs case,” Alito told Bursch drolly. “Justice Sotomayor didn’t write and I didn’t write.”\n\nRejoined Sonia Sotomayor, as the others chuckled, “Maybe we’ll have a chance here.”\n\nQuips aside, the competing views in the dispute over Trump’s assertion of unilateral power for tariffs on foreign goods surprised the legal community.\n\n“I was struck with just how many and how long the separate opinions were,” said University of Pennsylvania law professor Jean Galbraith. “Justice Gorsuch’s opinion was notable for pointedly throwing down the gauntlet, at his colleagues, which had the effect making all of them feel they had to write more in response.”\n\nIn prior decades, justices tended to write concurring opinions to make clear the limits of a majority ruling, said Galbraith, an international law scholar who earlier served as a law clerk to the late Justice John Paul Stevens.\n\n“Concurrences these days are often being used for big brush strokes,” she said, “for laying out and defending broad judicial philosophies. That’s what was going on in the tariff opinions.”\n\nThe extended debate in Learning Resources v. Trump concerned modes of statutory interpretation more than the nuts-and-bolts of tariff policy. Such seemingly abstract differences can often consume the members of the country’s highest court more than which side wins or loses.\n\nSimilarly, in a 2024 dispute over the Second Amendment, the justices by an 8-1 vote (Thomas dissented)upheld a federal lawprohibiting individuals subject to a restraining order for domestic violence from possessing a gun. Then, in addition to Roberts’ opinion for the majority,five other justices wrote concurring opinionsdetailing their views on the constitutional and historical inquiry when determining whether a gun-control measure breaches the Second Amendment right to bear arms.\n\nAdam Feldman, who researches Supreme Court patterns and is the author of theLegalyticssubstack, documented a 42% increase in written concurring opinions from 2000 to 2024. He said the court averaged roughly 64 concurrences per 100 majority opinions in 2000–2009, compared to about 80 per 100 opinions in 2019–2024, with a pronounced rise since the mid-2010s.\n\nFor years, Thomas led the court in such supplemental writings as he laid out his distinct conservative approach to the Constitution. The newest justice, Jackson, on the left wing, is now close to rivaling Thomas.\n\nSince 2022 when she joined the bench, Jackson has authored 29 concurring opinions, Feldman found, topped only by Thomas at 35 concurrences for the same period.\n\nFor comparison, at the other end of the spectrum, the liberal Kagan penned just five concurrences over the past three-and-a-half years. Roberts, who controls many of the court’s most important opinions, wrote only one concurring statement.\n\nAn otherwise little-noticed January dispute over federal court procedure illustrated Jackson’s tendency. Barrett had the majority in the case,Berk v. Choy, and wrote an 11-page decision signed by all other justices but Jackson.\n\nJackson agreed with Barrett’s conclusion that a Delaware affidavit requirement for medical malpractice cases does not apply in federal court. But she strongly disagreed with the Barrett majority over which rules of civil procedure applied.\n\nJackson laid out her reasoning, across 13 pages and six footnotes, some of which tussled with Barrett over how each was interpreting (or “contorting”) the rules.\n\nAt one point, Jackson asserted that a Barrett assumption “jumps the gun.” Barrett responded with a footnote asserting, “we do not ‘jump the gun,’ but rather cut to the chase.”\n\nAll seven of the justices who wrote opinions in the tariff dispute last Friday dropped asides in the footnotes.\n\nRoberts trained his fireon Kavanaugh’s dissent, noting that Kavanaugh had suggested Trump could impose “most if not all” of the disputed tariffs under statutes other than the International Emergency Economic Powers Act.\n\nResponded Roberts: “We do not speculate on hypothetical cases not before us.”\n\nLater, as he rejected Kavanaugh’s reliance on a 1981 case, Roberts insisted that the court had stressed the narrowness of that ruling at least five times in its opinion. “That is not quite ‘no, no, a thousand times no,’ but should have sufficed to dissuade” Kavanaugh from using it.\n\nMuch of the separate writing in the tariffs case addressed how a legal approach known as “the major questions doctrine” should be applied. The theory holds that if Congress wants to delegate significant economic or political power to the president, it must do so clearly in a statute.\n\nRoberts concluded that Congress had not granted such tariff power under IEEPA, as Trump had claimed.\n\n“(T)he President must ‘point to clear congressional authorization’ to justify his extraordinary assertion of the power to impose tariffs,” Roberts wrote.\n\nGorsuch agreed with Roberts’ take but then used the occasion tocriticize other justices’ approachesto interpreting statutes under the major questions doctrine, largely based on their past writings.\n\nBarrett fired back that Gorsuch was mischaracterizing her position, saying, “he takes down a straw man. I have never espoused that view.”\n\nKagan, a critic of the constraints imposed by the “major questions” approach, noted in her separate writing that Gorsuch was “insisting that I now must be applying the major-questions doctrine, and his own version of it to boot. Given how strong his apparent desire for converts, I almost regret to inform him that I am not one.”\n\nThe desire for converts can indeed motivate a lengthy concurrence. As much as the justices were, by turns, relitigating past cases and defending their positions in the dispute at hand, they were laying out the groundwork for future cases.\n\nAs Gorsuch remarked as he closed out his 46 pages, “if history is any guide, the tables will turn….”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/22/politics/supreme-court-tariffs-major-questions-doctrine-gorsuch-kavanaugh-kagan",
      "text": "laying bare divisions among the justices"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/chief-justice-john-roberts-tariffs-analysis",
      "text": "written the court’s main opinion"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf",
      "text": "Learning Resources v. Trump"
    },
    {
      "url": "https://www.cnn.com/2024/06/21/politics/supreme-court-guns-rahimi",
      "text": "upheld a federal law"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/23pdf/22-915_8o6b.pdf",
      "text": "five other justices wrote concurring opinions"
    },
    {
      "url": "https://legalytics.substack.com/",
      "text": "Legalytics"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-440_1b82.pdf",
      "text": "Berk v. Choy"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/chief-justice-john-roberts-tariffs-analysis",
      "text": "Roberts trained his fire"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/supreme-court-tariffs-major-questions-doctrine-gorsuch-kavanaugh-kagan",
      "text": "criticize other justices’ approaches"
    }
  ],
  "hash": "66b96d2f58a7545c2b6135c1b77df3aa6c2bd2a8e0195e3e458a61d33ddc54ac",
  "scraped_at": "2026-03-01T07:08:25.976994+00:00"
}