{
  "url": "https://lite.cnn.com/politics/state-redistricting-maps-vis",
  "title": "Tracking state congressional redistricting efforts | CNN Politics",
  "date": "2026-02-26T07:31:26.806193+00:00",
  "authors": [
    "Amy O’Kruk",
    "Ethan Cohen",
    "Renée Rigdon",
    "Fredreka Schouten"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump and Republicans have launched an unprecedented effort to redraw state congressional maps to help protect theparty’s narrow majorityin the House ahead of the midterm elections in November.\n\nDemocrats have responded with redistricting efforts of their own, setting off a series of fights across the country — including in the courts — which will shape the midterm landscape and help determine control of Congress.\n\nMost recently, legal action is continuing in Virginia over whether a statewide vote on a Democratic redistricting plan will be allowed to proceed on April 21. Even if voters allow the legislature to implement a new map, which targets four of the state’s five Republican House members, the courts could still strike down the plan after the election.\n\nCNN is tracking new maps and will continue to update with new state developments.\n\nRedistricting, or the process of redrawing congressional district boundaries, typically takes placejust once a decade, as states respond to updated population counts after thedecennial census.\n\nBut with a historically tight House of Representatives, redistricting has become a critical tactic to shaping the midterm races.\n\nThe redistricting process is different in every state. In some places, state legislators can redraw the map on their own, and all that’s needed is the political will. In other states, the redraw might require changing the constitution, a lengthier process which often involves a direct vote of the people.\n\nOverall, Republicans have more opportunities to gain seats through new maps than Democrats do. Republicans have full control of government in more states and many Democratic states haveceded the map-drawing powerto independent commissions, moves some of them are now trying to reverse.\n\nSix out of the nine House members targeted by Republican-enacted maps across the country are Black or Latino.\n\n2025 has already featured an unprecedented level of politically motivated mid-decade redistricting, but there could be even more in store. In many states, legal challenges aim to overturn existing maps. And at the Supreme Court,the justices may be poisedto strike down key parts of the landmark Voting Rights Act, a decision which would open the floodgates to even more aggressive maps andimperil more seats held by people of color.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/politics/narrow-house-majority-congress-dg",
      "text": "party’s narrow majority"
    },
    {
      "url": "https://www.cnn.com/interactive/2022/politics/us-redistricting/",
      "text": "just once a decade"
    },
    {
      "url": "https://www.cnn.com/2021/08/12/politics/us-census-2020-data",
      "text": "decennial census"
    },
    {
      "url": "https://www.cnn.com/interactive/2022/politics/us-redistricting/",
      "text": "ceded the map-drawing power"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/politics/voting-rights-act-supreme-court-conservatives",
      "text": "the justices may be poised"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/politics/missouri-redistricting-kansas-city-racial-divide-vis",
      "text": "imperil more seats held by people of color"
    }
  ],
  "hash": "682e094cb1f7f03d6b2fb6e06603bb31846499cbbeaf64a7de907b46f5ea33cd",
  "scraped_at": "2026-02-26T07:31:26.806205+00:00"
}