{
  "url": "https://lite.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
  "title": "El Paso, Texas: Surprise US military plans to use counter-drone laser triggered airspace closure, Sources say | CNN",
  "date": "2026-02-12T21:30:37.272392+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA Pentagon plan to use a high-energy, counter-drone laser without having coordinated with the Federal Aviation Administration about potential risks to civilian flights prompted Wednesday’s unprecedented airspace shutdown over El Paso, Texas, multiple sources told CNN.\n\nTwo people familiar with the matter said later Wednesday that Customs and Border Protection, not the US military, was in control of the laser technology when it was used this week around El Paso to shoot down balloons.\n\nDefense Secretary Pete Hegseth signed off on loaning CBP the technology in recent weeks, one of the sources said.\n\nThe sources said the Defense Department led the development of the technology, but CBP was physically operating it this week. Another source familiar with the matter said Defense personnel were present when the device was used.\n\nCNN has asked the Defense Department and the Department of Homeland Security for comment.\n\nA source told CNN earlier Wednesday that the US military used the laser technology to shoot down four mylar balloons this week, contributing to the decision by the FAA to shut down local airspace.\n\nThose accounts come as the Trump administration has claimed that a Mexican cartel drone crossing into US airspace is what triggered the 10-mile restriction centered on El Paso International Airport.\n\nLate Tuesday, the FAA abruptly issued a temporary flight restriction that immediately grounded all flights up to 18,000 feet around the city for 10 days, effectively shutting down El Paso International Airport.\n\nRoughly eight hours later, the restriction was lifted. By the time the FAA had lifted the flight restrictions, airlines had already issuedtravel waiversand notified customers of potential changes.\n\nMultiple sources from the federal government and US airlines told CNN that military activity near El Paso, including US drones monitoring cartel operations and the Pentagon’s planned use of a high-energy laser designed to counter drones, raised immediate concerns for civilian traffic arriving and departing El Paso International Airport. Fort Bliss and its airfield, Biggs Army Airfield, sit just north of the commercial airport, which serves about 100 flights each day.\n\nFAA and Pentagon officials had been scheduled to meet February 20 to review potential impacts and mitigation measures for a test of the laser system, a technology the Pentagon has been testing in more remote areas of the country, multiple sources said. But the Defense Department sought to use the system sooner around El Paso, prompting the FAA to impose the temporary flight restriction until that coordination could occur. The 10-day restriction would have expired on February 21, one day after DoD and the FAA were set to meet.\n\nThe FAA’s decision to close the airspace was made without telling the White House first, according to people familiar with the matter. The issue became a topic of intense focus inside the West Wing in the early morning hours of Wednesday, as Texas lawmakers pressed for answers on why the airspace was suddenly closed without first alerting them.\n\nAn administration official said Wednesday morning that the shutdown was triggered by Defense Department “action to disable” cartel drones. It’s unclear if the presence of drones might have led to the acceleration of the deployment of the laser system.\n\nCNN reached out to the FAA and White House for comment about the differing explanations. The Pentagon on Wednesday continued to refer to the administration official’s statement about a drone breach having caused the airspace closure.\n\nSecretary of Transportation Sean Duffy posted to social media crediting the FAA and Defense Department with acting “swiftly to address a cartel drone incursion.”\n\n“The threat has been neutralized, and there is no danger to commercial travel in the region,” he wrote on X.\n\nIncursions along the southern border are extremely common and historically do not prompt such airspace closures. In 2024, for example, Air Force Gen. Greg Guillot, the commander of NORTHCOM, told the Senate Armed Services Committee that the number of incursions along the US Mexico border was “over a thousand” each month.\n\nThe Drug Enforcement Administration and other US security agencies have used facilities at the Biggs Army Airfield for years as part of efforts to monitor Mexico-based drug cartel operations, current and former US officials said.\n\nEl Paso, with a population of nearly 700,000, is the sixth-largest city in Texas and one of the 25 largest in the United States. It is a hub of cross-border commerce alongside neighboring Ciudad Juárez in Mexico.\n\nNearly 3.5 million passengers passed through El Paso International Airport in the first 11 months of 2025, according to its website. The airport describes itself as the gateway to West Texas, southern New Mexico and northern Mexico.\n\nThe US military has been testing laser-based air defenses against drones in recent months. Last summer, the Army conducteda live-fire exerciseusing directed energy weapons alongside more traditional air defense systems at Fort Sill, Oklahoma. And last fall, the Armyput out a requestto industry for ideas on a counter-drone Enduring-High Energy Laser (E-HEL) weapon system.\n\nIn the initial flight restrictions, the FAA classified the area around El Paso﻿ as “(National) Defense Airspace” and said pilots who violated the restriction could be intercepted, detained and questioned by law enforcement.\n\nIt warned that additional actions could be taken for pilots who don’t adhere to the restrictions, including suspension of flight certifications, criminal charges, and that the US government “may use deadly force” if an aircraft poses an “imminent security threat.”\n\nThe sudden FAA restrictions seemed to catch pilots and air traffic controllers by surprise.\n\nAudio from LiveATC.net caught the moment pilots were made aware of the grounding.\n\n“Just pass it on to everybody else, at 06:30 for the next 10 days, we’re all at a ground stop,” a controller said.\n\nA pilot replied, “OK, ground stop 06:30 for how long?”\n\n“Ten days,” the controller replied.\n\n“So the airport is totally closed?” the pilot said, chuckling.\n\nThe controller replied, “Apparently, we just got informed about 30 minutes to an hour ago.”\n\n“So for 10 days you guys are not open,” the pilot said, in disbelief.\n\n“Well, we’ll be here, but no air traffic,” the controller said.\n\n“OK,” the pilot said while laughing.\n\nSamuel, a traveler in El Paso, told CNN affiliate KFOX he was doing a book tour with a client and didn’t get any notification from his airline.\n\n“I just kind of saw all the cops here and the news cameras,” he said. “I gotta figure out what’s going on if there’s another airport that’s not in El Paso, and try to figure out and rent a car out.”\n\nDemocratic Rep. Veronica Escobar of Texas told reporters Wednesday that the closure of the El Paso International Airport was solely a FAA decision and that local officials — including members of Congress — were left completely in the dark before it happened.\n\nShe stressed that she was not notified in advance despite representing the congressional district that’s home to the airport, Fort Bliss and the broader El Paso community.\n\n“They did not alert the El Paso city manager or the El Paso mayor,” Escobar said on a press call Wednesday morning. “Everyone locally on the ground was in the dark, and the impact, obviously, is highly consequential.”\n\nThe Associated Press and CNN’s Evan Perez, Kevin Liptak, Kit Mayer, Camila DeChalus, Karina Tsui, and Diego Mendoza contributed to this report.\n\nThis headline and story have been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.united.com/en/us/fly/travel/trip-planning/travel-alerts.html",
      "text": "travel waivers"
    },
    {
      "url": "https://www.army.mil/article/286677/us_army_tests_laser_weapons_aiming_at_a_future_of_energy_based_air_defense",
      "text": "a live-fire exercise"
    },
    {
      "url": "https://sam.gov/opp/89e98c0e5d4b453f823132bc2ced416c/view#general",
      "text": "put out a request"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "687e68c7e479e5d0c1db8dbdc68a9ba3204ace877f9cd9c96b1907fe7aa3500b",
  "scraped_at": "2026-02-12T21:30:37.272406+00:00"
}