{
  "url": "https://lite.cnn.com/2026/02/10/politics/fulton-county-search-warrant-annotated",
  "title": "Breaking down the evidence DOJ used to justify searching a Fulton County elections office | CNN Politics",
  "date": "2026-02-11T16:38:56.695435+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPresident Donald Trump’s long-running stolen-election crusade entereda potentially fraught new phaserecently, with the FBI search of an elections office in Fulton County, Georgia.\n\nSome fear it could be a precursor to an evenmore heavy-handed Trump interventionin American elections.\n\nAnd a big question after the search was how it got the go-ahead from a magistrate judge. After all, searches require probable cause of a crime, and the magistrate judge, Catherine Salinas, was not exactly some reputed judicial extremist or election skeptic; according to Lawfare, she had previously worked for a public defender’s office and clerked for a Clinton appointee.\n\nMaybe there was some new information that suddenly lent some credence to claims of malfeasance in Fulton County in 2020?\n\nOr, as it turns out, maybe not.\n\nThe affidavit that was used for the search warrant application wasmade public on Tuesday, and it overwhelmingly recycles old claims about voting irregularities that have either been debunked or haven’t gone anywhere.\n\nThe application also relies heavily on information from prominent election-deniers whose claims have failed to produce the voter-fraud smoking gun Trump has sought over the past five-plus years.\n\nIn addition, the affidavit cites no evidence of any actual criminal intent.\n\nLet’s annotate some key parts from theaffidavit.\n\nThe combination of “electoral impropriety,” “ballot counting” and “substantiated” paint a dire picture. But a misleading one.\n\nWhile it’s true that certain aspects of Fulton County’s election administrationwere not perfect– and officials have acknowledged as such – there has been no proof offered of widespread fraud. Similarly, dozens of lawsuits from Trump’s campaign and allies failed after the 2020 election – nearly all of them, in fact.\n\nAnd it’s never been demonstrated that any of the problems owed to anything other than human or administrative errors. Which, in this context, usually aren’t treated as crimes.\n\nThe key word there is “if.” The affidavit doesn’t cite any real evidence of criminal intent.\n\nIn one case, it cites a member of the state election board who “believed” she had witnessed “an intentional act.” In another, it cites a data analyst who “concluded that what he observed could be intentional but was not partisan.”\n\nCriminal intent isn’t required to convince a magistrate to find probable cause to approve the warrant. But the lack of evidence on that front is notable given previous reviews of the election have failed to turn up any evidence of it.\n\nTwo high-profile reviews of Fulton County’s elections, includingan extensive “Performance Review Board” report, both found significant problems but no evidence of fraud or misconduct. Georgia’s GOP governor, Brian Kemp, and secretary of state, Brad Raffensperger, have both frequently defended the election results.\n\nThe warrant application cites a number of prominent election-deniers.\n\nOlsen is a lawyer who playeda key role in challenging the 2020 election, including working on a lawsuit to nullify the results of key states that Trump lost. Such lawsuits overwhelmingly failed. He had multiple phone calls with Trump on January 6, 2021, when rioters stormed the US Capitol.\n\nOlsen was alsosanctionedover what a federal judge found to be “false, misleading and unsupported factual assertions” about the 2022 Arizona gubernatorial campaign, which Republican Kari Lake lost.\n\nHe was recently madea special government employeein the Trump administration.\n\nThe affidavit also cites another person who tried and failed to overturn Lake’s loss,Clay Parikh.\n\nThis is a years-old claim, and a spokesman for Georgia’s Republican secretary of state has explained it.\n\nBasically, there were about 17,000 fewer ballots counted during a recount than in earlier counts, because the county used the same name on two batch files,USA Today has reported. The count was later corrected through a process called “reconciliation.”\n\nAnd while the affidavit cites missing ballot images as potential evidence of a crime,Reuters has reportedthat it’s not clear that the law at the time of the election required such ballot images to be saved.\n\nThis refers to the so-called “duplicate ballot” issue. And among the issues cited in the affidavit, it’s perhaps the most legitimate. But there’s still no real evidence of malfeasance.\n\nState officials in 2024acknowledgeda little more than 3,000 duplicate ballot images. But duplicate ballot images are not the same as counted votes, and officials couldn’t determine that any of them were actually tabulated in the recount.\n\n“If the ‘3,000 duplicate ballot images’ had been counted as votes … the results would have been off by 3,000 — and they were not,” a spokesman for the Georgia secretary of statetold PolitiFactback then.\n\nA local official cited human error for the duplicate ballot images.\n\nThis refers to the so-called “pristine ballots” theory. A judge in 2021dismissed a lawsuitthat relied on these claims.\n\nThe secretary of state’s office reviewed the claims and said it was “unable to substantiate the allegations that fraudulent or counterfeit ballots were counted.” They found no ballots that appeared to be counterfeits.\n\nAn official in that office hasexplainedthat some overseas and military ballots might not be the right size for scanners, so those votes can be transferred to ballots that can be scanned and might appear more “pristine.”\n\nThe affidavit notably makes no mention of any theories about foreign election interference. That should ratchet up questions as to why Director of National IntelligenceTulsi Gabbard was presentat the FBI search. (Gabbard’s job generally revolves around foreign threats, not domestic law enforcement.)\n\nThe affidavit also does not address a pretty significant potential problem with any ensuing prosecutions: the passage of time. Thestatute of limitationsis generally five years, and the 2020 election is now just outside that window. That might not matter to the extent this is about record retention – one of the crimes the affidavit cites requires keeping records for 22 months after an election, so the statute would expire five years after that. But it could matter for more severe potential offenses.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/politics/fbi-fulton-county-gabbard-election-trump-analysis",
      "text": "a potentially fraught new phase"
    },
    {
      "url": "https://www.propublica.org/article/fbi-fulton-county-voting-records-search-warrant",
      "text": "more heavy-handed Trump intervention"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
      "text": "made public on Tuesday"
    },
    {
      "url": "https://www.documentcloud.org/documents/26927587-warrant-affidavit-for-fulton-county-ballots/",
      "text": "affidavit"
    },
    {
      "url": "https://www.11alive.com/article/news/politics/fulton-county-admission-unsigned-voting-tabulations-2020-election-state-election-board/85-c72117d7-6a5f-4df1-b59e-14e214ba029a",
      "text": "were not perfect"
    },
    {
      "url": "https://sos.ga.gov/sites/default/files/forms/Performance%20Review%20Board%20Report%20on%20Fulton%20County%20Elections%20%281-13-23%29_0%20%28OLD%29.pdf",
      "text": "an extensive “Performance Review Board” report"
    },
    {
      "url": "https://www.cnn.com/2021/11/05/politics/january-6-timeline-trump-coup",
      "text": "a key role in challenging the 2020 election"
    },
    {
      "url": "https://www.dailyjournal.com/article/387216-federal-appeals-court-split-on-attorney-sanctions-in-arizona-ballot-case",
      "text": "sanctioned"
    },
    {
      "url": "https://www.politico.com/news/2026/02/09/kurt-olsen-2020-election-intelligence-00771580",
      "text": "a special government employee"
    },
    {
      "url": "https://www.nytimes.com/2022/12/24/us/politics/kari-lake-election-trial-arizona.html",
      "text": "Clay Parikh"
    },
    {
      "url": "https://www.usatoday.com/story/news/factcheck/2023/12/21/false-claim-georgia-letter-mentioned-invalid-2020-ballots-fact-check/71989887007/",
      "text": "USA Today has reported"
    },
    {
      "url": "https://www.reuters.com/article/fact-check/claims-that-17690-ballot-images-from-the-2020-presidential-election-are-missing-idUSL1N2S31Z0/",
      "text": "Reuters has reported"
    },
    {
      "url": "https://georgiarecorder.com/2024/05/07/georgia-oversight-panel-ruminates-on-2020-election-hiccups-as-2024-showdowns-loom/",
      "text": "acknowledged"
    },
    {
      "url": "https://www.politifact.com/article/2024/may/24/fact-checking-misleading-claims-of-2020-election-f/",
      "text": "told PolitiFact"
    },
    {
      "url": "https://www.gpb.org/news/2021/10/13/judge-dismisses-votergas-fulton-county-ballot-inspection-lawsuit",
      "text": "dismissed a lawsuit"
    },
    {
      "url": "https://www.nytimes.com/2021/01/04/us/politics/trump-georgia-election-fraud.html",
      "text": "explained"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/tulsi-gabbard-georgia-trump-fulton",
      "text": "Tulsi Gabbard was present"
    },
    {
      "url": "https://www.lawfaremedia.org/article/we-have-questions-about-the-fbi-s-fulton-county-search",
      "text": "statute of limitations"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/fulton-county-search-warrant-annotated",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/fulton-county-search-warrant-annotated",
      "text": "Cookie Settings"
    }
  ],
  "hash": "68822176f512ff8f838ec3fbabada7bd5938798e607307730a4ac3977a139688",
  "scraped_at": "2026-02-11T16:38:56.695448+00:00"
}