{
  "url": "https://lite.cnn.com/2026/02/16/travel/eat-pray-love-remember-20th-anniversary",
  "title": "‘Eat, Pray, Love’: How Elizabeth Gilbert helped women conquer the world | CNN",
  "date": "2026-02-17T07:30:39.318497+00:00",
  "authors": [
    "Lilit Marcus, CNN"
  ],
  "text": "Source: CNN\n\nIt was when she got to San Diego, of all places, that Elizabeth Gilbert realized everything had changed. She had left home as the author of a reasonably successful, year-old memoir titled “Eat, Pray, Love,” a first-person fusion of travelogue, confessional, and self-help manual, tracing her post-divorce journeys to Italy, India and Indonesia. On tour to promote the book’s paperback release, Gilbert recalls, she’d been speaking to audiences of “10, 15, 20 people.”\n\nNow, heading to yet another appearance, she saw “people like three deep wrapped around the block.” Gilbert was confused: “I said to the driver, ‘what’s going on tonight in San Diego? Is there some kind of a concert or show?’ And he said, ‘No, they’re here to see you.’”\n\nSuddenly “Eat, Pray, Love,” which came out 20 years ago this week, was no longer Gilbert’s idiosyncratic personal project — ”I remember just thinking, nobody’s going to want to read this, yet I have to do it anyway” — but a phenomenon that would span the globe. The book took on a life beyond its pages, in the hotels, cafes, spas, and beaches where legions of its readers set off seeking their own transformative journeys.\n\nIn 2019, Gloria Caseiro, a Portugal-born New Jersey resident, was the mother of two grown kids, and she had gotten divorced after the children moved out. On her own and newly retired, she says she found the answer about what to do next in the form of an “Eat, Pray, Love” paperback: “I decided, ‘You know what? I’m now going to go to all the places that I’ve never gone to.’” At age 51, she set off on her first-ever solo holiday, to Italy.\n\nThat sort of experience — not the millions of copies sold or the $200 million box office gross of the 2010 film adaptation, starring Julia Roberts as Gilbert and Javier Bardem as the new love she made on her travels — was what made “Eat, Pray, Love” an enduring sensation. Gilbert says that friends describe her as a “human permission slip” — someone who essentially told an entire generation of women it was OK to just travel for the sake of traveling.\n\n“There’s an old blues song that says, When a man gets the blues, he grabs a train and rides, when a woman gets the blues, she hangs her head and cries,” Gilbert says. “And so much of that is because women couldn’t grab a train ride.”\n\nBy the time the book appeared in 2006, the world had started to congratulate itself on how “easy” it had become for a woman to travel alone for leisure — a claim that says more about the restrictions that came before than about any great leap forward. Only recently had many countries stopped treating solo female travelers as a problem to be managed, no longer refusing them hotel rooms when traveling without a man, or denying them credit cards to pay for it.\n\nGlobalization and the growing democratization of travel made it easier to get to distant places, and ever smarter mobile devices with SIM cards and Google Translate made it easier for travelers to get around when they got there.\n\nOne word kept coming up among women who talked about their journeys in those years. It wasn’t just more socially acceptable for a woman to travel alone, they say. It wassafer.A traveler could navigate a new neighborhood alone just with her phone, without having to pull out a paper map that announced her unfamiliarity to anyone around. It was possible to send a text to someone back home as soon as a plane landed, rather than waiting to get somewhere with a satellite phone.\n\n“Freud spent a lot of time saying, ‘what do women want?’” Gilbert says. “And it’s like, apparently, they want a year to travel around the world by themselves, to eat a lot of pizza, to fall in love with a handsome Brazilian man, to have adventure.”\n\nMany of the women inspired by “Eat, Pray, Love” thought that their opportunities to travel had passed them by. Careers and families took up their time and energy; vacations were for kids’ college tours or visiting relatives. By the time traveling solo became an option, they were not interested in sleeping in shared rooms at a hostel, but wondered how they’d make friends or find connection otherwise.\n\n“At first, it was a little strange traveling by myself,” Caseiro says. She initially felt self-conscious about eating at a restaurant alone and kept wondering if people would feel embarrassed for her. “But it actually has been joyous and freeing and liberating,” she says.\n\nElizabeth Lahiff was an American recent college grad working in Mexico in the early 2000s when someone said: “You’re doing that ‘Eat, Pray, Love’ thing, aren’t you?”\n\nMystified, Lahiff tracked down a copy of the book.\n\n“When I read it, everything just kind of resonated with me. And I went, yeah, I am doing something great. So, for me, the book was really reassuring.”\n\nLahiff’s story, like Gilbert’s, began with the protagonist as a young career woman in Manhattan. Though she’d been filled with dreams about moving to the big city and being successful, the indignity and monotony of her entry-level job at a consulting firm caused Lahiff to wonder if she’d made the right decision.\n\nShe ended up quitting her job and moving to the Marshall Islands, a place she’d never heard of, for a short-term contract job.\n\nTwo decades later, Lahiff lives in Dushanbe, Tajikistan and works in international development. It’s literally and figuratively a world away from where she grew up in small town upstate New York.\n\n“Solo travel gives you so much in terms of what you feel you can accomplish,” she says. “It also, I think, is the closest to freedom that one can ever feel because there’s no expectations on you.”\n\nBefore, during or after their travels, the book kept resonating with its readers. Caseiro  still has her original copy of the book, now made into a sort of scrapbook as she’s stuffed dried flowers and train tickets between the pages and written notes in the margins. The book began as Caseiro’s travel bible, and now it’s a souvenir.\n\nSo many people wrote to Gilbert about their “Eat, Pray, Love”-spurred journeys that her publisher collected them into a book: “Eat, Pray, Love made me do it: Life journeys inspired by the bestselling memoir.”\n\nBy now, the idea of “Eat, Pray, Love” has fully transcended the original memoir. Gilbert says that recently, someone told her about traveling alone in Asia and meeting another woman, in Thailand, who was also traveling on her own. “And she said to the women, ‘What are you doing here in Thailand?’” Gilbert says. “And the woman said, ‘Well, I’m doing my “Eat, Pray, Love” thing. I’m my “Eat, Pray, Love” year.’ And  the person telling me the story said to her, ‘Oh, you mean like in the book?’\n\n“And she says, ‘What book?’”\n\nThe book also, unavoidably, served as a marketing template, as a new crop of businesses sprang up to meet the new travelers’ needs. Upscale wellness resorts advertised the idea that a guest could come and experience meditation and spiritual healing without having to sleep on a floor, abstain from alcohol, or take a vow of silence.\n\n“Eat, Pray, Love” became a catchphrase that spa and hotel owners could use to attract a new kind of customer. No, a resort in Bali couldn’t promise you’d fall in love with Javier Bardem while there, but it could sell an Instagram feed full of healthy grain bowls and thin women doing yoga in rice fields.\n\nFor Sasha Astiadi, who is Indonesian and spent part of her youth in Bali, “Eat, Pray, Love” was everywhere — even though she still hasn’t read the book or seen the movie.\n\nShe says it was impossible not to witness the transformation “Eat, Pray, Love” ignited on the island as tens of thousands of tourists descended, spending up to five figures on meditation retreats that local people like her couldn’t afford. Many local people passed themselves off as healers, she says, to cash in on the droves of women who came looking for a Gilbertian experience of their own.\n\nBali, she said, “is not like the movies. There is constant traffic. There is a language you don’t understand. There are mosquitoes. There are so many bureaucracies.”\n\nAstiadi got the travel bug when she won a scholarship to study in the United States as a teenager. Following her stint in small-town Texas, she quickly realized that education was going to be her path out of poverty and Indonesia. Her academic studies have taken her from China to Hungary to the United Arab Emirates. Now, she’s a web developer based in Berlin.\n\nWidely traveled as she’s been, her movement around the world has not been the frictionless experience embraced by the largely white, Western fans of Gilbert’s work. She speaks six languages but says she is held up by racial profiling when she travels, while white tourists who only speak English float through customs without a problem.\n\nThe US is one ofthe most powerful passports in the world, with holders able to access 179 countries and territories either without a visa or with a visa on arrival. Indonesia, on the other hand, is 64th in the annual ranking.\n\nIn addition, Astiadi says that she is often profiled while traveling due to her skin color.\n\n“Meanwhile,” she adds, “tourists coming to Bali, all they need to do is get off the plane and everything is cleared.”\n\nAstiadi says she has to keep her visits back to Indonesia short, because if she’s away from Europe too long, she runs the risk of her visa being cancelled. As a child, Astiadi loved Paddington Bear, and she still dreams of visiting London to visit the Paddington statue and buy a stuffed bear of her own. But as she’s only a resident in Germany, not a citizen or passport holder, the hurdles are much higher.\n\n“I think my spiritual healing mostly comes from like getting over obstacles and getting over hardships,” she says.\n\nGilbert’s memoir provided readers with a perfect happy ending as she paired off with the handsome Brazilian businessman she’d fallen in love with along the way. The two married and settled in the US, but Gilbert’s real life was less simple.  A dozen years later,Gilbert left her husbandfor her female best friend, Rayya, who died of cancer not long after, an experience that made for another, more divisive memoir.\n\n“I am always reminding people that I wrote ‘Eat, Pray, Love’ when I was 34. And that’s pretty young to have your whole life figured out,” she says. While Julia-Roberts-as-Liz-Gilbert’s story ended, Liz-Gilbert-as-Liz-Gilbert is still moving ahead, honestly and imperfectly.\n\nStill, the original version of Gilbert continues to guide or inspire women who’ve wanted to see more of the world and make more of themselves.\n\n“I think Elizabeth Gilbert’s story is really similar to mine,” says Merridith Ng.\n\nNg, a Maryland native, now lives in New Zealand. But her journey to see the world began, like Gilbert’s book, in Italy. “Once you’ve realized there’s places outside of the United States that are amazing as well, then something changes in you a bit,” Ng says.\n\nNg pursued her spiritual side by attending services at a church in New Zealand, where she met the man who would later become her husband – a tidy combination of Pray and Love. They now have three daughters – the oldest of whom, in a tribute to the country that kicked off a desire to explore the world – is named Siena.\n\n“I’ll never forget my mom’s face when I told her I wanted to get engaged to someone across the world,” Ng says. “Her face went completely white. And she said, ‘What about when you have babies?’ She was really brave, I think, in that moment to allow me to chase my dream and go across the world.”\n\nWhen Ng first moved overseas, she counted on postcards and the occasional expensive overseas call to keep in touch with her family. These days, though, they can use FaceTime and WhatsApp. And although she’s spending much less time traveling for pleasure these days, Ng’s job as a coordinator for students who coming from overseas to study in New Zealand means that she taps into her memories of travel — and of being scared, alone, and far from home — every day.\n\nNg says that when her girls are older, she hopes to show them the movie “Eat Pray Love” as a way into her own story – as a starting point to talk about how a girl from the DC suburbs met a guy from the other side of the world and ended up making a family.\n\nGilbert says she was concerned at first that her readers were trying to follow her example too closely, making a “ritualized recreation of the book,” in which they were “trying to stay in the same neighborhood in Rome, trying to eat the same pizza that I ate in Naples, trying to find the ashram where I was in India, trying the healers that I went to in Bali.” She tried, she said, to encourage people not to do the same things she’d done.\n\n“But I realized somewhere along the way,” she said. “that you could faithfully, step by step, completely re-create my journey, and you’re still gonna get your own journey.” Everyone’s personal experience of the pizza, or of the healing, or of the spiritual awakening, Gilbert said, was going to be completely different.\n\n“So at that point, I was like, do what you want with it,” Gilbert said. “Like, even if you try to be me, you’re going to end up being you.”\n\nWatch an extended cut of the interview with Elizabeth Gilberthere.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/travel/the-worlds-most-powerful-passports-for-2026",
      "text": "the most powerful passports in the world"
    },
    {
      "url": "https://www.cnn.com/2016/07/01/entertainment/eat-pray-separate",
      "text": "Gilbert left her husband"
    },
    {
      "url": "https://www.youtube.com/watch?v=qQ2qqeZHZs8",
      "text": "here"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/travel/eat-pray-love-remember-20th-anniversary",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/travel/eat-pray-love-remember-20th-anniversary",
      "text": "Cookie Settings"
    }
  ],
  "hash": "68d37e0049dec78eaebb5befdfd74a3258c4b4063b63bfc6b2b1c8a099697eb7",
  "scraped_at": "2026-02-17T07:30:39.318509+00:00"
}