{
  "url": "https://lite.cnn.com/2026/02/28/us/georgia-school-shooting-trial-colin-gray",
  "title": "Colin Gray trial testimony reveals frantic moments before Georgia school shooting | CNN",
  "date": "2026-03-01T07:06:56.867670+00:00",
  "authors": [
    "Eric Levenson"
  ],
  "text": "Source: CNN\n\nMinutes before the 2024 shooting at Apalachee High School, administrators and officers went to intercept a freshman student named Colt Gray, whose concerning comments that morning had raised several red flags.\n\nThey went to his second period math class but learned he had gone to the bathroom. There, they found a student named Kolton Gray and brought him to the office for questioning.\n\nMinutes later, Colt Gray began shooting.\n\nThe bizarre, unfortunate name mix-up was revealed in its full extent this week at thetrial of Colin Gray, the father of the school shooter, on charges of murder and manslaughter.\n\nThe shooting at Apalachee High in Winder, Georgia, on September 4, 2024, left four people dead and nine injured. Colt Gray surrendered to police and hasadmitted to the shooting, according to authorities. Now 16, he has pleaded not guilty to55 felony counts, including four counts of malice murder. A trial date has not been set.\n\nColin Gray, the teen’s father, haspleaded not guiltyto charges of murder and manslaughter. Prosecutors say he acted recklessly by buying his son the rifle as a Christmas gift and allowing him access to it despite previous warnings that his son was a danger to others. His defense has said he was unaware his son was planning the shooting and had taken steps to try to get him help.\n\nThe trial has primarily focused on what the father knew about his troubled son and what he did with that knowledge before the attack. But it has also featured dozens of witnesses who have offered key testimony about the day of the attack and the “what-if” moments in which police nearly stopped it before it started.\n\nIn particular, the testimony revealed Colt Gray’s alarming actions and statements prior to the attack: the school’s efforts to locate him that day, the confusion with a similarly named student, and finally the horrific shooting itself.\n\nHere’s a closer look at what we now know about the shooting based on trial testimony so far:\n\nOn the morning of September 4, 2024, Colt’s comments and actions raised multiple red flags.\n\nIn his first period class, Colt asked his teacher, Suzanne Harris, if the school had done any active shooter drills, she testified.\n\n“It was a little bit alarming, and I did send an email to the counselor in regards to that,” Harris testified.\n\nShe noticed Colt was carrying a backpack with a large poster sticking out of the top of it. Shortly after Colt left her classroom, Harris told an administrator she thought he had a gun. “I felt in every fiber of my being that something was wrong,” she testified.\n\nThe poster, reading “Happy Mama’s Day,” was wrapped around the part of the firearm that stuck out of the top of the backpack, according to trial evidence.\n\nAt 9:40 a.m., Colt sent several concerning texts to his father that alarmed him, according to phone records.\n\n“I’m sorry,” he wrote to his father. “It’s not ur fault.” Colin Gray, at his construction job, texted him what was wrong, but the teen didn’t respond, text evidence shows.\n\nColin Gray then called his estranged wife, Marcee, who called the school guidance counselor, Lisa Butler, at 9:50 a.m. to ask them to check on Colt. Toward the end of that conversation, she told Butler Colt had access to a firearm and had an obsession with school shooters, alarming the counselor, Butler testified.\n\nButler relayed the information to Deigh Martin, the assistant principal at Apalachee. Martin and two school resource officers were already searching for Colt Gray based on the teacher’s concerns about his backpack and questions about active shooter training, she testified.\n\nMartin and the officers then went to locate Colt but failed to find him due to a stranger-than-fiction mix-up: another student in the same class was named Kolton Gray.\n\nAt 9:53 a.m., Colt Gray took his backpack and left his second period classroom. His teacher, Katherine Greer, testified he asked to go see a crisis counselor, and she allowed him to do so.\n\nBut instead, Colt took his bag and the weapon inside to the bathroom. There, he texted his mother, “I’m sorry,” and texted his father, “ur not to blame for any of it.”\n\nAt 10:03 a.m., Kolton Gray – seated in the desk next to Colt – got up from his desk and also went to the bathroom.\n\nAt 10:06 a.m., Martin entered the classroom looking for Colt Gray but instead took Kolton Gray’s backpack from the room. A minute later, the two school resource officers entered a nearby bathroom looking for Colt Gray but instead located Kolton Gray and took him to the office for questioning.\n\nMartin testified they soon realized they had the wrong student and wrong backpack because of their similar names. “We kinda knew that was the mix-up,” she said.\n\nOne explanation for the mix-up was that Colt Gray had only attended a few days of school at that point, and school employees did not know what he looked like.\n\nHe did not enroll in any school – online or otherwise – for his entire eighth grade year, school records showed. He missed the first two weeks of his freshman year at Apalachee High, and after that missed more days than he attended leading up to the day of the shooting. His student photo on file with the school was from years prior, so they did not know what he looked like.\n\n“There was confusion in regards to the name and there was also confusion in regards to Colt Gray himself because he had not been at the school for an extended period of time,” Georgia Bureau of Investigation agent Lucas Beyer said. “He was lesser known than Kolton Gray was.”\n\nUnable to find Colt Gray, Martin said she went to look at the school security cameras to try to figure out what he looked like.\n\nMeanwhile, Colt Gray remained behind in the bathroom, surveillance video shows. He left the bathroom at 10:21 a.m. wearing yellow gloves, walked toward his classroom and removed the firearm from his backpack, the video shows.\n\nA female student looked out the door window and saw Colt Gray armed. She alerted Greer, who immediately pressed the emergency button on her badge, locking down the school.\n\nAt 10:22 a.m., unable to enter his own classroom, Colt Gray went to Cassandra Ryan’s nearby algebra class, took three to four steps inside and opened fire for about 10 to 12 seconds, Beyer said.\n\n“There was gunfire that started happening, and I could feel debris and bullets going over my head,” Ryan said.\n\nChristian Angulo, a student in the class, was killed, and several otherstudents were wounded by gunfire.\n\nColt Gray then left the class and walked down the hallway, where he fatally shot teachers Cristina Irimie and Richard Aspinwall and wounded another teacher, David Phenix, according to Beyer. He then fatally shot Mason Schermerhorn, a student who had come out of a bathroom.\n\nSchool resource officersBrandon King and Chase Boydhad been searching for Gray when they heard the sound of gunshots, they testified. They sprinted toward the sound and came to a hazy and backlit hallway with limited visibility, they said.\n\nKing saw the outlines of a person standing and loudly said, “Show me your f***ing hands,” he testified. The person immediately got on the ground, lay down in the prone position and put his arms out, he testified.\n\nBoyd then put the shooter, Colt Gray, in handcuffs. A rifle sat next to him, and magazines were located on his body, he testified.\n\nMeanwhile, Colin Gray texted his son at 10:23 a.m. – moments after his son had opened fire – and 10:27 a.m., asking him to call and saying he would take the teen out of school, text records show. Colt did not respond.\n\nAt 10:55 a.m., Colin Gray’s daughter Jenni texted him, “I’m scared,” and the father responded, “It’s going to be ok.” She said people had been killed at the high school, and Colin Gray asked how she knew that and whether she had spoken to Colt that day.\n\nColin Gray left his construction job at 11:18 a.m. and drove home, arriving at 12:27 p.m., where he saw the Sig Sauer firearm was not in Colt’s room. Police arrived at the home five minutes later to question him, according to body-camera footage.\n\n“God. I knew it,” he said when they arrived, according to police body-camera footage. “My little girl just texted me – she’s in middle school – she said, ‘We’re in lockdown.’ I’m like, ‘God almighty, please tell me your brother didn’t do something.’”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/us/colin-gray-trial-georgia-shooting",
      "text": "trial of Colin Gray"
    },
    {
      "url": "https://www.cnn.com/2024/10/22/us/apalachee-school-shooter-colt-gray-has-waived-arraignment-and-entered-a-not-guilty-plea",
      "text": "admitted to the shooting"
    },
    {
      "url": "https://www.cnn.com/2024/10/17/us/colt-colin-gray-apalachee-school-shooting",
      "text": "55 felony counts"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "pleaded not guilty"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "students were wounded by gunfire"
    },
    {
      "url": "https://www.cnn.com/2024/12/30/us/apalachee-high-school-officer-church-interview-hnk",
      "text": "Brandon King and Chase Boyd"
    }
  ],
  "hash": "68f9dd7add924f960aab456d57860091143dc034baa9e9d0a228d6fea705314a",
  "scraped_at": "2026-03-01T07:06:56.867681+00:00"
}