{
  "url": "https://lite.cnn.com/2026/02/13/politics/us-shutters-key-dea-office-caribbean-agent-visa-fraud",
  "title": "US shutters key DEA office in the Caribbean amid agent corruption scandal | CNN Politics",
  "date": "2026-02-14T07:07:07.727467+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA day after the US announced it took the unusual step of shuttering it’s Drug Enforcement Administration office in the Dominican Republic — a key site in the agency’s effort to combatdrug traffickingin the Caribbean — a top agent there was charged with running a visa fraud scheme.\n\nUS Ambassador Leah F. Campos announced on social media Thursday that she had closed the DEA’s office, writing “It is a disgusting and disgraceful violation of public trust to use one’s official capacity for personal gain.”\n\n“I will not tolerate even the perception of corruption anywhere in the Embassy I lead,” Campos added.\n\nThe Justice Department announced Friday the charges against supervisory special agent Meliton Cordero, who the DOJ said in a press release was assigned to the US Embassy in the Dominican Republic for six years. Cordero was arrested Thursday.\n\nCordero is charged with conspiracy to commit bribery and visa fraud, according to the Justice Department. Prosecutors didn’t ask that he be detained, but he was ordered to surrender his passport.\n\nProsecutors say Cordero accepted thousands of dollars in exchange for assisting foreign nationals with securing nonimmigrant visas that would allow them to visit the US for a temporary period.\n\n“During his assignment at the U.S. Embassy in the Dominican Republic, Cordero expedited at least 119 visa applications, at least one of which is alleged to have been fraudulent, often coaching individuals in preparation for their visa interview with U.S. Consular Officers,” the Justice Department said.\n\nCharging documents against Cordero have not yet been unsealed in court records.\n\nThe US ambassador made the extraordinary move to shut down the DEA’s office in the Dominican Republic in recent days, in response to the corruption probe,\n\nThe decision could hamper US anti-narcotics efforts in the region, which the Trump administration has cited as a high priority.\n\nThe office is a major base of operations for monitoring and cutting off traffickers using the Caribbean as a route to traffic cocaine from South America to Europe and the US.\n\nThe Dominican government has allowed the Defense Department to use its military facilities as part of a broader effort that includes military strikes on purported trafficking boats in the Caribbean Sea and the Pacific Ocean.\n\n“The temporary closure of the DEA office in Santo Domingo is to allow time for an investigation internal to this Embassy. The Dominican Republic remains a critical partner in our work to combat narco-terrorism throughout the region,” the US embassy in the Dominican Republic said in a statement on X. “That work will continue at the same robust pace between the U.S. Embassy in Santo Domingo and our Dominican partners even as our internal investigation ensues.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/us-strikes-boat-2-killed-1-survivor",
      "text": "drug trafficking"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/us-shutters-key-dea-office-caribbean-agent-visa-fraud",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/us-shutters-key-dea-office-caribbean-agent-visa-fraud",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6927ad028723a07def3c8ce966e541eacf7772acda3b1defd8a448e05186bfc1",
  "scraped_at": "2026-02-14T07:07:07.727481+00:00"
}