{
  "url": "https://lite.cnn.com/2026/02/27/media/cnn-paramount-ellison-bari-weiss-wbd-merger",
  "title": "What does the Paramount-WBD merger mean for CNN? | CNN Business",
  "date": "2026-03-01T07:08:07.338256+00:00",
  "authors": [
    "Brian Stelter"
  ],
  "text": "Source: CNN\n\nViewers and readers of CNN might be wondering the same thing that CNN employees are asking right now: What will Paramount’s ownership mean?\n\nAnswers are in short supply. Paramount executives have privately talked about the prospect of combining its CBS News unit with CNN. They have also praised CNN’s newsgathering machine and global reach.\n\nBut CNN employees and viewers have serious concerns about whether Paramount CEO David Ellison will uphold the news network’s editorial independence amid severe political turbulence.\n\nPresident Donald Trump, after all, has long sought to weaken CNN, and he viewed the recent bidding war for Warner Bros. Discovery as another way to exert control. “It’s imperative that CNN be sold,” Trump said last December, signaling he favored Paramount’s takeover proposal.\n\nParamount’s financing has also come under scrutiny, as several Middle Eastern sovereign wealth funds are attached to the deal. Journalists worry that such funding could complicate or even chill CNN’s coverage of the region.\n\nFurthermore, David Ellison’s father, Larry, the Oracle billionaire, is one of the richest men in the world and a close ally of the president. Larry is deeply involved in the Trump-approved deal that kept TikTok online in the United States.\n\nThe bidding war abruptly ended on Thursday when Netflix declined to counter Paramount’s latest bid. Paramount’s leaders seemed caught off guard by Netflix’s capitulation, just like everyone else; thus, the company hasn’t commented yet on its victory, or telegraphed its intentions for CNN.\n\nBut Ellison has talked in recent months about his commitment to sustaining the news business and his belief that “the majority of the country longs for news that is balanced and fact-based.”\n\nOn the day he officially took control of Paramount last August, he expressed big ambitions for the demoralized CBS News division, saying he wanted it to “speak to the biggest audience possible.”\n\nHe asserted that CBS News coverage could appeal to “70%” of Americans, ranging “from center left to center right” — a vision of the audience that mirrors CNN’s own.\n\nArguably, Ellison’s biggest statement about the future of news was with his wallet: In October, he spent $150 million to acquire The Free Press and make its co-founder, Bari Weiss, the editor-in-chief of CBS News.\n\nThat decision, and several ensuing controversies at CBS News, have unnerved journalists both inside and outside the company.\n\nAnd more broadly, Paramount’s attempts to put on a Trump-friendly face — while seeking the Trump administration’s blessing for its business deals — have led to Democratic accusations of corruption and promises of future investigations.\n\nFormer FTC commissioner Alvaro Bedoya wrote on X, “To win over Trump, they canceled Colbert, blocked a CECOT investigation, and blocked Talarico. Much more will follow. Block this rotten deal.”\n\nCalifornia Attorney General Rob Bonta said Thursday night that he might try to block it: “The California Department of Justice has an open investigation, and we intend to be vigorous in our review.”\n\nBut Paramount executives see a path to completing the merger by the end of the year, a source familiar with the company’s thinking said.\n\nParamount in the Ellison era is a complicated place, with competing narratives about what’s going on.\n\nThe same company that cancelled Stephen Colbert’s late-night show on CBS also renewed Jon Stewart’s contract on Comedy Central and ordered more episodes of the Trump-skewering comedy “South Park.”\n\nThe same news boss, Weiss, who delayed a “60 Minutes” story that was critical of the Trump administration, also greenlit the story for TV a few weeks later and expressed regret about the controversy.\n\nAnd the same CEO, Ellison, who has forged a close relationship with Trump, previously donated $1 million to Joe Biden’s reelection campaign.\n\nCBS News continues to break hard-hitting stories about the Trump administration and other topics.\n\nAnd Weiss has told confidants that she hasn’t felt pressure from Paramount to bend CBS News in a politically partisan direction.\n\nAt an all-hands meeting last month, she told employees that her only conversations with Ellison have been “about fairness. That’s it. He’s never seen anything before it aired. Nothing of that sort.”\n\nHer comments about the future of CBS News were quite similar to CNN CEO Mark Thompson’s comments about the future of CNN.\n\nWeiss called CBS News “the best capitalized media start-up in the world” and talked about a much-needed digital transformation. “We need to shift to a streaming mentality immediately,” she said.\n\nBut some early missteps by Weiss have raised eyebrows and left CBS News staffers wondering about her managerial abilities.\n\nAnd political clouds — far out of her reach or control — have tainted public perception of her transformation project.\n\nLast December, the Wall Street Journal reported that “David Ellison offered assurances to Trump administration officials that if he bought Warner, he’d make sweeping changes to CNN, a common target of President Trump’s ire, people familiar with the matter said.”\n\nParamount did not respond to that assertion at the time.\n\nWhen Paramount reported quarterly earnings earlier this week, the company said in a letter to investors that the leadership team at CBS News “is focused on building ‘one newsroom with one mission’ — delivering exceptional journalism to the broadest possible audience.”\n\n“With trust in mainstream news and legacy media at historic lows, transformation is essential,” Paramount said. “The goal is to build a modern news organization equipped for the digital age and rooted in facts, rigorous reporting, and audience-first storytelling.”\n\n“As part of this revitalization, we are focused on expanding the range of stories covered and the voices amplified,” the company added. “We are reimagining CBS News 24/7 with new formats and programming and by investing in key brands such as 60 Minutes, 48 Hours, and Sunday Morning through podcasts, newsletters, live journalism events, and more.”\n\nSquint a little bit, and it’s easy to see CNN in the same sentences. CNN is taking many of the same steps, for example, by rolling out a streaming subscription service.\n\nThanks to cable carriage fees and advertising revenue, CNN is strongly profitable, on track to make about $600 million in operating profit this year, according to WBD. But annual profits used to top $1 billion, and the business is under considerable pressure.\n\nAny steps to merge CNN and CBS News — a long-discussed possibility — may be impeded by the fact that the CBS News workforce is heavily unionized while CNN’s is not.\n\nThe combination of the two storied news brands is both eminently logical – but potentially really hard to accomplish.\n\nSee Full Web Article",
  "links": [],
  "hash": "69ce8696b32d5cda1005231ea523ba384843df6803e60b6ce1f3ec04afbe04fe",
  "scraped_at": "2026-03-01T07:08:07.338268+00:00"
}