{
  "url": "https://lite.cnn.com/2026/02/10/europe/crypto-linked-kidnapping-france-intl",
  "title": "Mother and daughter captives rescued by passerby in France’s latest crypto-linked kidnapping | CNN",
  "date": "2026-02-11T16:39:33.261339+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIt was the photo of a loved one nobody wants to receive.\n\nWhen the partner of a 35-year-old magistrate in France checked his phone last week, he saw a picture of his partner accompanied by a stark warning: pay a ransom incryptocurrencyor we will mutilate her.\n\nThe man – an associate in a start-up that has cryptocurrency activities – reported the demand to French police on Thursday morning, sparking a multi-agency manhunt involving as many as 160 officers, local authorities said.\n\nThe magistrate and her elderly mother were held for 30 hours in a garage in southern France’s Drôme region before escaping, according to CNN affiliate BFMTV.\n\nThe case renews focus on the recent rise in crypto-linked kidnappings in France and elsewhere, often involving high-profile individuals and those linked to them. Searches are ongoing in the United States after the disappearance of 84-year-oldNancy Guthrie, mother of “Today” host Savannah Guthrie. Purported ransom notes have demanded millions in bitcoin for her return, CNN has reported.\n\nIn France, the mother and daughter duo managed to escape from the garage in the municipality of Bourg-lès-Valence without a ransom being paid, assisted by a neighbor, Lyon prosecutor Thierry Dran said Friday in a press conference.\n\n“They were able to take advantage of the absence of their captor to free themselves, to call for help, in particular by banging forcefully on the garage door,” Dran said. “Alerted by the noise, a neighbor then intervened. He was able to open the door and thus allow our two victims to escape.”\n\nThe unnamed man who discovered the two women told local media they were grateful for his intervention.\n\n“I just came to take my car when I heard women hitting and screaming. I opened the door and two women came out; they were a little dirty. I was happy, they said thank you,” he told BFMTV.\n\nThe women were immediately transported to hospital, Dran said.\n\nOn Sunday, six people were arrested in relation to the kidnapping, including a minor, according to BFMTV. The main suspects are in their twenties and were arrested in the cities of Lyon and Chambéry, the outlet said.\n\nThe latest kidnapping follows similar incidents in France linked to the world of cryptocurrency – either due to the individuals involved or the currency of the ransom.\n\nSome believe bitcoin and other cryptocurrencies are untraceable – and therefore useful in ransom demands – but experts say this is a misconception. “Crypto works on a blockchain, and the blockchain is a public registry where everything is visible, everything is trackable and everything is auditable,” Renaud Lifchitz, a French IT senior security consultant, told CNN last year.\n\nLast week, Juan Andrés Guerrero-Saade, vice president for intelligence and security research at SentinelOne, told CNN that bitcoin is one of the “most traceable currencies we’ve ever had.”\n\nIn December 2024, the wife of crypto investor and influencer Stéphane Winkel was kidnapped from the couple’s home in Belgium. She was rescued after her kidnapper crashed his car in a dramatic police chase.\n\nThe following month, David Balland, cofounder of the crypto wallet company Ledger, waskidnappedwith his wife from their home in central France. Before the couple was freed, the assailants sent a video of Balland’s severed finger to his business partner Eric Larchevêque and demanded ransom money.\n\nLater in 2025, the daughter of the CEO of French cryptocurrency platform Paymium wassaved by passers-byfrom a daylight kidnapping attempt in Paris.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/05/14/europe/paris-kidnap-crypto-attack-intl",
      "text": "cryptocurrency"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/5-things-to-know-for-feb-10-nancy-guthrie-epstein-files-mask-ban-dhs-funding-us-canada-bridge",
      "text": "Nancy Guthrie"
    },
    {
      "url": "https://www.cnn.com/2025/06/04/europe/france-crypto-kidnappings-detained-intl",
      "text": "kidnapped"
    },
    {
      "url": "https://www.cnn.com/2025/05/14/europe/paris-kidnap-crypto-attack-intl",
      "text": "saved by passers-by"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/europe/crypto-linked-kidnapping-france-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/europe/crypto-linked-kidnapping-france-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6a0fc8051d25f1859f0442e2c53e55305a10fd66d6e9c4a54f3bf687214614ef",
  "scraped_at": "2026-02-11T16:39:33.261351+00:00"
}