{
  "url": "https://lite.cnn.com/2026/02/13/politics/immigration-democrat-shutdown-demands-poll",
  "title": "How popular are Democrats’ shutdown demands on immigration? | CNN Politics",
  "date": "2026-02-14T07:06:42.901865+00:00",
  "authors": [],
  "text": "Source: CNN\n\nCongress is now, yet again, shutting down major parts of the federal government.\n\nThere’s little sign of an agreement between Republicans and Democrats to fund the Department of Homeland Security as a midnight deadline to keep money flowing has expired. And GOP leaders sent their rank-and-file members home Thursday.\n\nOne side will eventually have to cave, and the popularity of proposed changes to immigration enforcement will have a major impact on which side “wins.” Meanwhile, people will soon seeimpactson their air travel, emergency response services and, to some extent, immigration enforcement.\n\nThe standoff stems from disagreements about reforming the Trump administration’s use of Immigration and Customs Enforcement (ICE) and Border Patrol in places like Minneapolis, where federal agents have killed two people: Renee Good and Alex Pretti. The Trump administration announced Thursday that it’s ending its surge of agents in Minneapolis.\n\nBoth Republicans and Democrats say the American people are on their side. The Trump administration and Republicans point to numbers that show Americanswant undocumented immigrants to be deported. Democrats insist the American people side with them because a large majority disapprove of ICE and saythe deportation effort has gone “too far.”\n\nSo who’s right? It’s clear Americans aren’t supporting the status quo, with anNBC News-SurveyMonkey pollthis week showing 7 in 10 want to at least see changes to ICE (about 3 in 10 want it abolished). Democrats obviously have some leverage here.\n\nBut how much? Let’s break down a few of the specific proposals Democrats are pushing.\n\nThe administration has unofficially backed off a bit on ICE conducting random stops in the street, at least for now. When border czar Tom Homan took over in Minneapolis after the second death, he signaled the operationwould be more “targeted.”\n\nThe polling is a bit mixed on more official legal restrictions.\n\nAPew Research Center polla year ago found 66% of Americans said law enforcement should be able to arrest undocumented immigrants at protests or rallies. Another 63% said it should be able to do so in their homes, and 54% said it should be fair game at workplaces.\n\nBut none of these specifically ask about stopping random people on the streets. And Pew polling later that year showed54% disapproved of workplace raids.\n\nStill, it seems logical to assume that the scenes of agents stopping people in public in Minneapolis have played a significant role in 6 in 10 Americans deciding that Trump’s immigration enforcement has gone “too far.”\n\nDemocrats have cried foul that the Trump administration has said it can enter someone’s homewithout a judicial warrant— instead using only an easier-to-obtain administrative warrant, which the executive branch itself provides.\n\nAnd they’ve also pushed to codify due process in other ways, given how much the Trump administration has sought to accelerate deportations, despite arecord of mistakeson this front.\n\nBut House Speaker Mike Johnson has called requiring judicial warrants “an unworkable proposal.” And the Trump administration has repeatedly argued that undocumented migrants shouldn’t get the same due process as citizens.\n\nWhat polls show: It seems Americans do believe people targeted by ICE should have the right to sufficiently challenge their deportations.\n\nAReuters-Ipsos pollin July showed Americans disagreed 50%-37% with the idea that suspected undocumented migrants aren’t entitled to due process.\n\nAnd aPublic Religion Research Institute pollin May showed Americans by a 61%-37% margin opposed deporting people to foreign prisons without due process, as the Trump administration has done.\n\nBody cameras appear to be a consensus issue, with a recent Quinnipiac University poll showing92% said they should be required. DHS recentlyannouncedthat agents would wear them.\n\nICE agents’ ability to wear masks is a more contentious debate between the parties. Democrats warn they give agents a sense of impunity, while the administration has said they are important to prevent “doxxing,” or sharing the agents’ personal information, which can lead to them being targeted.\n\nBut if the American people decided, the masks would be out.\n\nThe Quinnipiac poll showed registered voters said 61%-35% that masks shouldn’t be permitted. And the NBC poll showed 63% of Americans disapproved of masks. Notably, about twice as many strongly opposed masks (49%) as strongly approved of them (24%).\n\nRepublicans have argued that recent Supreme Court rulings have allowed immigration enforcement to target people based on how they look or what language they speak.\n\nRegardless, that doesn’t mean Americans are a fan of the policy. A Pew poll last month found72% of Americans said it was unacceptablefor immigration officers to use someone’s looks or language as a reason to check their immigration status.\n\nA much-shared video from Minneapolis showed a Border Patrol agent telling a man he asked for his paperwork “because of your accent.” And local police chiefs have cited possible instances of racial profiling, which DHS has denied.\n\nThe administration has rapidly expanded ICE thanks to an explosion of funding in Trump’s big agenda bill last year. It quickly became the highest funded federal law enforcement agency,by far.\n\nAnd Democrats have long worried that this could create an influx of insufficiently trained officers.\n\nIt’s difficult to measure how Americans feel about this specifically. But a Reuters-Ipsos poll this month showed80% of Americanssaid training and conduct standards were “extremely” (57%) or “very” (23%) important.\n\nDemocrats are pushing to create a new system for accountability for immigration enforcement. And Americans have indicated they are interested in increased oversight.\n\nPolling has repeatedly shown they don’t trust the administration to deliver that accountability — especially after it clearly sought toavoid a full-fledged investigationof the ICE officer who shot Good. (The administration has indicated it would conduct a more substantial investigation of Pretti’s death, after bipartisan calls for that.)\n\nAnIpsos polllast month, after Good’s killing, showed Americans said 59%-39% that they weren’t confident the investigation would be fair.\n\nLikewise, the Quinnipiac poll showed Americans said 61%-25% that the administration hadn’t given an honest account of Pretti’s killing.\n\nAnd a whopping 80% said there should be an “independent” investigation. Even a majority of Republicans (56%) supported that.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "impacts"
    },
    {
      "url": "https://www.whitehouse.gov/articles/2026/02/americans-overwhelmingly-support-deporting-criminal-illegals-local-cooperation-with-ice/",
      "text": "want undocumented immigrants to be deported"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/alex-pretti-shooting-minneapolis-crackdown-polls",
      "text": "the deportation effort has gone “too far.”"
    },
    {
      "url": "https://s3.documentcloud.org/documents/26948008/nbc-news-decision-desk-poll-jan-feb-2026-topline.pdf",
      "text": "NBC News-SurveyMonkey poll"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/politics/donald-trump-ice-politics",
      "text": "would be more “targeted.”"
    },
    {
      "url": "https://www.pewresearch.org/race-and-ethnicity/2025/03/26/views-on-deportations-and-arrests-of-immigrants-in-the-u-s-illegally/",
      "text": "Pew Research Center poll"
    },
    {
      "url": "https://www.pewresearch.org/politics/2025/06/17/americans-have-mixed-to-negative-views-of-trump-administration-immigration-actions/?utm_source=AdaptiveMailer&utm_medium=email&utm_campaign=25-06-17%20POL%20Immigration%20&%20GOP%20bill&org=982&lvl=100&ite=16340&lea=4426536&ctr=0&par=1&trk=a0DQm000006IkAbMAK",
      "text": "54% disapproved of workplace raids"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/ice-memo-warrantless-entry-what-we-know",
      "text": "without a judicial warrant"
    },
    {
      "url": "https://www.npr.org/2026/02/03/g-s1-108426/trump-kilmar-abrego-garcia-immigration-mistaken-deportations",
      "text": "record of mistakes"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2025-07/Reuters%20Ipsos%20Immigration%20and%20Epstein%20Files%20Topline%2007%2018%202025.pdf",
      "text": "Reuters-Ipsos poll"
    },
    {
      "url": "https://prri.org/spotlight/new-prri-poll-six-in-ten-americans-oppose-exporting-undocumented-immigrants-to-foreign-prisons-without-due-process/#:~:text=Those%20who%20live%20in%20the,May%2016%2D28%2C%202025",
      "text": "Public Religion Research Institute poll"
    },
    {
      "url": "https://poll.qu.edu/poll-release?releaseid=3946",
      "text": "92% said they should be required"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/politics/homeland-security-minneapolis-body-cameras-noem",
      "text": "announced"
    },
    {
      "url": "https://www.pewresearch.org/politics/2026/01/29/how-americans-see-immigration-officers-behaviors-and-civilian-actions/",
      "text": "72% of Americans said it was unacceptable"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/us/video/border-patrol-detain-citizen-accent-vrtc",
      "text": "because of your accent"
    },
    {
      "url": "https://www.politifact.com/factchecks/2025/jul/11/jon-favreau/ICE-FBI-bill-Donald-Trump-largest/",
      "text": "by far"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2026-02/Ipsos%20Poll%20on%20Immigration%20Feb%202026_2.pdf",
      "text": "80% of Americans"
    },
    {
      "url": "https://www.nytimes.com/2026/02/07/us/renee-good-investigation-minnesota-trump.html",
      "text": "avoid a full-fledged investigation"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2026-01/Ipsos%20Poll%20on%20ICE%20Shooting%20Topline%20January%202026_0.pdf",
      "text": "Ipsos poll"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/immigration-democrat-shutdown-demands-poll",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/immigration-democrat-shutdown-demands-poll",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6a2cf79316e438fca7216d735cea5b08c5ed1a76c71310fc398cd980081b4167",
  "scraped_at": "2026-02-14T07:06:42.901878+00:00"
}