{
  "url": "https://lite.cnn.com/2026/02/11/science/tyrannoroter-heberti-fossil-discovery",
  "title": "A football-size creature may have been among the earliest plant-eating land animals | CNN",
  "date": "2026-02-12T21:31:02.309867+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA chunky, squat creature that roamed Earth 307 million years ago is helping scientists understand how plant-eating animals first appeared on land. The newly described species is one of the earliest known tetrapods — or four-limbed animals — to show evidence of having a plant-based diet.\n\nThe discovery, detailed in a study that was published Tuesday in the journalNature Ecology & Evolution, centers on a skull found in a fossilized tree stump along the cliffs of Cape Breton Island in Nova Scotia. The species name, Tyrannoroter heberti, is a nod to the man who discovered the fossil, Brian Hebert, a local paleontology enthusiast.\n\n“It translates to ‘Hebert’s tyrant digger,’” said co-lead study author Dr. Arjan Mann. The name combines the Greek words for “tyrant” and “plough man,” since its snout was likely used for digging.\n\nThe finding reveals that the oldest four-limbed land animals likely started eating vegetation around the middle of the Carboniferous Period, pushing back the timeline for the emergence of plant-eating vertebrates. “That’s pretty shortly after tetrapods transitioned fully to land,” Mann said.\n\nUsing 3D scanning and printing, the team was able to study the fossil in remarkable detail. “It’s a way of digital preparation that allows us to visualize the skull and make 3D prints for our museum collections, for outreach, and to take around the world without risking the actual fossil,” explained Mann, curator of early tetrapods at Chicago’s Field Museum of Natural History.\n\nAfter studying the fossil and comparing it with skeletons of relatives, the researchers were able to determine that Tyrannoroter heberti was “a little big, chunky, cute, football-sized, reptile-like thing,” similar to ashingleback skink, which is a type of lizard, Mann said. But what set this creature apart were its teeth and skull.\n\nThe animal had a wide, heart-shaped skull and sizable teeth arranged in rows on the roof of its mouth and its lower jaw. These choppers fit together like puzzle pieces, allowing the animal to grind up tough, fibrous plants.\n\n“This massive amount of surface area on its palate, covered in large, robust teeth, is probably a key adaptation to herbivory,” explained Mann, referring to plant feeding.\n\nTo confirm its plant-based diet, the research team relied on CT scans and electron microscopes to identify wear facets — areas where the teeth grind together. “Other animals with similar wear facets are herbivores during later time periods,” Mann noted.\n\nThe new research shows plant-eating evolved earlier and in more animal groups than previously thought, said Michael Coates, professor of organismal biology and anatomy at the University of Chicago who was not involved in the study. The findings shed light on how early land ecosystems developed, according to Coates.\n\nHe also noted that Tyrannoroter’s rows of teeth were a leftover trait from its aquatic ancestors.\n\nThe study authors hypothesized that this early land animal initially fed on insects but over generations evolved into an herbivore.Coates agreed, adding that feasting on vegetation shortened the Tyrannoroter “food chain by cutting out insects as the ‘middlemen.’”\n\nThis dietary shift would have required more than specialized teeth. To digest stalky plants, Tyrannoroter and other early herbivores likely developed bigger, barrel-shaped bodies to accommodate larger guts. These expanded digestive systems would have supported robust gut microbes — tiny organisms that help break down plant material.\n\nThe broader significance of the find, Mann explained, is that it suggests four-limbed vertebrates rapidly evolved into herbivores after becoming full-time land dwellers, appearing sooner than scientists previously thought. “Modern terrestrial ecosystems have herbivore-dominated communities,” he said. “This animal shows that it’s almost as soon as animals were becoming terrestrialized, they were also experimenting with herbivory and potentially paving the way for the large-scale, widespread herbivory we see later.”\n\nThe findings also suggest that herbivory evolved independently in several different groups of early land vertebrates, not just in the ancestors of modern reptiles.\n\nClimate change may also have shaped ancient ecosystems, Mann noted. As the climate shifted from wet, mangrove-like forests to more arid environments, many early herbivores struggled to adapt and eventually disappeared. With the disappearance of flora that these species needed to survive, the animals became a “dead group walking,”  Mann explained. This may have been what drove the Tyrannoroter’s lineage to extinction, according to Mann.\n\nMany mysteries remain about early plant-eating animals and their place in the family tree. “I think that this study just scratches the surface and allows us that gateway to start studying tetrapods with this new perspective,” Mann said.\n\nAnd for aspiring paleontologists, Mann has a message. “The majority of questions left in early tetrapod evolution and vertebrate evolution are in front of us, not behind us,” he said. “New fossils change stories all the time, and this is the case of a new fossil coming to light and changing our entire perspective on the evolution of life on land.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nature.com/articles/s41559-025-02929-8",
      "text": "Nature Ecology & Evolution"
    },
    {
      "url": "https://australian.museum/learn/animals/reptiles/shingleback-lizard/",
      "text": "shingleback skink"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/science/tyrannoroter-heberti-fossil-discovery",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/science/tyrannoroter-heberti-fossil-discovery",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6a55183f2aae2393555d12841a04b5e51c16e8031437abb7f1aea6dbd3dc5217",
  "scraped_at": "2026-02-12T21:31:02.309881+00:00"
}