{
  "url": "https://lite.cnn.com/2026/02/25/australia/albanese-evacuates-residence-bomb-threat-shen-yun-intl-hnk",
  "title": "Australian Prime Minister evacuated from residence following bomb threat linked to banned Chinese dance group | CNN",
  "date": "2026-02-27T07:18:08.961094+00:00",
  "authors": [
    "Helen Regan"
  ],
  "text": "Source: CNN\n\nAustralian Prime Minister Anthony Albanese was forced to evacuate his official residence Tuesday night after a bomb threat was made against him by opponents of a religious organization that is banned in China.\n\nThe prime minister posted a photo of his dog, Toto, inside the Lodge, his residence in Canberra, to social media Wednesday, thanking Australian police and saying, “Toto on alert but all good.”\n\nHe later said such threats cannot be “taken for granted.”\n\n“I think it’s just a reminder, take every opportunity to tell people, turn the heat down for goodness sake. Like, you know, we can’t take these things for granted. Turn it down,” Albanese said during an event in Melbourne.\n\nThe bomb threats were made ahead of performances in Australia by Shen Yun, a classical Chinese music and dance group that is backed by the Falun Gong religious movement.\n\nThe Falun Gong emerged in China in the mid-1990s, surging in popularity before it was banned and brutally suppressed on the mainland for its protests against the Chinese government.\n\nTwo emails, written in Chinese and seen by CNN, threatened harm against the Australian prime minister if Shen Yun’s upcoming shows went ahead, and falsely claimed that explosives had been placed at Albanese’s residence.\n\nThe emails were sent to the dance group’s host organization, the Falun Dafa Association, on February 10 and February 22, according to a spokesperson for the group’s Australia branch.\n\n“All threats have been reported to Australian national security and law enforcement authorities. We appreciate the steps taken to ensure public safety and to protect elected officials, including the Prime Minister,” the Falun Dafa Association of Australia said in a statement.\n\n“The coordinated pattern of bomb threats, death threats, and systematic intimidation constitutes more than harassment — it reflects tactics consistent with state-sponsored intimidation designed to silence dissent beyond China’s borders.”\n\nAustralian Federal Police said it responded to an “alleged security incident” in the capital area at about 6 p.m. local time on Tuesday.\n\n“A thorough search of a protection establishment was undertaken and nothing suspicious was located,” a police spokesperson said. “There is no current threat to the community or public safety.”\n\nFinance Minister Katy Gallagher told Australia’s “Today” program that those working at the prime minister’s residence “had to be removed for a couple of hours until police searched it and ensured that it was safe for people to return.”\n\nThe emails threatening the Australian prime minister are similar to other emails received from local Shen Yun dance presenters in multiple countries over the past two weeks, including in South Korea, Denmark and Austria, Leeshai Lemish, a Shen Yun narrator based in the United States, told CNN.\n\nLemish said his group has tracked about 200 similar threats against them since March 2024 and they all follow a “pattern of harassment and sabotage of performances.”\n\nChina’s Ministry of Foreign Affairs said it “consistently opposed all kinds of violent attacks.”\n\n“It must be pointed out that the so-called Shen Yun performances are by no means normal cultural activities, but rather a political tool used by the Falun Gong organization to spread cult information and amass money,” ministry spokesperson Mao Ning said in a press briefing Wednesday.\n\nBeijing frequentlydenouncesFalun Gong as “a notorious anti-humanity, anti-society and anti-science cult, which has been outlawed by the Chinese government.”\n\nIn January, the Chinese consulates in Sydney and Melbourne issued statements attacking Shen Yun and urging Australians to avoid the group’s shows.\n\nThe Sydney Consulatewarnedthe performances were a “political tool used by ‘Falun Gong’ to exploit the Australian public’s appreciation of Chinese culture and respect for multiculturalism” by “disseminating anti-China narratives and cult ideology.”\n\nFalun Dafa describes itself as a “peaceful spiritual practice rooted in the Buddhist tradition” and its Shen Yun performing arts group has a “mission of reviving 5,000 years of traditional Chinese culture.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2020/07/18/asia/hong-kong-china-falun-gong-intl-hnk",
      "text": "denounces"
    },
    {
      "url": "https://sydney.china-consulate.gov.cn/eng/zlgdt/202601/t20260102_11796965.htm",
      "text": "warned"
    }
  ],
  "hash": "6b273a7f019125457227cf2700868c8f4201b0c1fd30800186874667c300982b",
  "scraped_at": "2026-02-27T07:18:08.961108+00:00"
}