{
  "url": "https://lite.cnn.com/2026/02/24/politics/washington-post-hannah-natanson-fbi-devices-seized",
  "title": "Judge bars Justice Department from searching through devices seized from Washington Post reporter as part of leak probe | CNN Politics",
  "date": "2026-02-25T07:31:39.610327+00:00",
  "authors": [
    "Devan Cole"
  ],
  "text": "Source: CNN\n\nThe Justice Department may not search through the contents of several devicesseized from a Washington Post reporterearlier this year as part of a probe into leaked classified documents, a federal judge said in a ruling Tuesday that was highly critical of the government’s approach in the case.\n\nThe decision fromMagistrate Judge William Porter, of the federal court in Alexandria, Virginia, is a remarkable turn of events some six weeks after he first gave the government permission to raid the reporter’s home to seize a phone, two computers and a Garmin watch.\n\nIn a 22-page ruling laying bare the judge’s concerns that investigators would use the search warrant he approved to peer into parts of the reporter’s data that are unrelated to the leak investigation, Porter said that giving them carte blanche to rummage through all of the data it seized “when probable cause exists for only a narrow subset … would authorize an unlawful general warrant.”\n\n“Given the documented reporting on government leak investigations and the government’s well-chronicled efforts to stop them, allowing the government’s filter team to search a reporter’s work product — most of which consists of unrelated information from confidential sources — is the equivalent of leaving the government’s fox in charge of the Washington Post’s henhouse,” he wrote.\n\nPorter rejected separate requests from lawyers for the reporter and DOJ attorneys to look through the devices and filter out information that is not subject to the search warrant, instead tasking the court with that responsibility.\n\n“To gather the information the government needs to prosecute its criminal case without authorizing an unrestrained search … the court will conduct the review itself,” he wrote.\n\nThe decision landed several days after lawyers for the reporter, Hannah Natanson, pressed Porter to issue an order that would require the government to return all of the devices it seized from her. They argued that investigators were violating her First Amendment rights by frustrating her ability to continue working on stories and communicating with more than 1,000 sources she’s developed covering President Donald Trump’s efforts to shrink the federal workforce.\n\n“No easy remedy exists here,” Porter wrote. Natanson’s “First Amendment rights have been restrained. The government seized all of Ms. Natanson’s work product, documentary material, and devices, terminating her access to the confidential sources she developed and to all the tools she needs as a working journalist. The government’s proposed remedy – that she simply buy a new phone and laptop, set up new accounts, and start from scratch – is unjust and unreasonable.”\n\nBut he went on to say that his “genuine hope is that this search was conducted – as the government contends – to gather evidence of a crime in a single case, not to collect information about confidential sources from a reporter who has published articles critical of the administration.”\n\nCNN has previously reported that Natanson is not under investigation. But her communications with a government contractor who was charged with illegally leaking classified information are what led prosecutors to ask Porter to approve a search warrant for her Virginia home earlier this year.\n\nThe contractor,Aurelio Luis Perez-Lugones, pleaded not guilty late last month to five counts of unlawfully transmitting national defense information to Natanson through an encrypted messaging application and a single count of unlawfully retaining the defense information.\n\nThe Washington Post said in a statement that it’s pleased with Porter’s “recognition of core First Amendment protections and its rejection of the government’s expansionist arguments for searching Hannah Natanson’s devices and work materials in their entirety and placing itself in charge of determining their relevance.”\n\nCNN has reached out to the Justice Department for comment.\n\nIn his decision Tuesday, Porter scolded Justice Department attorneys for failing to inform him of the applicability of a law meant to protect journalists from government searches and seizures when it asked him for permission to raid Natanson’s home – a move he described as “a matter of significant concern.”\n\nThe law, known as the Privacy Protection Act of 1980, establishes guardrails to prevent federal investigators from searching or seizing work product materials from a newsroom or journalist unless a reporter is themself the subject of a criminal investigation or prosecution.\n\nPorter said he was unaware of the law’s existence when he signed off on the search warrant, and he chided the government attorneys for deciding to not raise it with him last month when they sought approval for the raid.\n\n“The government’s failure to identify the PPA as applicable to a request for a search warrant on a member of the press – and to analyze it in its warrant application – is another matter,” he wrote. “This omission has seriously undermined the Court’s confidence in the government’s disclosures in this proceeding.”\n\nHad the government told him about the applicability of the law, Porter said, he may have rejected the search warrant request and instead told its lawyers to subpoena Natanson for the information it’s seeking.\n\n“At the very least, it would have asked more questions,” he wrote. “The government deprived the court of the opportunity to make those real-time decisions.”\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/media/fbi-hannah-natanson-washington-post-search-doj",
      "text": "seized from a Washington Post reporter"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/judge-rips-washington-post-fbi-reporter-warrant",
      "text": "Magistrate Judge William Porter"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/ex-government-contractor-charged-leaking-washington-post",
      "text": "Aurelio Luis Perez-Lugones"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/washington-post-hannah-natanson-fbi-devices-seized",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/washington-post-hannah-natanson-fbi-devices-seized",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6bae97f30fbd0c3e9fc50a58e4a3db94c6bab192d8b9d2838adfdc7129a840ef",
  "scraped_at": "2026-02-25T07:31:39.610338+00:00"
}