{
  "url": "https://lite.cnn.com/2026/02/23/business/china-trump-supreme-court-tariff-analysis-inl-hnk",
  "title": "The real winner from the Supreme Court’s tariff ruling? China | CNN Business",
  "date": "2026-02-24T07:31:06.607760+00:00",
  "authors": [
    "Analysis by John Liu, CNN"
  ],
  "text": "Source: CNN\n\nThe Supreme Court ruling that nullified global tariffs from United States President Donald Trump has created renewed uncertainty for many of its major trade partners – and a clear vindication for its biggest economic rival: China.\n\nThe dramatic rebuke to the US president’s trade agenda comes weeks before Trump is set to meet Chinese leader Xi Jinping for a crucial three-day summit in Beijing to discuss high-priority topics such as trade, technology and Taiwan.\n\nTariffs have been one of Trump’s go-to tools for economic negotiations with other nations. But on Friday, Supreme Court justices ruled that Trump had exceeded his authority in utilizing the International Emergency Economic Powers Act, or IEEPA, to impose broad tariffs on nearly all of its trade partners, including China.\n\nAfter the ruling, Trumpscrambled to re-implement global tariffs of 15%under a different trade act, which are temporary and require congressional approval after 150 days.\n\nWhile countries around the world awaited further clarity on the exact impact of the new tax rates, China has emerged as one of the biggest beneficiaries of the reductions. The Supreme Court’s decision has also effectively stripped away one of Washington’s most potent means of leverage over Beijing.\n\n“Under the current fragile balance between China and the US, Trump has now lost one card, while China still holds all of its cards,” said Hu Xijin, a pugnacious nationalist pundit and former editor-in-chief of the state-run tabloid Global Times, on Chinese social media Weibo.\n\nSome also saw the latest development as a vindication of China’s decision to retaliate to US tariffs in kind, giving it more negotiating power when Trump arrives in Beijing later this month.\n\nSince Trump launched an initial trade war in 2018, China has taken measures to insulate itself from the impact of further tariffs during his second term in office. It has diversified sources of good like corn andsoybeans, and responded to new tariffs from Washington by levying its own on all US imports.\n\nIn a sign of China’s growing leverage against the US, the country notched arecord trade surplus of $1.2 trillionlast year by redirecting exports to other countries.\n\nWhile key trading nations like Japan and South Korea scrambled to negotiate trade and investment deals worth hundreds of billions with the US in exchange for lower tariff rates, China’s status as an export powerhouse enabled it to stand its ground and retaliate instead.\n\nTariffs aside, Beijing has also utilized another potent pain point for the US: imposing restrictions on exports of rare earth minerals and magnets, pressuring Trump into concession with Xi. Chinadominates global processing of rare earths– materials essential for everything from everyday electronics and cars to big-ticket weapons such as F-35 fighter jets.\n\nOn Monday, Beijing said it is conducting a comprehensive assessment of the Supreme Court’s ruling and will closely monitor any alternative measures adopted by the Trump administration to maintain the levies, while safeguarding its national interests.\n\n“Facts have shown time and again that cooperation benefits both China and the US, while confrontation harms both. We urge the US to remove the unilateral tariffs imposed on its trading partners,” the Ministry of Commerce said in astatement.\n\nTrump’s meeting with Xi on March 31 will mark the first visit by a US president since he traveled to Beijing in 2017 during his first term, and could define US-China relations for the remainder of his term. Now, the balance of power in the face of what Beijing has called“unilateral bullying”seems to have shifted dramatically in its favor.\n\nAlthough the new tariffs lessen the economic burden of most Asian countries, “the biggest winner is China,” said Julian Evans-Pritchard, head of China economics at Capital Economics in a Monday research report. “It still faces a higher tariff than countries elsewhere in the region, but the gap has narrowed.”\n\nMorgan Stanley economists estimated in a Monday note that the new weighted average tariffs on Chinese goods would decline from 32% to 24%.\n\nWhile the Trump administration may seek other means to impose tariffs on China, such as by invoking other sections of the trade law based on unfair trade practices or national security concerns, they said the Supreme Court ruling likely meant that US tariffs on Asia “have likely peaked.”\n\n“These developments, particularly in light of President Trump’s upcoming visit to China, reinforce our view that the US-China trade truce remains fragile,” they said.\n\nWhile officials in Beijing have adopted a wait-and-see approach, Chinese pundits and academics have framed the Supreme Court ruling as a massive blow to Trump, who could face even more “chaos” as businesses demand refunds from tariffs paid since last year.\n\nCui Fan, a trade expert cited by state broadcaster CCTV-linked social media account, said China would not rule out making adjustments to its trade measures if the US lowers tariff rates. But he added that China would also consider corresponding measures should Washington impose new levies with other legal tools.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "scrambled to re-implement global tariffs of 15%"
    },
    {
      "url": "https://www.cnn.com/2025/04/13/business/american-farmer-china-trade-trump-intl-hnk-dg",
      "text": "soybeans"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/business/china-record-trade-surplus-despite-tariffs-intl-hnk",
      "text": "record trade surplus of $1.2 trillion"
    },
    {
      "url": "https://www.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk",
      "text": "dominates global processing of rare earths"
    },
    {
      "url": "https://www.mofcom.gov.cn/syxwfb/art/2026/art_809592ab82a343478f20ac13bd75fd27.html",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2025/04/02/business/china-trump-tariffs-intl-hnk",
      "text": "“unilateral bullying”"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/business/china-trump-supreme-court-tariff-analysis-inl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/business/china-trump-supreme-court-tariff-analysis-inl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6bae8496217205c2b4d04f24fd175b26d97858f7ee48d1734237e7c7eb20e055",
  "scraped_at": "2026-02-24T07:31:06.607774+00:00"
}