{
  "url": "https://lite.cnn.com/2026/02/19/politics/trump-banner-justice-department-building",
  "title": "Giant banner of Donald Trump hung at Justice Department headquarters | CNN Politics",
  "date": "2026-02-20T07:28:37.968666+00:00",
  "authors": [
    "Hannah Rabinowitz, CNN"
  ],
  "text": "Source: CNN\n\nA large banner of Donald Trump was hung outside of the Justice Department headquarters in Washington, DC, on Thursday, emphasizing the White House’s control over the nation’s top law enforcement branch that once pursued criminal prosecutions against the president.\n\nThe image of Trump in shades of blue is a remarkable addition to the storied Robert F. Kennedy Department of Justice Building, which is occupied by a department that traditionally has made painstaking efforts to separate itself from politics.\n\nSince Trump retook office last year, the Justice Department has faced repeated accusations of targeting the president’s perceived enemies on his behalf. Those prosecutions include that of former FBI Director James Comey, New York Attorney General and Letitia James, as well as investigations into Federal Reserve Chair Jerome Powell and several Democratic representatives who recorded a video urging service members to disobey any illegal orders.\n\nSimilar banners of Trump’s face have been draped across other federal departments including the Department of Labor and the Department of Agriculture, each with their own text: “American workers first” and “growing America,” respectively.\n\nThe new sign at the Justice Department reads “make America safe again,” the slogan of the Trump administration’s violent crime crackdown.\n\nThe Trump Justice Department has repeatedly stated that its investigations under Trump are not political, and said that the department is course-correcting from alleged “weaponization” under the previous administration.\n\nChief among their examples are the two federal criminal cases brought against Trump by former specialJack Smithforretaining classified documentsin his home at Mar-a-Lago and for his alleged role in instigating the 2021 Capitol riot. The classified documents case was dismissed by a judge, and the election interference case was dropped when he won election in November 2020.\n\n“We are proud at this Department of Justice to celebrate 250 years of our great country and our historic work to make America safe again at President Trump’s direction,” a Justice Department spokesperson said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/jack-smith-trump-house-testimony-01-22-26",
      "text": "Jack Smith"
    },
    {
      "url": "https://www.cnn.com/2024/07/15/politics/classified-documents-case-trump-dismissed-aileen-cannon",
      "text": "retaining classified documents"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-banner-justice-department-building",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/trump-banner-justice-department-building",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6bbe5651a206daf170916c8bd63c87731cbc30c382a065c73ed90e4bc3fca58e",
  "scraped_at": "2026-02-20T07:28:37.968680+00:00"
}