{
  "url": "https://lite.cnn.com/2026/02/12/tech/russia-whatsapp-social-media-clampdown-intl",
  "title": "Russia says it has blocked WhatsApp amid wider clampdown on social media | CNN Business",
  "date": "2026-02-12T21:30:02.605040+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nRussia has confirmed that it has blocked instant messaging app WhatsApp in the country, instead directing Russian citizens to use its state-backed Max app.\n\nThe news comes days after it emerged that Russian authorities wererestricting accessto Telegram, another instant messaging app that is used by millions of people in Russia, including the military, top-level public officials, state media services and government bodies, such as the Kremlin and Roskomnadzor, the communications regulator.\n\nKremlin spokesperson Dmitry Peskov told journalists Thursday that the decision to block WhatsApp was made due to what he called violations of the law by the app’s parent company, without elaborating.\n\n“Max is an affordable alternative on the market for citizens, a developing national messenger. Regarding the blocking of WhatsApp, our authorities did indeed state that the decision was made and implemented due to the corporation’s unwillingness to comply with the law,” Peskov said.\n\nWhatsApp is owned by Meta (META), which also owns Facebook and Instagram.\n\nEarlier on Thursday, WhatsApp put out a statement saying the Russian government had “attempted to fully block WhatsApp.” WhatsApp described it as an effort to “drive people to a state-owned surveillance app.”\n\nThe statement added: “Trying to isolate over 100 million users from private and secure communication is a backwards step and can only lead to less safety for people in Russia. We continue to do everything we can to keep users connected.”\n\nCNN has contacted Meta to ask whether WhatsApp is now indeed fully blocked in Russia.\n\nSome users in Russia reported Thursday being able to access WhatsApp using a VPN. But the Kremlin has increasingly cracked down on VPNs across the country, including restricting access to 439 VPN services in order to prevent the bypassing of state restrictions. In September, a law came into force banning the advertising of VPNs and other means of bypassing blocks on social media.\n\nThis is not the first time Russia has gone after the app. In August 2025, Roskomnadzor – a federal agency responsible for monitoring and controlling the country’s mass media – announced restrictions on video and voice calls via WhatsApp and Telegram “in order to counter criminals.” WhatsApp, in its turn, accused Russia of attempting to block access to the app for its Russian users.\n\nRussia has already banned Facebook, Instagram and X.\n\nMax is a homegrown messenger that Russia ispre-installingon all new devices as part of a broader push to replace foreign platforms.\n\nSimilarly to China’s WeChat, it is designed as an all-in-one super-app combining messaging, calls, payments and other services, allowing users to authenticate their identity for government platforms that provide public services. Critics have raised safety and privacy concerns about Max, warning that the app has excessive tracking capabilities and lacks strong encryption.\n\nOn Tuesday, the Russian government said it was restricting access to Telegram for the “protection of Russian citizens,” accusing the app of refusing to block content authorities consider “criminal and terrorist.”\n\nThe app’s Russian-born founderPavel Durovsaid in a statement that day that Russia’s attempts to restrict Telegram would fail, writing that “Telegram stands for freedom of speech and privacy, no matter the pressure.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/europe/telegram-ban-russia-web-block-latam-intl",
      "text": "restricting access"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/META",
      "text": "META"
    },
    {
      "url": "https://www.cnn.com/2025/08/21/tech/max-messenger-app-russia-smartphones-intl",
      "text": "pre-installing"
    },
    {
      "url": "https://www.cnn.com/2024/08/27/tech/pavel-durov-telegram-kremlin-intl",
      "text": "Pavel Durov"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/tech/russia-whatsapp-social-media-clampdown-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/tech/russia-whatsapp-social-media-clampdown-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6c087207c33610d51a851cef50762f06a12c70e35626a5c1c60080ed68c21fbf",
  "scraped_at": "2026-02-12T21:30:02.605053+00:00"
}