{
  "url": "https://lite.cnn.com/2026/02/25/politics/chatgpt-china-intimidation-operation",
  "title": "A Chinese official’s use of ChatGPT accidentally revealed a global intimidation operation | CNN Politics",
  "date": "2026-02-26T07:31:49.640509+00:00",
  "authors": [
    "Sean Lyngaas"
  ],
  "text": "Source: CNN\n\nA sprawling Chinese influence operation — accidentally revealed by a Chinese law enforcement official’s use ofChatGPT— focused on intimidating Chinese dissidents abroad, including by impersonating US immigration officials, according to a new report from ChatGPT-maker OpenAI.\n\nThe Chinese law enforcement official used ChatGPT like a diary to document the alleged covert campaign of suppression, OpenAI said. In one instance, Chinese operators allegedly disguised themselves as US immigration officials to warn a US-based Chinese dissident that their public statements had supposedly broken the law, according to the ChatGPT user. In another case, they describe an effort to use forged documents from a US county court to try to get a Chinese dissident’s social media account taken down.\n\nThe report offers one of the most vivid examples yet of how authoritarian regimes can use AI tools to document their censorship efforts. The influence operation appeared to involve hundreds of Chinese operators and thousands of fake online accounts on various social media platforms, according to OpenAI.\n\n“This is what Chinese modern transnational repression looks like,” Ben Nimmo, principal investigator at OpenAI, told reporters ahead of the report’s release. “It’s not just digital. It’s not just about trolling. It’s industrialized. It’s about trying to hit critics of the CCP [Chinese Communist Party] with everything, everywhere, all at once.”\n\nCNN has requested comment on the report from the Chinese Embassy in Washington, DC.\n\nChatGPT served as a journal for the Chinese operative to keep track of the covert network, while much of the network’s content was generated by other tools and spread through social media accounts and websites. OpenAI banned the user after discovering the activity.\n\nOpenAI’s investigators were able to match descriptions from the ChatGPT user with real-world online activity and impact. The user described an effort to fake the death of a Chinese dissident by creating a phony obituary and photos of a gravestone and posting them online. False rumors of the dissident’s death did indeed surfaced online in 2023,accordingto a Chinese-language Voice of America article.\n\nIn another case, the ChatGPT user asked the AI agent to draw up a multi-part plan to denigrate the incoming Japanese prime minister, Sanae Takaichi, in part by fanning online anger about US tariffs on Japanese goods. ChatGPT refused to respond to the prompt, according to OpenAI. But in late October, as Takaichi took power, hashtags emerged on a popular forum for Japanese graphic artists attacking her and complaining about US tariffs, according to OpenAI.\n\nThe report comes amid a battle between the US and China for supremacy over AI. At stake is how the technology is used on the battlefield and in the boardroom of the world’s two biggest economies.\n\nThe Pentagon is in a standoff with another prominent AI company, Anthropic, over the use of its AI model. Defense Secretary Pete Hegseth hasgivenAnthropic CEO Dario Amodei a Friday deadline to comply with demands to peel back safeguards on its AI model or risk losing a lucrative Pentagon contract.\n\nThe report from OpenAI “clearly demonstrates the way that China is actively employing AI tools to enhance information operations,” Michael Horowitz, a former Pentagon official focused on emerging technologies, told CNN.\n\n“US-China AI competition is continuing to intensify,” said Horowtiz, who is now a professor at the University of Pennsylvania. “This competition is not just taking place at the frontier, but in how China’s government is planning and implementing the day-to-day of their surveillance and information apparatus.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/01/16/tech/chatgpt-ads-openai",
      "text": "ChatGPT"
    },
    {
      "url": "https://www.voachinese.com/a/7323197.html",
      "text": "according"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/tech/hegseth-anthropic-ai-military-amodei",
      "text": "given"
    }
  ],
  "hash": "6c83734d5c657952a9dc2907ee016fa4b85e27bd8c76b3351671f1a795f1a96f",
  "scraped_at": "2026-02-26T07:31:49.640521+00:00"
}