{
  "url": "https://lite.cnn.com/2026/02/22/politics/supreme-court-tariffs-major-questions-doctrine-gorsuch-kavanaugh-kagan",
  "title": "Supreme Court conservatives were united against Biden. Here’s why they split against Trump. | CNN Politics",
  "date": "2026-02-24T07:33:04.649208+00:00",
  "authors": [
    "John Fritze, CNN"
  ],
  "text": "Source: CNN\n\nOn the surface, the Supreme Court’s massive decision shutting downDonald Trump’s sweeping tariffswas a case about the president’s power to pursue a global economic agenda and levy what the majority said amounted to a$134 billion tax on Americanconsumers.\n\nBut just below the court’s bottom-line repudiation of Trump’s tariffs, a testy debate unfolded among the court’s conservative justices about a little understood — and often criticized — legal theory knownas the “major questions doctrine.”It is a fight that could have enormous consequences for the remainder of Trump’s term, and beyond.\n\nIn an opinion running more than twice as long as the 21 pagesChief Justice John Robertsused to resolve the case, Justice Neil Gorsuch took his colleagues on the left and the right to task for their views of the doctrine, which stipulates that Congress “speak clearly” when it is granting a president power to deal with matters of “major” economic or political significance.\n\nThe Supreme Court, therefore, may say that presidents can’t find a specific and significant power in an ambiguous law.\n\nRoberts also pushed back on an idea raised by Justices Brett Kavanaugh, Samuel Alito and Clarence Thomas that Congress intended to give presidents flexibility with broad language. It is precisely in cases dealing with major issues, the chief justice wrote, that the court should be skeptical of sweeping claims of presidential power.\n\n“There is,” Roberts wrote, “no major questions exception to the major questions doctrine.”\n\nThe spirited back-and-forth may explain why thetariffs case took months for the court to resolve, and it exposed rifts that could prove meaningful for Trump and for future presidents.\n\nConservatives seemed united about how the major questions doctrine worked when they were applying it to a Democratic president. They cited it to invalidate President Joe Biden’s policies — including hisstudent loan forgivenessprogram, environmental policies and his responses to theCovid-19 pandemic.\n\nBut those same justices were nevertheless deeply divided Friday about its use when it came to Trump’s tariffs.\n\nThree conservatives in dissent claimed it didn’t apply, three liberals in the majority said it wasn’t needed and two conservatives spent dozens of pages debating what, exactly, it is.\n\n“Past critics of the major questions doctrine do not object to its application in this case,” Gorsuch, who was Trump’s first nominee to the high court yet voted against the president Friday, wrote of the three-justice liberal wing that also declared the tariffs illegal.\n\n“Still others who have joined major questions decisions in the past dissent from today’s application of the doctrine,” he wrote of the three conservative justices who would have allowed Trump to continue his tariffs. “It is an interesting turn of events.”\n\nIn the end, a combination ofconservative and liberal justices concludedthat the 1977 emergency powers law Trump relied on to impose his sweeping tariffs did not give him the authority to do so. The president has other authorities to levy those duties and made clear in a combative press conference hours after the court’s decision that he would quicklyturn to those other laws.\n\n“When Congress grants the power to impose tariffs, it does so clearly and with careful constraints,” Roberts wrote. “It did neither here.”\n\nThe doctrine has long been criticized, especially from the left, as a judge-invented theory that can be applied inconsistently. The bickering in Friday’s decision about how — and whether — the theory applied to Trump will do little to ease that skepticism.\n\n“The internal division among the Republican appointees over just how powerful a tool it is,” said Steve Vladeck, CNN Supreme Court analyst and professor at Georgetown University Law Center, “is likely to matter even more for presidents after Trump than for the rest of this administration — assuming that presidents of both parties continue to have to rely upon old statutes to implement their domestic agendas rather than new ones.”\n\nIn 2023, the court relied on the doctrine to blockBiden’s student loan forgiveness plan. The Democrat had attempted to forgive student loans via a law that allowed the Education Department to “waive or modify” rules tied to financial assistance programs.  That language, the court ruled withsix conservatives in the majority, wasn’t clear enough to authorize the cancellation of $430 billion in debt.\n\nTwo years earlier, the court ruled that a 1944 public health law that allows the government to impose quarantines did not empower the Biden administration to enforce a nationwide eviction moratorium during the Covid-19 pandemic.\n\nIn the tariffs decision, Gorsuch embraced the most robust view of the doctrine, accusing fellow conservative Justice Amy Coney Barrett of putting a “gloss” on it that would render it unworkable. He blamed the three dissenting conservatives of carving out exceptions that would lead to outcomes “hard to reconcile with the Constitution.”\n\nGorsuch also said that the court’s three liberals had repeatedly criticized the doctrine’s use during the Biden administration but that their reasoning for opposing Trump’s tariffs seemed suspiciously similar.\n\nBarrett — who also voted against Trump — fired back that Gorsuch was targeting a “straw man” and suggested his approach might “veer beyond interpretation and into policymaking.”\n\nJustice Elena Kagan, writing for the court’s three-justice liberal wing, balked at Gorsuch’s hint of hypocrisy.\n\n“Given how strong his apparent desire for converts, I almost regret to inform him that I am not one,” Kagan wrote in a footnote.\n\n“But that,” she said, “is the fact of the matter.”\n\nThe skirmishes among conservatives are particularly fascinating because it was the modern conservative legal movement that brought the major questions doctrine to the forefront.\n\nWhen the majority relied on the theory in a2022 decision that kneecapped Biden’sability to regulate power plant emissions, Kagan lamented in dissent that “canons like the ‘major questions doctrine’ magically appear as get out-of-text-free cards.” Kagan’s point was that justices who proclaim to rely on the clear text of a law, in her view, would use the doctrine to get their desired result.\n\nStephanie Barclay, a Georgetown law professor who clerked for Gorsuch, said the debate among the justices showed they were “doing the hard work of theorizing” the major questions doctrine. That kind of sustained engagement, she said, is a sign of a legal approach that is “maturing and deepening.”\n\nAnd in the end, she noted, the doctrine was key to Roberts’ majority opinion.\n\n“One of the most important things about this decision is what it tells us about the major questions doctrine’s neutrality,” Barclay said. “The major questions doctrine is not about who occupies the White House; it is about whether the person who occupies the White House can claim powers that Congress never clearly granted.”\n\nOn the other hand, six of the justices — three conservatives and three liberals — claimed the doctrine didn’t apply at all.\n\nWriting for the dissenters, Kavanaugh found an exception from the major questions doctrine because the case implicated foreign policy, an area where courts have often deferred to a president’s authority.\n\n“The court hasneverbefore applied the major questions doctrine in the foreign affairs context, including foreign trade,” Kavanaugh wrote. In those cases, Trump’s second nominee to the high court said, “courts read the statute as written and do not employ the major questions doctrine as a thumb on the scale against the president.”\n\nKavanaugh, more than any other justice, drew heavy praise from Trump on Friday for his approach to the tariffs case. The president applauded Kavanaugh’s “genius and his great ability” and said he was “very proud of that appointment.”\n\nTrump’s other nominees to court who voted against him, Gorsuch and Barrett, the president said, were an “embarrassment to their families.”\n\nStill, at times Kavanaugh’s position sounded like the same arguments Biden made to defend his policies. Kavanaugh said that federal trade law Trump used was intended to “provide flexibility” to the president “to address the unusual and extraordinary threats specified in a declared national emergency.”\n\nFormer Solicitor General Elizabeth Prelogar, defending the Biden administration’s eviction moratorium during the pandemic, wrote that the law at issue in that case was designed to provide “flexibility needed to address new threats to public health as they emerge.”\n\nBut as both conservative and liberal justices often suggest in their writing, the most dependable way for Congress to grant power to a president — regardless of that president’s party — is to enact a law that makes their intentions clear.\n\n“If history is any guide,” Gorsuch wrote, “the tables will turn and the day will come when those disappointed by today’s result will appreciate the legislative process for the bulwark of liberty it is.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "Donald Trump’s sweeping tariffs"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
      "text": "$134 billion tax on American"
    },
    {
      "url": "https://www.cnn.com/2025/05/29/politics/tariffs-major-questions-doctrine-supreme-court",
      "text": "as the “major questions doctrine.”"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/chief-justice-john-roberts-tariffs-analysis",
      "text": "Chief Justice John Roberts"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/where-is-supreme-court-ruling-on-trump-tariffs",
      "text": "tariffs case took months for the court to resolve"
    },
    {
      "url": "https://www.cnn.com/2023/06/30/politics/supreme-court-student-loan-forgiveness-biden",
      "text": "student loan forgiveness"
    },
    {
      "url": "https://www.cnn.com/2021/08/26/politics/supreme-court-eviction-moratorium",
      "text": "Covid-19 pandemic."
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf",
      "text": "conservative and liberal justices concluded"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/donald-trump-tariffs-economic-agenda",
      "text": "turn to those other laws"
    },
    {
      "url": "https://www.cnn.com/2023/06/30/politics/supreme-court-student-loan-forgiveness-biden",
      "text": "Biden’s student loan forgiveness plan"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/22pdf/22-506_nmip.pdf",
      "text": "six conservatives in the majority"
    },
    {
      "url": "https://www.cnn.com/2022/06/30/politics/supreme-court-climate-change-epa-regulations",
      "text": "2022 decision that kneecapped Biden’s"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/supreme-court-tariffs-major-questions-doctrine-gorsuch-kavanaugh-kagan",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/supreme-court-tariffs-major-questions-doctrine-gorsuch-kavanaugh-kagan",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6d0250e92a2be7fae83cd3aa74b2babab289e2f4efd827d5eb1c18bf4d79d269",
  "scraped_at": "2026-02-24T07:33:04.649220+00:00"
}