{
  "url": "https://lite.cnn.com/2026/02/12/politics/new-judicial-ethics-code-illegitimate-attacks",
  "title": "New judicial ethics code says judges may speak out against ‘illegitimate’ attacks | CNN Politics",
  "date": "2026-02-13T07:31:03.901365+00:00",
  "authors": [],
  "text": "Source: CNN\n\nNewlyreleased ethics guidancefor the federal judiciary makes clear that judges can speak out against “illegitimate forms of criticism and attacks.”\n\nThe guidance comes as judges have been targeted with smears by President Donald Trump and allies for their rulings against administration policies. Judges have spoken publicly about violence or threats of violence faced by them, their families and their staff, including the 2020 fatal shooting of the son of a federal judge.\n\nJudicial ethics rules, the new opinion says, “affirm that judges may choose to engage in a wide range of civic engagement activities, including speaking and writing on core judiciary matters such as advocacy for the rule of law and judicial independence.”\n\n“At the same time, judges should always exercise caution when expressing their personal views to preserve the integrity of the judiciary and to promote public confidence in the courts,” the new opinion says.\n\nThe ethics advisory cites the 2024 year-end report by Chief JusticeJohn Roberts that emphasized judicial independence and said that violence, intimidation, disinformation and threats to defy court orders all qualify as “illegitimate” forms of judicial attack.\n\nRoberts himself issued a noteworthy statement last year, amid calls by Trump and his allies for the impeachment of a federal judge for his ruling against a Trump immigration initiative, that said “impeachment is not an appropriate response to disagreement concerning a judicial decision.”\n\nMore recently, the chief judge of the federal court in Minnesota wrote a pair of extraordinary letters to the appeals court that oversees him decrying how the Justice Department had handled a dispute over warrants it sought from his court for ICE protestors who disrupted a church service.\n\nGabe Roth, who leads the court reform group Fix the Court, praised the new ethics opinion in a statement.\n\n“Though individuals are not called out by name, this is a strong rebuke of the Trump administration’s ‘war’ on the judiciary and comes one day after Attorney General Bondidenounced‘liberal activist judges’ for taking part in ‘coordinated […] unlawful attack’ against President Trump’s ‘authority.’ Any judge who, in a measured manner, seeks to counter that nonsense would thus be ethically sound,” Roth said.\n\nIn court decisions, some judges have also pushed back at the administration’s hostility towards the judiciary. Fourth Circuit Judge Harvie Wilkinson – in a decision concerning Kilmar Abrego Garcia, the migrant the administration wrongly sent to an el Salvadorian prison – warned, “The respect that courts must accord the Executive must be reciprocated by the Executive’s respect for the courts.”\n\n“Too often today this has not been the case, as calls for impeachment of judges for decisions the Executive disfavors and exhortations to disregard court orders sadly illustrate,” he wrote in theApril opinion.\n\nThe new ethics language does not specifically point to the current environment. It instead leaned on past ethics commentary and said that “the Committee believes the Code and its previous advisory opinions leave room, in at least some circumstances, for the measured defense of judicial colleagues from illegitimate forms of criticism and attacks that risk undermining judicial independence or the rule of law, whether or not they rise to the level of persecution.”\n\nThe new opinion obliquely referenced the growing willingness of judges to speak to reporters without attribution, telling judges “that considerations of tone, context, and form should inform a judge’s assessment concerning the propriety of civic engagement and judicial speech in general—including speech not intended for public attribution to the judge.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.uscourts.gov/sites/default/files/document/guide-vol02b-ch02.pdf",
      "text": "released ethics guidance"
    },
    {
      "url": "https://www.youtube.com/live/3H14-fPGtvM?si=F8K8o_A8Q5ypni7g&t=1466",
      "text": "denounced"
    },
    {
      "url": "https://www.ca4.uscourts.gov/docs/pdfs/251404order.pdf?sfvrsn=b404b209_2",
      "text": "April opinion"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/new-judicial-ethics-code-illegitimate-attacks",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/new-judicial-ethics-code-illegitimate-attacks",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6d2b9deaf7b59c681920493645aaa0a58f33e6e5b73109186c507af0bf4b064b",
  "scraped_at": "2026-02-13T07:31:03.901377+00:00"
}