{
  "url": "https://lite.cnn.com/2026/02/13/politics/trump-kelly-hegseth-epa-dhs-tariffs-analysis",
  "title": "Analysis: How the anti-Trump resistance is slowly stirring | CNN Politics",
  "date": "2026-02-13T07:30:45.321073+00:00",
  "authors": [],
  "text": "Source: CNN\n\nDonald Trump, whoonce claimed, “I have the right to do whatever I want as president,” isn’t always getting it all his own way anymore.\n\nThe president hasn’t repudiated his quest for total power. But he’s beginning to hit small but significant pockets of rebellion.\n\nEvery week, more people show they are less frightened of the president. That even includessome Republicans. Some of Trump’s most cherished policies and personal goals face increasing disruption from political action, the courts, individual citizens and the inexorable gravity of electoral politics.\n\nOn Thursday, Trump’s border czarTom Homan announcedthe end of the surge of thousands of federal officers to Minnesota. He insisted the countrywide deportation crackdown would not relent and that the force had achieved its goals, including by making more than4,000 arrests. Yet its departure and the step back from the most aggressive on-the-street tactics still represented a reversal. It followed weeks of protests and public outrage over the broad-daylight killings of two Americans, Renee Good and Alex Pretti. The politics of the purge in Minnesota are simply no longer sustainable\n\nMinnesota’s Democratic Gov. Tim Walz on Thursday declared the end of what he called an “unprecedented federal invasion.” And he saw a broader meaning in the end of a confrontation that he said caused huge economic and societal damage. “I think it’s probably safe to say the rest of the country will be forever grateful because we showed what it means to stand up for what’s right,” Walz said.\n\nThe courts have been another reliable brake on Trump’s power grabs, even if the administration has won its share of big decisions.\n\nIn Washington on Thursday,a judge shut downDefense Secretary Pete Hegseth’s bid to punish retired Navy captain and Arizona Democratic Sen. Mark Kelly for “sedition” — one of the most grievous charges that can be laid against anyone. (Hegseth said the administration would “immediately” appeal the decision.)\n\n“However hard the Trump administration may fight to punish me and silence others, I will fight ten times harder. This is too important,” Kelly said in a statement. The ruling came after a grand jury had separately refused to sign off ona Justice Department indictmentagainst Kelly and five other Democratic lawmakers who are also military or intelligence veterans over a video advising troops not to follow illegal orders.\n\nSometimes, a scent of rebellion can be catching.\n\nSix Republicans just defied their party’s leadership and voted with Democrats in the House torepeal the president’s tariffs on Canada— reflecting growing anxiety about the cost of his 19th century-style trade policies.\n\nThree GOP members also joined Democrats to thwart House Speaker Mike Johnson’s effort toblock future voteson Trump’s tariffs. The twin trade showdowns underscored the fact that on some issues, the president can no longer count on a functioning majority in the tightly divided House. And they followed a much broader revolt against the president late last year that forced the Department of Justice to release theJeffrey Epstein files, extending a controversy that is infuriating the president — but that he cannot end, in another sign of his waning political alchemy.\n\nSmall victories for Trump’s opponents aren’t going to buckle his presidency in the short term. But they suggest regular rules of politics still apply to a president who acted with shock-and-awe dexterity earlier in his second term. The president’s poor polling is only encouraging his opponents. In theCNN Poll of Polls average, his approval rating is stuck at 39%.\n\nMultiple administration programs have been slowed or blocked in the courts — some by Republican-appointed judges. Democrats are trying again to assert leverage on Capitol Hill despite lacking the control of any branch of government in a showdown over ICE tactics that couldshut down the Department of Homeland Securityat the end of the week.\n\nAbroad, allies are working out how to live without America and the policies of its“demolition” man president, as Trump was described by a report issued ahead of the annual Munich Security Conference this weekend. Canadian Prime Minister Mark Carney wants the world’s “middle powers” to stand up to bullying great powers.\n\nOutgoing Federal Reserve Chairman Jerome Powell has refused Trump’s relentless pressure to slash interest rates and shatter the central bank’s independence. And artists and performers have been boycotting the Kennedy Center in protest ofTrump’s takeoverof the arts behemoth on the Potomac.\n\nStill, Trump retains enormous power at home. He flexed it Thursday by revoking the Environmental Protection Agency’s capacity tofight greenhouse gasesin a move set to destroy the Obama and Biden administrations’ climate legacies. And the firing of the government’s antitrust chiefAbigail Slater, who has been pushing for tougher scrutiny of the tech titans whom Trump has welcomed into his kinglike court, will fuel new anxiety over rising corruption in the economy.\n\nAnd Trump wasn’t far wrong when he told the New York Times that the only thing that could rein in his considerable powers in foreign policywas his “morality.”The US raid to extract Venezuelan dictator Nicolás Maduro highlighted enormous power at Trump’s fingertips as commander-in-chief.\n\nBut for all the talk on liberal media that Trump is a tyrant, America’s system of republican government still shields dissent that the administration has tried so hard to suppress — including through its attacks on the media.\n\n“I don’t expect the average person to do acts of regular bravery every single day,” Democratic Sen. Elissa Slotkin told CNN’s Anderson Cooper on Wednesday. “I’m asking you to do a couple inches more than you’re used to doing because, I think, while fear can be contagious, so is courage,” said Slotkin — another of the Democrats who escaped indictment this week.\n\nSlotkin’s argument rests on the conceit that once people begin to understand that Trump is not as omnipotent as his carefully constructed personality cult claims, his mystique will inevitably wane.\n\nThe president seems to understand this, given his regular shows of dominance and efforts to cultivate a strongman’s aura.\n\nAll second-term presidents experience an ebbing of influence as the end of their constitutionally stipulated mandate looms and as fellow politicians and voters begin to think about life after they have left the scene.\n\nBut the outburst of commentary before Christmas that portrayed Trump as a lame duck already was probably premature. His response was frenetic, and included the assault on Venezuela and the announcement of the surge of federal officers into Minnesota. The president’s extremely broad vision of his constitutional authority means that he’s certain to continue pushing the limits of his office. The moment of his greatest threat, after all came after he’d lost the 2020 election to Joe Biden.\n\nTrump’s control over his own party remains robust despite some recent defections on Capitol Hill. GOP lawmakers who want to keep their job can’t ignore the affection in which he’s held by their base voters. And with the midterm elections looming in November, Trump has leverage.\n\n“Any Republican, in the House or the Senate, that votes against TARIFFS will seriously suffer the consequences come Election time, and that includes Primaries!” Trump threatened on social media this week.\n\nYet those same midterm elections are looking increasingly perilous for Republicans who may be dragged down by Trump’s national unpopularity. Ultimately, more lawmakers may begin to reason that to save themselves, or their constituents, they have no choice but to break with the president more often.\n\nTrump’s presidential power will sustain him in the short term. There is no indication, for instance, of a veto-proof majority in either the House or the Senate that could ultimately force him to ditch his trade wars.\n\nBut some Republicans who rebelled against Trump on the Canada tariff vote argued that the tariffs were punishing farmers and steel workers whom they represent. “At the end of the day, I looked at the Constitution, I looked at what was in the best interest of my district, and I took the vote,” Colorado Republican Rep. Jeff Hurd told CNN’s congressional team.\n\nA New York Fed report released Thursday found thatUS businesses and consumerspaid nearly 90% of the cost of Trump’s tariffs last year, debunking the president’s fantasy that they are enriching the country. The findings point to another constraint on Trump’s power — reality. The consequences of his failure to lower prices as many voters hoped in 2024 could supersede all his claims that his rejection of the global trading system is making people’s lives better. This would be bad news for Republican candidates in November.\n\nFor now, Trump appears stronger than many of his critics hoped, but weaker than he thinks he is. But small political shifts now could augur bigger ones in the months to come. After all, Trump’s MAGA movement started small — with one reality star who no one took seriously descending a golden escalator in 2015.\n\nDemocrats hope they are seeing the seeds of a realignment.\n\n“I’m just asking folks just to realize that if we all do a half an inch more, to just call balls and strikes on this administration, it is contagious and it helps turn the tide,” Slotkin told CNN’s Cooper.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2020/05/29/politics/donald-trump-twitter-power-personal-whims",
      "text": "once claimed"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/republicans-congress-trump-legislative-branch",
      "text": "some Republicans"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "Tom Homan announced"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/us/video/homan-minneapolis-operation-juliette-kayyem-intv-021209aseg1-cnni-us-fast",
      "text": "4,000 arrests"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/mark-kelly-pentagon-lawsuit-ruling",
      "text": "a judge shut down"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
      "text": "a Justice Department indictment"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/house-republicans-trump-canada-tariff-vote",
      "text": "repeal the president’s tariffs on Canada"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
      "text": "block future votes"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "Jeffrey Epstein files"
    },
    {
      "url": "https://www.cnn.com/polling/approval/trump-cnn-poll-of-polls",
      "text": "CNN Poll of Polls average"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/dhs-shutdown-white-house-democrats-ice",
      "text": "shut down the Department of Homeland Security"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/europe/trump-munich-security-conference-report-intl-hnk",
      "text": "“demolition” man president"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/americas/canada-greenland-trump-analysis-latam-intl",
      "text": "middle powers"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/kennedy-center-trump-close",
      "text": "Trump’s takeover"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/climate/trump-repeals-epa-endangerment-finding",
      "text": "fight greenhouse gases"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/doj-antitrust-chief-fired",
      "text": "Abigail Slater"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/politics/trump-ice-shooting-venezuela-greenland-analysis",
      "text": "was his “morality.”"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/business/trump-tariffs-consumers-nightcap",
      "text": "US businesses and consumers"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/trump-kelly-hegseth-epa-dhs-tariffs-analysis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/trump-kelly-hegseth-epa-dhs-tariffs-analysis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6d36f9f1159979e0775303e39473b93c78e77e07a22623ea3284dfcf70f065bf",
  "scraped_at": "2026-02-13T07:30:45.321085+00:00"
}