{
  "url": "https://lite.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction",
  "title": "Instagram chief Adam Mosseri denies social media can be ‘clinically addictive’ in landmark case | CNN Business",
  "date": "2026-02-12T21:30:39.608563+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAdam Mosseri, the head of Instagram, testified on Wednesday that he does not think users canbe “clinically addicted” to the social media app.\n\nMosseri is the first executive to testify in thelandmark social media addiction trialagainst YouTube and Instagram parent company Meta in a suit brought by a now 20-year-old woman identified as Kaley. The woman alleges the companies intentionally developed addictive features to hook young users, which she claims harmed her mental health.\n\nThe lawsuit is the first of more than 1,500 similar cases to go to trial and couldserve as a test of whether the social media giants can be held responsible for claims that they’ve harmed young users’ mental health.\n\nMark Lanier, a lawyer for the plaintiff,questioned Mosseri on Wednesday about whether Instagram chooses profits over the health and safety of minors and whether Mosseri oversees an app that hooks younger users.\n\nIt was a rare look into how Mosseri views Instagram’s business. Mosseri said he hadn’t testified in a trial like this before.\n\nMosseri said that he didn’t think that it was possible to be addicted to Instagram but that “problematic use” was possible, though it varies from person to person. Mosseri compared it to “watching TV for longer than you feel good about.” (Mosseri conceded in questioning that he is not a doctor.)\n\n“It’s relative,” he said. “Yes, for an individual, there’s a such thing as using Instagram more than you feel good about.”\n\nMosseri becamehead of Instagramin 2018 after joining the company then known as Facebook in 2008.\n\nIn 2021, Facebook whistleblower Frances Haugen leaked a trove of internal documents indicating the company knew Instagram could have a“toxic” effecton teen girls. The same year, CNNreportedthat Instagram promoted accounts encouraging extreme dieting and eating disorders to teen users. The company acknowledged at the time that those accounts violated its rules.\n\nMosseritolda Senate committee in December 2021 that he was in favor of greater online safety regulation but also “committed” to making the platform safe, even if parents didn’t use parental control tools.\n\nOn Wednesday, Mosseri said that any implication that Instagram specific targets teen users to maximize profits was false.\n\n“We make less money from teens than any other demographic on the platform,” he said, while being questioned by one of Meta’s lawyers, Phyllis Jones. “Teens don’t clock on ads and they don’t have much expendable income.”\n\nInstagram has sincerolled outadditional safety and well-being features, most notably “teen accounts,” which apply default content restrictions and privacy protections for teen users. Meta has previously said “we strongly disagree” with the allegations in Kaley’s lawsuit.\n\nKaley began using Instagram at the age of nine, according to Lanier, although the app’s minimum age is 13. (Instagram has more recently begun rolling outAI age verificationtechnology to identify younger users who sign up with an inaccurate birthdate, although the technology’s accuracy is unclear.)\n\nLanier, in his opening statement Monday, called out features such as “infinite scroll and autoplay” andthe “like” button, which Lanier equated to a “chemical hit” that teens looking for validation from their peers grow to crave. Kaley’s lawsuit also alleges that “beauty filters” that can alter a user’s face contributed to body dysmorphia and that she experienced bullying andsextortionon Instagram.\n\nOn Wednesday, Lanier asked if Mosseri was aware that Kaley had once spent over 16 hours in a single day on Instagram.\n\n“That sounds like problematic use,” Mosseri said.\n\nAhead of Mosseri’s testimony, a group of parents and family members who say they lost loved ones because of harms from social media gathered outside the courtroom around 1 am in blue rain slickers in hopes of getting one of the limited seats for public observers in the courtroom, avideofrom one of the parents shows. “We’re never going to stop fighting, that’s why we’re here,” said Julianna Arnold, whose17-year-old daughter Coco diedafter being given a pill laced with fentanyl by an older man whom Instagram connected her to.\n\nLanier questioned Mosseri at length about Instagram’s beauty filters, especially those that alter users’ faces in ways that some view as promoting cosmetic surgery.\n\nLanier pointed to internal documents from 2019 in which Meta executives debated whether to ban such filters. One email said experts were “unanimous on the harm there.”\n\n“We are talking about encouraging young girls into body dysmorphia,” another email from a Meta executive read.\n\nAt first, Instagram decided to ban all filters that distort faces, Mosseri said. But it later altered the decision.\n\nInstagram filters that promote plastic surgery, such as adding the appearance of facial scars in common procedure areas, were banned, Mosseri said. But the company decided to lift the ban on Instagram filters that alter facial features, such as enlarging a person’s lips or slimming their nose, instead deciding to stop recommending them, Mosseri said.\n\nAt the time of the policy change, Kaley was 14 years old, Lanier said.\n\nLanier also grilled Mosseri on his salary. Mosseri said that his base salary is “about $900,000 per year” but that his compensation can be more than $10 million or, in some years, more than $20 million, including bonuses and stock options.\n\nLanier questioned whether Mosseri’s decisions on product features, such as “beauty filters,” were motivated by ensuring growth at the company, thus benefiting his compensation. He showed another internal email suggesting that removing such filters would “limit our ability to be competitive in Asian markets (including India).”\n\n“I was never concerned with any of these things affecting our stock price,” Mosseri replied.\n\nLanier also referenced an unreleased, internal Meta study called “Project Myst.” During his opening statement, Lanier said that the study found evidence that children who had experienced “adverse effects” were most likely to get addicted to Instagram. The study also found that parents were powerless to stop the addiction, he said.\n\nMosseri said he recognized the study, but didn’t remember anything specific about it. “I was a supporter, I am generally a supporter of research,” he said.\n\nMeta lawyer Paul Schmidt argued during his opening statement that Kaley’s difficult family life during childhood was responsible for her mental health challenges, rather than Instagram. He showed portions of pre-trial testimony from two therapists who he said worked with Kaley that suggested they did not believe Instagram was central to her challenges.\n\nA Meta spokesperson reiterated the company’s argument in a new statement on Wednesday.\n\n“The question for the jury in Los Angeles is whether Instagram was a substantial factor in the plaintiff’s mental health struggles. The evidence will show she faced many significant, difficult challenges well before she ever used social media,” the statement said.\n\nMatthew Bergman, an attorney representing Kaley, said Mosseri’s testimony indicated Instagram’s executives “made a conscious decision to put growth over the safety of minors” in a statement Wednesday afternoon.\n\n“The evidence shows that Instagram knew the risks its product posed to young users, yet continued to deploy features engineered to keep kids online longer, even when those features exposed them to significant danger,” he said.\n\nThe jury will likely not hear many arguments related to Instagram or YouTube’s content because of Section 230, a federal law that shields tech companies from liability over content that their users post. Ahead of Mosseri’s testimony, Superior Court Judge Carolyn Kuhl directed the parties not to question him about Instagram’s content safety features or the content Kaley was exposed to while using it, citing that law.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/tech/instagram-youtube-social-media-trial",
      "text": "landmark social media addiction trial"
    },
    {
      "url": "https://www.cnn.com/2018/10/01/tech/instagram-adam-mosseri",
      "text": "head of Instagram"
    },
    {
      "url": "https://www.cnn.com/2021/09/30/tech/facebook-senate/index.html",
      "text": "“toxic” effect"
    },
    {
      "url": "https://www.cnn.com/2021/10/04/tech/instagram-facebook-eating-disorders/index.html",
      "text": "reported"
    },
    {
      "url": "https://www.cnn.com/business/live-news/instagram-adam-mosseri-congress-teens-12-08-21",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/tech/instagram-teen-accounts-safety-features",
      "text": "rolled out"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/tech/instagram-teen-accounts-safety-features",
      "text": "AI age verification"
    },
    {
      "url": "https://www.cnn.com/2025/01/29/us/nigerian-extradited-guffey-sextortion-cec",
      "text": "sextortion"
    },
    {
      "url": "https://www.linkedin.com/posts/juliannaarnold_parentsrise-bigtechontrial-ugcPost-7427283083906715648-P-AU?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAv5GzgB-OMx3yRqXu-P7xCCuNJN0jw-9oU",
      "text": "video"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/business/video/meta-youtube-tiktok-trial-julianna-arnold-vrtc",
      "text": "17-year-old daughter Coco died"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6d55d17a44bd87136a9475ba3ddef80e0623f8a6c8847fe2cefe005d3647ecbb",
  "scraped_at": "2026-02-12T21:30:39.608576+00:00"
}