{
  "url": "https://lite.cnn.com/2026/02/10/politics/republicans-epstein-shift-polls",
  "title": "How polls show Republicans stopped caring so much about Epstein | CNN Politics",
  "date": "2026-02-11T16:33:04.947433+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFor years, conservative influencers and Republican politicians kept the flame lit when it came to pushing for more information about Jeffrey Epstein’s crimes.\n\nWith an often-conspiratorial bent that assumed powerful people were involved and that Epstein hadn’t actually killed himself, they aimed to rip the lid off a major government scandal.\n\n“What possible interest would the US government have in keeping Epstein’s clients secret?” JD Vanceposted on Xback in 2021, before adding suggestively: “Oh…”\n\nBut as we were finally getting a big peek behind the curtain late last month, with the Justice Department releasing millions of pages of documents, there was an interesting dynamic. Conservatives didn’t care too much — at least relative to the left — and conservative TV didn’t cover it too much, new polling suggests.\n\nAMarquette University Law School pollconducted shortly before the latest document release on January 30 showed just50% of Republicans and Republican-leaning independentssaid they had heard or read “a lot” about the Epstein files. That’s compared to 72% of Democrats and Democratic-leaning voters.\n\nAnd it appears news coverage could be a major reason why.\n\nThe poll found that just 49% of people who relied on conservative TV news for their news had heard “a lot” about Epstein, versus 75% who relied on other network TV news.\n\nFor comparison’s sake, Republican-leaning voters and conservative TV viewers were about as likely to have heard “a lot” about the Epstein files as they were Rob Reiner’s death back in December. And significantly more of them had heard “a lot” about alleged social services fraud in Minnesota.\n\nThese are remarkable gaps in attention paid to key news stories — and they reflect a broader shift on the right when it comes to the Epstein files.\n\nAs the handling of the Epstein files became a growing political problem for the Trump administration and as the president derided the files as a Democratic “hoax,” the right gradually de-emphasized it as an issue.\n\nConservatives didn’t necessarily absolve Trump of blame for his administration’s mishandling of the issue, and they didn’t abandon their theories about Epstein, but they did largely move on.\n\nA CNN poll from earlier in January is another case in point.\n\nWhen the administration’s botched handling of the files first blew up back in July,40% of Republicanshad said they were dissatisfied with how much information the federal government had released. But by early-to-mid January, that number was cut approximately in half,to 21%.\n\nWhy is that so striking? Because up to that point, the government had released only a tiny portion of the documents it had —less than 1%, by the Trump administration’s own account.\n\nThe Justice Department had also blown the late-December deadline that Congress had given it for releasing all of the files.\n\nAnd yet, for some reason, Republicans were suddenly much more satisfied with the government’s level of disclosure.\n\nBothQuinnipiac UniversityandReuters-Ipsospolls likewise showed GOP approval of the administration’s handling of the files rising by double-digitsbetween thesummerand the latter part of the year.\n\nA CBS News-YouGov poll showed an even bigger shift in GOP satisfaction with the administration’s handling. Whilejust halfof Republicans were at least “somewhat” satisfied back in July, by Novemberabout three-quarterswere at least “somewhat” satisfied.\n\nThat latter number might have owed to the fact that Trump had recently signed a bill mandating the release of the files. But it’s also clear the bill, which he endorsed at the last minute under political pressure, advanced in Congress against his wishes.\n\nThe same CBS News-YouGov poll also pointed to how Republicans seemed to decide the handling of the Epstein files didn’t matter as much to them.\n\nBack in July, 46% of Republicans said the Epstein files mattered at least “a little” to their evaluation of Trump. But by November that had dropped to 36%.\n\nBut even that July number was pretty striking. The handling of the Epstein files had animated the political right — and especially its influencer class. But shortly after the administration signaled anabrupt and confusing end to its disclosures, most Republicans quickly signaled it was neither here nor there when it came to their views of Trump.\n\nAnd that gets at what might be most jarring about all of this. You might look at these numbers and think that Republicans have concluded there’s simply not a whole lot there — that the conspiracy theories were baseless or wrong.\n\nBut that’s not actually the case.\n\nBetween July and December, the Reuters-Ipsos polling showed the percentage of Republicans who believed the federal government was hiding info about Epstein’s death staying steady at 55%, and the percentage who thought who it was hiding info about his clients stayed steady in the lows 60s.\n\nThe conspiracy theories haven’t disappeared, it seems. They were just set aside.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/JDVance/status/1476544439036387331",
      "text": "posted on X"
    },
    {
      "url": "https://law.marquette.edu/poll/2026/02/04/new-marquette-law-school-national-survey-finds-60-disapprove-of-the-work-of-ice-with-democrats-and-independents-opposed-to-ice-and-republicans-in-favor/",
      "text": "Marquette University Law School poll"
    },
    {
      "url": "https://law.marquette.edu/assets/community/poll/MLSPSC30/MLSPSC30Crosstabs.html#trump-epstein-info-4-cat",
      "text": "50% of Republicans and Republican-leaning independents"
    },
    {
      "url": "https://www.cnn.com/2025/07/15/politics/jeffrey-epstein-cnn-poll",
      "text": "40% of Republicans"
    },
    {
      "url": "https://s3.documentcloud.org/documents/26496339/cnn-poll-epstein.pdf",
      "text": "to 21%"
    },
    {
      "url": "https://www.cnn.com/2026/01/06/politics/epstein-files-justice-department-review",
      "text": "less than 1%"
    },
    {
      "url": "https://poll.qu.edu/poll-release?releaseid=3943",
      "text": "Quinnipiac University"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2025-12/Reuters%20Ipsos%20Large%20Sample%20Poll%206%20December%202025%20Topline.pdf",
      "text": "Reuters-Ipsos"
    },
    {
      "url": "https://poll.qu.edu/poll-release?releaseid=3928",
      "text": "between the"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2025-07/Reuters%20Ipsos%20Immigration%20and%20Epstein%20Files%20Topline%2007%2018%202025.pdf",
      "text": "summer"
    },
    {
      "url": "https://d3nkl3psvxxpe9.cloudfront.net/documents/cbsnews_20250720_1.pdf",
      "text": "just half"
    },
    {
      "url": "https://d3nkl3psvxxpe9.cloudfront.net/documents/cbsnews_20251123_1.pdf",
      "text": "about three-quarters"
    },
    {
      "url": "https://www.cnn.com/2025/07/07/politics/bondi-epstein-files-client-list-suicide-memo",
      "text": "abrupt and confusing end to its disclosures"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/republicans-epstein-shift-polls",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/republicans-epstein-shift-polls",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6e3d4e1301f1f2c7fd4b05231be63c0a1dd461b692a11c7b8c66be33135d200d",
  "scraped_at": "2026-02-11T16:33:04.947445+00:00"
}