{
  "url": "https://lite.cnn.com/2026/02/20/politics/cyberattack-closes-clinics-mississippi",
  "title": "Major cyberattack forces closure of clinics across Mississippi | CNN Politics",
  "date": "2026-02-23T07:37:53.567159+00:00",
  "authors": [
    "Sean Lyngaas, CNN"
  ],
  "text": "Source: CNN\n\nAransomwareattack has forced one of Mississippi’s largest health care systems to close clinics across the state on Friday, raising larger concerns about the cybersecurity of medical facilities across the country.\n\nThe closure affects all 35 of the University of Mississippi Medical Center’s health clinics, which provide a range of care to patients from cancer treatment to chronic-pain management. The attack also caused the cancelation of elective procedures in what health officials said would be a “multi-day event.”\n\nDoctors at UMMC are now using pen and paper as they treat patients because they are cut off from the electronic health records system they normally use to draw up patient information. A top FBI official in the state said the bureau was “surging resources both locally and nationally” in response to the attack.\n\nThe digital outage and cancellation of surgeries could strain a medical system whose $2 billion budget, according to its website, accounts for two percent of the state’s economy.\n\nEmergency rooms remain open and UMMC doctors are drilled on delivering services when computers are down.\n\n“We do not know how long this situation may last,” LouAnn Woodward, a vice chancellor at UMMC, said at a press conference Thursday. “As a precaution, all of our IT systems have been taken down, and risk assessment will be conducted before we bring things back up.”\n\nA disruptive ransomware attack like this is familiar to hundreds of health care organizations across the US, which have suffered attacks in recent years. Other ransomware attacks have threatened patient safety, caused delays in crucial medication being distributed and cost the economy billions of dollars in aggregate. The attacks typically involve the hackers locking or stealing data and then demanding payment from victim hospitals.\n\nIt was unclear Friday if the hackers had made ransom demands. In general, hospitals can be vulnerable to extortion by hackers because of the pressure hospital executives face to get critical care functions back online,experts have toldCNN.\n\nOfficials from the FBI and the Department of Health and Human Services have been closely monitoring the UMMC ransomware attack’s impacts since Thursday, sources familiar with the federal response told CNN.\n\n“The attackers have communicated to us and we’re working with the authorities and the specialists on next steps,” Woodward told reporters.\n\n“Ransomware attacks targeting US hospitals and health care continue to increase at a very concerning rate,” said John Riggi, national advisor for cybersecurity and risk at the American Hospital Association.\n\n“Any cyberattack which disrupts or delays health care delivery, poses a risk to patient and community safety,” Riggi said, speaking generally rather than on the Mississippi hack specifically. “This is especially so in rural areas where the next nearest available hospital or trauma center may be over 100 miles away.”\n\nThere is a broader concern in the US health care sector about potential blowback in cyberspace if the US military strikes Iran in the coming days, which has prepared to do if ordered by President Donald Trump.\n\nIranian hackers have been linked to numerous cyberattacks on US health organizations in the past decade, and cyber specialists are preparing for a possible uptick in hacks should the US strike, one expert told CNN. There is no indication that Iran is responsible for the attack in Mississippi.\n\n“We are keeping an elevated threat level and watching this Iran situation for potential impacts,” said one cyber expert focused on health care who spoke on the condition of anonymity because they were not authorized to speak to the press.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/05/20/politics/ransomware-attack-medical-centers",
      "text": "ransomware"
    },
    {
      "url": "https://www.cnn.com/2023/04/06/politics/microsoft-hospitals-ransomware-court-order",
      "text": "experts have told"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/cyberattack-closes-clinics-mississippi",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/cyberattack-closes-clinics-mississippi",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6f225037c182dc24c20db212681f0b18ca6f993b389cc9ed071e25d9aaa31e0e",
  "scraped_at": "2026-02-23T07:37:53.567172+00:00"
}