{
  "url": "https://lite.cnn.com/2026/02/27/politics/trump-iran-state-sponsor-wrongful-detention",
  "title": "Trump administration designates Iran as a state sponsor of wrongful detention | CNN Politics",
  "date": "2026-02-28T06:59:02.619445+00:00",
  "authors": [
    "Jennifer Hansler"
  ],
  "text": "Source: CNN\n\nThe Trump administration on Friday formally designated Iran as a state sponsor of wrongful detention, thelatest move to ratchet up pressureand penalize Iran for its history of imprisoning US citizens.\n\nIt is the first such designation under anexecutive order signed last Septembermeant to deter countries from illegally detaining US citizens and encourage them to release wrongful detainees they have in custody. The announcement from US Secretary of State Marco Rubio comes as the Trump administration is pressing for a new nuclear deal with Iran and has threatened to launch military action against the country.\n\n“For decades, Iran has continued to cruelly detain innocent Americans, as well as citizens of other nations, to use as political leverage against other states. This abhorrent practice must end,” Rubio said in a statement.\n\nRubio warned that if Iran does not stop detaining Americans, “we will be forced to consider additional measures, including a potential geographic travel restriction on the use of U.S. passports to, through, or from Iran.”\n\nThere is such a travel restriction in place for North Korea. The US does not allow its citizens to travel to North Korea on US passports without an approved exception, and in those cases, the State Department issues a “special validation passport.”\n\n“The Iranian regime must stop taking hostages and release all Americans unjustly detained in Iran, steps that could end this designation and associated actions. We encourage it to do so. No American should travel to Iran for any reason. We reiterate our call for Americans who are currently in Iran to leave immediately,” Rubio said Friday.\n\nIran has a history of wrongfully detaining Americans. InSeptember 2023, the Biden administration secured the release of five Americans – all of whom had been imprisoned for years – as part of a wider deal with Iran.\n\nThere is one American who has been designated as wrongfully detained currently imprisoned in Iran: Reza Valizadeh. Valizadeh, an Iranian-American journalist, had worked in exile for Persian language outlets, including the US-funded Radio Farda. He returned to Iran in March 2024 to visit his elderly parents and was arrested in September of that year.\n\nConcerns have mounted about his well-being in the years since his imprisonment. His brother said inSeptember 2025that Valizadeh has asthma that has “deteriorated dramatically.”\n\nRyan Fayhee, a US-based attorney working on Valizadeh’s case, said he is hopeful that the state sponsor of wrongful detention designation will have an impact, “particularly given the travel restrictions and the like that come with this.”\n\n“Do I think this will free Reza? No, I don’t think it will, unfortunately. But do I believe it’s helpful? Yes,” he told CNN.\n\nAnother American imprisoned in Iran is Kamran Hekmati, who was arrested last year and sentenced to prison time by Iranian authorities for visiting Israel more than a decade ago for his son’s bar mitzvah, according to family members who spoke to CNN.\n\nThe 70-year-old Hekmati is suffering from bladder cancer and is currently detained in Tehran’s notoriousEvin Prison. Although an appeal has been filed, his family has serious concerns about his health.\n\nThe administration could apply the designation to other countries in the future, such as Afghanistan or Russia, where US citizens remain detained.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/middleeast/iran-nuclear-talks-trump-options-intl-latam",
      "text": "latest move to ratchet up pressure"
    },
    {
      "url": "https://www.cnn.com/2025/09/05/politics/state-sponsor-of-wrongful-detention-designation-trump-order",
      "text": "executive order signed last September"
    },
    {
      "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/index.html",
      "text": "September 2023"
    },
    {
      "url": "https://cpj.org/2025/09/imprisoned-for-telling-the-truth-a-qa-with-iranian-american-journalist-reza-valizadehs-brother/",
      "text": "September 2025"
    },
    {
      "url": "https://www.cnn.com/2024/09/23/world/iran-siamak-namazi-amanpour-interview",
      "text": "Evin Prison"
    }
  ],
  "hash": "6f78a3d3dd2a2e48c94e6fd274478dc3ab6a57336a7e8d19869964637fa87a81",
  "scraped_at": "2026-02-28T06:59:02.619457+00:00"
}