{
  "url": "https://lite.cnn.com/2026/02/12/sport/figure-skating-backflip-explainer",
  "title": "The ‘Quad God’ made history with his Olympic backflip, but some say the glory was owed to a Black skater | CNN",
  "date": "2026-02-12T21:29:29.629387+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nIlia Malinin, the U.S. figure skater nicknamed the “Quad God,” became the first person to legally land a backflip on one skate in the Olympics — although one trailblazing woman pulled it off when the move was still forbidden.\n\nThe 21-year-old from Virginia delivered a crucial free skate on Sunday night for the winning American team, filled with his trademark quadruple jumps, and punctuated the gold medal-clinching performance with his dramatic backflip.\n\nIt’s a move known today as “the Bonaly flip” — named for France’s Surya Bonaly. Nevertheless, it is Malinin getting showered with praise, prompting many on social media to lament the way his achievement has eclipsed that of Bonaly, who is Black, and wondering if that is due to the color of her skin.\n\nAri Lu, 49, was among those on TikTok saying the figure skating world owed Bonaly an apology. Where Malinin is praised for his athleticism, Bonaly was judged, she told The Associated Press in a text message on Monday.\n\n“Something a Black person used to be derided for is now celebrated when done by a white person,” said Lu, who is Black herself. She added that critiques of Bonaly at the time appeared related to her appearance rather than her skills.\n\nThe first person to pull off a backflip at the Olympics was former U.S. champion Terry Kubicka, in 1976, and he landed on two skates. The International Skating Union swiftly banned the backflip, considering it too dangerous.\n\nOver 20 years later, at the 1998 Nagano Games, France’s Surya Bonaly flouted the rules and executed a backflip, this time landing on a single blade — an exclamation point to mark her final performance as a professional figure skater. The crowd cheered, and one television commentator exclaimed, “I think she’s done that because she wants to, because it’s not allowed. So good on her.”\n\nBonaly knew the move meant judges would dock her points, but she did it anyway. The moment would cement her legacy as a Black athlete in a sport that historically has lacked diversity.\n\nFor decades, Bonaly’s thrilling move could only be witnessed at exhibitions. That changed two years ago, when the ISU lifted its ban in a bid to make the sport more exciting and popular among younger fans.\n\nMalinin, who is known for his high-flying jumps, soon put the backflip into his choreographed sequences for competitions. And on Sunday it was a part of a gold medal-winning free skate.\n\nBonaly, for her part, ended her professional career with a 10th place finish. Some argue the punishment of Bonaly back then and praise of Malinin today underscores a double standard that still exists in the figure skating world.\n\nIn a telephone interview from Minnesota, Bonaly told the AP on Monday that it was great to see someone do the backflip on Olympic ice, because skating needs to be taken to an upper level.\n\nRegarding the criticism she received during her career, Bonaly said she was “born too early,” arriving on the Olympic scene at a time when people weren’t used to seeing something different or didn’t have open minds.\n\n“I broke ice for other skaters,” Bonaly said. “Now everything is different. People welcome anyone as long as they are good and that is what life is about.”\n\nBefore Bonaly there was Mabel Fairbanks, whose Olympic dreams were dashed by racist exclusion from U.S. Figure Skating in the 1930s, and also Debi Thomas, the first African American to win a medal at the Winter Olympics. They and and others have paved the road for more representation in the sport.\n\nBut there are still few professional Black figure skaters, and none competing for the U.S. this year; popular skater Starr Andrews failed to make the team, finishing seventh at nationals. The team does include five Asian American skaters and Amber Glenn, an openly vocal LGBTQ+ supporter.\n\nMalinin’s teammate, Amber Glenn, said that while she thinks backflips are fun and is interested in learning how to do one after she’s done competing, the three-time and reigning U.S. champion does not plan to do them any time soon.\n\n“I want to learn one once I’m done competing,” the 26-year-old Glenn said. “But the thought of practicing it on a warmup or in training, it just scares me.”\n\nBoth the ISU and the International Olympic Committee have apparently begun to embrace Bonaly’s backflip, sometimes posting it to social media in conjunction with Bonaly’s own account.\n\n“Backflips on ice? No problem for figure skating icon Surya Bonaly!” says one from last May. Another from November 2024 says: “Surya Bonaly’s backflip has been a topic of discussion, awe, and admiration for over two decades and continues to inspire young skaters to never give up on their dreams.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/sport/figure-skating-backflip-explainer",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/sport/figure-skating-backflip-explainer",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6fce4b7066234ae24b111d9c074251f3c7cc176e2ce7d7084c3935ea81ffd53b",
  "scraped_at": "2026-02-12T21:29:29.629400+00:00"
}