{
  "url": "https://lite.cnn.com/2025/04/18/entertainment/sinners-director-ryan-coogler-film-school",
  "title": "‘Sinners’ director Ryan Coogler takes us to film school in 10 minutes | CNN",
  "date": "2026-02-18T07:32:26.860647+00:00",
  "authors": [
    "Quincy Bowie Jr., CNN"
  ],
  "text": "Source: CNN\n\nRyan Coogler’s newest film “Sinners” is alreadygeneratingtons of buzz, and a lot of it has to do with a video shared days before the release.\n\nLast week, Kodak posteda 10-minute videothat between YouTube and TikTok has racked up around 1 million views, in which Coogler makes complex topics like aspect ratios, film formats and sound design accessible and fun. He does this largely thanks to how the video uses his latest vampire-crime thriller hybrid “Sinners” as the primary example.\n\nCoogler seems comfortable in professor mode as he talks through the different film formats in the video, while film strips of different sizes and a whiteboard chockfull of detailed drawings are displayed behind him. His passion is clear as he starts off with a quick explanation of Super 8mm film, Super 16mm film and some technical terms.\n\nRegarding shooting on actual celluloid – which is increasingly rare in today’s digital and video-centric age – he says,“It’s a format that I fell in love with when I was in film school, so I brought a few film strips here.” The “Black Panther” director also mentions other notable recent movies that were shot on film, includingOscar-winners “Anora” and “The Brutalist.”\n\nAfter making sure everyone is up to speed, Coogler then explains how he and his team shot “Sinners” on two camera systems: Ultra Panavision 70 and IMAX. Ultra Panavision 70 is the widest format available and will crop the screen along the top and bottom, while IMAX is the tallest format and will crop on the left and right sides of the screen, the director says.\n\nCoogler’s latest project draws on his Southern roots and family history to deliver a paranormal tale about two brothers who open a juke joint in their Mississippi hometown. The film is led by Coogler’s longtime collaborator Michael B. Jordan, who plays twin brothers Smoke and Stack.\n\n“Sinners” is only hitting screens nationwide on Friday, but it has already made history. This is the first time that a movie has been shot simultaneously with two different aspect ratios (as described above), and it’s also the first time that a movie has been released combining both, Coogler specified in the Kodak clip. Cinematographer Autumn Durald Arkapaw, who also worked on “Black Panther: Wakanda Forever,” alsobecame the first womanto shoot a theatrical feature film on both 65mm and IMAX.\n\nThe film will therefore be available for viewing in several formats, with some showings shifting between aspect ratios depending on the emotion and intensity of a scene in select theaters – another first.\n\nCoogler hasn’t shot on film since his breakout “Fruitvale Station” from 2013 – which also starred Jordan – and his return to the medium is about more than achieving a shallow depth of field and high resolution, he says in the Kodak video. The filmmaker wanted to create a moving theatrical experience like the ones he experienced in his youth, he said.\n\n“My parents was working class in Oakland, and it was the most affordable way for us to go out and have a good time. I still believe in that,” Coogler said.\n\n“Sinners” opens Friday in theaters nationwide. It’s distributed by Warner Bros. Pictures, which like CNN is owned by Warner Bros. Discovery.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2022/03/09/entertainment/ryan-coogler-arrested-bank-robbery-mistaken/index.html",
      "text": "Ryan Coogler"
    },
    {
      "url": "https://www.cnn.com/2025/04/16/entertainment/video/entertainment-showbiz-hollywood-sinners-supernatural-horror-thriller-movies-coogler-jordan-steinfeld-mosaku",
      "text": "tons of buzz"
    },
    {
      "url": "https://youtu.be/78Ru62uFM0s",
      "text": "a 10-minute video"
    },
    {
      "url": "https://www.cnn.com/entertainment/live-news/oscars-academy-awards-03-02-25/index.html#:~:text=The%20film%20picked%20up%20five,for%20writing%2C%20editing%20and%20directing.&text=Other%20big%20winners%3A%20Architectural%20epic,Adrien%20Brody%20and%20best%20cinematography.",
      "text": "Oscar-winners “Anora” and “The Brutalist.”"
    },
    {
      "url": "https://www.proximitymedia.com/podcast/making-imax-history-with-autumn-durald-arkapaw-and-ryan-coogler#:~:text=With%20SINNERS%2C%20Autumn%20made%20history%20as%20the,PALO%20ALTO%2C%20and%20BLACK%20PANTHER:%20WAKANDA%20FOREVER",
      "text": "became the first woman"
    },
    {
      "url": "https://www.cnn.com/2025/04/18/entertainment/sinners-director-ryan-coogler-film-school",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2025/04/18/entertainment/sinners-director-ryan-coogler-film-school",
      "text": "Cookie Settings"
    }
  ],
  "hash": "6fce22aa281833f96804da2988e30e02ae4fcaf8c564c4aa98c552f7c390ef87",
  "scraped_at": "2026-02-18T07:32:26.860661+00:00"
}