{
  "url": "https://lite.cnn.com/2026/02/19/politics/abigail-spanberger-democratic-response-trump-sotu",
  "title": "Virginia Gov. Abigail Spanberger to deliver Democratic response to Trump’s State of the Union address | CNN Politics",
  "date": "2026-02-20T07:28:23.848047+00:00",
  "authors": [
    "Ellis Kim, CNN"
  ],
  "text": "Source: CNN\n\nAbigail Spanberger will deliver the Democratic Party’s response to President Donald Trump’s State of the Union address Tuesday night, giving a high-profile platform to the Virginia governor.\n\nDemocratic congressional leaders are tapping a recent history-maker who becamethe Commonwealth’s first female governorin January. Prior to that, she served three terms in the US House, gaining a reputation as a pragmatic, more moderate Democrat. A former CIA case officer, Spanberger was among the national security-minded Democrats whoflipped competitive seatsin 2018 to help the partywin back the Houseas it sought to check Trump during his first term.\n\nThe party out of power attempts to use the rebuttal as a way to offer a contrast to the president — and next week’s speech comes as Democrats are trying to make their case to voters ahead of the 2026 midterm elections. The format can prove challenging, however, and has at times led to unintended viral moments and late-night parodies.\n\nIn announcing the pick, Senate Minority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries praised Spanberger as a champion of “lower costs,” and previewed that she will also touch on the issue of health care, as the party emphasizes affordability as a key theme in the run-up to the midterms.\n\n“Gov. Spanberger has always put service over politics — defending our national security and delivering real results for working families. She knows Americans want lower costs, safer communities, and a stronger democracy — not chaos and corruption,” Schumer said in a statement. “Gov. Spanberger will lay out a clear path forward: lower everyday costs, protect healthcare, and defend the freedoms that define who we are as a nation.”\n\nSpanberger said in a statement that Tuesday’s address comes at a “defining moment” in the country’s history.\n\n“Virginians and Americans across the country are contending with rising costs, chaos in their communities, and a real fear of what each day might bring. Next week, I look forward to laying out what these Americans expect and deserve — leaders who are working hard to deliver for them,” she said.\n\nVirginia governors have been a popular choice for both parties for the State of the Union response. Republicans turned to Bob McDonnell for their response in 2010, and before that, Democrats selected then-Gov. Tim Kaine in 2006.\n\nThe Democratic leaders also announced Thursday that California Sen. Alex Padilla will deliver the party’s Spanish language response to the speech.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/04/politics/virginia-governor-abigail-spanberger-wins",
      "text": "the Commonwealth’s first female governor"
    },
    {
      "url": "https://www.cnn.com/2018/11/07/politics/dave-brat-defeated-virginia-house",
      "text": "flipped competitive seats"
    },
    {
      "url": "https://www.cnn.com/2018/11/06/politics/house-control-midterm-election",
      "text": "win back the House"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/abigail-spanberger-democratic-response-trump-sotu",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/abigail-spanberger-democratic-response-trump-sotu",
      "text": "Cookie Settings"
    }
  ],
  "hash": "706639a47968efd0912e8dc7ee619193607c35aed22880518e9dc3feffc5504d",
  "scraped_at": "2026-02-20T07:28:23.848061+00:00"
}