{
  "url": "https://lite.cnn.com/2026/02/25/politics/trump-administration-third-country-deportation",
  "title": "Trump administration’s ‘third country’ deportation policy is unlawful, judge rules | CNN Politics",
  "date": "2026-02-26T07:31:22.679741+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nThe Trump administration’s latest policy of deporting immigrants to “third countries” to which they have no ties is unlawful and must be set aside, a federal judgeruled Wednesdayin a case that already reached the nation’s highest court.\n\nUS District Judge Brian E. Murphy in Massachusetts agreed to suspend his decision for 15 days, giving the government time to appeal his latest ruling in the case. Murphy noted that the US Supreme Court ruled in the administration’s favor last year, pausing his previous decision and clearing the way for a flight carrying several migrants to complete its trip to war-torn South Sudan, where they had no ties.\n\nMurphy said migrants challenging the Department of Homeland Security’s policy have the right to “meaningful notice” and an opportunity to object before they are removed to a third country. The policy “extinguishes valid challenges to third-country removal by effecting removal before those challenges can be raised,” the judge concluded.\n\n“These are our laws, and it is with profound gratitude for the unbelievable luck of being born in the United States of America that this Court affirms these and our nation’s bedrock principle: that no ‘person’ in this country may be ‘deprived of life, liberty, or property, without due process of law,’” Murphy wrote.\n\nIn June, the Supreme Court’s conservative majorityfound that immigration officials can quickly deport peopleto third countries. Liberal justices Sonia Sotomayor and Ketanji Brown Jackson dissented, saying the ruling gives the government special treatment.\n\nMurphy said President Donald Trump’s administration has repeatedly violated — or tried to violate — his orders. Last March, he noted, the Defense Department deported at least six class members to El Salvador and Mexico without providing the process required under a temporary restraining order that Murphy issued. DHS issued its new policy guidance for third-country removals on March 30, two days after Murphy’s order.\n\n“The simple reality is that nobody knows the merits of any individual class member’s claim because (administration officials) are withholding the predicate fact: the country of removal,” wrote Murphy, who was nominated to the bench by Democratic President Joe Biden.\n\nMurphy said the DHS third-country removal policy has targeted immigrants who were granted protection from being sent back to their home countries, where they feared being tortured or persecuted in other ways.\n\nEight men who were sent to South Sudan in May had been convicted of crimes in the US and had final orders of removal, Immigration and Customs Enforcement officials have said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://storage.courtlistener.com/recap/gov.uscourts.mad.282404/gov.uscourts.mad.282404.241.0.pdf",
      "text": "ruled Wednesday"
    },
    {
      "url": "https://www.cnn.com/2025/06/23/politics/supreme-court-migrants-south-sudan-turmoil-filled-countries",
      "text": "found that immigration officials can quickly deport people"
    }
  ],
  "hash": "7072ee65cee5299f35999ab3d81e28676cb25877605b09906836d697ead2d09d",
  "scraped_at": "2026-02-26T07:31:22.679754+00:00"
}