{
  "url": "https://lite.cnn.com/2026/02/15/business/warsh-fed-cuts-ai",
  "title": "Trump’s Fed chair pick argues there is one crucial reason to lower interest rates | CNN Business",
  "date": "2026-02-17T07:31:33.191770+00:00",
  "authors": [
    "Analysis by Bryan Mena, CNN"
  ],
  "text": "Source: CNN\n\nBack in December, Kevin Warsh hinted how he may argue for lower interest rates.\n\nAI is ushering in “the most productivity-enhancing wave of our lifetimes — past, present and future,” Warsh, who was nominated by President Donald Trump as Federal Reserve chair on January 30, said in aninterviewwith fintech entrepreneur Sadi Khan. The technology could prove to be “structurally disinflationary” like the internet, Warsh said, suggesting the Fed may have a clear path to continue lowering rates.\n\nIn recent years, US productivity has grown at a robust pace, according to Bureau of Labor Statistics data. In economics, if productivity is strong, then growth can run hot without stoking inflation. That would mean the Fed doesn’t need to step in with interest rate hikes. It’s unclear if that same logic can apply to rate cuts.\n\nIf he’s confirmed by the Senate to lead the central bank after Fed Chair Jerome Powell’s term ends in May, Warsh will preside over a 12-person rate-setting committee that has becomestarkly divided in recent months. Fed chairs are tasked with building consensus around rate decisions, with each person having only one vote, including the head.\n\nThat means Warsh has to convince his colleagues — some of whom are still concerned about inflation — that AI-driven productivity is enough for additional interest rate cuts. But it’s too soon to conclude AI will boost productivity in a long-lasting way, according to most economists, and some key monetary policymakers have already suggested it may not even warrant lower rates.\n\nWhen Warsh served as a Fed governor from 2006 to 2011, hewas known for his “hawkish” views, or preference for policies that restrain the economy and keep a lid on inflation.\n\nHe has since changed his tune and is now more in line with the Trump administration, which, in addition to wanting lower rates, also believes the US economy is in the throes of a historic productivity boom, similar to the one during the dot-com era.\n\n“It’s clear that we are at the nascent stages of a productivity boom, not unlike the 1990s,” Treasury Secretary Scott Bessent told CNBC recently. National Economic Council Director Kevin Hassett, who was also a Fed chair candidate, has echoed that view.\n\nSome current central bankers — such as Fed governors Christopher Waller and Lisa Cook, in addition to Powell himself — have concluded AI has the potential to significantly boost productivity.\n\nWarsh argues Fed policymakers should take the same leap of faith with the new technology that they did with the internet, under Fed Chair Alan Greenspan, and lean toward looser monetary policy.\n\nIn his December interview, Warsh pointed out how Greenspan “believed based on anecdotes and rather esoteric data that we weren’t in a position where we needed to raise rates,” despite signs that the economy was heating up at the time.\n\n“As a result, we had a stronger economy, we had more stable prices,” Warsh said.\n\nEconomists say productivity is usually understood better in retrospect, but Greenspan concluded that policymakers should let the economy run hot because anecdotes all pointed to strong productivity aided by the internet.\n\n“Recognizing that the economy was in the early stages of a productivity boom helped the Greenspan-led Fed hold off on interest rate hikes in the 1990s,” Michael Pearce, chief US economist at Oxford Economics, wrote in an analyst note Friday.\n\n“But it wasn’t an argument for cutting rates into accommodative territory,” he said.\n\nRobust productivity paving the way for lower borrowing costs might be a tough sell for some Fed policymakers.\n\nCleveland Fed President Beth Hammack, who votes on policy moves this year, said in a December interview withthe Wall Street Journalthat stronger productivity could translate into a higher so-called “neutral rate of interest,” a theoretical level of borrowing costs that neither stimulates nor weakens economic activity.\n\n“That could be more upward biased, if (AI) is having more material productivity impact,” Hammack said, who has also telegraphed her concerns with 2026 being the fifth consecutive year of elevated inflation.\n\nA higher neutral rate implies that the economy can withstand higher interest rates, an argument directly against the big rate cuts the Trump administration wants.\n\nDallas Fed President Lorie Logan, who is also a Fed voter this year, recounted in a2024 speecha series of anecdotes of AI enhancing productivity for businesses across industries. But like Hammack, Logan is described by economists as a hawk, still concerned about inflation, and has suggested she would have cast a dissenting vote on the Fed’s decision to cut rates in December.\n\n“Productivity is an important and powerful force, but it’s one of the great unknowns of economics,” said Josh Jamner, senior investment strategy analyst at ClearBridge Investments. “A lot of people compare this to the late 90s, but if you look back to that time, there was also a meaningful amount of labor-force growth going on.”\n\n“Now we have an aging population and shifts in immigration policy that have made labor-force growth harder, so there are similarities with the 90s, but there are also some important differences,” he added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.youtube.com/watch?v=6LtRcC-JgBI",
      "text": "interview"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/economy/fed-committee-rate-decisions-new-voters",
      "text": "starkly divided in recent months"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/economy/kevin-warsh-fed-trump-inflation",
      "text": "was known for his “hawkish” views"
    },
    {
      "url": "https://www.wsj.com/podcasts/take-on-the-week/how-this-fed-hawk-views-the-economy-inflation-ai-and-jobs/e106390d-63b4-43b2-ac8d-90b12ed42660",
      "text": "the Wall Street Journal"
    },
    {
      "url": "https://www.dallasfed.org/news/speeches/logan/2024/lkl240405",
      "text": "2024 speech"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/business/warsh-fed-cuts-ai",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/business/warsh-fed-cuts-ai",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7095951f12caf9213f6cfbca12a7d3600f879176740dbfde29efc0b9394449b8",
  "scraped_at": "2026-02-17T07:31:33.191782+00:00"
}