{
  "url": "https://lite.cnn.com/2026/02/26/politics/disaster-aid-fema-states-trump-shutdown",
  "title": "FEMA disaster aid: Trump is about to release billions in aid, but several blue states won’t be included | CNN Politics",
  "date": "2026-02-28T07:00:28.590968+00:00",
  "authors": [
    "Gabe Cohen"
  ],
  "text": "Source: CNN\n\nThe Trump administration is releasing more than $5 billion in long-delayed disaster aid to states – but not to several Democratic-led states where President Donald Trump has clashed with governors, according to four sources familiar with the plan.\n\nStates rely on these funds from the Federal Emergency Management Agency to pay for disaster recovery and mitigation, but more than $14 billion has been stuck in the pipeline, in part because of strict spending rules imposed by the Department of Homeland Security, which oversees FEMA.\n\nWhile more than one-third of that backlog is now being released, a handful of states, including California, Illinois, Minnesota, and Colorado, are being left out, raising new concerns that the administration is playing politics with critical emergency assistance, the sources said.\n\n“They’re doing what they should have been doing all along: helping states — and the people in those states — recover from disasters,” one of the sources told CNN, but added that using the funds “as a political tool is really tragic.”\n\nIn a statement to CNN, DHS denied that politics are playing any role in the process, pointing to other funding that has gone to a “diverse group of states,” including several led by Democrats. Some money in the most recent release went to two tribes in California, but not the state itself.\n\n“This week, FEMA released over $5 billion in recovery funding for projects, some dating back as far as 15 years — a significant win for states, local governments, and hospitals,” a FEMA spokesperson said. “To be clear, this is about results, not politics.”\n\n“Regarding which projects are being funded, FEMA is prioritizing based on project readiness and strict oversight. Obligations are made when projects meet all necessary criteria. Decisions are not based on political considerations; the process is focused on merit and accountability,” the spokesperson added.\n\nUnder a rule implemented by Homeland Security Secretary Kristi Noem nearly a year ago, any FEMA spending over $100,000 needs her personal approval. That bottleneck has caused additional delays.\n\nCalifornia is still waiting on more than $1 billion in FEMA aid to help its recovery from several disasters like last year’s deadly wildfires, including funding for debris removal and power restoration.\n\nDemocratic Sen. Alex Padilla of California said in a statement Thursday, “Donald Trump and his Administration continue to play political games while disaster survivors and local governments are forced to wait for desperately needed federal resources.”\n\nTop Democratic appropriator Sen. Patty Murray said in a statement Thursday, “It’s good that these funds are finally flowing, but communities nationwide have already paid an unacceptable toll because of Kristi Noem’s disastrous mismanagement of FEMA, and it is absolutely unacceptable that it appears this administration may well be holding up disaster relief to certain blue states.”\n\nColorado and Minnesota are seeking reimbursement for millions of dollars for their own storm recoveries. Those states, as well as Illinois, are also due tens of millions of dollars in long-awaited Covid-19 funds that are also caught up in the backlog.\n\nGovernors in all four of those states have had high-profile clashes with Trump over a range of issues, including his immigration crackdown and the deployment of National Guard mostly to Democratic cities.\n\nAll this comes as negotiations over theDHS shutdownare deadlocked. Trump and Noem have blamed Democrats for the budgetary impasse, which they say is hampering disaster response work and holding up relief.\n\nAt Tuesday’s State of the Union address, Trump claimed “we have no money” to help states clean up from this week’s powerful snowstorm “because of the Democrats.”\n\nDHS hasrestricted FEMA’s disaster workduring the shutdown, halting projects, freezing hundreds of new deployments, and requiring staff to obtain written approval from DHS leadership before any travel — even to return home for family or medical reasons.\n\nBut the Disaster Relief Fund that FEMA uses to support disaster response and relief efforts is a separate pool of money appropriated by Congress and not affected by the current lapse in DHS funding, FEMA sources have told CNN.\n\nThe release of the $5 billion will nearly deplete the fund, further complicating future recovery efforts and forcing Congressional action to replenish the fund.\n\nLawmakers and state officials from both parties have grown increasingly frustrated with Noem, warningthe FEMA funding delaysare straining state budgets, stalling mitigation projects and leaving communities exposed ahead of the next potential disaster.\n\nEven White House officials are fed up with the flood of complaints from Republicans as well as the turmoil inside FEMA, which has undergone a massive overhaul that included leadership changes and dramatic reductions in staffing, multiple administration sources have told CNN.\n\nSome in the administration have privately warned that the situation is becoming a political liability, especially as some budget-strapped red states are more disaster-prone and often rely more on FEMA aid and resources than blue states.\n\nIt’s unclear whether the White House or DHS made the decision to exclude California, Illinois, Minnesota and Colorado, according to the sources familiar with the plan.\n\nThe $5 billion includes more than $1 billion in backlogged Covid funding for New York. Rep. Andrew Garbarino, a Republican from New York, who is expected to face a competitive race in the 2026 midterms, has been pushing Noem and her team to release the funds for months.\n\nNorth Carolina is also expected to receive a large trove of disaster aid and Covid funding. Just this week, North Carolina Republican Sen. Ted Budd tweeted that communities across Western North Carolina are still waiting on $229 million, the vast majority for the state’s recovery from Hurricane Helene in 2024.\n\n“This money is stalled until Dems come to the table and open an agency that North Carolinians rely on,” Buddtweeted, blaming the shutdown for the delay, even though Noem has blocked the funds for months. Budd previouslyblocked DHS nomineesover Noem withholding aid for the Hurricane Helene recovery until her department agreed to release funds to his state.\n\nNoem’s department had already begun to ramp up the distribution of funds, announcing disaster aid for states like Georgia and Tennessee in recent weeks.\n\nBut even after the release of some funding, the backlog remains in the billions of dollars. During a House Appropriations hearing this month, Rep. Rosa DeLauro, a Connecticut Democrat, pressed a top Trump FEMA official about the backlog.\n\n“Everyone is waiting for money,” DeLauro said. “The delays are preventing disaster-stricken communities from starting recovery projects.”\n\nThe official insisted the agency is “committed to reducing the backlog” and is “going as fast as we can.”\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "DHS shutdown"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/trump-dhs-fema-travel-restriction",
      "text": "restricted FEMA’s disaster work"
    },
    {
      "url": "https://www.cnn.com/2025/07/02/politics/fema-critical-funding-disaster-response",
      "text": "the FEMA funding delays"
    },
    {
      "url": "https://x.com/SenTedBuddNC/status/2026067546340774151?s=20",
      "text": "tweeted"
    },
    {
      "url": "https://www.cnn.com/2025/09/09/politics/ted-budd-dhs-nominees-hurricane-helene",
      "text": "blocked DHS nominees"
    }
  ],
  "hash": "70ad0f3d6c4bac59efcc1261dddabd88d37241e069c386cc524afc4dc0550804",
  "scraped_at": "2026-02-28T07:00:28.590981+00:00"
}