{
  "url": "https://lite.cnn.com/2026/02/20/politics/doj-us-attorney-virginia-fired",
  "title": "Justice Department says interim US attorney is fired hours after Virginia judges appoint him to replace Trump loyalist Lindsey Halligan | CNN Politics",
  "date": "2026-02-23T07:36:54.411068+00:00",
  "authors": [
    "Katelyn  Polantz, CNN"
  ],
  "text": "Source: CNN\n\nJust hours after the federal judges in the Eastern District of Virginia appointed a new interim US attorney to replace Trump loyalist Lindsey Halligan, the administration said he is fired.\n\nThe judges on Friday unanimously appointed James Hundley, a Virginia defense attorney with more than three decades of experience, to lead the influential prosecutors’ office after Halligan, President Donald Trump’s hand-picked choice, was forced to leave last month.\n\nShortly after the judges appointed Hundley, Deputy Attorney General Todd Blanche said he was fired on social media.\n\n“Here we go again. EDVA judges do not pick our US Attorney. POTUS does,” Blanchesaid on X.“James Hundley, you’re fired!”\n\nSoon after, Dan Scavino, a White Housedeputy chief of staff who ran Trump’s social media accounts during his first term, responded to Blanche’s tweet with a message for Hundley: “Check your email, James.”\n\nHundley didn’t immediately respond to a request for comment.\n\nCNN has reached out to the Justice Department for comment.\n\nVirginia Democratic Sens. Mark Warner and Tim Kaine slammed the firing in a statement on Saturday, saying, “The Trump Administration has shown complete disrespect for the longstanding process — which Presidents and Senators of both parties have respected and followed in Virginia for years — for the nomination and confirmation of U.S. Attorneys.”\n\n“Now, Trump’s DOJ is also disregarding the law, which clearly gives district judges the power to select U.S. Attorneys when these positions are vacant,” the senators added. “The EDVA judges made an excellent decision in picking James Hundley. Virginians deserve a court system that is fully staffed with qualified personnel — and the Trump Administration’s antics are making our communities less safe.”\n\nHalligan’s brief and turbulent time as interim US attorney ended in late January after an unsuccessful attempt at prosecuting Trump’s political foes — former FBI Director James Comey and New York Attorney General Letitia James.\n\nA federal courtdismissed those caseslate last year, judging that Trump’s appointment of Halligan — a Florida insurance lawyer who became the president’s personal lawyer, but had no experience as a prosecutor — was invalid. Judge Cameron McGowan Currie said in her November ruling that the power lies with the judges of the Eastern District to appoint a US attorney, until an executive branch nominee is approved by the Senate.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/DAGToddBlanche/status/2024993246175261137?s=20",
      "text": "said on X."
    },
    {
      "url": "https://www.cnn.com/2025/11/24/politics/james-comey-letitia-james-indictments-dismissed",
      "text": "dismissed those cases"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/doj-us-attorney-virginia-fired",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/doj-us-attorney-virginia-fired",
      "text": "Cookie Settings"
    }
  ],
  "hash": "70aea7a8b715bee703299c70559c59d70a63e332120f59c3fea17fa2ffe4c3d9",
  "scraped_at": "2026-02-23T07:36:54.411082+00:00"
}