{
  "url": "https://lite.cnn.com/2026/02/25/politics/caine-iran-hegseth-trump",
  "title": "Top General Dan Caine tries to avoid conflict with Trump while preparing for possible war with Iran | CNN Politics",
  "date": "2026-02-26T07:31:41.380054+00:00",
  "authors": [
    "Natasha Bertrand",
    "Zachary Cohen",
    "Haley Britzky"
  ],
  "text": "Source: CNN\n\nAs Chairman of the Joint Chiefs Gen. Dan Caine has been drafting military options forpotentially striking Iran, a steady stream of top officials from the Army, Navy and Air Force have been quietly summoned directly to his office.\n\nTypically, sensitive military operations are debated in the highly fortified conference room in the Pentagon known as the Tank. But in an administration that is focused on avoiding leaks, Caine — who is also known for his intensive secrecy — worried that assembling the top brass in the Defense Department’s nerve center on very short notice would draw suspicion, according to several sources familiar with the matter.\n\nIn those meetings and others at the Pentagon, Caine has been vocal about the potential downsides of launching a major military operation targeting Iran, raising concerns about the scale, complexity and potential for US casualties of such a mission, according to sources familiar with his advice.\n\nThose concerns have not matched the rhetoric coming out of the White House, where President Donald Trump has been bullish on how easily the US military could achieve victory, though the exact dimensions of that success haven’t been defined.\n\nBut Caine is determined to avoid what he believes were the mistakes of one of his predecessors, Gen. Mark Milley, and maintain his influence with Trump, according to sources familiar with his thinking.\n\nMilleyoften clashed directly with Trumpduring his first term on issues such as deploying the military domestically to quell protests, and sometimes undermined Trump’s inflammatory rhetoric privately to reassure nervous allies and foes.\n\nFor Caine, avoiding the Milley approach has meant being more reserved around Trump, and avoiding weighing in too directly on decisions, including what to do in Iran. It’s a tightrope that Caine has been attempting to walk during his year as Trump’s top military adviser – avoid direct conflict with a notoriously mercurial president, while still providing professional military guidance.\n\nSome say Caine hasn’t been assertive enough with Trump. “He’s definitely pulling punches,” a source familiar with Caine’s interactions with Trump said when comparing his White House conversations with his private discussions with military leaders.\n\nDespite any concerns Caine has raised internally, over the last month he has also orchestratedassembling the largest collection of US military hardwareassembled in the Middle East since the invasion of Iraq.\n\nThis account of Caine’s efforts to navigate his tenure as chairman is based on interviews with 10 current and former officials.\n\nJoint staff spokesperson Joe Holstead told CNN in a statement that Caine “never ‘pulls punches’ when discussing military options which could send our troops into harms way.”\n\n“The role of the Chairman of the Joint Chiefs of Staff and the approach of this Chairman is based on the Chairman’s statutory role to provide military advice to the President, the Secretary of War, and the National Security Council,” he said. “This Chairman fulfills these responsibilities by providing these leaders with a full spectrum of military options, along with precise and thoughtful consideration of the secondary effects, implications and risks associated with each option. He does so confidentially.”\n\nCaine,a former F-16 fighter pilotwho spent time as a military liaison to the CIA, rarely divulges his personal opinions on a policy, and his supporters say he’s doing exactly what a chairman is supposed to do — give the president the best military advice that will facilitate his agenda, policies the country’s top general has no business dictating.\n\nTrump has pushed Caine for weeks to develop a wide range of military plans, which now include everything from strikes on Iranian ballistic missile and nuclear facilities to wiping out Iran’s top leadership as a way to force regime change. Those options are being planned in parallel with diplomatic talks set for their next exchange on Thursday.\n\nBut in a Situation Room meeting last week about plans for Iran that went three times longer than scheduled, Caine was unable to predict what the result of a regime change operation would be, sources said. Caine had seemed more confident several months ago about the success of such a mission in Venezuela, whose leader was captured by the US military in a swift and decisive operation in January.\n\nIt’s part of Caine’s delicate balancing act, telling people privately that he wants to restore trust in his position as the country’s top general and in the military more broadly even as Trump has politicized both.\n\nIn response to questions for this story, White House spokesperson Anna Kelly described Caine as “a highly respected professional whose job requires providing unbiased information to the Commander in Chief, which he does perfectly.”\n\n“Any suggestion that the Chairman is providing his personal or political opinion, one way or another, is completely false,” Kelly said. “On all issues, President Trump listens to feedback from all members of his national security team, and he is always the final decision maker.”\n\nCaine has worked hard in his time as chairman to make sure he has Trump’s ear, at one point even trying to secure an office at the White House so he could brief the president more regularly and have a highly secure space to work from when he’s there, according to people familiar with the matter.\n\nA soft-spoken and self-deprecating airman who spent much of his career in the secretive world of spies and special operators, Caine is a member of Trump’s most-trusted inner circle, which includes Vice President JD Vance; Secretary of State Marco Rubio, and Susie Wiles, the White House chief of staff. He is even more trusted by Trump than Secretary of Defense Pete Hegseth, multiple people familiar with their relationship said, particularly when it comes to sensitive operational matters.\n\nIf Hegseth is frustrated with Caine, there is little he can do about it. “Caine has a direct line to Trump,” said one of the people familiar with the dynamic. “He has to respect the chain of command, but he’s the president’s guy. Hegseth can’t just shove him in a corner.”\n\nAs Pentagon concerns about the fallout of a potential major military operation in Iran began to make their way to the press, Trumptook to social media Mondayto reinforce his faith in Caine and to make it clear his weeks of threats of strikes haven’t been empty.\n\n“General Caine, like all of us, would like not to see War but, if a decision is made on going against Iran at a Military level, it is his opinion that it will be something easily won,” Trump wrote. “He only knows one thing, how to WIN and, if he is told to do so, he will be leading the pack.”\n\nWhen asked about Caine’s deliberations on Iran, Holstead said Caine “does not advocate for a single course of action, nor does he inject personal preference into operational deliberations.”\n\nA recently retired senior officer who previously worked with Caine told CNN that officers wondered why he’d been chosen in the first place, when there’s “obviously some expectation of loyalty” by Trump, and Caine is not the type to prioritize that over his loyalty to his oath as an officer.\n\n“Caine is a person of high emotional intelligence,” the recently retired senior officer said, “because he hasn’t gotten sideways with anyone, and he’s generally recognized as a team player.”\n\nOne official who’s worked with Caine put it simply: “How has Caine made it this long?  He is a genius at getting himself to be the person someone needs him to be in any setting.”\n\nLast September, when Defense Secretary Pete Hegsethabruptly summoned hundreds of the most senior US military officers to Virginiato hear him and Trump give a speech, Caine knew the event had the potential to veer into deeply political territory—something he’d promised Congress during his confirmation hearings that he would guard against.\n\nSo he privately gave the assembled generals and admirals advice he knew Hegseth and Trump might not like, according to people familiar with his remarks, including two military officials close to Caine: Don’t cheer, don’t react, and act as stoic as you would at the president’s annual State of the Union address, in keeping with the norms of a nonpartisan military.\n\nHe then introduced Hegseth and Trump, saying it was “vital” to hear from them. Trump seemed irked by the generals’ lack of reaction. “I’ve never walked into a room so silent before,” he said. “If you want to applaud, you applaud.”\n\nPentagon spokesman Sean Parnell disputed this account of Caine’s actions before Trump’s speech.\n\n“There is no tension between these great leaders,” he said. “They are both in agreement and focused on executing President Trump’s agenda to make our military the greatest fighting force in the world.”\n\nCaine’s path to becoming the country’s top general and sharing a stage with Trump was highly unusual. He retired in December 2024 as a three-star lieutenant general but was recalled to active service by Trump despite never having led a combatant command or serving as a service chief. That is how most previous chairmen have received their fourth star, before being elevated to the role of the US’ most senior military officer. In the end, Caine was promoted ahead of 38 eligible active duty four-star generals and admirals.\n\nIn Trump’s telling, Caine had shown he was committed to the president when they first met in 2018 while Caine was serving in Iraq, with Caine telling Trump that he “loved” him and would “kill for you” while wearing a MAGA hat.\n\nCaine said during his confirmation hearing last year thatthe incident had never happened. He also said that defending against the politicization of the military “starts with being a good example from the top and making sure that we are nonpartisan and apolitical and speaking the truth to power every day.”\n\nAnd yet, even as Trump has regularlypushed the legal limitsof how the US military can be deployed — sending troops into American cities over the objections of governors, bombing suspected drug traffickers in the Caribbean and Pacific, and attacking Iran and Venezuela without congressional authorization — Caine has dutifully given him options to execute these operations, sources told CNN.\n\n“Milley always wanted to be seen as the adult in the room, protecting the world from our democratically elected president,” said one Republican congressional aide. “It struck me as wildly inappropriate.”\n\nCaine works closely with one of the most politically polarizing figures in the Trump administration, Trump’s deputy chief of staff for policy Stephen Miller, on how to best carry out the US military’s operations inside the US and around Latin America, the sources said. Miller often phones Caine directly, asking for ways to put a plan into action.\n\nCaine’s careful planning to deliver options and not push decisions stands in contrast to the way Trump now views Milley, whose portrait was taken down from a wall in the Pentagon on day one of the administration and had his security detail revoked by Hegseth — on Trump’s orders — days later.\n\nDefense officials broadly see Caine as a useful counterbalance to Hegseth, whose inexperience and focus on culture war issues contrasts with Caine’s long military career and operational experience.\n\nOne example officials point to came in September, when Caine hand-delivered memos to Hegseth and the Pentagon’s policy chief Elbridge Colby outlining his disagreements over the new National Defense Strategy that Colby’s office had drafted, one of the sources said. Among Caine’s concerns with the document, which prioritizes homeland defense and the western hemisphere, was that it underplayed the threat posed by China and the US military’s need to prepare for a potential future conflict in the Indo-Pacific, sources said.\n\nA senior defense official declined to confirm that Caine had raised issues with the strategy, but said “the instances as you described them would simply be those of a Chairman and the Joint Chiefs doing their jobs.”\n\nCaine also appeared skeptical early on of the effectiveness of the US military’s extremely expensive operation, championed by Hegseth, to counter the Iran-backed Houthi rebel group in Yemen last year. He ultimately recommended to Trump that thecampaign be wound down, the sources said, and the president announced shortly thereafter that the US had reached a ceasefire deal with the Houthis.\n\nNonetheless, Caine’s reticence to strongly deliver his opinion on certain issues has left many military officials struggling to understand where he stands, especially considering the number of senior military officials who have been forced out for disagreeing with Trump and Hegseth.\n\nLast fall, Hegseth summoned then-US Southern Command Commander Adm. Alvin Holsey to a meeting with him and Caine. The meeting was tense — Hegseth did not believe Holsey was moving quickly or aggressively enough to combat drug traffickers in the Caribbean, and he complained about not being given the information he needed about operations there, sources said. But SOUTHCOM was concerned about the operations not being lawful. Caine remained largely quiet during the meeting, sources said.\n\nUltimately, Hegseth ousted Holsey,who retired early and just one year into his tenureas commander. But underscoring the persistent balancing act he’s played, Caine then presided over Holsey’s retirement ceremony and showered him with praise, in what some officials perceived as a subtle act of protest against Hegseth’s decision.\n\n“It’s never been about you, it’s been about people, it’s been about others,” Caine said of Holsey at his ceremony. “You’ve never said ‘I’ in all the conversations we’ve had. You’ve always said ‘we.’ … The impact you’ve had will last for a long time.”\n\nUnlike previous chairmen, Caine has avoided interacting with the press and has spoken publicly only from podiums. Late last year, some officials who work closely with Caine suggested he begin cultivating his own public persona, people familiar with the matter said.\n\nCaine has resisted that, preferring to stay as invisible as possible. But Trump has undoubtedly pushed him to the limits of his comfort zone. The most obvious example of this came last June, when Trump demanded Caine and Hegseth give a press conference aimed largely at discrediting anearly Defense Intelligence Agency assessmentthat had downplayed the long-term impact of the US strikes on Iran’s nuclear facilities.\n\nTrump had touted the attack as a “total obliteration” of Iran’s nuclear program.\n\nHegseth spent most of the press conference attacking the press for reporting on the assessment. But Caine pivoted, instead choosing to give a technical explanation of the bombings — complete with graphics of the 30,000-pound GBU-57 Massive Ordnance Penetrators used to hit the facilities — and the pilots who dropped the munitions from B-2 bombers following an 18-hour flight from Missouri to Iran.\n\nTrump’s special envoy Steve Witkoff said on Saturday, however, that Iran is now “probably a week away from having industrial-grade bombmaking material.”\n\nCaine was also thrust front and center after the US military operation tocapture former Venezuelan president Nicolas Madurofrom his compound in Caracas in the early hours of January 3.\n\nCaine’s summary of the operation during a press conference the next day read like a screenplay for an action movie, describing American helicopters and troops coming under fire both as they approached Maduro’s compound in the dead of night and as they extracted him out to an aircraft carrier in the Caribbean.\n\n“I want to thank General “Raizin” Caine,” Trump said at the press conference. “He’s a fantastic man. I’ve worked with a lot of generals. I worked with some I didn’t like, I worked with some I didn’t respect, I worked with some that just weren’t good, but this guy is fantastic.”\n\nApart from his appearances at press conferences and industry events, Caine has maintained a very low profile. Hegseth has made it clear that he does not want Caine interacting with reporters without his signoff, sources said. The Joint Staff is now required to get permission from the secretary’s office before speaking to the media, and reporters no longer travel with the chairman, in a break with tradition.\n\nCaine obliges Hegseth’s requests, largely because he has spent months trying to repair the joint staff’s relationship with the defense secretary. Prior to Caine’s confirmation in April, Hegseth harbored deep suspicions that the Joint Staff was leaking information to make him and his team look bad.\n\nStill, some officials believe Caine has sometimes gone too far in his efforts to please Hegseth and point to one episode last October.\n\nThat month, Caine rushed to get recertified to fly the F-16 fighter jet — including making room in his schedule for frequent flight training at Joint Base Andrews, according to a person with knowledge of the situation — so that he could fly alongside Hegseth in the jets while visiting Naval Air Station Fallon in Nevada, where he’d completed Air Force Weapons School decades earlier. The chairman moved forward with the event despite the government shutting down and all those required to support the trip having to go without pay, this person said.\n\nThe biggest source of tension between Caine and Hegseth has been over personnel, multiple sources said, and Caine has routinely lost those battles with the secretary. Caine tried to convince Hegseth not to push out several senior military officials last year, including the former director of the Joint Staff Lt. Gen. Doug Sims and the former director for Strategy, Plans, and Policy on the Joint StaffLt. Gen. Joe McGee, who Hegseth accused of leaking against him and being insufficiently aligned with his agenda, sources said. Both were forced to retire early.\n\nCaine has tried to appeal to Hegseth, telling him the abrupt and seemingly retributive firings, the delayed promotions, and the forced retirements that have seen dozens of top generals and admirals pushed out have not been good for the secretary’s standing with the force, the sources said.\n\nThe move to relieve senior military officers over their perceived alignment with a political agenda or other unspecified reasons has been challenging for Caine and other leaders in the services, the recently retired senior officer said. But ultimately it falls back on the constitutional principal of civilian control of the military, whether the military likes their decisions or not.\n\n“At the end of the day, guys like Caine and service leaders haven’t been happy about it …. but [Caine] understands it’s fair and it’s just the way of things. To do anything else, it’s like, what else are you going to do? It’s kind of a tough situation,” the recently retired officer said. “But I do think there’s moral injury taking place with our senior leaders.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/politics/iran-trump-military-options-nuclear",
      "text": "potentially striking Iran"
    },
    {
      "url": "https://www.cnn.com/2021/07/15/politics/milley-trump-politics-january-6",
      "text": "often clashed directly with Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
      "text": "assembling the largest collection of US military hardware"
    },
    {
      "url": "https://www.cnn.com/2025/04/01/politics/dan-caine-chairman-joint-chiefs-confirmation-hearing",
      "text": "a former F-16 fighter pilot"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116121997925438698",
      "text": "took to social media Monday"
    },
    {
      "url": "https://www.cnn.com/2025/09/30/politics/hegseth-speech-culture-standards",
      "text": "abruptly summoned hundreds of the most senior US military officers to Virginia"
    },
    {
      "url": "https://www.cnn.com/2025/04/01/politics/dan-caine-chairman-joint-chiefs-confirmation-hearing",
      "text": "the incident had never happened"
    },
    {
      "url": "https://www.cnn.com/2025/10/15/politics/pentagon-lawyers-sidelined-jags",
      "text": "pushed the legal limits"
    },
    {
      "url": "https://www.cnn.com/2025/05/06/politics/us-to-stop-strikes-on-houthis-in-yemen",
      "text": "campaign be wound down"
    },
    {
      "url": "https://www.cnn.com/2025/10/16/politics/southern-command-caribbean-strikes-holsey",
      "text": "who retired early and just one year into his tenure"
    },
    {
      "url": "https://www.cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites",
      "text": "early Defense Intelligence Agency assessment"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/americas/venezuela-maduro-fort-tiuna-compound-operation-reconstruction-intl-invs",
      "text": "capture former Venezuelan president Nicolas Maduro"
    },
    {
      "url": "https://www.cnn.com/2025/10/29/politics/three-star-pushed-out-by-hegseth-caine-over-tensions",
      "text": "Lt. Gen. Joe McGee"
    }
  ],
  "hash": "70f7840c092593f7af09448e2bf9aef558d0f1fe52f4f205a1aacbdf989ff6a9",
  "scraped_at": "2026-02-26T07:31:41.380067+00:00"
}