{
  "url": "https://lite.cnn.com/2026/02/19/entertainment/eric-dane-death",
  "title": "Eric Dane, an advocate for people with ALS, is dead at 53 | CNN",
  "date": "2026-02-21T07:05:28.652605+00:00",
  "authors": [
    "Alli Rosenbloom",
    "Dan Heching",
    "CNN"
  ],
  "text": "Source: CNN\n\nEric Dane, the handsome and hunky actor who steamed up primetime TV on “Grey’s Anatomy” at the height of the show’s popularity, has died, according to his publicist. He was 53.\n\n“With heavy hearts, we share that Eric Dane passed on Thursday afternoon following a courageous battle with ALS. He spent his final days surrounded by dear friends, his devoted wife, and his two beautiful daughters, Billie and Georgia, who were the center of his world,” the statement read.\n\nDaneannounced he was living with amyotrophic lateral sclerosis(ALS), also known as Lou Gehrig’s Disease, in 2025. Following his diagnosis, he “became a passionate advocate for awareness and research, determined to make a difference for others facing the same fight,” the statement added.\n\n“He will be deeply missed, and lovingly remembered always,” the statement added. “Eric adored his fans and is forever grateful for the outpouring of love and support he’s received.”\n\nDane enjoyed a robust TV and film career that began in the early 1990s. He had bit parts in popular series including “The Wonder Years” and “Roseanne” before a multi-episode arc in the early aughts on “Gideon’s Crossing.”\n\nMeatier roles followed, including that of Jason Dean on “Charmed” in 2003, before he took on the role of smoldering Dr. Mark Sloan on Shondaland megahit “Grey’s Anatomy” on ABC, beginning in 2006.\n\nEarning the moniker “McSteamy” on screen, it stuck off-screen, too. Dane became a fixture of the medical drama from seasons 3 through 9, when his character was written off, dying from injuries sustained in a plane crash.  He reprised the role in 2021 during the long-running show’s 17th season, which featuredmultiple buzzyreturns from past characters.\n\nDane talked about his complicated feelings about playing McSteamy during anappearanceon SiriusXM’s “Jess Cagle Show” in 2022, classifying his time on the show as “a magical time in my life.”\n\n“It was a fun show. It was new for us and it was exciting. We were on this juggernaut of a television show that was in every country and that everybody watched,” he said. “I don’t know that I necessarily felt comfortable being McSteamy, so much so that I think that may be the third time I’ve actually said that name, but it was fun and I love all those people dearly.”\n\nIn a statement posted late Thursday, actress Kim Raver honored her former “Grey’s Anatomy” co-star, writing, “Eric was a light. You’d see it effortlessly shine from him on the set of ‘Grey’s’ as well as when he was with Rebecca and the girls.”\n\n“During filming he’d get this twinkle in his eye and with a mischievous look, he would deliver with perfect comedic timing, a line of dialogue that would floor you,” she wrote. “You will be missed.”\n\nCreator Shonda Rhimes added in a statement to CNN that Dane “was truly a gifted actor whose portrayal of Dr. Mark Sloan left an indelible mark on the series and on audiences around the world.”\n\nDuring his tenure on “Grey’s,” Dane also appeared in several popular films, including “X-Men: The Last Stand,” “Marley & Me” and “Burlesque.”\n\nIn 2019, he took on the role of Cal Jacobs, the stern and standoffish father to Jacob Elordi’s neo-high school jock Nate on “Euphoria.” Dane reprised the role in the acclaimed series’ second season, and is listed as set to appear in the show’slong-awaited third and final seasonthis spring.\n\nIn a statement to CNN, “Euphoria” creator Sam Levinson said he was “heartbroken” by Dane’s passing. “Working with him was an honor. Being his friend was a gift,” he said.\n\nDane remained active until quite recently,appearing last fall in an episodeof “Brilliant Minds,” where he played a firefighter who suffered from ALS.\n\nDane first announced his diagnosis last April and worked hard to advocate for further assistance for those with and research into neurodegenerative diseases.\n\nIn June, during his first televisioninterviewsince revealing his diagnosis, Dane opened up about some of the symptoms that led to the discovery of his diagnosis, telling ABC’s “Good Morning America” that it all started with “some weakness in my right hand.”\n\nALS progressively affects the nerve cells in the brain and spinal cord that make the muscles of both the upper and lower body work, according to the ALS Association, a non-profit organization that works to research the disease and offer resources to people living with it.\n\nThere is currently no known cure.\n\n“At the end of the day, just, all I want to do is spend time with my family and work a little bit if I can,” he told ABC in June. “I don’t think this is the end of my story. I just don’t feel like, in my heart, I don’t feel like this is the end of me.”\n\nDane went on to advocate for legislation addressing research on neurodegenerative diseases.\n\nIn October, hetraveledto Washington, DC with the nonprofit I AM ALS to advocate for additional research into ALS, as the Accelerating Access to Critical Therapies for ALS Act, which was passed in 2021, had provided for five years of research into the disease, among other provisions, and was close to running out.\n\nI AM ALS said it was “heartbroken” by Dane’s death. “Eric used his platform not for attention, but for action,” the group said in a statement, calling him “a fierce advocate, a generous spirit, and a true champion in the movement to end ALS.”\n\nWhile in DC, Dane spoke about his hope for the future.\n\n“I have two daughters at home. I want to see them, you know, graduate college, and get married and maybe have grandkids,” Dane said. “I want to be there for all that. So I’m going to fight to the last breath on this one.”\n\nDane shared teen daughters Billie and Georgia with actress Rebecca Gayheart.\n\nThis story has been updated with additional information.\n\nCNN’s Lisa Respers France contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/04/10/entertainment/eric-dane-als-diagnosis-wellness",
      "text": "announced he was living with amyotrophic lateral sclerosis"
    },
    {
      "url": "https://www.cnn.com/2021/04/02/entertainment/greys-anatomy-characters-trnd",
      "text": "multiple buzzy"
    },
    {
      "url": "https://www.youtube.com/watch?v=voJEHlKriRM",
      "text": "appearance"
    },
    {
      "url": "https://www.cnn.com/2025/12/04/entertainment/euphoria-sam-levinson-season-3-storylines",
      "text": "long-awaited third and final season"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/entertainment/eric-dane-als-brilliant-minds",
      "text": "appearing last fall in an episode"
    },
    {
      "url": "https://www.cnn.com/2025/06/16/entertainment/eric-dane-als-gma",
      "text": "interview"
    },
    {
      "url": "https://www.cnn.com/2025/10/01/entertainment/eric-dane-vows-to-fight-als",
      "text": "traveled"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/entertainment/eric-dane-death",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/entertainment/eric-dane-death",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7119aa149b8b3106645d881e5097c0793da1aeed5671689b794a2285733b14d1",
  "scraped_at": "2026-02-21T07:05:28.652618+00:00"
}