{
  "url": "https://lite.cnn.com/2026/02/19/middleeast/british-couple-jailed-espionage-iran-10-years-intl",
  "title": "British couple Iran: UK condemns 10-year sentence for British couple in Iran | CNN",
  "date": "2026-02-20T07:29:22.362323+00:00",
  "authors": [
    "Reuters, CNN"
  ],
  "text": "Source: Reuters\n\nBritish foreign minister Yvette Cooper on Thursday condemned as “totally unjustifiable” the10-year sentencegiven to a British couple in Iran forspying,saying the government would continue to press for their release.\n\nCraig and Lindsay Foreman had been charged with espionage afterIranaccused them of gathering information in several parts of the country.\n\n“We will pursue this case relentlessly with the Iranian government until we see Craig and Lindsay Foreman safely returned to the UK and reunited with their family,” Cooper said in a statement.\n\nThe Foremans were arrested on January 3 of last year while traveling through Iran on a global motorcycle journey. Iranian state media announced their detention the following month over espionage charges and they have now been held for more than 13 months.\n\nJoe Bennett, Lindsay’s son, said in a separate statement the couple had appeared at a three-hour trial on October 27, in which they were not allowed to present a defense.\n\n“We have seen no evidence to support the charge of espionage,” he said, adding that the family was deeply concerned about the couple’s welfare and the lack of transparency in the judicial process.\n\nBennett called on the British government to “act decisively and use every available avenue” to secure their release.\n\nThe Iranian embassy in London did not immediately respond to a request for comment on the sentencing.\n\nAccording to a family statement, the couple have been held for extended periods without being able to communicate. They have had limited or delayed access to legal representation, periods of solitary confinement and delays in receiving funds for basic necessities. They also reported disrupted or canceled consular visits.\n\nCooper, whose office did not comment on the disruption, said they would continue to provide consular assistance.\n\nLindsay Foreman has been held in the women’s section of Tehran’s Evin Prison, while her husband Craig has been held in its political wing.\n\nIran’s Revolutionary Guards have in recent years detained foreign and dual nationals, typically on espionage or national security charges.\n\nHuman rights organizations say the authorities use such arrests as leverage in disputes with other countries, a practice they describe as part of a broader pattern of politically motivated detentions. Tehran has rejected those accusations and said the cases involved legitimate security concerns.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/middleeast/iran-sentence-two-french-citizens-intl-latam",
      "text": "10-year sentence"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/middleeast/american-israeli-espionage-charges-iran-intl",
      "text": "spying,"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
      "text": "Iran"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/middleeast/british-couple-jailed-espionage-iran-10-years-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/middleeast/british-couple-jailed-espionage-iran-10-years-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "713f134d961c0401274c8a8f7a16b1904a2807bf4fcc76865a60eedd872c865d",
  "scraped_at": "2026-02-20T07:29:22.362336+00:00"
}