{
  "url": "https://lite.cnn.com/2026/02/27/economy/us-ppi-wholesale-inflation-january",
  "title": "Wholesale inflation was hotter than expected in January as tariffs threaten to push up prices for consumers | CNN Business",
  "date": "2026-02-28T06:59:49.706896+00:00",
  "authors": [
    "Alicia Wallace"
  ],
  "text": "Source: CNN\n\nThe prices businesses pay to each other took a sharp turn higher in January, new data showed Friday, indicating that more tariff-related price increases could be still to come.\n\nThe Producer Price Index rose 0.5% last month, a pickup from December’s 0.4% rate, according to the latest data from the Bureau of Labor Statistics. The annual rate of inflation nudged down to 2.9% from 3%.\n\nEconomists were expecting wholesale inflation to increase by 0.3%, which would have resulted in a 2.6% annual rate.\n\nUS stocks moved sharply lower Friday morning, with investors fearing the hotter-than-expected inflation report could lead the Federal Reserve to keep its rate-cutting cycle on pause. The Dow fell 728 points, or 1.47%. The S&P 500 sank 0.8%, and the tech-heavy Nasdaq slid 0.92%.\n\nPPI, which measures the average change in prices that producers receive for their goods and services, is closely watched as a potential bellwether for the prices consumers may see in the months ahead.\n\n“Tariffs are being passed through along the supply chain,” Michael Reid, US economist at RBS Capital Markets, told CNN on Friday. “And so, our worry is that this is not the end of the pass through. We have not yet seen the full impact on consumer prices in the goods space.”\n\nGas and food prices tumbled during the month; however, those decreases were countered by a sharp increase in “trade services,” a category that measures profit margins for wholesalers and retailers.\n\nTrade services can be highly volatile on a monthly basis. But economists have closely watched this category during the past year since it could serve as a signal for whether businesses are absorbing the higher costs US importers are paying for tariffs.\n\nTrade services leapt 2.5% in January, a potential indication that costs could be passed along to other businesses and consumers.\n\nSome of the industries that logged the sharpest increase in trade services included apparel; footwear; chemicals; wired telecommunications; health, beauty and optical products; as well as some food and alcohol.\n\n“These are all things that consumers pay for, directly or indirectly,” Reid said.\n\nWhen excluding food and energy, the core PPI gauge (which provides a measure of the underlying inflation trend) picked up sharply. Prices rose 0.8% versus 0.6% in December to bring the annual rate to 3.6%, the highest in 10 months.\n\nOther details in Friday’s report further corroborated the idea that President Donald Trump’s steep and sweeping tariffs continued to drive prices higher for US businesses, which in turneventually leads to higher prices for consumers, Reid said.\n\nNotably, he said, prices of finished consumers goods excluding food and energy continued to ramp higher, rising to an annual rate of 3.4%. That’s the highest year-over-year inflation rate for that category in more than two years (when goods were winding down from the pandemic-era inflationary burst).\n\nAlso, on the services side, inflation was unchanged if trade (margins), transportation and warehousing prices were excluded.\n\n“In this environment, when you think about services, and notably those that exclude the trade-related services, there is no (price) pressure there,” he said.\n\nThe higher wholesale prices very well could translate to more expensive goods and services for consumers, Reid said; however, the alternative isn’t easy to swallow either.\n\n“We may not necessarily see a pronounced rise in the prices for these consumer goods, but that would mean there would be margin compression in the sector; and in that scenario, if you don’t get higher prices, you risk seeing more significant layoffs,” he said.\n\nThere’sa laundry list of reasonswhy tariff-driven price hikes have been slow to develop and not showing up until months after they’ve been in place: The biggest reason was that businesses loaded up their warehouses with pre-tariffed goods, drawing down that inventory through much of last year.\n\nAdditionally, the erratic nature of Trump’s trade moves has resulted in a varied approach as to how and which products are tariffed and when.\n\nThe latest twists – theSupreme Court ruling that Trump exceeded his authorityon some tariffs, the president’s subsequent 15% global tariff response and expectations that further tariffs will follow – could create another “front-loading” window for some businesses; however, the broader trade and tariff story isn’t expected to change dramatically, Reid said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/08/24/economy/us-tariffs-passthrough-consumers",
      "text": "eventually leads to higher prices for consumers"
    },
    {
      "url": "https://www.cnn.com/2025/07/10/economy/tariffs-higher-prices-inflation",
      "text": "a laundry list of reasons"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "Supreme Court ruling that Trump exceeded his authority"
    }
  ],
  "hash": "71462545df2ded553ad99f2485db270a941db412334eac80f5fa58bc5e8df041",
  "scraped_at": "2026-02-28T06:59:49.706908+00:00"
}