{
  "url": "https://lite.cnn.com/2026/02/12/science/solar-system-inside-out-planets",
  "title": "Astronomers detect a solar system they say should not be possible | CNN",
  "date": "2026-02-12T21:29:27.607729+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAn exoplanetary system about 116light-yearsfrom Earth could flip the script on how planets form, according to researchers who discovered it using telescopes from NASA and the European Space Agency, or ESA.\n\nFour planets orbit LHS 1903 — a red dwarf star, the most common type of star in the universe — and are arranged in a peculiar sequence. The innermost planet is rocky, while the next two are gaseous, and then, unexpectedly, the outermost planet is also rocky.\n\nThis arrangement contradicts a pattern commonly seen across the galaxy and in our own solar system, where the rocky planets (Mercury, Venus, Earth and Mars) orbit closer to the sun and the gaseous ones (Jupiter, Saturn, Uranus and Neptune) are farther away.\n\nAstronomers suspect thiscommon patternarises because planets form within a disk of gas and dust around a young star, where temperatures are much higher close to the celestial body. In these inner regions, volatile compounds such as water and carbon dioxide are vaporized while only materials that can withstand extreme heat — such as iron and rock-forming minerals — can clump together into solid grains. The planets that form there are therefore primarily rocky.\n\nFarther from the star, beyond what scientists call the “snow line,” temperatures are low enough for water and other compounds to condense into solid ice — a process that allows planetary cores to grow quickly. Once a forming planet reaches about10 timesthe mass of Earth, its gravity is strong enough to pull in vast amounts of hydrogen and helium, and in some cases, this runaway growth produces a giant gas planet such as Jupiter or Saturn.\n\n“The paradigm of planet formation is that we have rocky inner planets very close to the stars, like in our solar system,” said Thomas Wilson, an assistant professor in the department of physics at the University of Warwick in England and first author of a study on the discovery that was published Thursday in the journalScience. “This is the first time in which we have a rocky planet so far away from its host star, and after these gas-rich planets.”\n\nThe unexpected rocky planet, called LHS 1903 e, has a radius about 1.7 times that of Earth, making it what astronomers call a “super Earth” — a larger version of our planet with similar density and composition. But why is it there, defying logic and previous observations?\n\n“We think that these planets formed in very different environments from each other, and that is what’s kind of unique about this system,” Wilson said. “This outer planet, which is rockier compared to the middle two planets, shouldn’t have happened, based on the standard formation theory. But what we think happened is that it formed later than the other planets.”\n\nThe planetary system was first discovered using a Transiting Exoplanet Survey Satellite, or TESS, a NASA space telescope launched in 2018 to discover new exoplanets. The system was then analyzed using ESA’s CHaracterising ExOPlanet Satellite, or Cheops, which was launched in 2019 to study stars that are already known to host exoplanets. The researchers also used data fromothertelescopesacross the world, leading to a large international collaboration.\n\nAfter they confirmed the odd finding of an “inside out” planetary system, the scientists tested some hypotheses to explain the presence of the outermost rocky planet, hoping to understand whether it could have formed via a collision between other planets, or if it could be the remnant of a gas-rich planet that had lost its outer envelope.\n\n“We ran a lot of dynamical analysis in this study, basically throwing these planets at each other and throwing other planets at these planets, seeing if you could remove the atmosphere, if you could create these planets via impacts,” Wilson said, referring to two possible formation processes. “But we cannot make these planets this way.”\n\nOnce they ruled out these possibilities, the researchers landed on what Wilson calls a “gas-depleted” formation mechanism in which the planets formed one after another and in the opposite order to our own solar system, starting with the innermost planet and moving outward.\n\n“This formation mechanism, where you start with the inner one and then you move away from the host star, means the outermost planet formed millions of years after the innermost one,” Wilson said. “And because it formed later, there was actually not that much gas and dust in the disk left to build this planet from.”\n\nIn our solar system, the gas giants formed first and quickly, followed by the four inner rocky planets. There are also rocky bodies beyond the orbit of Neptune, such as Pluto, but compared with LHS 1903 e, Wilson said, they are far smaller, ice-rich and likely formed much later than the other solar system planets, as a result of collisions.\n\nThe finding may offer “some of the first evidence for flipping the script on how planets form around the most common stars in our galaxy,” according to Sara Seager, professor of planetary science and physics at the Massachusetts Institute of Technology and a coauthor of the study.\n\nHowever, she added, the study is centered around a difficult interpretation, so the debate remains open. “Even in a maturing field, new discoveries can remind us that we still have a long way to go in understanding how planetary systems are built,” she said in an email.\n\nLHS 1903 is an intriguing planetary system that can teach scientists a lot about how small planets form and evolve, according to Heather Knutson, a professor of planetary science at the California Institute of Technology who was not involved with the study. “Planet e is particularly intriguing, as it can potentially host many different kinds of atmospheres and may be cool enough for water to condense,” she said in an email. “This would be a fascinating planet to observe with the James Webb Space Telescope, which might be able to tell us more about its atmospheric properties.”\n\nAccording to Ana Glidden, a postdoctoral researcher at MIT’s Kavli Institute for Astrophysics and Space Research, the four-planet LHS 1903 system can serve as a natural laboratory for studying how small planets form around a star different than our own sun. She also didn’t participate in the research.\n\n“The authors reasonably conclude that the outermost planet likely formed in a region with little gas rather than losing its atmosphere through a violent collision,” Glidden wrote in an email, adding that future observations may allow scientists to probe their atmospheres and better understand how different types of planets form and evolve.\n\nThe formation hypothesis outlined in the paper is exciting, but planet formation is a complex process that scientists are still trying to understand, warned Néstor Espinoza, an astronomer at the Space Telescope Science Institute in Baltimore who did not work on the study.\n\nHow planets form around small stars such as LHS 1903 is now a matter of debate, Espinoza added in an email. “This system adds a very interesting datapoint that will have planet formation models trying to explain it for years to come — and I’m sure we will learn something new about the process of planet formation once they are compared against each other!”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2023/03/31/world/bill-nye-light-year-scn",
      "text": "light-years"
    },
    {
      "url": "https://science.nasa.gov/exoplanets/how-do-planets-form/",
      "text": "common pattern"
    },
    {
      "url": "https://science.nasa.gov/exoplanets/how-do-planets-form/",
      "text": "snow line"
    },
    {
      "url": "https://www.britannica.com/science/solar-system/Modern-ideas",
      "text": "10 times"
    },
    {
      "url": "https://doi.org/10.1126/science.adl2348",
      "text": "Science"
    },
    {
      "url": "https://www.eso.org/public/teles-instr/lasilla/36/harps/",
      "text": "other"
    },
    {
      "url": "https://lco.global",
      "text": "telescopes"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/science/solar-system-inside-out-planets",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/science/solar-system-inside-out-planets",
      "text": "Cookie Settings"
    }
  ],
  "hash": "71552c7eeaf0eae257a15b13639b4373325ce6709c4eb64980b744219014c650",
  "scraped_at": "2026-02-12T21:29:27.607756+00:00"
}