{
  "url": "https://lite.cnn.com/2026/02/20/politics/judge-rips-washington-post-fbi-reporter-warrant",
  "title": "Judge who allowed FBI to search Washington Post reporter’s home rips into Justice Department | CNN Politics",
  "date": "2026-02-23T07:37:42.357671+00:00",
  "authors": [
    "Devan Cole, CNN"
  ],
  "text": "Source: CNN\n\nA federal judge ripped into the Justice Department on Friday for failing to inform him of the applicability of a law intended to protect journalists from government searches and seizures when it asked him for permission to raid a Washington Post reporter’s home earlier this year.\n\n“How could you miss it? How could you think it doesn’t apply?” Magistrate Judge William Porter asked a DOJ lawyer during a hearing in Alexandria, Virginia.\n\n“I find it hard to believe that in any way this law did not apply,” Porter added later.\n\nThe judge said during the hearing that he had declined to approve the warrant for materials from reporter Hannah Natanson several other times.\n\nJustice Department attorney Christian Dibblee argued that the decision was made by department officials several rungs above him, but that he understood the judge’s “frustration.”\n\nPorter shot back: “That’s minimizing it!”\n\n“Ms. Natanson has been deprived of basically her life’s work,” Porter said during the hearing, echoing comments from her lawyer that she’s been unable to continue reporting and gathering confidential sources following the raid.\n\nThe Privacy Protection Act of 1980 is intended to protect journalists and newsrooms from government searches and seizures of a reporter’s work product materials unless the reporter is themself the subject of a criminal investigation or prosecution.\n\nCNN has previously reported that the Post reporter, Natanson, is not under investigation. But her communications with a government contractor who was charged with illegally leaking classified information are what led prosecutors to ask Porter to approve a search warrant for her Virginia home.\n\nLast month, federal agents arrived at Natanson’s home and seized a phone, two computers and a Garmin watch were seized. After Natanson and the Post sued in an effort to get the devices back, Porter temporarily blocked investigators from examining them.\n\nDibblee and DOJ attorney Gordon Kromberg tried to tell Porter on Friday that the department didn’t believe the law was applicable in this case, with Dibblee at one point saying it’s not the kind of “adverse authority” that lawyers are typically required to raise with a court when making requests for such warrants.\n\n“You don’t think you have an obligation to say that?” Porter said at one point. “I’m a little frustrated with how the process went down.”\n\nThe alleged leaker,Aurelio Luis Perez-Lugones, pleaded not guilty late last month to five counts of unlawfully transmitting national defense information to Natanson through an encrypted messaging application and a single count of unlawfully retaining the defense information.\n\nPress freedom advocates have raised alarm bells over the non-disclosure of the law, decrying the decision as a significant assault on key protections for newsrooms.\n\n“The government appears to have ignored a crucial press freedom guardrail in searching a journalist’s home and did not alert the magistrate judge to the law’s application in this case, let alone show how or if it had complied with the statute’s considerable protections,” Gabe Rottman, the vice president of policy for the Reporters Committee for Freedom of the Press, said earlier this month.\n\nPorter is weighing a request from Natanson and the Post for him to order the government to return the seized devices and data back to them or set up a process through which the massive volume of information can be reviewed and the materials that relate to Perez-Lugones’ can be separated from information that is not relevant to his case.\n\nHe appeared sympathetic to the reporter’s argument that the government seized much more than it needed during its raid last month, but noted that in today’s digital world, it’s difficult to easily separate material that is responsive to a search warrant from material that is not.\n\n“What’s the government’s need for all that information?” he asked at one point.\n\nDibblee quickly conceded “there is more information that was received than what was pursuant to the warrant,” drawing a scoffing laugh from the judge.\n\nPorter didn’t appear ready to issue an order requiring the Justice Department to turn over all the devices, instead suggesting that the court could set up a “filter team” that would look through the data and determine what fit within the parameters of the search warrant and what may need to be returned to Natanson or shielded from the government’s eyes\n\nHe said he would rule in the coming weeks.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/ex-government-contractor-charged-leaking-washington-post",
      "text": "Aurelio Luis Perez-Lugones"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/judge-rips-washington-post-fbi-reporter-warrant",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/judge-rips-washington-post-fbi-reporter-warrant",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7168d06487ae8d982dc6e1c19d32a44755d17ee9b824fe41cc95189256edb880",
  "scraped_at": "2026-02-23T07:37:42.357684+00:00"
}