{
  "url": "https://lite.cnn.com/2026/02/23/politics/supreme-court-boulder-colorado-climate-change-oil-companies",
  "title": "Supreme Court to decide if Colorado city can sue oil companies for climate change | CNN Politics",
  "date": "2026-02-24T07:32:20.845385+00:00",
  "authors": [
    "John Fritze, CNN"
  ],
  "text": "Source: CNN\n\nThe Supreme CourtagreedMonday to take up a major environmental appeal from fossil fuel producers who are hoping to shake off a lawsuit from a Colorado city that wants to hold them responsible for climate change.\n\nThe court’s decision could have broad implications for numerous other lawsuits filed by state and local governments seeking billions of dollars in damages.\n\nThe appeal follows a decision from the Colorado Supreme Court last year that rejected an effort by Suncor Energy and Exxon Mobil to get the lawsuit from Boulder, Colorado, tossed out on the grounds that such state-law claims are preempted by the Clean Air Act.\n\n“Boulder, Colorado, cannot make energy policy for the entire country,” an attorney for the industry told the Supreme Court, adding that justices should step in to “clarify that state law cannot impose the costs of global climate change on a subset of the world’s energy producers chosen by a single municipality.”\n\nThe 6-3 conservative Supreme Court has repeatedly ruled against environmentalists in recent years. In May, a unanimous courtlimited the scope of environmental reviewsof major infrastructure projects in a decision that was expected to speed up approvals of highways, airports and pipelines.\n\nPresident Donald Trump’s administration urged the justices to take the case, arguing that if Colorado was allowed to pursue its case “energy companies across the globe will be subject not only to billions of dollars in damages, but also to a multiplicity of rules governing their conduct in any given location, as one city after another seeks to hold the companies liable for fossil-fuel activities anywhere in the world.”\n\nBoulder sued the companies arguing they knowingly misled the public about climate risks. In its response to the Supreme Court, the city said the Supreme Court shouldn’t get into the legal fight at an early stage of the litigation and it rejected the idea that federal law blocked their claims from moving forward.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.supremecourt.gov/orders/courtorders/022326zor_7758.pdf",
      "text": "agreed"
    },
    {
      "url": "https://www.cnn.com/2025/05/29/politics/supreme-court-nepa",
      "text": "limited the scope of environmental reviews"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/supreme-court-boulder-colorado-climate-change-oil-companies",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/supreme-court-boulder-colorado-climate-change-oil-companies",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7349c7e99da5c520a967d39dd2f31396e50230413933ca80bc05bc8093ad8528",
  "scraped_at": "2026-02-24T07:32:20.845399+00:00"
}