{
  "url": "https://lite.cnn.com/2026/02/10/economy/us-jobs-report-january-preview-revisions",
  "title": "The first jobs report of 2026 is coming out Wednesday. It could be a doozy | CNN Business",
  "date": "2026-02-11T16:33:07.021067+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nWe’ll get a first look Wednesday at the state of the US job market as 2026 kicked off, as well as a clearer picture of hiring in 2025.\n\nThe Bureau of Labor Statistics is set to release the January jobs report at 8:30 am ET Wednesday. The crucial employment snapshot is slightly delayed because of the brief government shutdown and will show whether the trajectory improved for the US labor market, which has been stuck in a low-hire and low-fire lull.\n\nLast year, the economy posted its weakest year of job gainsoutside of a recession since 2003.\n\nThe year ended with the economy adding 50,000 jobs in December (roughly matching the average monthly gain for the year) and unemployment dipping to 4.4%, the BLS reported.\n\n“Many workers feel stuck in their careers or feel frozen out of the job market,” said Daniel Zhao, chief economist at employment site Glassdoor.\n\nThe all-important churn needed for a healthy labor market has slowed considerably, and there are more people searching for jobs than are available.\n\nThe January jobs report will also include a series of critical revisions (namely, theannual benchmark revision) and statistical modeling adjustments that not only will provide a fuller look at past employment trends but also could very well shape our current and future view of the labor market.\n\nThere’s going to be a lot to unpack Wednesday, so here’s a cheat sheet to help get up to speed:\n\nIn short: Expect to see more of the same. Heading into this year, economists said monthly job gains could hover around that 50,000-a-month range.\n\nThe recent batch of labor market data (bothpublicandprivate) indicated that there’s a high likelihood that job growth was tepid, unemployment remained subdued and that health care remained a primary driver of overall hiring.\n\nThere’s a possibility that seasonal and weather-related factors could result in a stronger-than-expected reading for January: Weaker holiday hiring has meant fewer post-holiday layoffs, and unseasonably warm weather during the early part of last month could have bolstered employment in industries like construction.\n\nEconomists’ consensus estimates are for job gains of 80,000 last month and for the jobless rate to stay at 4.4%, according to FactSet.\n\nThere is a combination of factors at play.\n\nOn the supply side, Baby Boomers are aging and retiring, population growth has slowed, and there’s been a sharp reduction in immigration and an increase in deportations.\n\nOn the demand side: Large employers are whittling down their ranks after over-hiring during the pandemic; high levels of uncertainty – particularly around the Trump administration’s sudden, shifting and sweeping domestic policy changes – have clouded businesses’ decision-making and stifled hiring; firms have shifted some investments away from hiring and toward equipment and technology (including artificial intelligence) to shore up productivity; and a high-cost environment alongside steep tariffs, federal funding cutbacks and aggressive immigration enforcement have negatively affected some businesses.\n\nJoe Brusuelas, senior economist at RSM US, highlighted a few of those factors when pushing back on White House economic adviser Kevin Hassett’s claim Monday that subdued job gains are primarily the result of lower population figures and higher productivity.\n\n“The idea that slower hiring is simply a function of long-term demographics is both unsatisfactory and an attempt to distract from immigration and trade policies – see the 72,000 decline in manufacturing jobs last year that will likely look worse following the upcoming benchmark revision,” Brusuelas said in a statement.\n\nFederal data is fluid and frequently subject to change as more detailed and accurate information becomes readily available. The BLS’ monthly jobs report is meant to provide a higher-frequency look at employment trends, but that timeliness comes with somecost to accuracy.\n\nTo get the monthly employment snapshot, the BLS surveys about 121,000 US employers, accounting for 631,000 work sites (covering more than a quarter of overall employment). Those respondents are given three opportunities to report their payroll gains and losses for any given month.\n\nEvery year, the BLS undertakes a process aimed at providing a near-complete employment county by squaring up the monthly survey estimates with data drawn from the Quarterly Census of Employment and Wages program, which covers about 95% of US jobs.\n\nThe QCEW provides a more comprehensive and accurate read on the number of businesses, employees and wages throughout the country because that data is derived from state unemployment insurance tax records most employers are required to file. Given that process, the QCEW comes with a significant lag: The data for the third quarter of last year won’t be released until next month.\n\nThat was the preliminary benchmark revision, an annual first-look estimate that coincides with the release of the first-quarter QCEW data.\n\nIn September, the preliminary revision inferred that the US economy likely added about911,000 fewer jobsthan the jobs reports initially estimated for the 12-month period running from April 2024 through March 2025.\n\nSpread out, that’s about 76,000 fewer jobs per month. If the preliminary estimate were to pan out, it would essentially cut the posted job gains for that period in half.\n\nNo, the process of benchmarking and these significant adjustments to past employment are not some proof of nefarious data-related activity as has been unjustifiably claimed by President Donald Trump and others.\n\nIn fact, they’re the exact opposite.\n\nFor one, this is a process that’s been conducted by the BLS in some shape or form for 90 years. To quote former BLS commissioner Erica Groshen, it’s “not a bug; it’s a feature.”\n\nThese and other revisions are a reflection of how a transparent and rules-driven organization accounts and adjusts for new information as it becomes available, said Groshen and other former BLS officials in past interviews with CNN.\n\nIf it were to hold – and history has shown that the final revision is smaller – it would be the biggest downward revision on record (which go back to 1979),BLS data shows.\n\nEconomists expect that the final adjustment could be a downward revision of 700,000 jobs.\n\nThis time last year, the final annual benchmarked figure for the 12 months ending in March 2024was a negative 589,000 jobs seasonally adjusted(-598,000 not accounting for seasonality).\n\nThat’s significantly narrower than the preliminary estimate of-818,000 jobs, which still seems tostick in some minds, even though it was not the final figure.\n\nThe final tally of nearly negative 600,000 was the largest downward revision since March 2009 (which was previously the largest on record, at minus 902,000) and steeper than the downward revision of 489,000 jobs for the 12-month period ended March 2019 (during Trump’s first term).\n\nBy the way, for context, the adjustments amount to a sliver (tenths of a percentage point) of overall employment.\n\nStill, such large swings, positive or negative, typically occur in times when the economy is suddenly changing in volumes that seemingly well-tuned models aren’t able to pick up as quickly.\n\nThe factors likely contributing to the upcoming downward revision include: declining survey response rates; the BLS’ modeling of business creation (called the birth-death model) being thrown out of whack by the pandemic and overestimating job gains; and immigration-related measurement gaps.\n\n“This has been a half-decade with enormous changes to the economy – both the pandemic and the beginning and end of the immigration surge,” said Jed Kolko, an economist and former Under Secretary of Commerce for Economic Affairs during the Biden administration.\n\nThe benchmark revision – whichultimately affects 21 monthsof not-seasonally adjusted data from April of the prior year through the following year’s December – isn’t the only adjustment in this upcoming release.\n\nBecause the BLS establishment surveys existing employers, they miss businesses that just opened or closed. BLS crafted the “birth-death” model to capture these dynamics.\n\nBLS has fine-tuned its birth-death model and will adjust past data produced under the prior model.\n\nTheagency also traditionally updates its seasonal adjustmentmodels with each benchmark revision, resulting in the past five years of seasonally adjusted data being affected.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/economy/us-jobs-report-final-december",
      "text": "Last year, the economy posted its weakest year of job gains"
    },
    {
      "url": "https://www.cnn.com/2025/09/09/business/bls-preliminary-benchmark-jobs-revisions",
      "text": "annual benchmark revision"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/economy/us-jolts-job-openings-layoffs-november",
      "text": "public"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/economy/us-adp-private-sector-jobs-january",
      "text": "private"
    },
    {
      "url": "https://www.cnn.com/2025/09/09/business/us-bls-jobs-preliminary-benchmark-revisions",
      "text": "911,000 fewer jobs"
    },
    {
      "url": "https://www.bls.gov/web/empsit/cestn.htm#tb5",
      "text": "BLS data shows"
    },
    {
      "url": "https://www.cnn.com/2025/02/07/economy/us-jobs-report-january-final",
      "text": "was a negative 589,000 jobs seasonally adjusted"
    },
    {
      "url": "https://www.cnn.com/2024/08/21/economy/bls-jobs-revisions",
      "text": "-818,000 jobs"
    },
    {
      "url": "https://www.cnn.com/2025/08/04/business/bureau-of-labor-statistics-jobs-report-explainer-hnk",
      "text": "stick in some minds"
    },
    {
      "url": "https://www.bls.gov/web/empsit/cesbmart.htm",
      "text": "ultimately affects 21 months"
    },
    {
      "url": "https://www.bls.gov/opub/hom/ces/calculation.htm",
      "text": "agency also traditionally updates its seasonal adjustment"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/economy/us-jobs-report-january-preview-revisions",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/economy/us-jobs-report-january-preview-revisions",
      "text": "Cookie Settings"
    }
  ],
  "hash": "738845befa6c0abce9f4caaf39d4ccb8a79e3ba5df1ea28c49ea71e158419728",
  "scraped_at": "2026-02-11T16:33:07.021081+00:00"
}