{
  "url": "https://lite.cnn.com/2026/02/12/style/wuthering-heights-emerald-fennell",
  "title": "A ‘Wuthering Heights’ adaptation as shallow as a puddle glittering in the sun | CNN",
  "date": "2026-02-12T21:30:06.695777+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe British writer and director’s third film, to be released Friday, has polarized audiences since the first trailer. Like most of the directors who have attempted to bring author Emily Brontë’s wild English moors to screen, Fennell decided to adapt only the first half of the gothic novel: cutting it off at the knees before the romance sours into a study of generational trauma. Fennell’s version has probably 50% less plot line and characters, but 100% more fingers thrust in mouths, masturbation scenes and sex.\n\nIn some ways it was set up to fail from the moment those infamous quotation marks around the title were revealed; an attempt by Fennell to get ahead of the very criticisms that have been published this week. “I can’t say I’m making Wuthering Heights, it’s not possible,” the director saidduring the movie’s extensive press tour. “What I can say is I’m making a version of it.”\n\nThose quotation marks didn’t just signal subjectivity, they were a reference in themselves. In the mid-20th century, film titles regularly appeared in trailers encased in quotation marks — either to differentiate the name of the movie inside a text-crowded poster, or as a stylistic hangover from the silent film era. This cinematic standard had largely fallen away by the 1960s, but in reviving it Fennell was indicating to audiences that her film has more to do with cinematic history than it does with the Brontë parsonage.\n\nIn fact, director William Wyler’s 1939 Hollywood adaptation — with its ostentatious outfits and romantic focus — feels like a better companion piece than the original literary source material. For the 2026 reimagining, Fennell worked with costume designer Jacqueline Durran to create dozens of costumes (Cathy alone, played by Margot Robbie, had 50) that were heavily inspired by the extravagant, unselfconscious and campy outfits of the mid-century. While making the film, Fennell passed around a book inches-thick with visual references that spanned Scarlett O’Hara in “Gone with the Wind” (1939) to “Donkey Skin” (1970). If it wasn’t already obvious, period accuracy is a concept Fennell simply does not buy into.Period.\n\n“We all think we’re making a period drama to a point, and then it just looks like the ‘90s or whenever it was made,” she said, speaking alongside Durran at a Q&A session at London’s Victoria and Albert Museum recently. “We are making costumes. We’re making a film. That’s a suspension of disbelief that is important to acknowledge.”\n\nCathy’s costumes in Fennell’s film veer into Wyler territory often: she teases fellow character Isabella Linton about her doomed crush on Heathcliff in the Thrushcross Grange manor, while wearing a white tulle frock with velvet appliqué vines that looks strikingly similar to a dress actress Merle Oberon wore on-screen in 1939. Then there is the blood-red, velvet hooded cape and white fur hand-warmer Robbie wears when Cathy visits Wuthering Heights for the first time since marrying Edgar Linton. Oberon, too, donned a velvet, fur-trimmed hood and fur handwarmer in Wyler’s version. The number of jewels adorned on Robbie don’t look as out of place when you see Oberon wearing a near-identical tiara, drop earrings and floral diamond necklace some 87 years earlier.\n\n“When I’m asked about why the costumes are a particular way, I find that really difficult to answer,” designer Durran said in London. “It’s a kind of instinctive, emotional reason.” Fennell agreed: “It’s not connected to the period, it’s connected to the emotional truth.”\n\nEarlyreviewsof Wyler’s version recognized the same sensibility. In 1939, The New York Times film critic Frank S. Nugent praised the movie for being “emotional in presentation, subject and appeal,” though even last century the fear of offending “the faithful of the Bronte societies” loomed large. In Nugent’s mind, any creative liberties taken by Wyler maintained, what he saw, as the novel’s central theme: the brutal love between Heathcliff and Cathy. “What they have done in brief is trim the unessentials and bring the essentials into clearer, sharper focus,” he wrote. No doubt Fennell would welcome a review such as Nugent’s today. Whether audiences engage with her adaptation in a similar spirit remains to be seen.\n\nUltimately, Fennellisreferencing a period in history, just not 1847, when Brontë wrote the novel, and not the late 1700s, when it is set. By choosing her references from the big screen rather than history, she’s made a film for cinephiles, not the bookworms. The result might be as shallow as a puddle on a sunny day — but it certainly caught the light.\n\n(“Wuthering Heights” is distributed by Warner Bros., which is owned by CNN’s parent company Warner Bros. Discovery.)\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.youtube.com/watch?v=OJZkTLg-_F8",
      "text": "during the movie’s extensive press tour"
    },
    {
      "url": "https://timesmachine.nytimes.com/timesmachine/1939/04/16/91567145.html?pageNumber=170",
      "text": "reviews"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/style/wuthering-heights-emerald-fennell",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/style/wuthering-heights-emerald-fennell",
      "text": "Cookie Settings"
    }
  ],
  "hash": "74113ad0e819192b2775c767427bbcd32e69b7146f5943a012e83015ca70e289",
  "scraped_at": "2026-02-12T21:30:06.695790+00:00"
}