{
  "url": "https://lite.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
  "title": "Colin Gray trial: Grandma of Apalachee school shooter testifies in murder trial | CNN",
  "date": "2026-02-22T07:10:29.829940+00:00",
  "authors": [
    "Eric Levenson, CNN"
  ],
  "text": "Source: CNN\n\nDeborah Polhamus, the maternal grandmother of teenage school shooter Colt Gray, testified Friday that theteen’s father Colin Graybought him an AR-15-style rifle as a Christmas gift nine months before the shooting.\n\nPolhamus initially said she did not remember if the firearm was kept in Colt Gray’s room, but she then reviewed her earlier statement to police in which she had said so.\n\n“So if it says, ‘Every time I went up there I saw it in Colt’s room,’ that would be what you believe to be accurate?” the prosecutor asked.\n\n“Yes,” Polhamus said.\n\nShe also said she gave her grandson money to buy bullets for his birthday after he got Colin Gray’s permission.\n\nThe family testimony offered insights into the tumultuous home life of Colt Gray, who in September 2024 at age 14 brought that rifle to Apalachee High School in Winder, Georgia, andopened fire. Four people were killed and nine were injured before he surrendered to police.\n\nProsecutors allege Colin Gray bought Colt the rifle despite previous warnings that his son was a danger to others, actions that constitute criminally reckless conduct. He has pleaded not guilty to nearly 30 charges, including two counts each of second-degree murder and involuntary manslaughter.\n\nColin Gray’s defense attorney said in opening statements that he was unaware his son was planning the shooting and had taken steps to try to get him help.\n\nColin Gray’s trial is part of a broader push to hold more people accountable for a school shooting, including the shooter’sparentsandresponding law enforcement officers. This case bears close similarities to the trials ofJames and Jennifer Crumbley, whose then-15-year-old son killed four students in 2021 at his high school in Oxford, Michigan.\n\nColt Gray hasadmitted to the shooting, according to authorities. Now 16, he has pleaded not guilty to55 felony counts, including four counts of malice murder. A trial date has not been set.\n\nMarcee Gray, the shooter’s mother, was expected to take the stand Friday afternoon but did not come to court on time, prosecutors said in court without the jury present. The judge decided to send the jury home for the weekend.\n\nIn her testimony, Polhamus reviewed several angry, vulgar text messages from Colt Gray that showed his spiraling mental health and penchant for outbursts.\n\nIn two incidents in August 2024, Colt sent his grandmother a series of text messages cursing her out, according to text messages shown in court. After the second incident, he apologized, saying he had “schizophrenia” that was “leaning towards acute mania,” according to the messages.\n\n“I haven’t gotten to the point where I’ve felt an instantaneous urge to hurt anyone, but I do have periods where it’s heightened. these can last days to weeks for me,” Colt Gray wrote.\n\nSoon after, he asked her, “If I do something terrible, would you still love me,” Polhamus testified. Concerned he might hurt himself, she spoke to a crisis counselor and a high school counselor about getting him help, she testified.\n\nShe spoke to Colin Gray about his son’s mental health issues and suggested he take Colt to a crisis counselor that weekend, but they did not go, she testified.\n\nPolhamus, 76, struggled to remember some key conversations and dates, blunting the impact of her testimony. “I don’t recall,” she said at one point, “but that doesn’t mean it didn’t happen.”\n\nOn cross-examination, she said she did not share those concerning texts with Colin Gray, or at least did not remember doing so.\n\nThe trial began Monday with opening statements and has featuredemotional testimony from surviving students, teachers and the officers who responded to the attack. Other key evidence has included police interviews with Colin Gray before and after the attack and Colt Gray’s school records.\n\nEarlier Friday, Georgia Bureau of Investigation special agent Heather Lashley testified investigators found multiple unsecured firearms and boxes of ammunition in Colin Gray’s home a few hours after the shooting.\n\nIn a bedroom Colin Gray shared withhis youngest son, an AR-15-style rifle and a shotgun rested on a top shelf ina closet next to boxes of ammunition, covered by loose clothing, according to photos shown in court. A Glock gun case sat in a storage cubby, with a lock and key still inside its original plastic packaging.\n\nIn Colt’s room, Lashley said, a “shrine” of photos ofNikolas Cruz– the Parkland, Florida, high school shooter – waspinned to the wall next to a desk.\n\nIn the closet was a rifle sling, rifle case, gun targets, a shotgun shell and another unopened gun lock and key, photos showed. The room did not have a bed; Colt Gray slept in the laundry room, where investigators found boxes of unsecured ammunition sitting in bins, Lashley testified.\n\nNone of the firearms had a lock or safety on them, she said, and there were no gun safes in the home. A Glock handgun was also found in Colin Gray’s vehicle, she testified.\n\nIn testimony Thursday, school officials laid out Colt Gray’s history of school misbehavior and spotty attendance record. He raised alarms at multiple middle schools, including when he searched “how to kill your dad” on a school computer in August 2021, and when he was suspended in spring 2022 for drawing swastikas and writing “Hitler” on his calculator, school officials said.\n\nThe teen did not appear to attend any school, online or otherwise, for his eighth grade year in 2023-2024, when he was under his father’s care. He attended only a few days of high school before he carried out the attack on September 4, 2024.\n\nProsecutors also showed the jury Colin Gray’s statements to police on body-camera footage immediately following the school shooting. Law enforcement officers went to his home and told him he couldn’t leave.\n\n“God. I knew it,” Gray said, according to the footage. “My little girl just texted me, she’s in middle school, she said ‘We’re in lockdown.’ I’m like, ‘God almighty, please tell me your brother didn’t do something.’”\n\nIt’s not clear what the officers said to him prior to this comment. Prosecutors said in opening statements Colin Gray “blurt(ed)” it out.\n\nJurors also saw body-camera footage from May 21, 2023, when deputies with the Jackson County Sheriff’s Office visited Colt and Colin Gray’s home after receiving an FBI tip about a threat on the messaging app Discord to shoot up a school.\n\nSpeaking to the officers, Colt denied making the post and said his Discord account had been hacked, according to the footage. Colin Gray told the officers that his son had access to firearms in the home because he was teaching his son about hunting and gun safety.\n\n“I don’t know anything about him saying sh*t like that,” Colin Gray told the officers. “I’m going to be mad as hell if he did and then all the guns will go away.”\n\nOfficer Daniel Miller told Colin Gray to keep guns away from Colt given the alleged threat of violence, according to the officer’s report. The deputies were ultimately not able to substantiate the origin of the threat, and no charges were filed.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "teen’s father Colin Gray"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "opened fire"
    },
    {
      "url": "https://www.cnn.com/2024/03/03/us/james-crumbley-trial-mass-shooting-accountability",
      "text": "parents"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/school-shooting-trials-police-officers",
      "text": "responding law enforcement officers"
    },
    {
      "url": "https://www.cnn.com/2024/03/16/us/james-jennifer-crumbley-trials-differences/index.html",
      "text": "James and Jennifer Crumbley"
    },
    {
      "url": "https://www.cnn.com/2024/10/22/us/apalachee-school-shooter-colt-gray-has-waived-arraignment-and-entered-a-not-guilty-plea",
      "text": "admitted to the shooting"
    },
    {
      "url": "https://www.cnn.com/2024/10/17/us/colt-colin-gray-apalachee-school-shooting",
      "text": "55 felony counts"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "emotional testimony from surviving students"
    },
    {
      "url": "https://www.cnn.com/2022/10/14/us/nikolas-cruz-defense-life-prison",
      "text": "Nikolas Cruz"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7446788b601865df22c5f68c4c7d55c75d3a4ed984f7b4c516a8c147b3ae6c7c",
  "scraped_at": "2026-02-22T07:10:29.829954+00:00"
}