{
  "url": "https://lite.cnn.com/2026/02/08/americas/venezuela-political-prisoners-opposition-released-latam-intl",
  "title": "Venezuelan opposition figure Guanipa placed under house arrest after armed men detained him again following prison release | CNN",
  "date": "2026-02-11T16:32:05.024872+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nKey Venezuelan opposition figure Juan Pablo Guanipa has been placed under house arrest, his son said, two days after he was re-arrested by heavily armed men following his release from a jail where he had been held as a political prisoner.\n\n“We are relieved to know that my family will be together soon,” his son Ramón Guanipa posted on his father’s social media account, where he also thanked US President Donald Trump and Secretary of State Marco Rubio for working to free political prisoners across Venezuela.\n\n“My father remains unjustly imprisoned, because house arrest is still imprisonment, and we demand his full freedom and that of all political prisoners,” Guanipa’s son added.\n\nA photo later circulated on social media showing Guanipa wearing an ankle monitor as he sat on a chair at home. His brother Tomás confirmed the authenticity of the image to CNN.\n\nThe Venezuelan Attorney General’s Office told CNN on Tuesday that it would give out no further information on the case at this time. CNN has reached out to the White House and US State Department for comment.\n\nGuanipa’s family and political allies said he had been “kidnapped” by a group of men on Sunday just hours after he had been freed.\n\nLeader of the conservative Primero Justicia party, Guanipa was among several high-profile political prisoners released that day, in the latest effort from Caracas to satisfyUS demandsfollowing Washington’s ouster of strongman leader Nicolás Maduro.\n\nThe country’s public prosecutor’s office later said it had requested Guanipa be placed under house arrest, claiming a breach of his release conditions.\n\nVenezuelan Interior Minister Diosdado Cabello said Guanipa had been re-arrested for “calling people to the streets.”\n\n“They were released, they reunited with their families, until the enlightened stupidity of some politicians led them to believe they could do whatever they wanted and stir up trouble in the country,” Cabello said.\n\nIn the past, political prisoners have faced restrictions upon their release, ranging from travel bans and periodic court appearances to gag orders, according to lawyer Gonzalo Himiob, vice president of the rights group Foro Penal. He emphasized that even after political prisoners are released, legal proceedings remain open in all cases, so they are not considered fully free.\n\nGuanipa, 61, was snatched by a group of men in the Los Chorros neighborhood of Caracas on Sunday, said Venezuelan opposition leader and Nobel Laureate María Corina Machado, who is not in the country.\n\n“Heavily armed men dressed in civilian clothes arrived in four vehicles and took him away by force,” she saidon X.\n\nGuanipa’s son said in a video that his father was “ambushed” at a late night event “by approximately 10 agents who had no identification whatsoever.”\n\n“They pointed their guns at them, they were heavily armed, and they took my father,” he said, before demanding to see proof his father was still alive.\n\nGuanipa’s Primero Justicia party also accused the Caracas regime of being behind the kidnapping. “We hold (interim President) Delcy Rodríguez, (National Assembly President) Jorge Rodríguez, and (Interior Minister) Diosdado Cabello responsible for any harm against the life of Juan Pablo,” it said in a statement on X.\n\nAfter Maduro was captured by US special forces last month, his former deputy Rodríguez took over as leader with the blessing of the Trump administration, on the proviso Caracas complied with a raft of US demands – from access to oil to the release of political prisoners.\n\nGuanipa was arrested inMay 2025, following claims by Cabello, made without evidence, that he was involved in an alleged “terror” plot against regional and legislative elections. Guanipa has repeatedly denied the accusation.\n\nHe had spent more than eight months in prison before his release. Shortly after walking out of a Caracas detention center where he had been held, Guanipa uploaded a video on social media, declaring there was “much to discuss about the present and future of Venezuela, always with the truth at the forefront.”\n\nMachado had celebrated the news of his release, saying on social media, “My dear Juan Pablo, counting down the minutes until I can hug you! You are a hero and history will always recognize it.”\n\nAnother of Machado’s allies, lawyer Perkins Rocha, was also released on Sunday, but under strict restrictions, according to his wife María Constanza.\n\nForo Penal said it had confirmed that at least 30 political prisoners were released on Sunday, according to the group’s director, Alfredo Romero.\n\nOthers who were freed include Luis Somaza, a member of the Popular Will party, and Jesús Armas, an activist and former opposition councilman.\n\nVenezuela’s opposition and human rights groups have long accused the country’s authoritarian regime of using arbitrary arrests to suppress dissent. Foro Penal estimates that hundreds of additional political prisoners still remain behind bars.\n\nThe government has denied that it holds people for political reasons, arguing that those in prison have committed crimes.\n\nSunday’s releases come days after Venezuela’s National Assembly President Jorge Rodríguez promised relatives of political prisoners that “all detainees” would be freed. Rodríguez, the brother of acting president Delcy Rodríguez, said the process would be completed “no later than” Friday, February 13.\n\nHis announcement comes as the acting socialist government moves forward with anamnesty billthat could lead to the mass release of prisoners – some of whom have been held since 1999, when strongman leader Hugo Chávez came to power – as a first step toward what officials describe as national reconciliation.\n\nGuanipa’s case has raised doubts about that process. “The so-called amnesty, that veneer of false dialogue, is dead before it was born,” said the opposition party Alianza Bravo Pueblo.\n\nAlthough the government announced the release of “a significant number of people” days after the US captured Maduro, rights groups and family members believe that the pace of releases has been slow.\n\nSo far, more than 380 people have been freed from prison, according to Foro Penal, while the government claims to have released more than 800.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/politics/venezuela-frees-americans-detained",
      "text": "US demands"
    },
    {
      "url": "https://x.com/MariaCorinaYA/status/2020713513770217537",
      "text": "on X."
    },
    {
      "url": "https://cnnespanol.cnn.com/2025/05/23/venezuela/detienen-juan-pablo-guanipa-venezuela-orix",
      "text": "May 2025"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/americas/venezuela-amnesty-law-political-prisoners-latam-intl",
      "text": "amnesty bill"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/americas/venezuela-political-prisoners-opposition-released-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/08/americas/venezuela-political-prisoners-opposition-released-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "745955a8cc42f15ffdda88ff43df4404216e01c911e7b870212ca9f4ea391ecd",
  "scraped_at": "2026-02-11T16:32:05.024885+00:00"
}