{
  "url": "https://lite.cnn.com/2026/02/25/politics/colin-mcdonald-trump-picked-fraud",
  "title": "Meet the man Trump picked to pursue his war on fraud at the Justice Department | CNN Politics",
  "date": "2026-02-27T07:17:15.880053+00:00",
  "authors": [
    "Hannah Rabinowitz"
  ],
  "text": "Source: CNN\n\nThe morning after President Donald Trump declared a “war on fraud” during his State of the Union address, senior Justice Department prosecutor Colin McDonald told the Senate Judiciary Committee and said he would steadfastly follow the department’s tradition to focus only on the evidence.\n\n“I am a career federal prosecutor,” McDonald said. “I follow the facts; I apply the law — those are the two considerations that come into play for me.”\n\nHis comment paraphrased a promise that’s core to the Justice Department, cited constantly by attorneys general under both Democratic and Republican administrations. But it didn’t directly address what he was asked: Whether McDonald, who is tapped to run anew DOJ divisiontasked with rooting out fraud, would follow an order from Trump to prosecute one of his own perceived enemies.\n\n“You are now placed in a highly politicized division,” one of the Democratic senators on the committee, Mazie Hirono, warned. “We already know that the president considers the Department of Justice to be his law firm, Pam Bondi to be his lawyer. You are down the chain and I don’t see how you sit there and tell us that you are going to be independent, as much as you might want to be.”\n\nThe Trump administration has made allegations of widespread fraud a main focus of their prosecution efforts, as well as a political tool to criticize Democratic officials. Most notably, the administration has focused on a wide-ranging fraud scandal in Minnesota that prosecutors estimate could total more than $9 billion in stolen funds. The president has specificallylaid blameat the feet of Democratic officials for allowing the state to become a “hub of fraudulent money laundering activity.”\n\nMcDonald’s career was relatively low profile until he moved with his wife and five children to Washington, DC, one year ago, leaving his decadelong post at the federal prosecutor’s office in California’s Southern District to work in Deputy Attorney GeneralTodd Blanche’s office. There, his work focused on everything from law enforcement issues to co-chairing the so-calledWeaponization Working Group.\n\nIn January, Trump announced on Truth Social his nomination of McDonald as the “first ever Assistant Attorney General for National FRAUD Enforcement, a new Division at the Department of Justice, which I created to catch and stop FRAUDSTERS that have been STEALING from the American People.”\n\nThe new division was under scrutiny before McDonald was even nominated. The Justice Department already has multiple offices that investigate criminal and civil fraud cases, leading some lawmakers and legal experts to question whether creating the new division is necessary.\n\nAnd Vice President JD Vancetold reporters in early Januarythat the role will be like that of a special counsel, but “run out of the White House under the supervision of me and the president United States,” which experts said would run afoul to longstanding department efforts to stay separate from political interference.\n\nVance, who Trump said in his speech would lead the “war on fraud,” said Wednesday that the effort would be a “whole government approach” that included other federal departments, including the Treasury Department.\n\nMcDonald tried to ease concerns of duplicate efforts during the hearing Wednesday, saying that his office would be “complementary” of the department’s preexisting fraud sections and would initially focus on cases that involved abuses of Medicaid and SNAP funds — both of which are alleged to havetaken place in Minnesota. He also pointed to a Justice Department organization chart that showed he would report directly to Bondi and Blanche, and pledged to work with federal, state or local partners “regardless of political party.”\n\nNone of the senators asked McDonald Wednesday what role Vance’s would play in his office’s efforts. The vice president said at an event later in the day that McDonald “impressed a lot of people. He certainly impressed me.”\n\nMcDonald’s attempts to appear non-political largely fell on deaf ears among Senate Democrats, who continued to push him to say definitively that he would not listen to prosecutorial demands from the president.\n\n“If in fact the Constitution requires that the president take care that the laws be faithfully executed, it would be a dereliction of duty if they did not ensure that we stop this fraud,” Republican Sen. Ashley Moody eventually cut in. “Is that correct?”\n\n“I agree with that, senator,” McDonald said.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.whitehouse.gov/fact-sheets/2026/01/fact-sheet-president-donald-j-trump-establishes-new-department-of-justice-division-for-national-fraud-enforcement/",
      "text": "new DOJ division"
    },
    {
      "url": "https://www.whitehouse.gov/articles/2025/12/yes-theres-something-wrong-with-walz-and-it-cost-taxpayers-1-billion/",
      "text": "laid blame"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/politics/todd-blanche-ed-martin-schism-broader-maga-divide-administration",
      "text": "Todd Blanche"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/politics/justice-department-trump-weaponization-priority",
      "text": "Weaponization Working Group."
    },
    {
      "url": "https://www.cnn.com/us/live-news/minneapolis-ice-shooting-01-08-26?post-id=cmk5szmm800003b6paajtuofb",
      "text": "told reporters in early January"
    },
    {
      "url": "https://www.cnn.com/2026/01/02/us/fraud-minnesota-programs-scandal-trump",
      "text": "taken place in Minnesota"
    }
  ],
  "hash": "74910a3d921bb6cdf1cd8bccad0a03f9bb87005b282483ea8f6ec9d0864cc423",
  "scraped_at": "2026-02-27T07:17:15.880067+00:00"
}