{
  "url": "https://lite.cnn.com/2026/02/19/europe/austria-climber-convicted-girlfriend-latam-intl",
  "title": "Climber found guilty of manslaughter after leaving girlfriend to die on Austria’s tallest mountain | CNN",
  "date": "2026-02-21T07:05:58.197604+00:00",
  "authors": [
    "Stephanie Halasz",
    "Billy Stockwell",
    "CNN"
  ],
  "text": "Source: CNN\n\nA man has been found guilty of grossly negligent manslaughter after leaving his girlfriend, who was “galaxies” behind him in terms of climbing experience, to freeze to death onAustria’s tallest mountainlast year, authorities said.\n\nThe 37-year-old man, named in local media as Thomas P., was accused of having left his 33-year-old girlfriend, Kerstin G., alone as he sought help on Austria’s Grossglockner mountain in the early hours of January 19, 2025.\n\nThe pair ran into difficulties while trying to reach the summit but there were conflicting accounts in court regarding the defendant’s attempts to seek assistance. The verdict could have implications for mountain climbers and how liable they are for the safety of companions.\n\nOn Thursday evening, Innsbruck Regional Court in western Austria sentenced Thomas P. to a suspended prison sentence of five months and a fine totaling €9,600 (around $11,300), the court told CNN in a statement.\n\nThe judge, Norbert Hofer, said the defendant’s girlfriend was “galaxies” away from his climbing skills and she assumed he would take “responsibility” for her, according to Austrian public broadcaster ORF.\n\nThe maximum prison term for the offense of grossly negligent manslaughter is three years, the court said.\n\nIn deciding the defendant’s sentence, the court statement said his clean criminal record was taken into account, as well as the “loss of a relative” as a mitigating factor.\n\n“It also took into account the public discussion on social media that had placed a strain on the defendant,” the court statement added.\n\nThomas P. had denied wrongdoing and said his girlfriend’s death was a “tragic accident” which he was deeply saddened by, according to his lawyer, Kurt Jelinek.\n\nOn Thursday, the court said the judgment was not final and is subject to appeal. “Appeals may be lodged within three days and must then be submitted in writing within four weeks,” it said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/austria-climber-accused-left-girlfriend-die-latam-intl",
      "text": "Austria’s tallest mountain"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/austria-climber-convicted-girlfriend-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/europe/austria-climber-convicted-girlfriend-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "749249f123975eb685f1a8c71372efcbdb357d52d53c26a15340f1d5b2532cf3",
  "scraped_at": "2026-02-21T07:05:58.197616+00:00"
}