{
  "url": "https://lite.cnn.com/2026/02/15/us/immigration-chicago-daughter-cancer",
  "title": "Teen girl whose Chicago father was detained in an immigration case dies from a rare cancer | CNN",
  "date": "2026-02-16T07:34:19.856793+00:00",
  "authors": [],
  "text": "Source: AP\n\nA Chicago teen who spoke out for her father’s release after he was detained last fall by immigration officials in a deportation case has died after battling a rare form of cancer.\n\nOfelia Giselle Torres Hidalgo, 16, died Friday from stage 4 alveolar rhabdomyosarcoma, the family said in a statement. Funeral arrangements are private.\n\nThe teenager was diagnosed in December 2024 with the aggressive form of soft tissue cancer and had been undergoing chemotherapy and radiation treatment.\n\nAn immigration judge in Chicago ruled three days before Ofelia’s death that her father,Ruben Torres Maldonado, was conditionally entitled to receive “cancellation of removal” due to the hardships his deportation would cause his children who were born in the United States and are US citizens, according to the statement sent by an attorney representing Torres Maldonado.\n\nThe ruling provides Torres Maldonado with a path to becoming a lawful permanent resident and eventual US citizenship, the statement said.\n\nOfelia was present via Zoom at last week’s hearing.\n\n“Ofelia was heroic and brave in the face of ICE’s detention and threatened deportation of her father,” said Kalman Resnick, Torres Maldonado’s attorney. “We mourn Ofelia’s passing, and we hope that she will serve as a model for us all for how to be courageous and to fight for what’s right to our last breaths.”\n\nTorres Maldonado, a painter and home renovator, was detained October 18 at a Home Depot store in suburban Chicago as the area was at the center of a majorimmigration crackdowndubbed “Operation Midway Blitz,” which began in early September.\n\nOfelia was undergoing treatment when she appeared in October in a video posted on a GoFundMe page set up for the family.\n\n“My dad, like many other fathers, is a hard-working person who wakes up early in the morning and goes to work without complaining, thinking about his family,” she said in the video. “I find it so unfair that hardworking immigrant families are being targeted just because they were not born here.”\n\nIn a wheelchair,she attended a hearing for her father in October. The family’s attorneys told a judge at that time that she was released from the hospital just a day before her father’s arrest so she could see family and friends. They added Ofelia had been unable to continue treatment “because of the stress and disruption.”\n\nTorres Maldonado’s attorneys petitioned for his release as his deportation case went through the system. A judge ordered a bond hearing after ruling in October his detention was illegal and violated Torres Maldonado’s due process rights.\n\nA judge later cited Torres Maldonado’s lack of criminal historywhile allowing his release on a $2,000 bond.\n\nLawyers said Torres Maldonado entered the US in 2003. He and his partner, Sandibell Hidalgo, also have a younger son.\n\nThe Department of Homeland Security had alleged he had been living illegally in the US for years and has a history of driving offenses, including driving without a valid license, without insurance and speeding.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/26/us/immigration-chicago-daughter-cancer",
      "text": "Ofelia Giselle Torres Hidalgo"
    },
    {
      "url": "https://www.cnn.com/2025/10/30/us/release-chicago-immigration-daughter-cancer",
      "text": "Ruben Torres Maldonado"
    },
    {
      "url": "https://apnews.com/article/arrests-chicago-immigration-investigation-0b1a1170f0ef26bd87608825f0cedbc3",
      "text": "immigration crackdown"
    },
    {
      "url": "https://apnews.com/article/immigration-chicago-man-daughter-cancer-2a7a78244d9df47cebe6a561e02861c9",
      "text": "she attended a hearing for her father in October"
    },
    {
      "url": "https://apnews.com/article/chicago-illinois-immigration-ice-midway-blitz-91835c660b44c4f50fc603d157031afd",
      "text": "while allowing his release on a $2,000 bond"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/us/immigration-chicago-daughter-cancer",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/us/immigration-chicago-daughter-cancer",
      "text": "Cookie Settings"
    }
  ],
  "hash": "75d14bd83794a8dff6d431c7106c21a763010cb50232f5dd981f42c837076d17",
  "scraped_at": "2026-02-16T07:34:19.856809+00:00"
}