{
  "url": "https://lite.cnn.com/2026/02/12/sport/trinidad-chambliss-ole-miss-extra-year-eligibility",
  "title": "Judge grants Ole Miss QB Trinidad Chambliss a preliminary injunction for extra eligibility | CNN",
  "date": "2026-02-13T07:31:01.837738+00:00",
  "authors": [],
  "text": "Source: AP\n\nIn saying “the NCAA ignored its own rules,” a Mississippi judge granted Ole Miss quarterbackTrinidad Chamblissa preliminary injunction Thursday against college athletics’ governing body, allowing him to receive an extra year of eligibility so he can play next season.\n\nThe NCAA denied Chambliss’ waiver request January 9, and after Chambliss appealed, the organization’s Athletics Eligibility Subcommittee upheld the denial on February 4.\n\nJudge Robert Whitwell took about 90 minutes to explain his decision that he agreed with Chambliss’ argument that the player’s medical history was not properly considered by the NCAA. The 23-year-old Chambliss has been in college for five years, but was healthy enough to play just three years.\n\nWhitwell said Chambliss would have received “irreparable harm” had the NCAA’s ruling been upheld, but that the organization will not be damaged by allowing him to play.\n\nChambliss and Ole Miss submitted nearly 91 pages to the NCAA to document how medical issues prevented him from playing two years, the judge said. The NCAA, the judge said, didn’t properly take those records into account and denied the waiver request “on pure semantics.”\n\n“Trinidad Chambliss has demonstrated based on the evidence presented that he is entitled to an additional year at the University of Mississippi,” Whitwell said. “The NCAA has failed in its argument to withhold that right.”\n\nThough the NCAA released a statement expressing frustration with the legal system, the organization did not say whether it would appeal the ruling.\n\n“This decision in a state court illustrates the impossible situation created by differing court decisions that serve to undermine rules agreed to by the same NCAA members who later challenge them in court,” the NCAA said. “We will continue to defend the NCAA’s eligibility rules against repeated attempts to rob future generations of the opportunity to compete in college and experience the life-changing opportunities only college sports can create.\n\n“The NCAA and its member schools are making changes to deliver more benefits to student-athletes, but the patchwork of state laws and inconsistent, conflicting court decisions make partnering with Congress essential to provide stability for current and future college athletes.”\n\nChambliss began his college career at Ferris State in 2021, redshirted his first season and did not play in 2022 because of medical reasons.\n\nHe played two more seasons at the Division II school in Michigan, leading the Bulldogs to a national championship before transferring to Ole Miss before the start of this past season.\n\nChambliss completed 294 of 445 passes (66.1%) for 3,937 yards with 22 touchdowns and three interceptions for Ole Miss (13-2), which set a school record for wins, including two after making the College Football Playoff for the first time. He ran for 527 yards and eight more TDs.\n\nThe Rebelslost 31-27 to Miamiin the College Football Playoff semifinals on January 8.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/sport/football-ncaa-chambliss-ole-miss-ncaa-lawsuit",
      "text": "Trinidad Chambliss"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/football-cfp-semifinals-miami-ole-miss",
      "text": "lost 31-27 to Miami"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/sport/trinidad-chambliss-ole-miss-extra-year-eligibility",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/sport/trinidad-chambliss-ole-miss-extra-year-eligibility",
      "text": "Cookie Settings"
    }
  ],
  "hash": "774401f523c8509535230c9dca0ad4555fa2e4b633de2b30988223780530fef6",
  "scraped_at": "2026-02-13T07:31:01.837750+00:00"
}