{
  "url": "https://lite.cnn.com/2026/02/16/americas/pokemon-card-logan-paul-record-auction-intl-hnk",
  "title": "Pokemon card: Logan Paul auctions Pikachu Illustrator for $16.5 million | CNN",
  "date": "2026-02-16T07:34:05.628410+00:00",
  "authors": [],
  "text": "Source: CNN\n\nFive years ago, Logan Paul set a world record when he purchased a Pokémon card for $5.275 million. It proved a sound investment – the influencer and wrestler sold that card for a jaw-dropping $16.492 million, with a diamond encrusted necklace thrown in.\n\nThe rare Pikachu Illustrator card –– one of just 39 created for a Pokémon illustration competition in the late 90s –– went under the hammer on Goldin auctions on Monday.\n\nIt is believed to have earned the WWE star more than $8 million in profit after auction fees, a sale he called “absolutely insane.”\n\nThe auction had been running for 42 days but came to an end after hours of extended bidding Monday, with Paul saying “we may have tired someone out” during a YouTube live stream.\n\n“Oh my gosh, this is crazy,” he added once the auction closed and confetti rained down.\n\nMoments later, a Guinness World Records official appeared onscreen and confirmed Paul had sold the most expensive trading card ever at auction.\n\nThis time around the card was sold inside a custom necklace worn by Paul at WrestleMania 38 and with his promise to hand-deliver it to the winning bidder.\n\nPokémon is the world’s highest-grossing media franchise, surpassing even Disney and Star Wars. Cards have rocketed in value, outpacing sports cards and beating the S&P stock market by 3,000% in the past 20 years, Goldin founder and CEO Ken Goldintold CNNin December after Logan confirmed he would be auctioning off the card.\n\n“This is the most coveted trading card in the world,” he said.\n\nGoldin said the Illustrator is considered “the holy grail of all Pokémon cards” and Paul’s card was what everybody wants because it’s virtually flawless – the only Illustrator card considered a Grade 10 card by authentication agency PSA.\n\nAs Monday’s bidding drew to a close, the price initially held at $6.882 million until a flurry of last-minute offers during an extended bidding period lasting several hours drove the final auction total to $16.492 million from 97 total bids.\n\nPaul has a reputation for taking collectibles to extreme levels and has spent millions to secure some of the rarest items ever produced,including NFTs- unique, verifiable digital assets traded on the blockchain.\n\nThe WWE wrestling star bid farewell to the card on Saturday in an Instagram post, saying “goodbye my friend. What a privilege it’s been to be the owner of the greatest collectible in the world.”\n\nThe card is just one of 20 Illustrator cards graded by PSA.\n\nPaul got his hands on the ultra-rare Grade 10 card by swapping a PSA Grade 9 Pikachu Illustrator card he previously owned – worth $1.275 – and $4 million in cash for it in July 2021.\n\nOnly eight of the Pikachu Illustrator cards have been awarded a PSA Grade 9 and Paul’s sale is the only PSA Grade 10, the highest and most desirable grade assigned by PSA.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/12/24/entertainment/video/pokemon-trading-cards-netflix-series-king-of-collectibles-logan-paul-ken-goldin-tsi",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/2021/03/17/business/what-is-nft-meaning-fe-series/index.html.",
      "text": "including NFTs"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/americas/pokemon-card-logan-paul-record-auction-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/americas/pokemon-card-logan-paul-record-auction-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "778dccb22934e6d5f42cdd0172968f64c8594e02a0fe60b5d59c94c10446ffd2",
  "scraped_at": "2026-02-16T07:34:05.628427+00:00"
}