{
  "url": "https://lite.cnn.com/2026/02/17/us/washington-dc-plane-crash-cause",
  "title": "NTSB final report reveals causes of deadly midair collision near Washington, DC | CNN",
  "date": "2026-02-18T07:31:41.264216+00:00",
  "authors": [
    "Alexandra Skores, CNN"
  ],
  "text": "Source: CNN\n\nMultiple failures across different parts of the government caused an Army Black Hawk helicopter to collide with an American Airlines regional jet, operated by PSA Airlines, the National Transportation Safety Board concluded in a nearly 400-page report released Tuesday.\n\nThe January 29, 2025, midair collision near Ronald Reagan Washington National Airport killed 67 people, making it the deadliest commercial aviation accident in the United States in more than 20 years.\n\nThe NTSB’s final report describes a chain of errors where policies and procedures in place to protect the public failed that cold, winter night.\n\n“FAA’s placement of a helicopter route in close proximity to a runway approach path; their failure to regularly review and evaluate helicopter routes and available data, and their failure to act on recommendations to mitigate the risk of a midair collision” were cited as part of the “probable cause” of the accident.\n\nThe board also placed blame on an “overreliance” on pilots visually looking out for other aircraft “without consideration for the limitations of the see-and-avoid concept.”\n\nThe helicopter crew had been warned by the air traffic controller to look out for the jet and confirmed they saw it moments before the crash. It’s not clear whether they saw the plane or mistook another aircraft for the jet.\n\nThe NTSB added the cause of the crash also included air traffic control’s “degraded performance” because two positions had been combined in the tower, and there was no “risk assessment process … which resulted in misprioritization of duties, inadequate traffic advisories, and the lack of safety alerts to both flight crews.”\n\nThe report noted the Army’s share of the cause was a failure to train pilots on the margin of error of altimeters, which show altitude, leading to the helicopter flying above the allowed height.\n\n“Within the report we highlight systemic failures that led to the local air traffic controller failing to provide required traffic alerts, the (Army helicopter) crew not knowing or indicating their correct altitude, the FAA not evaluating their own data, and a dangerous route design that left no room for error,” said NTSB board member Todd Inman in the report. “These are real, tangible problems that need to be addressed, and I hope the recipients of our recommendations get to work immediately.”\n\nThe incident heightened public attention to the safety of air travel in 2025 — a year punctuated by the dramatic crash of aDelta Air Lines regional jet landing in Torontoand the fiery crash of aUPS cargo plane taking offfrom Louisville, Kentucky.\n\nNTSB investigators formally made 50 safety recommendations in the final report, including 33 of them directed to the FAA.\n\n“We must ensure the hard-won knowledge contained in this report translates to lives saved,” NTSB Chair Jennifer Homendy wrote in the report. “Making the system-wide changes we need doesn’t come easy, but we must make them. And we should do so BEFORE people die.”\n\nTherecommendationscall for the aviation agency to implement time limitations for air traffic control supervisors, improve training, limit some commercial air traffic at busy airports, improve crash avoidance technology and amend helicopter route design criteria.\n\nWithin weeks of the January 29 crash, Trump administration officials announcedchanges to helicopter routes around Washington, addressing two of the NTSB’s urgent recommendations. Amultibillion-dollar overhaulto an aging air traffic control system was also promised.\n\nWhile the NTSB cannot force the adoption of its safety recommendations, the board advocates for their implementation to prevent another crash.\n\nOne key subject of several recommendations involves improving crash avoidance technology. The report found “limitations” of “collision alerting systems on both aircraft” contributed to the accident.\n\nThe board has long urged all aircraft to have systems that would show pilots if another aircraft was getting dangerously close. In January’s crash, the Army helicopter had a system to transmit its position, called “ADS-B Out,” but it was turned off. The regional jet was transmitting its location with the system but neither aircraft had a way to receive information from the other. Equipping planes with “ADS-B In” could show pilots other aircraft nearby and help avoid them.\n\nA few days before the one year anniversary of the incident, the NTSB held an hours-longboard meetingto describe every failure on that night.\n\n“This was preventable. This was 100% preventable,” Homendy said during the meeting.\n\n“They would have (seen the helicopter) with ADS-B In (and) gotten an alert at 59 seconds before the collision and been able to take measures to avert it,” she continued later during the board meeting. “For the helicopter crew, they had 48 seconds. They didn’t even know — it is clear from the (cockpit voice recorder) they didn’t even know it was on the left.”\n\nSen. Ted Cruz, chairman of the Senate Commerce, Science, and Transportation Committee, has called for the system to be implemented on all aircraft. Sens. Cruz and Cantwell haveco-sponsored a billthat would mandate the technology, but it awaits a vote from the House.\n\n“The pilots would have been warned of each other’s exact position nearly one minute before impact, and 67 people would still be alive today,” Cruz said last week in the hearing.\n\nHomendy closed the report reiterating that too many of the NTSB’s recommendations from previous deadly accidents resulted in no action being taken.\n\n“To all who have lost loved ones in an accident we’ve investigated, know this: the NTSB will never give up,” Homendy wrote. “Until every single one of our safety recommendations is fully implemented. Until there’s no longer a need for our recommendations. Until there’s no longer a need for the NTSB. Until we have a safe transportation system for all. Until there are zero grieving families. Zero.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/03/20/us/toronto-plane-crash-delta-preliminary-report",
      "text": "Delta Air Lines regional jet landing in Toronto"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/us/ntsb-investigators-pinpoint-failed-aircraft-part-from-ups-crash-last-year",
      "text": "UPS cargo plane taking off"
    },
    {
      "url": "https://www.ntsb.gov/investigations/Pages/DCA25MA108.aspx",
      "text": "recommendations"
    },
    {
      "url": "https://www.cnn.com/2025/03/11/us/ntsb-takeaways-dc-plane-helicopter-collision",
      "text": "changes to helicopter routes around Washington"
    },
    {
      "url": "https://www.cnn.com/2025/05/08/us/faa-equipment-issues-safety-concerns",
      "text": "multibillion-dollar overhaul"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/us/ntsb-plane-crash-dc-potomac",
      "text": "board meeting"
    },
    {
      "url": "https://www.cnn.com/2025/07/15/us/senator-helicopter-bill",
      "text": "co-sponsored a bill"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/washington-dc-plane-crash-cause",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/washington-dc-plane-crash-cause",
      "text": "Cookie Settings"
    }
  ],
  "hash": "779c192e250636f39559685584b4a0ee13d49e7a063549caef58652a44d8ec3c",
  "scraped_at": "2026-02-18T07:31:41.264228+00:00"
}
