{
  "url": "https://lite.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
  "title": "Trump’s approval rating with independents hits a new low ahead of the State of the Union | CNN Politics",
  "date": "2026-02-24T07:32:33.318416+00:00",
  "authors": [
    "Ariel Edwards-Levy",
    "Jennifer Agiesta",
    "CNN"
  ],
  "text": "Source: CNN\n\nWhen President Donald Trump gives his State of the Union address Tuesday, he will face a public that increasingly questions his priorities and expresses broad doubts about whether his proposed policies are helping the nation, according to a new CNN poll conducted by SSRS.\n\nAdding to the pile of alarming indicators for the president’s party heading into this year’s midterms, Trump’s approval rating among political independents has dipped to a new low in CNN polling.\n\nJust 32% of Americans now say that Trump has had the right priorities, while 68% say he hasn’t paid enough attention to the country’s most important problems. That’s the president’s most negative reading on that question to date during either of his terms in office. At the same time, Americans say, 61% to 38%, that Trump’s policies will move the country in the wrong direction rather than the right one. And Trump’s job approval rating among all adults remains mired at 36%.\n\nThe poll’s findings suggest the scale of the task ahead of the president.\n\nWhen Trump addressed Congress last year for the first time since returning to the White House, his approval rating stood at a career-high 48% in CNN’s pre-speech polling. Since then, he has lost ground across all major demographic groups, with Republicans, conservatives and White Americans without college degrees among the few groupsto hold a net-positive view of Trump.\n\nSome of the steepest declines include a 19-point drop in approval among Latino Americans and an 18-point drop among Americans younger than 45. Among political independents, Trump’s approval rating has dropped 15 points over the past year to 26%, the lowest it’s been in either of his terms.\n\nState of the Union addresses typically draw disproportionately friendly audiences, with supporters of the president more likely to tune in. That could give Trump an opportunity to rally his own partisans, whose support for the president has also softened over the past year.\n\nStrong approval among Republicans stands at 49% in the poll, down from 64% just after his address to Congress last year and the first time in this term it’s dipped below the 50% mark. Nearly three in 10 Republicans say Trump hasn’t paid enough attention to the most important problems, and 16% say his policies will move the country in the wrong direction.\n\nAsked to choose the issue they’d most like Trump to address in his State of the Union speech, 57% pick the economy and cost of living, more than quadrupling the share who want to hear him focus on any other individual topic, including immigration, the state of democracy, health care policy, crime or foreign policy. Half of Democrats say they want Trump’s speech to touch on economic issues, rising to 56% among independents and 65% of Republicans.\n\n“Part of the reason why I think people elected Trump was because they were hurting under Biden. … I think people were expecting Trump to provide a little bit of relief to their suffering,” wrote one poll respondent, a Republican from New Mexico. “Grocery prices are just through the roof. Everything is so expensive. … So I think he needs to talk about the economy, and he needs to talk about what kind of things he’s already done.”\n\nTrump’s job approval rating, which has hovered below the 40% mark since last autumn, stands at 36%, with 63% disapproving. Nearly half strongly disapprove of his job performance, while 19% strongly approve.\n\nThose who approve only moderately of Trump’s performance are more likely to take issue with his priorities than with his policies. While just 6% in this group think Trump’s proposals will move the country in the wrong direction, 34% say the president hasn’t paid enough attention to the country’s most important issues.\n\nThe poll finds sharp differences among Republicans by age. While 63% of Republicans who are 65 or older say they strongly approve of the president’s job performance, that stands at just 31% among Republicans younger than 35. Younger Republicans are about twice as likely as those age 65 or older to say Trump’s policies will move the country in the wrong direction (24% among 18- to 34-year-old Republicans vs. 11% among those 65 or older), and to say that he hasn’t had the right priorities (42% among 18- to 34-year-old Republicans vs. 20% among those 65 or older).\n\nOne thing unites the GOP across age lines: More than 6 in 10 say Trump should focus on economic issues in his address Tuesday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
      "text": "Cookie Settings"
    }
  ],
  "hash": "77b2b6fa0968944482a52eb4180d27a64151abe9758de140fce9e1d419cbc73f",
  "scraped_at": "2026-02-24T07:32:33.318431+00:00"
}