{
  "url": "https://lite.cnn.com/2026/02/12/entertainment/casey-wasserman-epstein-files-ghislaine-maxwell",
  "title": "The Epstein files come for Hollywood royalty | CNN",
  "date": "2026-02-15T07:10:58.607093+00:00",
  "authors": [],
  "text": "Source: CNN\n\nCasey Wassermanwas literally born to be a titan of the Hollywood industry.\n\nThis week, the powerhouse talent agent has faced a revolt after appearing inthe Epstein files, for both riding on the late convicted sex offender’s plane and exchanging suggestive messages with Jeffrey Epstein’s former girlfriend and convicted accomplice, Ghislaine Maxwell.\n\nThe slow trickle exploded into public view this week after singer Chappell Roan announced she was leaving Wasserman’s eponymous talent agency. Singer Orville Peck quickly followed, and then singer-songwriter Weyes Blood, among others.\n\nWhile Wasserman has not been accused by authorities of any wrongdoing, he is facing pressure from both his talent and his talent’s agents to step aside. CNN reached out to more than 70 artists on Wasserman Agency’s roster seeking comment. None chose to reply.\n\nWasserman will likely choose tactics from a playbook that will seem familiar to anyone who has seen a powerful man in a crisis. He can work with a crisis PR company behind the scenes; he can stay quiet in the hopes that another crisis will take center stage in the public conversation; he can address the matter publicly in a limited fashion when his advisors think it best. He also faces a choice to stay with or to leave his own agency, which may or may not need renaming.\n\nWasserman also serves as head of the coordinating committee for the 2028 Olympic Games in Los Angeles, and despite a number of LA officialscallingfor him to step aside from that role, the LA28 Executive Board told CNN in a statement Wednesday that after “reviewing any concerns related to the organization’s leadership,” it has determined that Wasserman “should continue to lead LA28 and deliver a safe and successful Games.”\n\nCNN has contacted Wasserman’s agency and a crisis communication firm representing him for comment.\n\nWasserman has not commented publicly on the artist departures, but he expressed his “regret” about his correspondence with Maxwell in astatementreported by the Associated Press in January, clarifying that the exchange “took place over two decades ago, long before her horrific crimes came to light.”\n\n“I never had a personal or business relationship with Jeffrey Epstein. As is well documented, I went on a humanitarian trip as part of a delegation with the Clinton Foundation in 2002 on the Epstein plane. I am terribly sorry for having any association with either of them,” his statement read.\n\nEver since the Justice Department releaseda three million-page trancheof documents related to its investigation into Epstein, there has been a relentless amount of information and stories, spawning a growing outcry for accountability.\n\nLittle has come — at least, in America.\n\nConsequences in Europe,particularly in England, have been swifter. For the rest, there are questions. Is simply appearing in the Epstein files a recipe for automatic disavowal? What about those who attended his parties andreferenced his harem?\n\nIfhistoryis any guide, the rally of a collective group of celebrities can provide some answers.\n\nWhile the Epstein files have revealed an elite circle of rich and powerful men that swirled in Epstein’s orbit, Wasserman is the one now facing calls for accountability, and they are coming from the very celebs whose voices it has been his job to amplify over the years.\n\nTheintimate messagesbetween Wasserman and Maxwell were sent in 2003, according to the released documents.\n\nIn one of the exchanges, WassermanemailedMaxwell asking, “so what do I have to do to see you in a tight leather outfit?” In anotheremailexchange from April 1, 2003, Wasserman, who was married at the time, says to Maxwell, “where are you, I miss you,” before asking to book a massage.\n\nMaxwell was found guilty on five of six counts in 2021 related to her role in Epstein’s sexual abuse of minor girls between 1994 and 2004. In 2022, she was sentenced to serve 20 years in federal prison.\n\nWasserman’s agency has long been a power player in the sports, music and entertainment industry, representing major stars like Coldplay, Ed Sheeran, Kendrick Lamar, Joni Mitchell, Travis Scott and Kenny Chesney, among hundreds of others.\n\nGrammy-winning singer Chappell Roan wrote on Instagram on Monday that she is “no longer represented” by the talent agency that Wasserman leads.\n\n“Artists deserve representation that aligns with their values and supports their safety and dignity,” Roan wrote. “This decision reflects my belief that meaningful change in our industry requires accountability and leadership that earns trust.”\n\nAnother singer/songwriter, Weyes Blood, wrote on her Instagram that she has “immense respect and affection for my booking agents, who are unfairly bearing the impact of the situation over at my booking agency, Wasserman.”\n\n“As I continue conversations with them about their futures, I want to be unequivocally clear: I will not be remaining with Wasserman,” she wrote. “Casey Wasserman’s behavior is fundamentally at odds with everything I value. Thank you.”\n\nCountry star Orville Peck has also left the agency, saying on his Instagram page Tuesday that he is leaving “with a huge amount of compassion for the rest of the agents and staff at the agency, who are being left with a situation that impacts all of our work and livelihoods.”\n\nMany other artists and bands on the roster have called for Wasserman to resign, including Bethany Cosentino of the band Best Coast, who, like Peck, empathized with the agents who work at Wasserman and called in an open letter posted to her Instagram page for Wasserman to step down.\n\n“I’m speaking out because pretending this is normal isn’t normal,” she wrote. “Because people in power can’t keep skating by.”\n\nOther artists including the bandLocal Natives, the popular Irish-American band Dropkick Murphys and the rock band Wednesday have also come out in condemnation of Wasserman.\n\nWasserman came from Hollywood royalty and took to the business early.\n\nHis grandfather helped build the idea of the modern Hollywood powerbroker, becoming one of the most prolific agents in postwar Hollywood and representing icons like Bette Davis and Clark Gable through his company, Music Corporation of America (MCA), while also diving deeply into politics, raising millions for the Democratic party.\n\nThe elder Wasserman, who died in 2002, took the boy then known as Casey Myers under his wing after his parents split when he was seven, raising him as his own son. Myers changed his name to Casey Wasserman in 1995, when he was 18.\n\n“He made that conscious decision to be my father figure and that meant a lot in my life,” Wasserman said on a 2017 episode of the “Rich Roll” podcast. “I would not be the person I am today, nor have had the life I’ve had if he hadn’t made the conscious decision to have that role.”\n\nThe younger Wasserman benefited from his privilege but worked his way to the top.\n\nBy age 24, after hereceived a multi-million dollar trust, Wasserman bought his first sports organization, the Arena Football League’s Los Angeles Avengers.\n\nA few years later, helaunchedWasserman Media Group, and went on to build it into one of the leading sports and entertainment talent agencies today. Like his grandfather, he also became involved in Democratic fundraising.\n\nWasserman cared about “creating the right culture” at his company, saying that he strived to create “an environment that allows people to be successful and do what they’re best at” during a 2016 appearance on “The Herd with Colin Cowherd.” “And that usually means putting your stuff aside and embracing theirs.”\n\nAs his company and status grew, Wasserman spoke about the tension that could bring. “What I quickly realized as I got older was that the more successful you are, the more problems you deal with and the more challenges you have,” he said on “Rich Roll,” adding that “stuff just goes wrong.”\n\n“And that the key measure to success is how well you deal with the bad news and the problems.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/casey-wasserman-talent-agency-epstein-maxwell",
      "text": "Casey Wasserman"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "the Epstein files"
    },
    {
      "url": "https://laist.com/news/epstein-files-la-olympics-chief-casey-wasserman-scrutiny",
      "text": "calling"
    },
    {
      "url": "https://apnews.com/article/epstein-maxwell-wasserman-olympics-bf365cd5231304395af05abc3deb9cf7",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "a three million-page tranche"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
      "text": "particularly in England"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/us/word-of-week-harem-cec",
      "text": "referenced his harem"
    },
    {
      "url": "https://www.cnn.com/2020/03/11/us/harvey-weinstein-sentence",
      "text": "history"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/casey-wasserman-la-olympics-ghislaine-maxwell-epstein",
      "text": "intimate messages"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02335206.pdf",
      "text": "emailed"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02332508.pdf",
      "text": "email"
    },
    {
      "url": "https://x.com/localnatives/status/2021765862227927044?s=46&t=Euy5E9Yucvfh6XupAe-sjg",
      "text": "Local Natives"
    },
    {
      "url": "https://www.latimes.com/archives/la-xpm-2002-oct-27-tm-wasserman43-story.html",
      "text": "received a multi-million dollar trust"
    },
    {
      "url": "https://www.hollywoodreporter.com/business/business-news/casey-wasserman-path-los-angeles-olympics-1236348056/",
      "text": "launched"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/entertainment/casey-wasserman-epstein-files-ghislaine-maxwell",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/entertainment/casey-wasserman-epstein-files-ghislaine-maxwell",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7883063013b184c1e5e4d038bb082bb1f25aa01970f41456046ce6e3f0f76927",
  "scraped_at": "2026-02-15T07:10:58.607105+00:00"
}