{
  "url": "https://lite.cnn.com/2026/02/24/politics/supreme-court-ruling-trump-state-of-the-union",
  "title": "Trump slams ‘very unfortunate ruling’ from Supreme Court on tariffs as justices sit in silence | CNN Politics",
  "date": "2026-02-25T07:31:27.219832+00:00",
  "authors": [
    "John Fritze"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump used hisState of the Union addressTuesday to slam theSupreme Court’s decisionagainst his sweeping emergency tariffs, repeatedly calling the ruling “unfortunate” even as he suggested his administration would quickly move past it.\n\nWith four justices sitting mere feet away, their hands folded over their robes, Trump touted what he described as a vast economic benefit from the global tariffs before lamenting the “unfortunate ruling from the United States Supreme Court.”\n\n“It just came down,” the president said. “Very unfortunate ruling.”\n\nThough it was likely an awkward moment for the justices, Trump’s criticism of the court was far more tempered than on Friday, when he railed against the justices who voted against his tariffs. In anangry press conferenceat the White House, he described the court’s decision as a “disgrace” and at one point said that justices in the majority were an “embarrassment to their families.”\n\nFour justices showed for the president’s speech: Chief Justice John Roberts and Justices Elena Kagan, Brett Kavanaugh and Amy Coney Barrett, a first-term Trump appointee. Three of them — Roberts, Kagan and Barrett — voted against his tariffs. Kavanaugh, whom Trump also appointed to the high court in his first term, wrote the dissent from that decision.\n\nThe justices themselves have made clear for years they would prefer to be almost anywhere besides a State of the Union address. Stone-faced and silent, their front-row presence is an oddity at an event where lawmakers repeatedly erupt into applause or jeers.\n\nThe late Justice Antonin Scalia once described the speech as a “childish spectacle.” Justice Samuel Alito acknowledged the awkwardness and in 2010 complained that jurists essentially had to sit in the chamber “like the proverbial potted plant.”\n\nThe Supreme Courtruled 6-3 on Fridaythat Trump could no longer rely on an emergency law enacted in the 1970s to impose his tariffs on a whim. Nothing in the court’s decision barred Trump from relying on other laws to raise tariffs, though many of those other measures come with strings attached.\n\nTrump last week praised Kavanaugh, who penned the dissent in the case, but called those who voted against him a disgrace and suggested without evidence that their decision may have been driven by foreign influence.\n\nBut Trump said the justices were still invited to his speech.\n\n“Barely,” he added.\n\nOn Tuesday, Trump exchanged pleasantries and shook hands with all four justices in attendance as he worked his way through the chamber before the speech.\n\nAfter calling the decision “unfortunate” and “disappointing,” he framed its impact as limited.\n\n“The good news is that almost all countries and corporations want to keep the deal that they already made,” the president said.\n\nSixteen years ago, President Barack Obama during his State of the Uniontook a similar swipeat the court for its decision days earlier in Citizens United v. FEC, which allowed corporations to spend unlimited sums in candidate elections. Six justices who attended the speech offered little reaction at first as Obama began speaking about that decision.\n\n“With all due deference to separation of powers,” Obama said, “last week, the Supreme Court reversed a century of law that I believe will open the floodgates for special interests — including foreign corporations — to spend without limit in our elections.”\n\nObama’s scolding is perhaps best remembered for one justice’s reaction. Alito, a conservative who supported that decision, could be seen shaking his head and mouthing the words, “Not true.”\n\nA media firestorm followed and Alito never returned to another speech, saving his expressions of agreement or disapproval for the bench.\n\nBut even when the president — any president — is not reeling from a significant legal loss, the presence of the justices can often make for awkward moments on the House floor. Last year Trump was caught on a microphone giving a hearty thanks to Roberts months after the court granted the presidentimmunity from criminal prosecutionfor some official actions.\n\n“Thank you again,” Trumpcould be heard telling Robertson the House floor. “I won’t forget it.”\n\nThe president later said on social media that he was thanking the chief justice for swearing him in at his inauguration.\n\nIn 2018, Trump touted his “great new Supreme Court justice,” referring to Neil Gorsuch, who sat so expressionless that his locked face became a social media meme. Two years later, Trump boasted about Gorsuch and Kavanaugh as the camera panned to both men as theyoffered tight-lipped smilesto each other.\n\n“To the extent the State of the Union has degenerated into a political pep rally,”Roberts said in 2010, “I’m not sure why we’re there.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
      "text": "Supreme Court’s decision"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/donald-trump-tariffs-economic-agenda",
      "text": "angry press conference"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "ruled 6-3 on Friday"
    },
    {
      "url": "https://www.youtube.com/watch?v=k92SerxLWtc",
      "text": "took a similar swipe"
    },
    {
      "url": "https://warnermedia-my.sharepoint.com/personal/john_fritze_cnn_com/Documents/cnn.com/2024/07/01/politics/takeaways-trump-immunity-scotus",
      "text": "immunity from criminal prosecution"
    },
    {
      "url": "https://www.c-span.org/clip/joint-session-of-congress/user-clip-trump-greets-the-justices-after-his-march-4-2025-address/5155822",
      "text": "could be heard telling Roberts"
    },
    {
      "url": "https://www.c-span.org/program/joint-session-of-congress/2020-state-of-the-union-address/540082",
      "text": "offered tight-lipped smiles"
    },
    {
      "url": "https://www.cnn.com/2010/POLITICS/03/10/obama.supremecourt/",
      "text": "Roberts said in 2010"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/supreme-court-ruling-trump-state-of-the-union",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/supreme-court-ruling-trump-state-of-the-union",
      "text": "Cookie Settings"
    }
  ],
  "hash": "78f8ba3d0176df4a4c5fcb61d80a02385a5c4de984da212478807bc4c33b66db",
  "scraped_at": "2026-02-25T07:31:27.219842+00:00"
}