{
  "url": "https://lite.cnn.com/2026/02/08/science/elon-musk-spacex-priorities-moon-intl-hnk",
  "title": "Elon Musk says SpaceX prioritizing the moon, pivots away from his Mars settlement ambition | CNN",
  "date": "2026-02-11T16:34:00.740114+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nElon Musk’s ambition to one day settle Mars appears to have taken a back seat to a rather nearer and more achievable goal – sending humans to live on the moon.\n\nIn a statement on X on Sunday, the billionaire said his company SpaceX has now shifted its priorities to building “a self-growing city on the Moon,” arguing that it coul﻿d be achieved in less than a decade, compared with more than 20 years for a similar plan on Mars.\n\n“The overriding priority is securing the future of civilization and the Moon is faster,” he saidon X Sunday. “It is only possible to travel to Mars when the planets align every 26 months (six month trip time), whereas we can launch to the Moon every 10 days (2 day trip time).”\n\nIt is not immediately clear what Musk meant by a “self-growing city” or whether his plans are in line with a similar lunar plan NASA proposes. CNN has reached out to SpaceX for comment.\n\nMusk said the company﻿ remains committed to building a Mars city, and will begin doing so in about five to seven years. As recently as last May, Musk had said SpaceX was working to land its first uncrewed Starship on Marsas soon as late 2026.\n\nMusk’s trimming of his previous space travel predictions came afterSpaceX acquired XAIlast week, in a move that will merge two of his most ambitious companies into the most valuable private firm in the world.\n\nShifting SpaceX’s focus away from Mars and to the moon — which is considered a more technologically and financially feasible target for an extraterrestrial settlement — could serve as a stepping stone that can help investors get comfortable with Musk’s more ambitious ideas.\n\n“Musk’s ultimate goal is to get civilization to Mars. It’s going to be very expensive, and as a soon-to-be public company, SpaceX needs to appease shareholders,” said Justus Parmar, CEO of Fortuna Investments, a venture capital firm invested in SpaceX.\n\n“Setting up operations on the lunar surface will provide a quicker return on revenue, so it’s a natural step on the way to a more expensive and heavier R&D project to get to Mars,” Parmar added.\n\nFor more than a decade, Musk has made it a point to advertise his laser focus on establishing a settlement on Mars, saying it has been SpaceX’s guiding goal since the company was founded in 2002.\n\nIn speeches delivered at aerospace conferences and events for SpaceX employees, he has detailed ambitious — albeitdubiously feasible— plans for establishing a permanent human presence on the red planet, saying such a step is necessary for ensuring a colony of humans can survive a potential apocalypse.\n\nNASA, in contrast, has focused on its lunar ambitions, particularly since President Donald Trump’s first term, when then-Vice President Mike Pence abruptlydeclaredthat the United States would return its astronauts to the moon by 2024.\n\nThe bold plan did not pan out, and NASA is currently working to return astronauts to the lunar surface by 2028 — the time frame the agency had been working toward in the Obama era. That return will mark the first time humans have set foot on the moon since the Apollo program ended in 1972.\n\nMusk has criticized the efforts in the past, alluding to NASA’s moon program, named Artemis, as a “distraction” on X early last year.\n\n“No, we’re going straight to Mars,” hewroteat the time. “The Moon is a distraction.”\n\nMusk’s apparent pivot to focusing on the moon comes as the tech billionaire – whose companies receive huge government contracts – has taken a far more vocal stance on politics than in years past. He poured $290 million into the US presidential election, backing Donald Trump and receiving a White House job only to have an abrupt falling out with the president. He returned to his good graces this past fall.\n\nWhile NASA has built the rocket and spacecraft designed to launch astronauts from Earth and to the lunar vicinity, SpaceX has a nearly $3 billion contract to build the federal agency’s lunar lander, or the vehicle that will ferry the crew members from their spacecraft down to the moon’s surface.\n\nSpaceX plans to use its Starship system for the task — the largest spacecraft and rocket system ever built, and the vehicle that Musk says is purpose-made for taking people to Mars.\n\nStarship, however, is still in the early stages of development and has oftenexplodedduring testing.  The spacecraft has never traveled to orbit or conducted an operational flight, and SpaceX is expected to debut a new line of Starship prototypes as soon as early March.\n\nStarship is extremely ambitious, and its role in NASA’s moon program has also been a point of controversy.\n\nSean Duffy, Trump’s secretary of transportation who also served a brief stint as acting NASA administrator last year, called out SpaceXin October — warning the company did not appear to be on track to have its lunar lander ready in time for NASA’s moon-landing mission as the space agency races to beat China’s lunar exploration program.\n\nDuffy notably threatened to sideline SpaceX from the moon-landing mission, called Artemis III, and said he wouldevaluatewhether SpaceX’s chief competitor, Blue Origin, could get the job done faster.\n\nBlue Origin, the space exploration company founded by Jeff Bezos, also holds a multibillion-dollar NASA contract to develop a vehicle capable of ferrying astronauts from deep space to the lunar surface. The company announced last month that it ishalting tripson its suborbital space tourism rocket — which previously carried Bezos, Katy Perry and William Shatner to space — in order to focus on lunar lander development.\n\nNASA officials have not openly revisited the Artemis III lunar lander contract since the agency’s newly installed administrator, billionaire tech CEO Jared Isaacman, was confirmed for the top job in December. Isaacman is considered an ally of Musk as he has twice paid to fly on SpaceX capsules to Earth orbit.\n\nMusk’s assertion that SpaceX will now focus on lunar exploration comes as NASA is gearing up to launch its first crewed mission of the Artemis program, called Artemis II.\n\nThat mission is slated to launch four astronauts on a trip that will circumnavigate the moon but will not land on it, serving as a pathfinder for the more complex Artemis III landing mission. Artemis II is scheduled to launch as soon asMarch.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/elonmusk/status/2020640004628742577",
      "text": "on X Sunday"
    },
    {
      "url": "https://www.cnn.com/2025/06/19/science/elon-musk-rocket-spacex-failure-mars",
      "text": "as soon as late 2026"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/tech/spacex-acquires-xai-elon-musk",
      "text": "SpaceX acquired XAI"
    },
    {
      "url": "https://www.cnn.com/2024/11/22/science/mars-human-settlement-elon-musk",
      "text": "dubiously feasible"
    },
    {
      "url": "https://www.cnn.com/2019/03/26/politics/mike-pence-moon-five-years",
      "text": "declared"
    },
    {
      "url": "https://x.com/elonmusk/status/1875023335891026324?s=20",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2025/06/19/science/elon-musk-rocket-spacex-failure-mars",
      "text": "exploded"
    },
    {
      "url": "https://www.cnn.com/2025/10/20/science/nasa-spacex-moon-landing-contract-sean-duffy",
      "text": "evaluate"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/science/blue-origin-space-tourism-new-shepard-pause?cid=ios_app",
      "text": "halting trips"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/science/nasa-artemis-2-delays-moon-mission-launch",
      "text": "March"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/science/elon-musk-spacex-priorities-moon-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/08/science/elon-musk-spacex-priorities-moon-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7946cd247c358e410a8ca0eb2459a742c87841c1e5ef69cf60a4371e999b95ed",
  "scraped_at": "2026-02-11T16:34:00.740125+00:00"
}