{
  "url": "https://lite.cnn.com/2026/02/13/style/nick-cave-artist-mammoth-smithsonian",
  "title": "‘History is being erased’: Artist Nick Cave brings his ancient mammoths to the Smithsonian | CNN",
  "date": "2026-02-15T07:12:51.717725+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe beasts arethe work of the Chicago-based artist Nick Cave, who, over the course of his career, has transformed troves of goods from thrift shops and craft stores into otherworldly humanoid figures, as well as other intricate sculptures bursting with color, texture and life.\n\nHis herd of creatures are just one component of a monumental show at the Smithsonian American Art Museum (SAAM), titled “Mammoth,” where they appear as sculpture﻿s and in a video, filmed along Lake Michigan.\n\nThe show, which opens February 13, is the institution’s largest commission by a single artist to date. It is Cave’s first solo exhibition in Washington, DC. and follows his major museum retrospective at Chicago’s Museum of Contemporary Art and New York’s Guggenheim Museum over three years ago, “Forothermore” — an ode to marginalized communities. Cave is best known for his Soundsuits — his ever-evolving collection of sculptures, some wearable, that camouflage the body in a surplus of materials and items — but he has also cast bronze sculptures of figures and limbs adorned with flora and created forest-like installations of whimsical wind spinners. He often builds texture through beading, sequins, and textiles and disguised objects, in ways that beckon the viewer to travel around an object or move up close.\n\n“I’m always interested in the ways I can build a surface,” Cave explained from his studio in December, as he was finishing the mammoths and shipping off the pieces to DC. “It’s through experimentation, exploration, just pushing materials out of their familiar roles.”\n\nIn Chicago’s Irving Park neighborhood, he shares the flexible studio and gallery Facility with his longtime partner, the artist and designer Bob Faust, who was also instrumental to making “Mammoth.” Facility is also their home, and their impressive art collection fills the walls of their upstairs apartment, including works by Barkley L. Hendricks, Cy Gavin and Amoako Boafo; downstairs, Cave’s studio assistants sit at workstations, working on the intricate details of his pieces in the sunlit, greenery-filled space.\n\nDuring the studio visit, mammoths sat in various stages of completion; some simple metal shells, others half-covered in hair. Tables and clothing racks displayed some of the individual components of the larger show. One rack Cave pulled included sequined garments worn by a group of so-called Nomads, their figures compiled together like the structure of a jungle gym, he explained. Their accompanying architectural headdresses, some half wrapped in beads, sat out on a nearby table. Altogether, Cave collected thousands of his own family heirlooms and familiar thrifted goods from flea markets and antique malls — from corded phones to Tinkertoys to quilting blocks — to assemble for the show.\n\n“Nick has always been dropping breadcrumbs about a project with this ambition and scale,” said Naomi Beckwith, the deputy director and chief curator of the Guggenheim, who curated “Forothermore,” in a video call. “His sculpture is getting bigger and bigger and bigger…there were works that we wanted to show at the Guggenheim Museum (that we) just couldn’t get into the building.”\n\nIn “Mammoth,” Cave acts as both artist and archaeologist, cataloging and transforming objects of American life on an illuminated table in the center of the show. They take shape as arrangements, sculptures and architecture, including sky-high antennas meant to call back to far-flung ancestors made of bingo cages, fishing poles or bicycle parts. His family’s story of migration from the South to the Midwest is shown through an enormous, beaded tapestry that charts the topography of his grandparents’ farmland, called “Palimpsest (Promised Land).”\n\n“It led me down this sort of path of really asking myself how was I made?” he said. “I come from an amazing family of makers, from woodworkers to carpenters to seamstresses to bakers, poets, musicians, painters. And so I started to dive deep into really exploring all of these amazing people that have influenced who I am today.”\n\nBut “Mammoth” also calls into question how history is formed and what is included, or left out, particularly with the symbolism of the titular creature.\n\n“I’m witnessing a time where history is being erased, but yet history is being revealed at the same time,” Cave explained. And so when I think about mammoths, I think about that at one point, they existed on the Earth, and then were extinct and buried, and then rediscovered. What is erased becomes revealed. What is removed, reappears.”\n\nWith mammoth skulls looming overhead on towering wooden structuresat the exhibition, there is a feeling of watchfulness. In one gallery, they roam the walls through the video filmed prior to the show. Later this year, performers will operate 12 mammoths of varying sizes for a procession through the museum.\n\n“I love this communal movement that speaks about unity and collective energy and so all of that is very much part of the message that I want to be apparent,” Cave said.\n\nThe exhibition has been nine years in the making, with Cave conceptualizing “Mammoth” long before the White House’s recent attempts to radically reshape the Smithsonian’s museums. During President Trump’s second term, the administration has sought to eradicate “improper ideology,” per an executive order in March 2025, and has directed a review of Smithsonian exhibitions and events that is still ongoing. Cave declined to address any politics behind the scenes, but alluded to the timeliness of the show.\n\nSarah Newman, SAAM’s curator of contemporary art, said that nothing about the show has changed from its intent. “We feel like it’s the right thing to present now,” she said in an interview at the museum.\n\nAcross the span of his work, Cave has blended history with personal memory. One of seven brothers, the artist was born in Fulton, Missouri, in 1959 and raised there and in nearby Columbia by his mother. He often incorporates family objects into his work. He added crucifixes to a collection of his grandfather’s tools to create an altar-like piece in 2000; in “Mammoth,” his grandmother’s ceramic florals and late younger brother’s wooden cane become a tribute within the larger display. He loves items that are handmade and kitschy, that aren’t considered valuable but carry meaning or memory.\n\n“He is thinking about all the traditions and objects that he grew up with that aren’t necessarily archived anywhere. They’re not in a museum,” said Newman. “They are the things we live with every day. They are crafts that people make. They are tools that people use. They’re pie plates and thimbles and toys.”\n\nCave had gathered all the elements in his studio and had roughly plotted out how and where they would appear. But he worked intuitively on-site to bring everything together over the course of two weeks. No one, including himself, knew fully what the show would look like until installation was completed. On the lakefront in January, one of Cave’s collaborators commented in passing about SAAM: “I think they’re nervous because they don’t know exactly what Nick is going to do.”\n\nUnder a different political climate, that likely wouldn’t be the case. The artist has long been open about the political, racial and social structures that have shaped his work. He has directly dealt with the iconography of slavery and racist imagery in his artworks and produced sculptures of the dismembered heads or arms of Black bodies, cast in dark bronze or carved in wood, sometimes in chains or at the mercy of eagles. He has laid out ammunition casings in the shape of American flags.\n\nA new bronze sculpture in the show, “Amalgam (Plot),” shows two black figures somberly sprawled on the floor, sculptural flowers bursting from their bodies. One figure’s head is the flared shape of a speaker, turned face down as if silenced, but Cave said the sculpture is about “rebirth,” too.\n\nCave’s Soundsuits were born in the wake of police brutality against Rodney King in 1991, a moment that marked a critical turning point for the artist, as he recounted.\n\n“I thought I was living in a world with a conscience, but that woke me up in a different way,” he recalled. Thinking about the recording of a Black body being violated, he began collecting twigs and fashioned a sculpture that became a kind of armor. “The moment I put it on, it concealed my identity, but then when I moved, it made sound,” he said. “So that’s how the Soundsuit came about — it allowed me to hide gender, race, class.”\n\nSince then, Cave has fashioned hundreds of Soundsuits as “second skins,” in gilded leaves, button patterns, technicolor fur, or even plush monkeys, varying their silhouettes, scale and mobility. Movement and dance are essential to the works, too, and the artist has staged performances at major museums as well as public locations such as New York’s Grand Central Terminal in 2013.\n\n“What Nick is incredibly good at is transforming something that is quite agonizing into something that can be beautifully joyous,” Beckwith said. Though Cave was directly responding to protection for Black bodies at the time, Beckwith notes that the idea of protection extends outwards. “You could also translate that to anyone who feels uncomfortable or vulnerable.  — What does it mean to be queer? What does it mean to be trans? What does it mean to be a woman? What does it mean to be small?”\n\nHis mammoths, however, do not strive to conceal. Cave discarded his original idea to have them covered in something akin to hide because he liked that viewers could see the people operating inside of them.\n\n“I loved the fact that humanity was revealed. “We weren’t hiding behind (them),” Cave said. “To me, that was really an important moment.”\n\nBeckwith says that Cave’s work isn’t always read as political at first. In “Mammoth,” though the catalog goes deeper into the show’s handling of complex topics, including race, colonialism and climate change, the wall texts are kept more open to interpretation.\n\n“With an exhibition like this, when we’re presenting it to our public, we’re more interested in inviting people to bring their own perspective to it, and to give them the tools so that they can have their own understanding and interpretation of the work,” Newman said.\n\nOn a granular level, Cave hopes that visitors will spend time with each object, perhaps forming their own connections or associations as potent as his own.\n\n“I know that everyone will be able to land somewhere within the exhibition and identify with something of their past,” he said. “That is the celebration — it will bring us all back to a place that we once remembered, and yet it will bring us right to the present, too.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://americanart.si.edu/exhibitions/nick-cave",
      "text": "Mammoth"
    },
    {
      "url": "https://www.cnn.com/2025/03/28/politics/trump-targets-ideology-at-the-smithsonian",
      "text": "improper ideology"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/style/nick-cave-artist-mammoth-smithsonian",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/style/nick-cave-artist-mammoth-smithsonian",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7ae94007d474041f9859349e796954edf3f7c2d8e041dbae443fcafc7c3ebc02",
  "scraped_at": "2026-02-15T07:12:51.717738+00:00"
}