{
  "url": "https://lite.cnn.com/2026/02/23/uk/andrew-mountbatten-windsor-epstein-taxpayer-money-intl",
  "title": "Andrew Mountbatten-Windsor: New allegations of how former prince may have used taxpayer money to meet Epstein | CNN",
  "date": "2026-02-24T07:32:08.335324+00:00",
  "authors": [
    "Christian Edwards",
    "Lauren Said-Moorhouse",
    "CNN"
  ],
  "text": "Source: CNN\n\nIn the days after the extraordinary arrest ofAndrew Mountbatten-Windsoron suspicion of misconduct in public office, the former prince has faced a slew of allegations about his time as a trade envoy for Britain and his friendship with the late sex offender Jeffrey Epstein.\n\nMountbatten-Windsor faces questions about how he may have traveled to visit Epstein, and whether he may have used his police protection as security while he spent time with him.\n\nThe former prince has not commented on the latest allegations. He has previously denied any wrongdoing related to Epstein and said that he never witnessed or suspected any of the behavior of which the sex offender was accused. CNN has asked Mountbatten-Windsor for fresh comment.\n\nOver the weekend, Gordon Brown, Britain’s prime minister from 2007 to 2010, demanded a police investigation into whether Mountbatten-Windsor used taxpayer-funded jets and Royal Air Force (RAF) bases to meet Epstein – according toThe Telegraph.\n\nBrown, who has taken a leading role in demanding accountability for Britons with ties to Epstein, sent letters to six police forces suggesting that civil servants be questioned about Mountbatten-Windsor’s decade as a trade envoy, before he was forced to step down in 2011.\n\nIn the letters, reported by The Telegraph, Brown expressed his concern that the then-Duke of York may have used chartered RAF flights to shuttle him to personal engagements that may have involved Epstein, calling the trips a “wholly unacceptable” use of public money.\n\nThe Telegraph reports that Brown would only say that the letters contained “new and additional information.” Brown’s spokesman confirmed to CNN that the letters were sent to police but did not address any of the new information Brown claims was sent.\n\n“We sent the letters privately to the relevant police forces only and are not making them available publicly whilst the investigation is live,” said the spokesman.\n\nEmails released by the US Department of Justice also appeared to show that taxpayer-funded officers from London’s Metropolitan Police were instructed to provide security for a dinner party at Epstein’s New York townhouse. Several emails discuss arrangements for the former prince to stay with the disgraced sex offender in December 2010 – more than a year after Epstein was released from jail having served 13 months of an 18-month sentence for soliciting prostitution from a minor.\n\nIn one exchange from November that year, Andrew’s then-private secretary asks an individual, whose name was redacted, to confirm Epstein’s address and “whether there is room for both of his Protection Officers at =he (sic) house?”\n\nWhat followed appeared to be an internal discussion among Epstein’s staff, with one unknown individual confirming that “there will be room for both andrew’s bodyguards.. one on the 4th floor =nd (sic) one on the 5th floor.”\n\nAn email sent to Epstein on December 1 by a redacted member of his staff reads: “The Duke’s 2 protection officers along with state security will all be here for tomorrow’s dinner party. Rich has given them instruction on the door.”\n\nAs a senior working member of the royal family at the time, the then-Prince Andrew would have received police protection as part of his security. Still, the emails have stirred outrage in Britain over why authorities thought it would have been appropriate to deploy police resources to allow Mountbatten-Windsor to travel to the home of a convicted sex offender.\n\nThe emails were among the 3.5 million documents released by the DOJ document dump that have prompted questions over whether protection officers were aware of Andrew’s conduct.\n\nOn Friday, the Metropolitan Police said it had not at this time identified any wrongdoing by any protection officers. It also said it was “identifying and contacting former and serving officers” and asking them “to consider carefully whether anything they saw or heard during that period of service,” as it continues to assess information following the release of the Epstein files.\n\nThe force also said it was aware that the DOJ disclosures suggested that London airports may have been used to facilitate human trafficking and sexual exploitation.\n\n“We are assessing this information and are actively seeking further detail from law enforcement partners, including those in the United States,” the force said, adding that “no new criminal allegations” had been made regarding sexual offences within its jurisdiction, and it is working with the UK national coordination group which has come together to work the cases.\n\nThe Met said it had nothing further to add following its most recent statement when contacted by CNN on Monday.\n\nThe Met is one of at least seven British police forces that are making or assisting with inquiries following the disclosures within the Epstein files.\n\nEssex Police previously said it waslooking into claims Epstein trafficked womenon flights that traveled through London’s Stansted Airport. Similar inquiries are being conducted “in relation to private flights in and out of London Luton Airport,” according to Bedfordshire Police. Meanwhile, West Midlands Police told CNN it was “assessing” whether Birmingham Airport was used.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/king-charles-andrew-arrest-royal-crisis-intl-latam",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.telegraph.co.uk/royal-family/2026/02/21/andrew-taxpayer-funded-jets-jeffrey-epstein-raf-base-police/",
      "text": "The Telegraph"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/uk/uk-police-stansted-airport-epstein-intl",
      "text": "looking into claims Epstein trafficked women"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/uk/andrew-mountbatten-windsor-epstein-taxpayer-money-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/uk/andrew-mountbatten-windsor-epstein-taxpayer-money-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7b18503c8a17912a5ba0978f00c5fb39b2fc48818dd492f64b82819f8764390b",
  "scraped_at": "2026-02-24T07:32:08.335338+00:00"
}