{
  "url": "https://lite.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam",
  "title": "Peru’s leader José Jerí ousted over ‘Chifa-gate’ scandal, as presidential ‘curse’ strikes again | CNN",
  "date": "2026-02-18T07:31:01.672015+00:00",
  "authors": [
    "CNN staff"
  ],
  "text": "Peru’s president has been ousted after being censured by Congress, marking the country’s eighth change of leader in nearly a decade ofpolitical instability.\n\nPeru’s Congress approved a motion of censure against José Jerí by 75 votes to 24 in a move that came just four months after he took office as interim president and two months before an expected general election.\n\nThe vote follows accusations that Jerí had held unofficial meetings with Chinese businesspeople, on one occasion while wearing a hood. The political scandal — dubbed in the country as “Chifa-gate” after the term for Peruvian food with Chinese roots – led the Attorney General’s Office to open an investigation against Jerí.\n\n“The presiding officers declare the office of President of the Congress of the Republic vacant, and consequently, the office of President of the Republic is vacant,” said Fernando Rospigliosi, acting head of Congress.\n\nThe various political blocs will now meet to agree a list of candidates for President of Congress, for a legislative vote on Wednesday that will determine the next interim president.\n\nJerí, 39, assumed the presidency in October after becoming Speaker of Congress when PresidentDina Boluartewas impeached. Boluarte had led the executive branch since the 2022 impeachment and arrest ofPedro Castillo, who served for a year and a half.\n\nJerí has been accused of misconduct after holding off-the-radar meetings with Zhihua Yang, a Chinese businessman who holds a state-granted concession for one of his companies.\n\nJerí has denied any wrongdoing and said the meetings were “circumstantial.” He has also denied that the businessman had requested any kind of favor or support from him.\n\nThe first meeting, held at a Chinese restaurant in Lima on December 26, sparked controversy after images showed the president entering the establishment wearing a hood. Jerí had another meeting with Yang on January 6 at a Chinese goods store, where he arrived wearing sunglasses. Neither of these meetings was registered in the presidential records.\n\nLast month, the 39-year-old interim president acknowledged the meetings took place and apologized for how they had been conducted.\n\n“I admit my mistake and publicly apologize for entering the way I did, hooded, and for how this has given rise to suspicions and doubts about my behavior and generated the creation of all kinds of unreal stories, which have no basis whatsoever,” he said.\n\nCNN has reached out to Yang and the presidential office for comment.\n\nThe scandal has fueled tensions over one of Peru’s biggest challenges: how to balance relations between China, one of its largest trade partners, and the US, which has warned Lima over China’s growing influence.\n\nLast week, the US Bureau of Western Hemisphere Affairs said it was “concerned” about reports that Peru could be powerless to oversee one of its largest ports, Chancay, which it said was managed by “predatory” Chinese owners.\n\n“We support Peru’s sovereign right to oversee critical infrastructure in its own territory. Let this be a cautionary tale for the region and the world: cheap Chinese money costs sovereignty,” the bureau said.\n\nJerí is just the latest in a long line of the country’s presidents and former presidents who have found themselves embroiled in scandal, in what some commentators have referred to as the “curse” of the Peruvian presidency.\n\nSince the turn of the millennium, no fewer than seven presidents have been brought to trial or faced legal challenges relating to allegations of corruption or human rights abuses. An eighth shot himself dead when police were closing in.\n\nPeru’s notorious political instability is often traced back to the presidency of Alberto Fujimori, who was ousted in 2000 after a scandal involving his intelligence chief andconvictedon charges of corruption, embezzlement and human rights violation.\n\nSince then, the political careers of most of Fujimori’s successors have also ended in disgrace.\n\nAlejandro Toledo, who was elected president after Fujimori, was sentenced to more than 20 years in prison for receiving millions in bribes from the Brazilian construction company Odebrecht. Then came Alan Garcia, who died from a self-inflicted gunshot wound in 2019 as police closed in as part of an investigation also linked to Odebrecht.\n\nOllanta Humala and Pedro Pablo Kuczynski were also ensnared in the Odebrecht scandal, while Martin Vizcarra was ousted on the grounds of “moral incapacity” – accused of taking bribes during his time as governor. Pedro Castillo was taken into custody for the alleged crime ofrebellionand dismissed by Congress after attempting to dissolve it and set up an emergency government, while Boluarte was impeached due to “permanent moral incapacity” following a series of scandals.\n\nAll those accused and convicted have rejected the accusations against them.\n\nPeruvians are expected to head to the polls on April 12 for a general election.\n\nThis is a developing story and will be updated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/05/18/americas/boluarte-nose-surgery-rolex-peru-presidency-intl-latam",
      "text": "political instability"
    },
    {
      "url": "https://www.cnn.com/2025/10/10/americas/peru-president-dina-boluarte-removed-intl-hnk",
      "text": "Dina Boluarte"
    },
    {
      "url": "https://www.cnn.com/peru-sentences-former-president-castillo-latam-hnk-intl",
      "text": "Pedro Castillo"
    },
    {
      "url": "https://cnnespanol.cnn.com/2017/12/27/fujimori-crimenes-violacion-de-derechos-humanos-corrupcion-peculado-y-mas-estos-son-los-crimenes-de-alberto-fujimori",
      "text": "convicted"
    },
    {
      "url": "https://cnnespanol.cnn.com/2022/12/08/caida-abismo-pedro-castillo-maestro-rural-expresidente-detenido-trax",
      "text": "rebellion"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/americas/peru-president-jose-jeri-ousted-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7bc168d7b0995ea2c9651eb1b116ce203e0b78916fbdb807f4603e635c614e3d",
  "scraped_at": "2026-02-18T07:31:01.672027+00:00"
}