{
  "url": "https://lite.cnn.com/2026/02/17/sport/vinicius-madrid-benfica-halted-alleged-racial-abuse",
  "title": "Madrid game at Benfica halted for several minutes as Vinícius says opponent racially insulted him | CNN",
  "date": "2026-02-18T07:31:03.747953+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nReal MadridforwardVinícius Júnioraccused an opponent of racially insulting him during Tuesday’s Champions League game againstBenfica, leading to the game being halted for nearly 10 minutes amid angry scenes at the Stadium of Light.\n\nMadrid defender Trent Alexander-Arnold called the incident “a disgrace to football” while Benfica managerJose Mourinhosaid Vinícius had incited his players and fans by the way he celebrated his goal in the 1-0 win for Madrid.\n\nVinícius had just curled in a shot into the top corner when French referee François Letexier had to stop the match in the 52nd minute, making a signal with his arms to show that an accusation of racism had been made.\n\nBenfica fans had reacted angrily to Vinícius celebrating his goal by dancing by the corner flag, throwing bottles and other objects toward the Madrid players. Benfica player Gianluca Prestianni then confronted Vinícius and said something while covering his mouth with his jersey.\n\nThe Brazil forward then suddenly pointed to his Argentine opponent and ran toward the referee.\n\nCameras picked up Vinícius telling Letexier that Prestianni called him “monkey.”\n\nAfter the match, Vinícius posted a photo on Instagram of him celebrating by the Benfica corner flag. He wrote: “Racists are, above all, cowards. They need to cover their mouths with their shirts to show how they are weak. … Nothing that happened today is new to me in my life and in my family’s life. I was shown a yellow card for celebrating a goal. I still don’t know why.”\n\nWhen Vinícius made his complaint, the referee immediately stopped the match and crossed his arms above his head to start the anti-racism protocol. Vinícius, who is Black and has been repeatedly subjected to racist abuse in Spain, went to the sideline and sat in the dugout while play was stopped. Some of his teammates also started to walk toward the sideline.\n\nMbappé and midfielder Aurélien Tchouaméni said the team considered leaving the field but eventually decided to continue playing. Mbappé said he asked Vinícius to see what he wanted to do.\n\n“What’s happened tonight is a disgrace to football,” Alexander-Arnold said after the game. “It’s overshadowed the performance, especially after such an amazing goal. Vini has been subjected to this a few times throughout his career, and for it to happen tonight and ruin the night for us as a team is a disgrace. There’s no place for it in football or society. It’s disgusting.”\n\nThe 20-year-old Prestianni just looked on from afar as Vinícius talked to the referee.\n\n“The players who were near said that (Prestianni) said something ugly, that shouldn’t be said,” Madrid midfielder Federico Valverde said. “If you cover your mouth to say something it’s because you are saying something that is not nice. I’m proud of my teammates who defended Vini and of Vini.”\n\nBenfica players said Prestianni told them that he provoked Vinícius but never used any racist insult.\n\n“I asked him and he said it was a normal provocation between players during a match,” Benfica midfielder Leandro Barreiro said. “He said it was nothing racist.”\n\nBoth coaches, Benfica’s Mourinho and Madrid’s Álvaro Arbeloa, talked to Vinícius near the benches.\n\nMourinho said he did not want to say he believed one player over the other after talking to both, but criticized Vinícius for celebrating near the fans.\n\n“Unfortunately he was not just happy to score that astonishing goal,” Mourinho told Amazon Prime. “When you score a goal like that, you celebrate in a respectful way.”\n\nMourinho said he told Vinícius that the greatest player in Benfica’s history — Eusébio — was black, but seemed to question why the Real Madrid player is so frequently targeted by racist abuse.\n\n“There is something wrong because it happens in every stadium,” Mourinho said. “The stadium where Vinicius played something happened. Always.”\n\nThe referee appeared to show that he did not hear anything and gestured that Prestianni had the shirt over his mouth.\n\nThe Argentine player was not shown a yellow card and continued playing. He was substituted in the 81st and was applauded by Benfica fans.\n\nThe game restarted in the 60th and Vinícius was jeered loudly by the home crowd during the rest of the match.\n\nHe was hit by the bottle in the final minutes while near the sidelines in front of Benfica fans. The referee asked for an announcement to be made through the stadium’s loudspeakers to warn fans not to through objects onto the field.\n\nMbappé, who was defending Vinícius while Benfica players confronted his teammate, was also jeered by Benfica supporters. Cameras also showed Mbappé apparently telling Prestianni that he was a racist, along with expletives.\n\n“We can’t accept that a player who plays in Europe’s top competition behaves like that,” Mbappé said. “He shouldn’t keep playing in the competition. Let’s see what happens now.”\n\nThe Brazilian soccer confederation showed solidarity with Vinícius, saying in an X post that he was “not alone” and that “racism is a crime” and has “no place in soccer anywhere.” It called Vinícius’ decision to complain to the referee ”an example of courage and dignity. We are proud of you.”\n\nMourinho, a former Madrid coach, was shown a red card in the 86th for complaining to the referee.\n\nHe said the he referee was not awarding yellow cards to the Madrid players as he should have, hinting that it was because they would miss the next game because of an accumulation of cards.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/sport/soccer-champions-league-playoffs-round",
      "text": "Real Madrid"
    },
    {
      "url": "https://www.cnn.com/2025/06/16/sport/vinicius-jr-effigy-four-people-sentenced-spt-intl",
      "text": "Vinícius Júnior"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/benfica-goalkeeper-anatoliy-trubin-looks-for-more-champions-league-magic-against-real-madrid",
      "text": "Benfica"
    },
    {
      "url": "https://www.cnn.com/2025/02/25/sport/galatasaray-jose-mourinho-racist-statements-spt-intl",
      "text": "Jose Mourinho"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/vinicius-madrid-benfica-halted-alleged-racial-abuse",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/sport/vinicius-madrid-benfica-halted-alleged-racial-abuse",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7bebb19ec169264299ee75c15b1058d466760aaea57eb353bea9b5191bd74d73",
  "scraped_at": "2026-02-18T07:31:03.747966+00:00"
}
