{
  "url": "https://lite.cnn.com/2026/01/13/style/nia-dacosta-28-years-later",
  "title": "Director Nia DaCosta: ‘I don’t want to make a Danny Boyle movie. I’d rather watch one’ | CNN",
  "date": "2026-02-19T07:33:24.571209+00:00",
  "authors": [
    "Leah Dolan, CNN"
  ],
  "text": "Two decades on, it’s DaCosta’s films being devoured by an international audience. At 36, the born-and-raised New Yorker, who is currently living in London, has directed a small stack of blockbusters — amassing some impressive credits along the way. Her second film, “Candyman,” a part-sequel, part-retelling of the 1992 horror classic, was co-written and produced by Jordan Peele and debuted at number one at the US box office in 2021 — making DaCosta the first Black female director ever to have done so. Two years later, she became the first Black woman to direct a Marvel film. “The Marvels,” which starred Brie Larson, Samuel L. Jackson and Zawe Ashton, is the highest-grossing film of all-time directed by a Black woman.\n\nNow, DaCosta is the first woman to direct a film in Danny Boyle’s beloved zombie franchise with “28 Years Later: The Bone Temple,” out in theaters in the US and UK this week. It’s a lot of firsts. “It is kind of funny,” she said of hearing it all said out loud. “If I read that about someone else, I’d be like, ‘Wow.’ You know? But to me, I’m not thinking about any of those things when I try to get a job.”\n\nAfter graduating from New York University’s Tisch School of the Arts in 2011, DaCosta crossed the pond to study stage writing and broadcast media at London’s Royal Central School of Speech and Drama. She worked as a production assistant on sets for Martin Scorsese, Steve McQueen and Steven Soderbergh, and in 2015 was selected to take part in the Sundance Institute Director’s Lab — a prestigious incubator workshop that has helped develop early works from Quentin Tarantino, Paul Thomas Anderson and Chloé Zhao. In a full circle moment, this month DaCosta will be awarded with the Sundance Institute’s annual Vanguard Award for Fiction.\n\nHer debut film “Little Woods,” starring Tessa Thompson, was released in 2019. “I could sense in her,” said Thompson in a phone call, “that she was a filmmaker who was boundless in terms of the kinds of stories they could tell. I think that’s a rarefied thing, and for that to exist inside of a young Black female filmmaker, I think is just so extraordinary.”\n\nDaCosta first watched Boyle’s 2002 film “28 Days Later” when she was 12 — six years earlier than the British Board of Film Classification would have liked. In it, Cillian Murphy wakes from a coma into a version of Britain ravaged by the “rage” virus, and attempts to locate a group of survivors between encounters with the rabid infected. “I was just so precocious,” remembered DaCosta. “I loved horror, and I was so fascinated by adult things.” DaCosta’s parents divorced when she was nine and she describes herself as a “latch-key kid,” spending long summer afternoons at home alone. “I watched a lot of movies I shouldn’t have watched at that age,” she admits. On the occasion she did have a babysitter, usually DaCosta’s grandmother, the horror-loving child would barely be allowed to watch “The Lion, the Witch and the Wardrobe” for fear of moral corruption. (As a Jehovah’s Witness, DaCosta’s grandmother thought James McAvoy’s turn as a Mr. Tumnus particularly “demonic.”) Little did she know, DaCosta had already watched Stanley Kubrick’s brutal anti-war proposition “Full Metal Jacket” numerous times — and liked it.\n\nDaCosta knew she wanted to direct something in the “28” family, as she calls it, probably before writer Alex Garland and director Danny Boyle knew they needed someone. “The Bone Temple” is the second installment in the “28 Years Later” trilogy (Boyle directed the first film, which came out last summer).DaCosta was brought on to make the second film, and Boyle will return at the helm once again for the final movie. Was it hard to create something that felt uniquely hers, within the confines of such a stylized franchise? “I came in saying, this is my vision for it,” she said. “And I also don’t want to make a Danny Boyle movie, because I don’t know how to do that. I’d rather watch one.” She described Boyle as “two middle fingers up, he does whatever he wants.” Whereas DaCosta, on the other hand, “is more thumbs up,” she smiled sweetly, adding, “yeah, let’s do this together.”\n\nWhile she admits her approach is less “punk-rock” than her predecessor, the resulting film is still fairly stomach-turning. The characters are skinned and burnt alive, with a hellish number of severed aortas. But DaCosta’s version also offers sensitive attention to detail— needle drops from Duran Duran and Radiohead, as Dr. Kelson, society’s last surviving doctor played by Ralph Fiennes, listens wistfully to what remains of his pre-apocalypse record collection. Elsewhere, insect noises in the background represent the bittersweet sound of a world returning to nature. “Seventy percent of all insect life is dead since the ‘70s,” DaCosta said. “We know this because of how much quieter it is now at night when you’re supposed to hear bugs and stuff. That was really interesting to me.”\n\nNow, after four back-to-back adaptation movies, DaCosta is turning her hand to script writing again. “I’ve done a lot of existing material,” she said. “I love adaptation, but I’m trying to write some more original things now moving forward. I’m leaning in a slightly different direction.” Starting, of course, with a body horror film. For the uninitiated, she recommends David Cronenberg’s “The Fly” (1986) as an introduction to the concept. “Gore is very binary and literal,” she said. “‘Oh no, he’s bleeding. His intestines are out.’ Body horror is about the uncanny and the perverse.”\n\nThe freaky, the spooky, and the bloody — it all “feels really good” to DaCosta, who is one of the few female voices working in the mainstream horror genre. Her chosen industry “is very male,” she said. “And horror does tend to be very male-focused.” At its worst, the space can house misogynistic manifestos thinly veiled as slasher films. “Part of that is the fear of sexuality, the fear of powerful women,” she added. On these topics, she believes women can offer a unique perspective and “move the work in a more enlightened direction.”\n\nIn fact, DaCosta’sveryfirst movie, “The Black Girl Dies Last,” filmed in her boarding school on a DVD camera she got for Christmas, does just this. While she dismisses the film as a “stupid little short,” in reality it is a surprisingly mature subversion of the racial cliché that dictates non-white characters are the most expendable in horror films. (The 6-and-a-half-minute-long video has remained publicly available on YouTube since 2009, much to her present-day dismay.) “If you stumble upon this and you aren’t in this video or know anyone in it, this is not to be taken seriously,” the YouTube description reads. “It was made late one night in high school. I swear I make better movies now.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/style/nia-dacosta-28-years-later",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/01/13/style/nia-dacosta-28-years-later",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7c66c9a31a35e774542c92a077e80bc079f5e7afa58e95e9724e2049273f3a7c",
  "scraped_at": "2026-02-19T07:33:24.571222+00:00"
}