{
  "url": "https://lite.cnn.com/2026/02/23/sport/tom-brady-mike-trout-topps-rip-night",
  "title": "Topps Rip Night: From Tom Brady to Mike Trout, this event draws 100,000 fans worldwide | CNN",
  "date": "2026-02-24T07:32:12.536490+00:00",
  "authors": [
    "Andy Scholes, CNN"
  ],
  "text": "Source: CNN\n\nGrowing up in Houston, Texas, I would beg my parents all the time to take me to my local card shop. If I got birthday money from an aunt, “Please, can we go to the card shop? I’ll do extra chores if we can go Friday.” Opening packs of cards was one of my favorite things to do.\n\nNow, if I had been in my card shop as a kid and Rockets legend Hakeem Olajuwon walked in and started opening packs with me? I would have absolutely lost my mind.\n\nBut that’s exactly the kind of memories Fanatics founder and CEO Michael Rubin and Topps are creating for kids – and plenty of adults – these days.\n\nSaturday marked the fifth annual Topps Rip Night, a global celebration of the sports trading card and memorabilia hobby that has grown from a niche in-store promotion into a worldwide phenomenon. More than 100,000 fans descended on more than 800 hobby shops across 25 countries, turning what used to be a quiet Saturday ritual into something closer to a championship parade.\n\nThe lines said it all. At Dave & Adams in New York City, fans wrapped around more than three city blocks hours before the doors opened.Across the globe, similar scenes played out as collectors of all ages waited for a chance to rip packs, trade cards and, in many cases, meet their heroes.\n\nThe biggest shock of the night came in Miami when seven-time Super Bowl championTom Bradyshowed up unannounced at Collector’s Club. The crowd erupted as Brady posed for photos, signed autographs and ripped packs alongside stunned fans. At one point, Rubin Facetimed Brady while standing next to New York Giants rookie quarterback Jaxson Dart – prompting fans to start chanting “Eli Manning!” in a moment that felt more like a playoff game than a card shop appearance.\n\nIn Minneapolis, Minnesota Timberwolves star Anthony Edwards walked into Triple Diamond Sports Card to MVP chants. In Indianapolis, Dallas Mavericks rookieCooper Flaggreportedly dropped more than $7,000 on rookie cards of his former Duke teammate Kon Knueppel, proving even elite prospects still get the collecting bug.\n\nOut west, three-time American League MVP Mike Trout traded a $10,000 card of himself to a young collector – the kind of story that will live in that kid’s scrapbook forever. Meanwhile, four New York Yankees players – Anthony Volpe, Max Fried, Will Warren and George Lombard – pulled up to a Tampa-area shop fresh off a 17-run spring training win, bringing big-league energy straight to the hobby floor.\n\nAnd Rip Night wasn’t just about athletes. Backstreet Boys frontman Nick Carter surprised fans at a Las Vegas shop he’s frequented during the group’s residency at The Sphere. Joined by his son, he ripped packs and traded cards, blending pop culture with sports nostalgia in a way that felt uniquely 2026.\n\nThe scale of the event underscores just how fast the hobby has grown. The first Topps Rip Night in 2023 featured 14 athlete appearances across 50 US shops. This year’s edition included more than 160 athlete and celebrity appearances worldwide, transforming local card stores into global gathering points.\n\nFrom pack wars and trivia to exclusive Rip Night packs and giveaways, the evening felt less like a shopping trip and more like a festival.Kids clutched fresh pulls like lottery tickets. Parents relived their childhoods. Celebrities turned into collectors again.\n\nOpening cards used to be something you did with a buddy or two at the kitchen table. Now, it’s a social experience. It’s not only about the cards anymore – it’s about the camaraderie, the shared gasp when a rare card is revealed, the story you’ll tell for years about the night Tom Brady walked into your local shop.\n\nFor the kid I once was in Houston, that kind of moment would have been unforgettable.\n\nFor more than 100,000 fans Saturday night, it was reality.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/sport/football-nfl-tom-brady-criticism-analyst-team-owner-intl",
      "text": "Tom Brady"
    },
    {
      "url": "https://www.cnn.com/2025/06/25/sport/cooper-flagg-dallas-mavericks-no-1-overall-nba-draft-spt",
      "text": "Cooper Flagg"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/sport/tom-brady-mike-trout-topps-rip-night",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/sport/tom-brady-mike-trout-topps-rip-night",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7c69a90643666c6acd2a00af7fbfe1336fea0e62eb09febef37e16747af7d391",
  "scraped_at": "2026-02-24T07:32:12.536503+00:00"
}