{
  "url": "https://lite.cnn.com/2026/02/12/politics/they-put-me-on-there-to-die-conservatives-unleash-on-gops-failures-to-carry-out-doge-cost-cutting",
  "title": "‘They put me on there to die’: Conservatives unload on GOP’s failures to carry out DOGE cost-cutting | CNN Politics",
  "date": "2026-02-12T21:30:20.290238+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe budget-slashing Department of Government Efficiency that upended the federal government at the start ofPresident Donald Trump’s second termhas stalled out on Capitol Hill, a reality that’s left conservative lawmakers fuming.\n\nInside the White House, the cost-cutting crusade marked by mass firings and blanket funding eliminations is largely seen as over, two people familiar with the discussions said, as Trump turns his attention to other priorities. On Capitol Hill, Republicans have passed just a single bill enacting $9 billion in DOGE cuts – far short of Elon Musk’s aim of cutting as much as$2 trillion from the nation’s budget.\n\nAnd now, Trump officials are signaling they likely will not try to pass another package clawing back more funds, with White House budget director Russell Vought telling one GOP lawmaker last month that it amounted to a long-shot given the razor-thin Republican majority in the House and a lack of appetite in the Senate.\n\nInstead, congressional Republicans signed off on a government funding package that included money the Trump administration had advocated eliminating. A White House attempt to lay off thousands of federal workers during last year’s shutdown was halted by the courts. And Trump said Tuesday that he did not like the haphazard way DOGE downsized the federal workforce, saying he “didn’t want a general cut.”\n\nEven Rep. Tim Burchett, who is taking over as the leader of the congressional subcommittee focused on DOGE, knows he is facing an uphill battle that is unlikely to be successful as a result of resistance on both sides of the aisle.\n\n“They put me on there to die,” Burchett told CNN of why he thinks House GOP leadership gave him this assignment. “They don’t like that I call them out.”\n\nThe Tennessee congressman says he is ready to introduce legislation and “publicly embarrass” lawmakers who stand in his way, but he openly admits he doesn’t think his party has the appetite for the kinds of cuts to the federal government he wants to make.\n\n“You can’t win but I’m going to fight it because I think it is worth it. I honestly do. I think we will lose our country if we’re not careful with all this nonsense, $40 trillion in debt. When does it stop? Democrats spend it on woke garbage and we spend it on a military that we don’t need,” he said.\n\nOther conservatives also feel abandoned by their party’s leadership in their efforts to find ways to codify DOGE’s downsizing of the federal government.\n\nRep. Aaron Bean, who leads a separate DOGE caucus, asked Vought directly in a meeting last month if the Trump administration had plans to send any more bills that would codify DOGE cuts, hoping his answer could spur momentum on Capitol Hill.\n\nInstead, Vought said it was “very difficult” to get the first package done and pointed to the realities of the narrow Republican majorities in Congress, according to Bean.\n\n“If it were totally up to me, we’d be doing one every week. But it’s not up to me,” the Florida congressman said, adding that Vought didn’t firmly rule anything out.\n\nWhen Bean first convened his group last year, he set up different working groups with the promise to introduce legislation regularly. Now, he can’t remember the last time his group met in 2025 and has been pushing House GOP leadership to make the DOGE caucus more front and center in his party’s agenda.\n\nAn Office of Management and Budget spokesperson said in response to questions from CNN, “We’re excited with the progress we’ve made on cutting spending and reforming the appropriations process over the past year – and we’re not taking any tools off the table going forward.”\n\nYet there appears to be little momentum for pushing another controversial package of cuts through Congress just months ahead of midterm elections. Encouraged by their success late last year in elevating allegations of Medicaid fraud in Minnesota, Trump administration officials have shifted their focus instead to more precise cuts targeting programs in various blue states.\n\nThe administration in recent months has sought to cut hundreds of millions of dollars in grants to Democratic-led states they’ve claimed are being wasted or mismanaged — a strategy viewed as more efficient and politically advantageous, and that requires less direct intervention from a Republican Congress barely hanging onto its majority.\n\n“The success of DOGE is in turning the Trump coalition toward fraud,” said one of the people familiar with the discussions. “We have to understand the positive consequences that came from maybe missing the mark.”\n\nStill, that’s done little to assuage conservatives who once saw Trump’s return to office as their best chance of slashing vast swathes of the federal government for good.\n\nInstead of the“multiple” rescissions packagesthat House Speaker Mike Johnson promised in June 2025, many conservatives now feel that their own party leadership is undercutting cost-cutting efforts by passing government spending bills that fund programs DOGE previously identified as problematic and wanted to defund.\n\n“Leadership doesn’t care because they have Democrats to vote on the bill to pass them. They’re not paying attention to conservatives,” Rep. Greg Steube, one of the 21 House Republicans to vote against the latest government funding deal, told CNN.\n\nRep. Thomas Massie, a fiscal conservative who often speaks out against his own party, coined himself “the only DOGE-voting congressman left” and said he wasn’t surprised that support for the effort has dwindled in his party.\n\n“I never really believed they were sincere to start with,” he said.\n\nJohnson told CNN “no” DOGE is not dead, but he did not elaborate. A spokesperson for Senate Majority Leader John Thune declined to comment for this story.\n\nTrump administration officials have acknowledged thatDOGE is no longer operating as a “centralized” organization.And while GOP lawmakers will say they are always looking to cut excess waste, fraud and abuse, many moderate Republicans are quietly celebrating that Musk’s tenure is behind them as they try to repair relationships with federal workers who felt demonized under the billionaire’s tenure.\n\n“A year ago, you had young people from gosh knows where coming into federal agencies and telling people you’re gone. We’re not seeing that level of chaos and controversy. Thank goodness,” GOP Sen. Lisa Murkowski of Alaska told CNN. “We are at a different place.”\n\nRep. Rob Bresnahan said he supports eradicating excess federal spending, but has appreciated how the effort has shifted since Musk’s departure. Representing 10,000 federal workers in his district and one of the largest Social Security Administration call centers in the country, Bresnahan recalled multiple conversations with his constituents about their fears over their privacy and data.\n\n“Seeing the impacts of the morale with the workforce there was certainly frustrating. And their concerns certainly didn’t fall on deaf ears,” Bresnahan said.\n\nNow, some moderate Republicans feel like they need to find ways to restore trust with federal workers and undo actions by the Trump administration. Bresnahan was one of a handful of Republicans who defied his own party leadership and the Trump administrationin a House vote last yearto reinstate collective bargaining rights for federal workers.\n\nBut even if the effort is now less overt, appropriators argue that cuts to excess spending are happening in earnest behind the scenes and through the appropriations process, as it was always intended.\n\nRep. Mario Diaz-Balart of Florida, who chairs the House Appropriations subcommittee that oversees State Department funding, said he has worked closely with OMB to implement a 16% reduction in fiscal year 2026 spending.\n\n“You can do all the rescissions you want, but then you have a different president, different administration and that’s all for nothing, which is why, working with us, we’ve been able to kind of get those into the appropriation bills,” Diaz-Balart told CNN.\n\nHouse Appropriations Chair Tom Cole said he takes DOGE recommendations into account but has to consider what can pass both chambers.\n\n“We have a lot more of the Trump budget in place than we had a year ago,” Cole told CNN. “We got a lot of good ideas out there. Some of them we liked, others we liked but weren’t necessarily things that we could pass. It’s still a bipartisan, bicameral process.”\n\nRep. Pete Sessions of Texas, who co-leads the DOGE caucus with Bean, meanwhile, says he now views his role as giving DOGE staffers context for the programs that they want to cut to help inform their decisions.\n\n“A lot of it is behind the scenes discussion,” Sessions said.\n\nPart of the reason some Republicans say DOGE lost its momentum is that the organization was not built to last beyond Musk’s megaphone.\n\n“I’ve always been concerned with the fact that they never really put down scaffolding to make it a repeatable measurable process,” GOP Sen. Thom Tillis of North Carolina said.\n\nTillis called Musk “a great catalyst but unless you have the follow up, you see all the missteps, you see the inefficiency.”\n\nAs Burchett sees it, part of the reason his party could never fully accept Musk’s goals was his own party’s “arrogance” that they could execute better than the billionaire who came in as an outsider to government.\n\n“Everybody just wants to stay in power,” Burchett told CNN. “The arrogance of this is they want to stay in power and they think that without them this will not work. And the truth is, it works in spite of them.”\n\nBurchett, who took over the DOGE subcommittee from former GOP Rep. Marjorie Taylor Greene, had been set to hold the subcommittee’s first hearing since September 2025 on Wednesday, butsaid on Xthat it was postponed “due to illness,” and would be rescheduled as soon as possible.\n\nOne GOP lawmaker, granted anonymity to speak freely, lamented that Musk’s aggressive approach even set the movement to cut federal spending back.\n\n“In some respects, I’m sad that DOGE wasn’t more successful. I’m a little irritated at Elon. We are driving towards bankruptcy. Clearly a more efficient government is part of the solution. But Elon’s approach was just not serious enough to get us the progress we need. It’s really unfortunate. I think it sets us back on the search for efficiency seeking quite a way,” the lawmaker said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump’s second term"
    },
    {
      "url": "https://www.cnn.com/2024/11/12/politics/elon-musk-vivek-ramaswamy-department-of-government-efficiency-trump/index.html",
      "text": "$2 trillion from the nation’s budget."
    },
    {
      "url": "https://www.cnn.com/2025/06/03/politics/doge-cuts-rescissions-package-trump",
      "text": "“multiple” rescissions packages"
    },
    {
      "url": "https://www.cnn.com/2025/11/24/politics/doge-reported-demise",
      "text": "DOGE is no longer operating as a “centralized” organization."
    },
    {
      "url": "https://www.cnn.com/2025/12/12/business/unions-labor-trump-republicans",
      "text": "in a House vote last year"
    },
    {
      "url": "https://x.com/timburchett/status/2021375052327850418?s=20",
      "text": "said on X"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/they-put-me-on-there-to-die-conservatives-unleash-on-gops-failures-to-carry-out-doge-cost-cutting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/they-put-me-on-there-to-die-conservatives-unleash-on-gops-failures-to-carry-out-doge-cost-cutting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7ceb5ae2838aca844f06ba9eacbaa6475c2642edef81d203c66db6d29a9e4a36",
  "scraped_at": "2026-02-12T21:30:20.290252+00:00"
}