{
  "url": "https://lite.cnn.com/2026/02/19/politics/aliens-ufos-trump",
  "title": "Trump says he will direct government agencies to release files related to extraterrestrial life | CNN Politics",
  "date": "2026-02-20T07:27:55.494347+00:00",
  "authors": [
    "Aileen Graef, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump on Thursday said he will direct the Pentagon and other federal agencies to release government records related to extraterrestrial life and UFOs.\n\n“Based on the tremendous interest shown, I will be directing the Secretary of War, and other relevant Departments and Agencies, to begin the process of identifying and releasing Government files related to alien and extraterrestrial life, unidentified aerial phenomena (UAP), and unidentified flying objects (UFOs), and any and all other information connected to these highly complex, but extremely interesting and important, matters,” he said in a post on Truth Social.\n\nIt was not immediately clear what information the records contain or when they would be released. The Pentagon in recent years has expanded efforts to catalog, track and investigate reports of UFOs through its All-domain Anomaly Resolution Office, which reiterated in a2024 reportthat it has found no evidence of alien life.\n\nTrump’s remarks come after former President Barack Obama drew media attention over the weekend when he appeared to confirm theexistence of aliensin an interview with podcast host Brian Tyler Cohen.\n\n“They’re real but I haven’t seen them,” Obama said when asked whether aliens are real.\n\nThe former president later clarified in an Instagram post that he was referring to the statistical likelihood of life existing on other planets given the vastness of the universe.\n\n“But the distances between solar systems are so great that the chances we’ve been visited by aliens is low, and I saw no evidence during my presidency that extraterrestrials have made contact with us,” he added.\n\nWhen asked about the comments on Thursday, Trump said on Air Force One, “Well, I don’t know if they’re real or not. I can tell you he gave classified information. He’s not supposed to be doing that. He made a big mistake.”\n\nThe topic of UAPs or unidentified anomalous phenomena – commonly known as UFOs – has garnered tremendous public attention, fueled in part by conspiracy theories about the US government hiding evidence of aliens.\n\nThere have been pushes in recent years for more transparency on the matter, includinga 2023 House hearingwhere three military veterans warned that the sightings of UAPs are a national security problem and that the government has been too secretive about them.\n\nThe Pentagon, working with the Office of the Director of National Intelligence and other government agencies, had received a total of 1,652 reports of UAPs as of 2024, according to a report published that year.\n\nSome of the sightings still have not been explained, while others have been attributed to “balloon or balloon-entities,” as well as drones, birds, weather events or airborne debris like plastic bags.\n\nJon Kosloski, the director of the All-domain Anomaly Resolution Office, acknowledged in 2024 that a number of cases had not yet been plausibly explained, requiring additional data and analysis.\n\nKosloski said some of these were “interesting cases that I – my physics and engineering background, and time in the (intelligence community) – I do not understand, and I don’t know anybody else who understands them either.”\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/11/14/politics/pentagon-report-ufo-sitings",
      "text": "2024 report"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/obama-clarifies-alien-comments-scli-intl",
      "text": "existence of aliens"
    },
    {
      "url": "https://www.cnn.com/2023/07/26/politics/ufo-house-hearing-congress",
      "text": "a 2023 House hearing"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/aliens-ufos-trump",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/aliens-ufos-trump",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7d1c8ac6971d7f19da6e8702e5c776521dbb8c0615ac3ced03fdc559590be7f7",
  "scraped_at": "2026-02-20T07:27:55.494363+00:00"
}