{
  "url": "https://lite.cnn.com/2026/02/22/entertainment/baftas-2026-tourettes-racist-slur",
  "title": "John Davidson: BAFTAs interrupted by racist slur from man with Tourette Syndrome | CNN",
  "date": "2026-02-23T07:35:40.907293+00:00",
  "authors": [
    "Tom Page, CNN"
  ],
  "text": "Source: CNN\n\nIt was the clip heard around the world after Sunday night’s BAFTA ceremony in London — a man yelling a racist slur as two celebrated Black actors, Michael B. Jordan and Delroy Lindo, presented an award on stage.\n\nThe man was John Davidson, the subject of the British indie film “I Swear,” about a man with Tourette Syndrome. Davidson, who has long campaigned  for awareness of the condition, told CNN before the ceremony that he was worried about the involuntary tics that mark it.\n\nThe actor Robert Aramayo, who plays Davidson in the film, went on to win the night’s award forbest actor. Davidson said the young English actor studied him closely, asking questions like, “When you have a tic do you know where it comes from? What about tic triggers?” Speaking on the crowded red carpet, Davidson went on: “Certain things — like today, lots of people around, I’m feeling very, you know, more tics in case I lash out. Different situations can trigger different emotions and tics and stuff.”\n\nThe audience had been warned before the ceremony that tics or involuntary swearing could occur, and Davidson received large applause inside the hall. After the incident, host Alan Cumming asked for “understanding” for the “strong and offensive language.” He reminded the crowd that Tourette Syndrome was a disability and tics were involuntary, and said: “We apologize if you are offended tonight.”\n\nContacted by CNN, the BBC, which airs the ceremony with a long delay, reiterated that message. It did not respond to questions about why the moment was not cut from the ceremony when it aired on television.\n\nLindo, in particular, looked stunned at the outburst, and then moved on with the ceremony, where he and Jordan presented the first award of the evening — for special visual effects to “Avatar: Fire and Ash.”\n\n“I Swear” has grossed$8 million at the UK box officeto date and will be out in US cinemas in April.\n\nAccepting his best actor win, Aramayo said, “I can’t believe I’m up here looking at people like you,” gesturing at Leonardo DiCaprio, who had been nominated for his role in One Battle After Another. Aramayo went on to tell an emotional Ethan Hawke, another nominee, how a talk the seasoned actor had given at Julliard had changed his own outlook as a student actor.\n\nBritish cinema’s biggest night cleaved to some longstanding award season narratives while heading off-piste on others.\n\nIt awarded best supporting actress to “Sinners’” Wunmi Mosaku (incidentally, one of few Brit actors nominated) over One Battle’s Teyana Taylor. Stellan Skarsgård and Benicio del Toro, both winners of significant awards this season, lost out to Sean Penn for best supporting actor.\n\n“Hamnet” was awarded outstanding British film, but the homegrown title, which took best motion picture drama at the Golden Globes last month, walked away with relatively little, its only other award Jessie Buckley’s best actress win (this season’s biggest lock).\n\nThe biggest movie to walk away empty handed was “Marty Supreme.” Timothée Chalamet leaves London with an unread speech and another chance to confirm his greatness at next month’s Oscars. With Aramayo out of the picture, there’s nothing to suggest he won’t.\n\nThough BAFTA shared the love, handing three awards to “Sinners” and three to “Frankenstein,” it couldn’t deny the greatness of “One Battle After Another.” The film’s six wins, spanning best picture, best director, adapted screenplay, cinematography, editing and supporting actor is enough to entertain the possibility of a sweep at the Oscars.\n\nThe BAFTAs and Oscars rarely agree about the year’s best film, and should Paul Thomas Anderson’s prevail it would be only the third film in a decade and change where the awards aligned (“Nomadland” and “Oppenheimer” are the others, for those keeping track).\n\nCNN’s Sandra Gonzalez contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/entertainment/bafta-film-awards-winners",
      "text": "best actor"
    },
    {
      "url": "https://www.boxofficemojo.com/title/tt31514146/",
      "text": "$8 million at the UK box office"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/entertainment/baftas-2026-tourettes-racist-slur",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/entertainment/baftas-2026-tourettes-racist-slur",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7d6c86e65318631e454c7a2408a69f78a8c06986bd18b04bf318f91f89735c13",
  "scraped_at": "2026-02-23T07:35:40.907306+00:00"
}