{
  "url": "https://lite.cnn.com/2026/02/15/europe/germany-britain-defense-chiefs-rearm-intl-hnk-ml",
  "title": "German, British defense chiefs warn public that Russia looking beyond Ukraine, say Europe must rearm | CNN",
  "date": "2026-02-16T07:34:09.664353+00:00",
  "authors": [],
  "text": "Source: CNN\n\nDefense chiefs from two major US allies have issued a rare public plea for people across Europe to support big boosts in defense spending to deter a possible war with an increasingly westward-looking Russia.\n\nThe highest-ranking officials from Germany and the United Kingdom warned that European nations “must now confront uncomfortable truths” about its security and make “hard choices” about spending inan article jointly publishedby The Guardian in the UK and Die Welt in Germany.\n\n“Moscow’s military buildup, combined with its willingness to wage war on our continent, as painfully evidenced in Ukraine, represents an increased risk that demands our collective attention,” Germany’s chief of defense, Gen. Carsten Breuer, and the UK’s chief of defense staff, Air Marshal Sir Richard Knighton, wrote.\n\n“Moscow’s intentions range wider than the current conflict,” the pair added, arguing that the pubic must get behind increased defense spending, even if it means other public service programs – the “peace dividend” from the end of the Cold War – might suffer.\n\nOver the past decade, member states of the European Union – of which the UK is not a member – have alreadydoubled their defense expenditures,but more spending is needed, the defense chiefs argued.\n\n“It’s clear that the threats we face demand a step change in our defence and security,” the pair wrote.\n\n“Rearmament is not warmongering; it is the responsible action of nations determined to protect their people and preserve peace,” they said.\n\nThe article comes on the heels of the weekend’s Munich Security Conference, where US Secretary of State MarcoRubio called on Europeto assume more responsibility for its own defense after relying for decades on Washington’s help as the backbone of its security.\n\nThe defense chiefs’ article notes that NATO leaders have already committed to spending 5% of gross domestic product on defense by 2035.\n\n“People must understand the difficult choices governments have to take in order to strengthen deterrence,” the two defense chiefs wrote.\n\nBut even in their own countries, the message may be a tough sell.\n\nOnly about 25% of Britons favor higher taxes to fund defense spending or cuts to public service to direct more money to arms, according toa January poll by the YouGovresearch firm.\n\nIn Germany, only 24% of the public favors increased defense spending if other programs would suffer, according toa recent Politico poll.\n\nThat skeptical public will have to be won over to achieve a key goal the chiefs put forth: “a whole-of-society approach” to defense.\n\n“Defence cannot be the preserve of uniformed personnel alone. It is a task for each and every one of us,” they wrote.\n\nBesides the pledge to increase defense spending, the defense chiefs said their countries are taking concrete steps to improve readiness and deterrence, with Britian building six new munitions factories and Germany repositioning troops near its eastern border.\n\nThe British Defense Ministry also announced over the weekend that it will send an aircraft carrier strike group led by the HMS Prince of Wales to the North Atlantic and Arctic oceans this year “to deter Russian aggression and protect vital undersea infrastructure.”\n\nThe strike group, which will include the carrier’s F-35 fighter jets, will work with US, European and Canadian forces during its deployment, a ministry statement said.\n\n“This deployment will help make Britain warfighting ready, boost our contribution to NATO, and strengthen our operations with key allies, keeping the UK secure at home and strong abroad,” Defense Secretary John Healy said in a statement.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.theguardian.com/commentisfree/2026/feb/15/defence-chiefs-russia-rearmament-security-britain-germany-europe",
      "text": "an article jointly published"
    },
    {
      "url": "https://www.consilium.europa.eu/en/policies/defence-numbers/",
      "text": "doubled their defense expenditures,"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
      "text": "Rubio called on Europe"
    },
    {
      "url": "https://yougov.co.uk/politics/articles/54010-are-britons-willing-to-rebuild-uk-national-power",
      "text": "a January poll by the YouGov"
    },
    {
      "url": "https://www.politico.eu/article/world-war-iii-defense-spending-europe-poll/",
      "text": "a recent Politico poll"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/europe/germany-britain-defense-chiefs-rearm-intl-hnk-ml",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/europe/germany-britain-defense-chiefs-rearm-intl-hnk-ml",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7dd46cf1495cbbdc382cc2c1d5658802d0d5a2585fd2217ac5a5cc1a438efb9f",
  "scraped_at": "2026-02-16T07:34:09.664366+00:00"
}