{
  "url": "https://lite.cnn.com/2026/02/07/europe/norway-royal-family-scandals-intl",
  "title": "Epstein files are threatening to split Norway’s royal family in two | CNN",
  "date": "2026-02-11T16:40:02.160177+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nNorway’s royal family were battling scandals onmultiple frontsthis week, with charities moving to cut or review ties to the Crown Princess for her past contact with the late sex offender Jeffrey Epstein while others question her suitability to the role of future queen.\n\nThe first controversy is that of the 29-year-old son of Crown Princess Mette-Marit,Marius Borg Høiby, who earlier this week broke down in tears during his first day of testimony as he denied four counts of rape in an Oslo court.\n\nHøiby sits outside the line of succession as he was born before his mother married Crown Prince Haakon in 2001.\n\nHaakon reaffirmed Høiby’s status as a commoner in a rare statement ahead of the rape trial starting on Tuesday, saying his stepson was “not a member of the Royal House of Norway and is therefore autonomous.”\n\nBut his efforts to safeguard the Crown’s reputation were overshadowed when a second controversy erupted, this time implicating his wife and Høiby’s mother, the country’s future queen.\n\nNewEpstein filesreleased by the US Justice Department show extensive correspondence between Mette-Marit and the late sex offender – something the princess has since expressed regret over – years after Epstein pleaded guilty to soliciting sex from a minor.\n\nOn Friday, Norway’s royal house said Mette-Marit “strongly disavows Epstein’s abuse and criminal acts” and is sorry for “not having understood early enough what kind of person he was.”\n\n“Some of the content of the messages between Epstein and me does not represent the person I want to be. I also apologize for the situation that I have put the Royal Family in, especially the King and Queen,” Mette-Marit said in a statement.\n\nIt has sparked an open public discussion in Norway about whether Mette-Marit should become queen, experts say.\n\n“Confidence in the Crown Princess has fallen sharply,” said Tove Taalesen, a royal correspondent for news outlet Nettavisen. “A majority still backs the institution, but that support is weaker, and uncertainty is growing.”\n\nThe controversy raises uncomfortable questions about Mette-Marit’s position within the clan, particularly given the advanced age of King Harald V, who at 88, is Europe’s oldest monarch. Harald’s physical health hasdeteriorated in recent years, requiring Haakon to act as regent on occasion.\n\nMette-Marit is not facing an immediate end to her time as a working royal just yet, Taalesen cautioned, but she said one option would be for her to withdraw from royal duties citing health reasons, and leaving the crown prince to one day rule on his own.\n\nMette-Marit was diagnosed with pulmonary fibrosis, a chronic, progressive lung disease with a poor prognosis, in 2018 and will likely need a lung transplant, according to the royal palace.\n\nOther royal commentators agree. Kjetil Alstadheim, the political editor at Norway’s influential newspaper Aftenposten, said many Norwegians are disappointed by the revelations and have less confidence in the princess as a result.\n\n“They question what her judgment will be like in the future,” Alstadheim told CNN.\n\nOle-Jørgen Schulsrud-Hansen, a royal commentator for Norway’s broadcaster TV2, added: “We need to wait until the dust has settled to see how much it has really affected the monarchy.”\n\nMette-Marit became Crown Princess in 2001 after she married Haakon at Oslo cathedral in front of 800 guests and a TV audience of millions. At the time, Mette-Marit’s openness about what she described as a “wild life” in her youth was well-received, particularly among younger generations.\n\n“It mobilized the younger generations who felt this was a modern monarchy, and they could identify with that,” Alstadheim said. “She managed to build trust and be respected.”\n\nAmid the recent furore, that trust and respect seem to be all but fading.\n\nThis week, Norway’s largest sexual health center, Oslo-based “Sex and Society,” announced it would cut ties with Mette-Marit as it said the latest revelations were incompatible with the group’s ethos.\n\n“The important thing for the foundation has been the consideration of our patients, of all victims of abuse and of all those who stand up to prevent sexual abuse,” the center said in a statement.\n\nThree cultural organizations in Norway – all under the patronage of the crown princess – have also written to the royal household regarding Mette-Marit’s past association with Epstein, saying the pair’s contact appears to be “serious and worrying.”\n\n“It is important for our further cooperation that the Royal House provides a good explanation of the matter,” Norway’s Hamsun Center, Førde Festival and Nynorsk Cultural Center wrote in a letter seen by CNN.\n\nThe controversial email exchanges – which demonstrated a deeper relationship between Epstein and the crown princess than previously known – have provoked rare political intervention, with Norwegian Prime Minister Jonas Gahr Støre saying on Monday that Mette-Marit demonstrated poor judgment.\n\n“She says she has showed bad judgment. I agree,” Støre told reporters.\n\nThough mirroring Mette-Marit’s own words, his comments speak to the significant public pressure facing the family, royal experts say. “I have not found any example from earlier in Norwegian modern history where a prime minister has criticized a member of the royal family in public like that,” said Alstadheim, the political editor.\n\nIn emails sent from “H.K.H. Kronprinsessen” – which translates from Norwegian to “Her Royal Highness The Crown Princess” – to Epstein in 2012, Mette-Marit calls the late sex offender “sweetheart” and “soft hearted.”\n\nIn another 2012 email exchange, she calls Epstein “very charming,” while adding: “Is it inappropriate for a mother to suggest two naked women carrying a surfboard for my 15 yr old sons wallpaper ?”\n\nAnother conversation in 2012 sees Epstein tell Mette-Marit he is on a “wife hunt,” before adding: “Paris is proving interesting but I prefer scandinavians (sic).” In response, Mette-Marit says Paris is “good for adultery” and “Scandis better wife material.”\n\nMette-Marit accepted she showed “poor judgment” over her relationship with Epstein but said he was “solely responsible for his actions.”\n\n“I must take responsibility for not having investigated Epstein’s background more thoroughly, and for not realizing sooner what kind of person he was. I deeply regret this, and it is a responsibility I must bear,” she told CNN in a statement.\n\nAs pressure on Mette-Marit builds, former Norwegian Prime Minister Thorbjørn Jagland is under investigation “on suspicion of aggravated corruption” related to his ties to Epstein, Norwegian law enforcement officials said in a statement Thursday.\n\nNorway is investigating “whether gifts, travel and loans were received in connection with his position,” according to Økokrim, the country’s national prosecutorial service and police agency.\n\nDOJ files show that Jagland exchanged friendly emails with Epstein and planned a vacation on his island. Jagland’s lawyer told CNN the former leader would contribute fully to the investigation, adding that “based on what we have uncovered so far, we remain confident about the outcome.”\n\nOn Sunday, Norway’s foreign ministry announced that prominent diplomat Mona Juul would step down, saying her ties to Epstein had undermined the confidence required for her role.\n\nIn a statement, Norway’s Foreign Minister Espen Barth Eide said “Juul’s contact with convicted sex offender Epstein has shown a serious failure of judgment. The case makes it difficult to rebuild the trust that the role requires.”\n\nJuul had recently represented Norway in Jordan and Iraq, and helpedorchestratethe consequential Oslo accords in the 1990s, along with her husband Terje Rød-Larsen.\n\nOn Monday, Juul was charged with “gross corruption” according to Økokrim, which investigates economic and environmental crimes.\n\nHer husband was also charged with complicity in gross corruption, following an investigation into the couple opened by the crime agency last week.\n\nAn apartment in Oslo was searched Monday as part of the investigation, as well as the property of a witness, the crime agency said. The probe will investigate whether the diplomat received any benefits in connection with her position.\n\nRød-Larsenresignedfrom his position as president of an international think tank in 2020 over his dealings with Epstein.\n\nEarlier this year, Norwegian public broadcaster NRK reported that US documents showed that Epstein left $10 million to Juul and Rød-Larsen’s two children in his will.\n\nOther European figures too are included in the latest trove, including royals, although being named in the files does not indicate any wrongdoing.\n\nIn one email sent to Epstein in 2010, a person whose name is redacted included a photo appearing to show Sweden’s Princess Sofia, then-Sofia Kristina Hellqvist, on a trip to Africa.\n\nThe email reads: “Here is a photo of our Sofia - you remember - i.e. soon Princess Sofia…the whole Swedish press is looking for her … while she is in Africa..!” The context surrounding the email exchange is unknown.\n\nThe name “Sophia Hellqvist” is also listed alongside Epstein on a 2012 guest list – which was emailed to the late sex offender – for what appears to be a performance of Les Misérables.\n\nPrincess Sofia met Epstein on several occasions around 20 years ago before she became a member of the royal family, Sweden’s royal court told CNN Friday. But they denied the princess attended such an event in 2012.\n\n“We are aware that the Princess’ name (misspelled) is reported to have been found in a document from a premiere in 2012.”\n\n“However, the Princess does not know how her name has ended up on this list,” they said, adding she was in Sweden at the time and had not met Epstein for “several years.”\n\nOn Tuesday, Princess Sofia said she was “grateful” not to have had anything to do with Epstein since her twenties.\n\n“Now that I’ve read about all the horrible crimes that he committed against young women, I am so grateful that I have not had anything to do with him since those few occasions in my twenties,” she said.\n\nShe added that her thoughts “go to all the victims. And I hope there will be justice in this.”\n\nMeanwhile, in 2012, Denmark’s then-crown prince, now King Frederik X, was listed in an email sent to Epstein as a “confirmed guest” for a dinner party.\n\nIt is not clear if Epstein or the then-crown prince attended the event. Denmark’s royal house told Danish newspaper Ekstra Bladet the King had never met Epstein, in a statement it later confirmed to CNN.\n\nAs CNNhas reported, Britain’s former Prince Andrew is also included multiple times in the files, as is his ex-wife Sarah Ferguson, who has previously expressed regret over her association with Epstein.\n\nBack in Norway, and with Høiby’s rape trial expected to last several weeks, Taalesen believes the two swirling royal controversies are “reinforcing each other.”\n\nThe daily courtroom coverage will keep the royal family at the forefront of public attention as the pressure on Mette-Marit grows, she says.\n\nBut, mirroring the fallout in Britain, it is the Epstein emails which present the most serious challenge to the family name in decades – a challenge she says the royal household cannot afford to ignore.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/europe/norway-crown-princess-epstein-hoiby-intl",
      "text": "multiple fronts"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/europe/stepson-norway-crown-prince-rape-trial-intl",
      "text": "Marius Borg Høiby"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "Epstein files"
    },
    {
      "url": "https://www.cnn.com/2024/03/02/europe/norway-king-harald-pacemaker-intl",
      "text": "deteriorated in recent years"
    },
    {
      "url": "https://www.cnn.com/videos/world/2016/09/30/shimon-peres-israel-intv-amanpour-oslo-accords-mona-juul-terje-rod-larsen.cnn",
      "text": "orchestrate"
    },
    {
      "url": "https://www.cnn.com/2020/10/30/world/epstein-donations-international-peace-institute-resign",
      "text": "resigned"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "has reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/europe/norway-royal-family-scandals-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/07/europe/norway-royal-family-scandals-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7e0eec6e720361f76ab129d9c90222b1985b80f81ce088c309d5126af96facf7",
  "scraped_at": "2026-02-11T16:40:02.160191+00:00"
}