{
  "url": "https://lite.cnn.com/2026/02/24/business/minnesota-ice-surge-mutual-aid",
  "title": "What others can learn from how Minnesota helped its most vulnerable residents during the ICE surge | CNN Business",
  "date": "2026-02-25T07:33:02.736215+00:00",
  "authors": [
    "Jeanne Sahadi"
  ],
  "text": "Source: CNN\n\nThe surge of federal immigration agents in Minnesota over the past few months left many people not only traumatized but financially hard up.\n\nPeople lost income because they were too afraid to go to work or their breadwinner was taken by agents of US Immigration and Customs Enforcement or Customs and Border Patrol. Small business owners, in turn, lost revenue because their workers and customers didn’t show up.\n\nIn Minneapolis alone, the city government now estimates 76,000 residents – or about 20% of the city’s population – have urgent needs in terms of lost wages, food insecurity and an inability to make rent, among other things.\n\nMutual aid groups of volunteers have mobilized to help neighbors sheltering at home with life’s essentials.\n\nSuch groups are not nonprofits and are not formally organized. Instead they offerpeer-to-peer assistance, which is faster and more agile than a nonprofit or foundation in providing tangible, targeted emergency relief.\n\n“They can move the fastest because they’re volunteer-run and hear directly from neighbors who need assistance,” said Rachel Sayre, director of emergency management for Minneapolis.\n\nSayre said her neighborhood association effectively has been providing mutual aid to the most vulnerable in their community.\n\nThere are too many such mutual aid groups to count.\n\nStandWithMinnesota.com, a site that was stood up a week afterRenee Goodwas killed by ICE agents, aims to be one centralized resource for people who want to help by listing mutual aid groups, crowdfunding campaigns and nonprofits engaged in mutual aid efforts on the ground.\n\nCombined, they’ve raised close to $20 million, according to its creator, former Minnesota resident Ashley Fairbanks. Fairbanks, a communications consultant for nonprofits and a political organizer, has created a new campaign – Keep MN Housed – to help struggling families make their rent and avoid eviction. (In Minneapolis alone, the city government estimates there is nearly $16 million needed inadditional rent assistancedue to lost household income as a result of the ICE surge.)\n\nMany businesses, meanwhile, have embarked on their own mutual aid efforts. “Every brewery, every café. Everywhere,” Sayre said, noting that shops and restaurants let customers and passers-by know they were collecting specific goods on specific days to distribute to those who needed them.\n\nAnd some nonprofits have engaged in providing their own direct, in-kind assistance. The Hmong American Partnership (HAP), for example, normally serves as a microlender to Hmong, Southeast Asian and immigrant refugee entrepreneurs and helps provide housing, workforce and community opportunities in the greater Twin Cities area.\n\nDuring the surge, ICE set up shop in its parking lot, which is located near many of the group’s constituents, said May yer Thao, HAP’s president.\n\nSo her organization pivoted.\n\nIt decided to use some of its own budget to provide emergency grants of between $2,500 and $5,000 to owners of brick-and-mortar businesses. The money could be used to make rent, pay an employee or get needed supplies. It’s not a lot, Thao said. But, she added, “We hope it will keep them afloat for a month.”\n\nSeparately, she said, HAP used a $50,000 grant it received from theImmigrant Rapid Response Fund– which is housed at the Women’s Foundation of Minnesota and run in concert with a diverse coalition of philanthropic leaders in the state – to provide families with boxes of “essential household items and culturally appropriate foods” such as rice and fresh produce. Thao said she and her staff went shopping to fill those boxes, the majority of which were then delivered to the homes of those sheltering in place. “We still need to serve our communities with dignity,” she said.\n\nThe treatment of many Minnesota residents by ICE and CBP agents, which resulted in, among other things, thevery public killingof Good and Alex Pretti, both US citizens – has beenroundly criticized.\n\nThe agency – while still enlarging its footprint across the country – may adopt more targeted, less public tactics going forward, according toreporting by CNN’s Priscilla Alvarez.\n\nThere is concern the risk for immigrants and refugeesregardless of legal statusis likely to remain.\n\nAnd with it, a likely need for mutual aid for some or many.\n\nMinnesota prides itself on having a culture of service. “We’re raised to volunteer,” Sayre said.\n\nBut even if that is not the case in another state or city, there are still ways for concerned citizens to anticipate how to meet people’s needs should they retreat in fear of ICE.\n\n“You have churches and community centers and neighborhood groups. Spend some time talking about (what to do) if your neighbors are in need. Ask ‘How would we help them?” Sayre suggested. Part of the answer should involve consideration of how goods can be distributed safely to families afraid of being exposed.\n\nThe goal is to arrange for quick distribution with as little red tape as possible, those who spoke to CNN suggested.\n\nAnd, Thao added, trust your internal compass. “Let’s just come back to basic care for humanity,” ﻿she said. “Everyone has that innate wisdom in them. Be courageous. Do the little bit you can do.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.standwithminnesota.com/",
      "text": "StandWithMinnesota.com"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/us/renee-good-shooting-incident-report",
      "text": "Renee Good"
    },
    {
      "url": "https://www.minneapolismn.gov/news/2026/february/oms-impact/",
      "text": "additional rent assistance"
    },
    {
      "url": "https://www.wfmn.org/funds/immigrant-rapid-response/",
      "text": "Immigrant Rapid Response Fund"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/immigration-agents-shooting-alex-pretti-invs",
      "text": "very public killing"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/alex-pretti-shooting-minneapolis-crackdown-polls",
      "text": "roundly criticized"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/trump-immigration-strategy-homan-bovino",
      "text": "reporting by CNN’s Priscilla Alvarez"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-refugees-memo-detain-immigration-hnk",
      "text": "regardless of legal status"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/business/minnesota-ice-surge-mutual-aid",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/business/minnesota-ice-surge-mutual-aid",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7e7a3cc0f920e1a0bf730fd042808338282bd343b238a23490ac34f5a450fb05",
  "scraped_at": "2026-02-25T07:33:02.736240+00:00"
}