{
  "url": "https://lite.cnn.com/2026/02/18/world/lunar-new-year-roundup-intl-hnk",
  "title": "Year of the Horse, Lunar New Year, Chinese New Year round-up | CNN",
  "date": "2026-02-19T07:30:43.341484+00:00",
  "authors": [
    "CNN staff"
  ],
  "text": "Source: CNN\n\nAs the Year of the Horse galloped in, revelers ushered in the most prominent festival on the lunar calendar with some quirks – from kung fu robots to Harry Potter’s teenage nemesis – and some reflection.\n\nHere’s a round-up of CNN’s coverage:\n\nIf there’s one common theme to emerge from the many Lunar New Year rituals attached to the annual celebration, it’s the collective hope that we’re ushering in luck, prosperity and good vibes for ourselves and everyone around us. We’ve done the cosmic legwork for you, rounding up this year’s Chinese zodiac fortune guide with the help of some seasoned feng shui masters.\n\nWhy is it called the Year of the Horse? Why is everyone dressed in red? What are you supposed to do during this auspicious holiday? Read our guide.\n\nA feng shui master gives his reading on the fortunes of celebrities Timothée Chalamet and Margot Robbie, US President Donald Trump and New York Mayor Zohran Mamdani.(Full disclosure: we are doing this just for fun.)\n\nLunar New Year celebrations can prompt superstitious actions. Should you sweep your apartment? Or, cut your hair on holiday days? And why are there long lines outside banks in places where the holiday is celebrated? Watch this to find out.\n\nWhile humanoids are far from taking over the world, they certainly stole the show by performing some kung fu moves during China’s most watched Lunar New Year programme.\n\nIn preparation for the festival, people in China also put up posters of well-wishing messages. But some of this year’s decorations were accompanied by the smirk of Draco Malfoy, Harry Potter’s privileged teen nemesis in J.K. Rowling’s wildly successful book series. Here’s why.\n\nA red plush horse became an instant sensation in China, despite – or because of – a sewing mistake that turned its smiling mouth downward. Many find the toy’s sad expression relatable, saying it mirrors the life of a “corporate slave.”\n\nSporting a design that resembles a historic Chinese garment, this jacket by sportswear brand Adidas has become a holy grail among Gen Z customers – and emblematic of young people’s growing embrace of all things China.\n\nWhile a celebratory mood spreads across the country, survivors of a deadly fire in Hong Kong are still grieving with little to celebrate, like this man who lost his wife in the blaze.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/travel/chinese-zodiac-predictions-2026-year-of-the-fire-horse",
      "text": "Chinese zodiac predictions: What’s in store for 2026"
    },
    {
      "url": "https://www.cnn.com/travel/chinese-lunar-new-year-2026-guide-intl-hnk",
      "text": "A guide as we gallop into the Year of the Horse"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/world/video/year-of-the-horse-feng-shui-predictions-vrtc-digvid",
      "text": "What will the Year of the Horse be like for these familiar faces?"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/world/video/rules-to-follow-for-a-prosperous-lunar-new-year-digvid-vrtc",
      "text": "Rules to follow for a prosperous Lunar New Year"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/world/video/kung-fu-robots-perform-at-spring-festival-gala-digvid-vrtc",
      "text": "Kung fu robots perform at Spring Festival Gala"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/world/draco-malfoy-china-new-year-mascot-intl-hnk",
      "text": "A Harry Potter villain is now an unlikely new-year mascot"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/world/video/video-crying-horse-toy-lunar-new-year-viral-china-hnk-digvid",
      "text": "Sad Year of the Horse toy goes viral"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/style/adidas-tang-jacket-chinese-new-year-trend-intl-hnk",
      "text": "Why the Adidas ‘Chinese New Year’ jacket has gone viral"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/asia/hong-kong-tai-po-fire-survivors-intl-hnk-dst",
      "text": "But how do you celebrate in the midst of grief"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/world/lunar-new-year-roundup-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/world/lunar-new-year-roundup-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7e8bc8e9106b67002bec729cb733a0a0738da6981e2502453d4799c0d870ba37",
  "scraped_at": "2026-02-19T07:30:43.341499+00:00"
}