{
  "url": "https://lite.cnn.com/2026/02/24/climate/epa-trump-endangerment-finding-climate-pollution-supreme-court",
  "title": "19 years ago, the Supreme Court told EPA it could regulate climate pollution. Trump is trying to undo that | CNN",
  "date": "2026-02-25T07:32:56.480621+00:00",
  "authors": [
    "Ella Nilsen"
  ],
  "text": "Source: CNN\n\nLast week, the Trump administration delivered a catastrophic blow to US climate policy by repealing the longstanding scientific finding that planet-warming pollution poses a danger to humans.\n\nGetting to this point was one of the administration’s most audacious deregulatory goals. But it doesn’t represent a complete success — yet. Now comes the years-long race through the courts to see if they really can pull off kneecapping the Environmental Protection Agency from regulating climate pollution ever again.\n\nThey are facing a phalanx of opponents. Last week,more than a dozen major environmental and public health groups filed a lawsuit against the Trump administration’s repeal of the greenhouse gas endangerment finding. Those organizations are setting up a high-stakes legal battle that could go all the way up to the Supreme Court.\n\nIronically, that’s the place this all began. In 2007, a major Supreme Court case, Massachusetts v. EPA, found that greenhouse gases met the definition of an “air pollutant” under the Clean Air Act, and that the EPA had the authority to regulate them. That ruling gave birth to the endangerment finding two years later.\n\nNow, environmental legal experts say, the Trump administration is hoping a far more conservative court will undo it all. If they are ultimately successful, the administration can more easily overturn other rules that reduce climate pollution emitted from power plants and oil and gas operations — and make it much harder for a future administration to put the rules back in place.\n\n“I think they’re certainly trying to get it to the Supreme Court,” said Jody Freeman, director of Harvard Law School’s Environmental and Energy Law Program and a former climate official in the Obama White House. The five justices that ruled in the majority for Mass v. EPA in 2007 are no longer on the bench; the three who dissented — Justices Samuel Alito, Clarence Thomas and Chief Justice John Roberts — are still there and have since been joined by three more conservatives.\n\n“The Trump administration is doing math, and they think they might be able to get five votes for their arguments, even though they’re arguing really a rehash of the same kinds of things that were argued back then and lost,” Freeman said.\n\nThe lawsuit will first go before the DC Circuit Court of Appeals, where the process of getting a ruling could be lengthy.\n\n“This will take a few years,” said Hana Vizcarra, a senior attorney at environmental legal group Earthjustice. “It’s going to be a relatively large, complicated piece of litigation, because there’s so many players involved.”\n\nAsked for comment on the legal challenge, an EPA spokesperson said, “unlike our predecessors, the Trump EPA is committed to following the law exactly as it is written and as Congress intended — not as others might wish it to be.”\n\nIf the case winds up in front of the Supreme Court, and if its conservative justices side with the Trump administration, it’s game over for the EPA’s authority to regulate climate pollution. Only Congressional action could restore it, Freeman and other experts said, and it is difficult to see a highly polarized Congress agreeing on a bipartisan climate change bill.\n\nBut it’s not even clear if this is what the oil companies want. Major industry groups including the American Petroleum Institute have not fought to kill the federal endangerment finding, because a patchwork of state laws could ultimately replace it — leading to legal headaches and a raft of nuisance lawsuits against them, experts said.\n\n“What I think industry wants is a weak EPA with weak regulation; that probably is their sweet spot,” Freeman said. “But not pulling the endangerment rug out from under the Clean Air Act.”\n\nThe Trump EPA is relying on a series of legal arguments in its repeal, rather than challenging the veracity of climate science.\n\nIt’s a different tactic than the one the agency took when it first proposed overturning the endangerment finding last summer. Then, the proposal was based in part on a report authored by five climate contrarians that questioned the threatof climate impacts like wildfires, extreme heat and stronger storms. That report was roundly rejected by the scientific community, and the group of five were later sued by environmental groups and disbanded.\n\nInstead, the new argument boils down to jurisdiction. In this rule change, the Trump EPA argues that greenhouse gas pollution and the harms it causes is a global problem rather than a local or regional one — and under the Clean Air Act, EPA does not have the authority to regulate global pollution. This is similar to the losing case lawyers for the George W. Bush administration took to court in 2007.\n\nThe EPA is also arguing that pollution from various classes of US vehicles doesn’t individually meet a threshold of contributing to global climate change, because it’s just too small a piece of the emissions pie.\n\nIn other words, the EPA is “slicing and dicing to make sure their analysis is looking at a small component to a large problem,” said Carrie Jenks, executive director of Harvard Law School’s Environmental & Energy Law Program.\n\nJeff Holmstead, an energy attorney with the law firm Bracewell, and a former high-ranking EPA official in the George W. Bush administration, said he believes the EPA is trying a legal argument that is carefully threading a needle — not explicitly asking the Supreme Court to overrule its previous ruling in Massachusetts v. EPA, while also getting it to handicap the EPA’s ability to regulate greenhouse gases for years to come.\n\nAnd Holmstead believes the jury is out on whether the current Supreme Court could find that convincing.\n\n“I’m not saying that the Trump administration will definitely win, but I think opponents are whistling past the graveyard if they say, ‘oh, it’s a slam dunk for us,’” Holmstead said. “I think there are good legal arguments on both sides.”\n\nUltimately, the makeup of the Supreme Court could matter more than the legal arguments themselves, said longtime environmental attorney and Harvard Law School professor Richard Lazarus.\n\nIf environmental groups were to lose in the DC Circuit, Lazarus said he would be surprised to see them appeal to the Supreme Court, where they will face tougher scrutiny.\n\n“They’ve got good arguments, but should they have reason to think that they have a potentially hostile court? Absolutely,” Lazarus said.\n\nAnd if environmental groups prevail at the DC Circuit, the Trump administration will very likely appeal to the highest court in the land. The basic math is “foreboding,” Lazarus said.\n\nOf the current six conservatives on the bench, Roberts and Justice Amy Coney Barrett have developed something of a swing vote status. But the court has shown a high level of interest in chipping away at the EPA’s ability to regulate climate pollution.\n\nIn a 2022 ruling, the court limited how the EPA could regulate climate pollution from power plants. The agency previously had broad authority to regulate this kind of pollution by shifting power generation from dirtier sources like coal to cleaner sources like wind and solar. But the conservative justices determined “there is little reason to think Congress assigned such decisions to the Agency.”\n\nLazarus said there is a scenario where the Supreme Court could rule more narrowly, essentially letting the Trump administration end regulation of climate pollution from vehicles, but leaving the door open for a future administration to take it back on.\n\nBut if the court fully agrees with the Trump administration, it will be a wounding blow, Lazarus said. Environmental groups “don’t want to lose on that one.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/climate/epa-trump-endangerment-finding-climate-pollution-supreme-court",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/climate/epa-trump-endangerment-finding-climate-pollution-supreme-court",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7ea06342ec121eb0216a00b3655da72e5030217dcf2b65fc6ff327072b816ab4",
  "scraped_at": "2026-02-25T07:32:56.480631+00:00"
}