{
  "url": "https://lite.cnn.com/2026/02/12/europe/albania-anila-bisha-ai-minister-intl-latam",
  "title": "Actor takes legal action to stop Albania’s government from using her image for ‘AI minister’ | CNN",
  "date": "2026-02-12T21:29:50.381216+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nAlbania introduced what it called the world’s firstartificial intelligence ministerlast year. Turns out she wasn’t entirely artificial —at least not her face and voice.\n\nAlbanian actor Anila Bisha says those belong to her, and she never imagined the government would use her image so prominently.\n\nNow Bisha, a popular film and theater actor in Albania, is demanding that her face and voice be stripped from the so-called virtual minister named Diella.\n\nCiting a violation of her personal data, Bisha filed a formal request through an administrative court in Albania this week demanding that the government immediately stop using her voice and image for Diella.\n\n“This is the first legal move to prevent the abuse of Anila’s image,” her lawyer Aranit Roshi said.\n\nThe Albanian government did not immediately respond to a request for comment.\n\nAlbania drew global attention last year when Prime Minister Edi Rama announced the creation of what he described as the world’s firstartificial intelligenceminister, aimed at ensuring that all public procurement tenders are handled 100% corruption-free.\n\nDiella is usually depicted in traditional Albanian national dress and is known for her punchy comebacks when prompted by government officials.\n\nBisha acknowledged she had signed a contract agreeing that her voice and image can be used for the government’s online platform e-Albania, which provides a wide range of public services in the country. But she said she was never told of any plans to use them for an AI minister.\n\n“It was surprising when I heard the prime minister declare it. I asked how this could happen without my knowledge, without anyone asking me if I wanted my image to be used or not,” Bisha told The Associated Press on Thursday.\n\nShe said she feels her image is now used as a political statement.\n\nIt is not the first time that voices used in artificial intelligence platforms have caused a stir.\n\nIn 2024, OpenAI pulled one of its ChatGPT voices, Sky, after actorScarlett Johanssonsaid the voice sounded “eerily similar” to her own. OpenAI said the voice used for Sky was not that of Johansson.\n\nBisha said she had tried to contact the government multiple times since the AI minister became part of the Albanian Cabinet last September. She said she decided to begin legal proceedings after failing to receive a response to her request for a meeting to discuss the issue.\n\nBisha filed the temporary injunction with the administrative court to demand that the government immediately cease using her image for Diella. Her representatives plan to file a formal lawsuit for damages and compensation.\n\n“One cannot take away one’s identity and do with it whatever they want,” she said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/19/world/video/ai-minister-ablania-ldndigvid",
      "text": "artificial intelligence minister"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/tech/ai-replacing-jobs-concerns-radiology",
      "text": "artificial intelligence"
    },
    {
      "url": "https://www.cnn.com/2024/05/20/tech/openai-pausing-flirty-chatgpt-voice",
      "text": "Scarlett Johansson"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/europe/albania-anila-bisha-ai-minister-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/europe/albania-anila-bisha-ai-minister-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7edba32c4b9305c8af417701fc23c3596084cec0866b65df67de45617ea52508",
  "scraped_at": "2026-02-12T21:29:50.381230+00:00"
}