{
  "url": "https://lite.cnn.com/2026/02/12/politics/kathy-ruemmler-resigns-goldman-sachs-epstein-fallout",
  "title": "Kathy Ruemmler, top Goldman Sachs lawyer, resigning amid Epstein fallout | CNN Politics",
  "date": "2026-02-13T07:30:53.578493+00:00",
  "authors": [],
  "text": "Source: CNN\n\nKathy Ruemmler, the chief legal officer at Goldman Sachs, said Thursday night she is resigning amid fallout from the Justice Department’s release of millions of pages ofJeffrey Epstein documents.\n\nHer resignation is effective June 30.\n\nHer announcement comes as she has weathered numerous news stories in recent weeks examining her relationship with the disgraced financier.\n\nRuemmler and those around her have insisted she had a professional relationship with Epstein.\n\n“Since I joined Goldman Sachs six years ago, it has been my privilege to help oversee the firm’s legal, reputational, and regulatory matters; to enhance our strong risk management processes; and to ensure that we live by our core value of integrity in everything we do,” Ruemmler, a former Obama White House counsel, said in a statement to CNN. “My responsibility is to put Goldman Sachs’ interests first.  Earlier today, I regretfully informed David Solomon of my intention to step down as Chief Legal Officer and General Counsel of Goldman Sachs as of June 30, 2026.”\n\nDavid Solomon, CEO of Goldman Sachs, told CNN in a statement: “Throughout her tenure, Kathy has been an extraordinary general counsel, and we are grateful for her contributions and sound advice on a wide range of consequential legal matters for the firm. As one of the most accomplished professionals in her field, Kathy has also been a mentor and friend to many of our people, and she will be missed. I accepted her resignation, and I respect her decision.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-golman-sachs-epstein-ties-invs-vis",
      "text": "Kathy Ruemmler"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "Jeffrey Epstein documents"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-resigns-goldman-sachs-epstein-fallout",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/kathy-ruemmler-resigns-goldman-sachs-epstein-fallout",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7f0e08a0cb50e305f76f7ae659e19f007567f0f157cdf3bf178b63dbed0ab18c",
  "scraped_at": "2026-02-13T07:30:53.578507+00:00"
}