{
  "url": "https://lite.cnn.com/2026/02/13/style/nyfw-marc-jacobs-collection-nostalgia",
  "title": "Are American designers too caught up in nostalgia? | CNN",
  "date": "2026-02-14T07:07:17.945295+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAmerican designers have a very special someone on their moodboards this season: themselves.\n\nMarc Jacobs namecheckedhis own collections from 1993, 1995, 1998, 2003 and 2013as influences in his show notes (alongside ’90s Prada andthe cult Lower East Side vintage store Ellen). Michael Kors, celebrating his brand’s 45th year, drew inspiration from his Fall 1998 show. “After this many years in the business, I’m on my third generation of customers,” he said. “I hear all the time about girls stealing their grandmother’s pieces.”\n\nSome of these navel-gazing odes are unsurprising. Ralph Lauren, the tartaned don of American fashion, is always going to look at Ralph Lauren (his favorite designer, and who can blame him?). The art of taking what’s vaguely out of style and mixing it with feverish individuality is the Ralph philosophy –and just one reason why his business is booming.\n\nThe question is whether these nostalgia-fests will buoy an American industry sagging under the pressure of tariffs and the collapse of department stores, plus a homogenized retail and media landscape that has led to a diminished sense of how to put yourself together each morning with a sense of originality. Is this remix-of-an-old classic routine givingcustomers who now look for vintage and secondhand pieces, rather than new clothes, what they really want? Or are designers indulging or cheatingconsumers who find the once straightforward hunt for stylish clothes an impossible pursuit?For many, the marketing noise of Instagram fashion and celebrity style have eclipsed the accessibility of simply great clothes.\n\nIt’s a relatable conundrum for the champagne bubble of fashion: is the present so overwhelming that seizing on the past is a noble escape? Or is it a creative leader’s responsibility to offer something that armors us distinctly for today?\n\nJacobs’s paean to Jacobs did tell us something about the way things are going now. His streamlined ’90s shapes and subdued but glamorous details (very early-2000s Jacobs) were like a strict teacher’s ruler clapping on the desks of influencers and celebrity stylists: the era of clickbait clothing, of pieces designed for social media meme-making, is officially over. But it is not enough for designers to serve up conservative clothes that “solve problems” (like yet another cashmere sweaterunder $100!, or wide-legged bore marketed as “The Perfect Trouser”). What’s wearable must also be a bit freaky, like Jacobs’s shrunken ladylike tweed suits, or pencil skirts with wackadoo oversized waistlines you can stuff your hands into, like some naïve alien’s idea of “pockets.” If the “wearable” isn’t also a little unusual, what’s the point of fashion at all? We might as well stay at home wearing sacks while we slurp our engineered meat and doomscroll. No: in today’s world, special design is proof of life.\n\nAnd more than any designer alive, Lauren knows his clients look not just for the leaf-print Victoriana jacket with a leg-o-mutton sleeve – but the idea to wear it with double pleat pants, a coin belt and a little leopard fur scarf.After his January return to the men’s runways in Milan, menswear geeks spent days poring over the images for styling ideas. It helps that Lauren makesthebelt ortheslightly ridiculous pleated pant, which are perfect if you don’t have the fabulous budget (and absurd life) to dig through the racks at Santa Fe Vintage in New Mexico or Crowley Vintage in New York. Women and men are, indeed, willing to fork over the cash for the Ralph-approved update.\n\nBut every designer can’t simply offer “the new version of the vintage thing” – they don’t have the money or the rizz. What American designers can do better than anyone is take a can-do attitude and put their ego aside – that tortured artist streak that every designer of every stripe has – and serve up the tools forstyle. Like a long sleeveless dress with a slight bell shape, in a pale Vermeerian blue popping with surprising shoots of grassy neon green, as Rachel Scott did at Proenza Schouler, or a peacoat with a grand portrait collar – “a little ‘Funny Face’ Audrey Hepburn,” as Kors put it. “Hopefully you will have these clothes, live in them, and generations to come will enjoy them.” The kinds of clothes that, every time you reach for them, you feel that punch of beauty.\n\nTwo designers nailed that: Kors, with his intelligent but special-feeling outerwear – “in New York, your coat is your calling card” – and surprising ideas for going-out clothes, like sequin pants worn with a silk, long-trained top, all worn with low pumps. “I can’t stand going to parties and seeing women having to take their shoes off,” Kors told CNN. The second was Wes Gordon, at Carolina Herrera, who put women smack in the middle of the action with a cast of art world stars (sculptor Rachel Feinstein, painter Amy Sherald, gallerist Hannah Traore) whom he called his muses – a cliché that, with the show’s smart styling, actually worked. “This is a collection about celebrating women,” Gordon said. And he meant it: his sophisticated coats, chic knit skirt suits and unfussy printed dresses are express routes to good style.\n\n“We did one gown,” he said, his eyes wide. “We’ve never done that before.” Carolina Herrera is a brand that, having dressed countless first ladies, could become stuck in its history or risk looking ridiculous in attempting to stay relevant. Rather than chasing trends or youth, Gordon is chasing a more worldly, more thoughtful woman. Smart – and aspirational!\n\nOther designers are so caught up in the past that they are unable to move forward. Anyone who’s gotten back together with an ex, or whose understanding of “The Great Gatsby” extends beyond the image of Leonardo DiCaprio lifting up that champagne glass, knows that you can’t repeat the past.\n\nWhy, for example, are we stretching ourselves to revive the heyday of Proenza Schouler? Scott, whose sparkling brand Diotima has earned heaps of industry accolades, speaks reverently of Proenza Schouler, where she just landed as creative director after its founders Jack McCollough and Lazaro Hernandez decamped to LVMH-owned Loewe. “I thought a lot about who this woman is – she’s complex,” she said. She also thought a lot about what she considers the brand’s signatures, like grommets and technical textiles. But her deference to her predecessors led her down some unsteady paths, like so-so digital prints and pieces overworked with grommets and loops of fringe. The pieces that will really sing to a customer, like that blue dress or her knit skirt suits, seemed much more her taste and more right for today.\n\nProenza Schouler was considered the future of American fashion over a decade ago, but business was not exactly singing, financially or creatively, when the founders departed. And in today’s world, it is much more interesting to see a wildly creative, young Black Jamaican American woman’s idea of how a fancy, busy city gal should dress than worry about whether the brand is hewing to the “codes” established at a time when fashion’s priorities (socialiates, “uptown-meets-downtown”) are so foreign from today’s “complex woman.” She should be empowered to embrace her own idea of what monied, cultured women should wear.\n\nNowhere is the misguided pursuit of recreating the past more apparent than Calvin Klein, in its third season of an attempted reboot under Italian designer Veronica Leoni. She does not know whether she is conjuring the 1990s — when Carolyn Bessette Kennedy trotted around New York in the simplest black dresses and long unbrushed hair — or the 2010s — when white-collar workers still wore suiting and designers tried to offer something slightly funky — or 2023 — when The Row, Toteme, Kallmeyer and Fforme started offering clothes that make wealth and minimalism seem somehow eccentric and intimate. Calvin Klein comes off as a big slop of corporate-honed luxury from a machine, rather than thoughtful, sophisticated Americana from a human being’s mind.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.instagram.com/p/DUjoTEMDWXr/?img_index=4",
      "text": "his own collections from 1993, 1995, 1998, 2003 and 2013"
    },
    {
      "url": "https://www.harpersbazaar.com/fashion/a70301499/downtown-new-york-vintage-store-ellen-marc-jacobs-inspiration-fall-2026/",
      "text": "the cult Lower East Side vintage store Ellen"
    },
    {
      "url": "https://www.vogue.com/article/ralph-lauren-sales-spike-10-raising-expectations",
      "text": "and just one reason why his business is booming"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/style/vintage-stores-offering-cure-to-fashion-fatigue",
      "text": "customers who now look for vintage and secondhand pieces, rather than new clothes"
    },
    {
      "url": "https://x.com/JungianPeater/status/2007726429463818388",
      "text": "consumers who find the once straightforward hunt for stylish clothes an impossible pursuit?"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/style/ralph-lauren-fall-2026-menswear-milan-show",
      "text": "After his January return to the men’s runways in Milan"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/style/nyfw-marc-jacobs-collection-nostalgia",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/style/nyfw-marc-jacobs-collection-nostalgia",
      "text": "Cookie Settings"
    }
  ],
  "hash": "7fe0fcb89ae8f86acfc245c1eaed9143173cd0882f89fa63c2001f9cf6fa13ea",
  "scraped_at": "2026-02-14T07:07:17.945309+00:00"
}