{
  "url": "https://lite.cnn.com/2026/02/13/business/chocolate-prices-valentines-day",
  "title": "Sticker shock: Chocolate prices are spiking | CNN Business",
  "date": "2026-02-14T07:08:01.605553+00:00",
  "authors": [],
  "text": "Source: CNN\n\nChocolate lovers are experiencing sticker shock this Valentine’s Day.\n\nConsumerprices for chocolatehave spiked 14.4% year-over-yearduring the January 1 to early February window, according to market intelligence firm Datasembly.\n\nThat’s a significant acceleration from the 7.8% price hike during the same period last year and 10.5% in 2024, according to the research firm, which tracked the best prices for more than 4,000 chocolate products across 57,000 stores across the United States.\n\nThe higher chocolate prices reflect the lingering effects of a global shortage in the primary ingredient: cocoa beans. That shortage, driven in part by poor harvests caused by extreme weather in West Africa, sent cocoa prices skyrocketing to unthinkable heights.\n\n“Supply suddenly dropped even as demand stayed largely the same. Prices went through the roof,” David Branch, sector manager at the Wells Fargo Agri-Food Institute, said in an interview.\n\nWest Africa, which produces around 70% of the world’s cocoa, suffered such a loss of supply that cocoa bean futures skyrocketed from around $2,500 per metric ton in mid-2022 to above $12,600 in late 2024.\n\n“We saw unprecedented cocoa inflation,” Stacy Taffet, chief growth officer at The Hershey Company, told CNN’s Kate Bolduan this week.\n\nThe Hershey executive said the company is focused on keeping items “as affordable as possible,” noting that around 75% of the company’s products are priced at less than $4.\n\nThe good news for consumers (and chocolate companies) is that cocoa prices have since crashed back to earth, recently dropping below $4,000 a metric ton for the first time in years.\n\nThe bad news: The chocolate items on the shelves today were made with beans priced at or near those crisis-level highs.\n\n“Retail prices remain sticky because candy makers buy cocoa months in advance and work through existing inventory,” Branch wrote in a report.\n\nValentine’s Day shoppers in certain cities are facing even bigger price hikes on chocolate.\n\nAccording to Datasembly data shared with CNN, chocolate prices have surged by 17% in Denver and Los Angeles, while they are up 19% in the Dallas-Ft. Worth region.\n\nFor Americans at large, however, Branch said chocolate price hikes may cool by the time of Easter. By Halloween, he suspects chocolate prices will be falling because of the recent plunge in cocoa prices.\n\n“Retail relief will be slow and uneven for consumers,” he said.\n\nBranch said he does not view steep tariffs on US imports as a primary factor behind the chocolate price increases.\n\nAfter affordability resurfaced as a major political challenge last November, President Donald Trumpsigned an executive orderthatshielded cocoa and other agricultural productsnot made in the United States from his historic tariffs.\n\n“We can’t make cocoa in the US, so we were happy about that,” Taffet, the Hershey executive, said of the tariff relief.\n\nThe chocolate price spike is another reminder of how the overall rate of inflation has eased from a four-decade high in 2022, yet prices for some items continue to rise rapidly.\n\nAnd it’s not just chocolate. Prices for candy and chewing gum jumped by 7.5% year-over-year in January, according to thelatest inflation reportreleased Friday by the Bureau of Labor Statistics. That’s triple the overall inflation rate.\n\nChocolate is a go-to candy purchased around Valentine’s Day, accounting for about 75% of all candy sold, according to the National Confectioners Association.\n\nAmericans are expected to spend $2.6 billion on candy this Valentine’s Day, according to estimates from the National Retail Federation.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/26/business/why-halloween-candy-is-getting-more-expensive-and-less-chocolate-y",
      "text": "prices for chocolate"
    },
    {
      "url": "https://www.whitehouse.gov/fact-sheets/2025/11/fact-sheet-following-trade-deal-announcements-president-donald-j-trump-modifies-the-scope-of-the-reciprocal-tariffs-with-respect-to-certain-agricultural-products/",
      "text": "signed an executive order"
    },
    {
      "url": "https://www.cnn.com/2025/11/14/economy/lower-tariffs-coffee-beef-bananas-produce",
      "text": "shielded cocoa and other agricultural products"
    },
    {
      "url": "https://www.bls.gov/news.release/cpi.t07.htm",
      "text": "latest inflation report"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/business/chocolate-prices-valentines-day",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/business/chocolate-prices-valentines-day",
      "text": "Cookie Settings"
    }
  ],
  "hash": "803664c0e140d88ef9958cb509e4ef14fa23fffae8d25d703e3ab5723d39dcdd",
  "scraped_at": "2026-02-14T07:08:01.605566+00:00"
}
