{
  "url": "https://lite.cnn.com/2026/02/17/weather/el-nino-global-warming-pacific-ocean",
  "title": "Global warming forced scientists to change the way they look at El Niño | CNN",
  "date": "2026-02-18T07:32:06.185008+00:00",
  "authors": [
    "Analysis by Andrew Freedman, CNN"
  ],
  "text": "Source: CNN\n\nIs your idea of El Niño and La Niña mainly informed by a1990s-era Chris Farley sketchfrom “Saturday Night Live?” The late comedian’s definition was hilarious, albeit a bit lacking in scientific precision. (Spanish for “The Niño.”)\n\nThere’s now far more interest in the tropical Pacific climate pattern, and it’s even more complicated than SNL made it out to be.\n\nEl Niño happenswhen ocean temperatures in the tropical Pacific spike way above average. Because that region is so much warmer than the water around it, the atmosphere reacts and weather patterns change — which is why we care so much about El Niño and its cooler sister, La Niña.\n\nThe old way of detecting it was known as the Oceanic Niño Index: Scientists compared the ocean temperature in a specific part of the tropical Pacific, known as the Niño 3.4 region, to the past 30 years of average temperatures in that region. The bigger the difference, the bigger the El Niño.\n\nBut that method ignored what was going on in the rest of the tropical Pacific.\n\nGlobal warming threw a wrench into this method. The whole tropical Pacific is warming so quickly that it’s masking the El Niño-related anomalies. If the ocean is overheated everywhere, then El Niño is harder to see.\n\nSo scientists just switched to a new way of measuring El Niño and La Niña: RONI — the Relative Oceanic Niño Index. The new method contains a simple yet effective math trick. Scientists subtract the temperature anomalies in the rest of the tropical Pacific from those in the region most important for El Niño.\n\nThe new method basically deletes climate change from the whole equation, which makes El Niño easier to spot. Scientists can now see it earlier, and our long-range weather forecasts will be improved for it.\n\nIt is vital that scientists accurately predict and detect El Niño and La Niña events, since they can alter weather patterns thousands of miles away, causing billions in damages by bringing floods to some regions and drought to others, while also affecting the Atlantic hurricane season.\n\nTo get a better handle on what this new index means, and how it may perform, I checked in with two of the most knowledgeable scientists in this field: Michelle L’Heureux of the National Oceanic and Atmospheric Administration and Emily Becker, a researcher at the University of Miami.\n\nL’Heureux, who leads El Niño and La Niña forecasting for NOAA, said the new index “better captures the interactions between the ocean and atmosphere across the tropical Pacific Ocean.” The older method “is increasingly capturing changes in the ocean that are not reflected in the overlying atmospheric circulation.”\n\nEl Niño and La Niña are known as coupled phenomena, meaning that changes in the seas are reflected in shifts in weather patterns in the atmosphere.\n\n“Coupled means that changes in the winds, rainfall, etc. need to be moving in sync with the changes that are occurring at the ocean surface,” L’Heureux said.\n\nL’Heureux said the background warming taking place across the Pacific has been gradually causing the original method to lose sight of El Niño. “The old index was kind of like looking at the tropical Pacific through blurry glasses and now we have upgraded to new prescription glasses and can see El Niño/La Niña more sharply,” she said.\n\nBecker pointed to human-caused climate change as the culprit for that blurry vision.\n\n“What we found was that over the last decade or so, the strength of El Niño and La Niña events, as measured by our traditional Niño 3.4 index, was getting out of sync with the impact patterns that we were seeing,” Becker said. “We found through research that was happening because the global oceans are warming very quickly, and they were warming too fast for our old measure.”\n\nShe said the new index better captures the intensity of these events and their effects on weather patterns, while subtracting the influence of a shifting climatic baseline.\n\nIn other words, “The Niño” from Farley’s sketch – which was filmed during the height of a major El Niño event that occurred from 1997 through 1998, can now be detected with greater precision, and its impacts can be foreseen more clearly.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.youtube.com/watch?v=IvmeUStFvz8",
      "text": "1990s-era Chris Farley sketch"
    },
    {
      "url": "https://www.cnn.com/2023/07/14/weather/what-is-el-nino-xpn",
      "text": "El Niño happens"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/weather/el-nino-global-warming-pacific-ocean",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/weather/el-nino-global-warming-pacific-ocean",
      "text": "Cookie Settings"
    }
  ],
  "hash": "80e1231c1697682fda093f8efd4861e0d59b6302a44006b44bd77fbcb9e71018",
  "scraped_at": "2026-02-18T07:32:06.185021+00:00"
}