{
  "url": "https://lite.cnn.com/2026/02/20/europe/britain-air-base-access-us-iran-intl-hnk-ml",
  "title": "Diego Garcia: Britain blocking use of air bases Trump says would be needed for strikes on Iran, UK media report | CNN",
  "date": "2026-02-23T07:38:43.488638+00:00",
  "authors": [
    "Brad Lendon, CNN"
  ],
  "text": "Source: CNN\n\nBritish Prime Minister Keir Starmer has blocked a request from US President Donald Trump to allow US forces to use UK air bases during any preemptive attack on Iran, saying it could break international law, according to multiple reports in British media citing government sources.\n\nAccording toThe Timesof London, which first reported the split over airbase access, Starmer has denied the use of RAF Fairford in England and Diego Garcia – the British overseas territory in the Indian Ocean – for any strike on Iran.\n\nThe two bases have long served as crucial overseas US military staging posts for operations far from home, with Diego Garcia a key airfield for the US’ heavy bomber fleet.\n\nThe Times reports Britain is concerned that allowing the US to use the bases “would be a breach of international law, which makes no distinction between a state carrying out the attack and those in support if the latter have ‘knowledge of the circumstances of the internationally wrongful act.’”\n\nThe Times cited UK government sources. The BBC, The Guardian and The Telegraph also subsequently published their own reports on the UK blocking access to the bases, citing sources.\n\nThe UK Ministry of Defence declined to comment on what it called operational matters. “There is a political process ongoing between the US and Iran, which the UK supports. Iran must never be able to develop a nuclear weapon, and our priority is security in the region,” a government spokesperson said.\n\nAmerican requests to use UK bases for operational purposes historically have been considered on a case-by-case basis, with precise criteria withheld for security reasons under long-standing agreements.\n\n“All decisions on whether to approve foreign nations’ use of military bases in the UK for operational purposes considers the legal basis and policy rationale for any proposed activity,” Veterans Minister Al Carns wrote in response to questions from independent British member of parliament Jeremy Corbyn, according to a Januaryreport from the UK Defence Journal.\n\nStarmer and Trump held a phone call on Tuesday evening, with readouts saying the two discussed peace in the Middle East and Europe.\n\nThe following day Trump took to his Truth Social platform to withdraw support for a deal that would see sovereignty overthe Chagos Islands, the Indian Ocean chain that is home to the joint US-UK Naval Support Facility Diego Garcia, handed to Mauritius in return for a 99-year lease on the military base.\n\nCNN has approached the White House for comment.\n\nBritain had split the Chagos Islands from Mauritius before that colony gained independence, something that has been a source of diplomatic friction as well as multiple legal battles with locals who were evicted. In 2019, the International Court of JusticeruledBritain should return the islands “as rapidly as possible,” so that they could be decolonized.\n\nAdeal to return themhas been making its way through British government channels since, with London arguing a lease compromise would ward off further expensive and likely futile legal battles while maintaining military access in the Indian Ocean.\n\nAfter initially opposing the UK-Mauritius deal, Trump in early February said it was the “best” Britain could get under the circumstances.\n\nBut as the US has been surging forces into the region for a possible attack on Iran, Trump reversed course, saying in a Truth Social post that Starmer is “making a big mistake” in agreeing to the lease deal with Mauritius.\n\n“Prime Minister Starmer is losing control of this important Island by claims of entities never known of before. In our opinion, they are fictitious in nature,” Trump’s post said.\n\nBut just a day earlier, the US State Department issued a statement saying in part that Washington “supports the decision of the United Kingdom to proceed with its agreement with Mauritius.”\n\nAsked about the discrepancy between the Truth Social post and the State Department statement, White House press secretary Karoline Leavitt said the president’s post should be taken as the “policy” of the Trump administration.\n\nIn his social media post, Trump directly referenced the two UK airbases, cited by British media, as important in a possible strike on Iran.\n\n“It may be necessary for the United States to use Diego Garcia, and the Airfield located in Fairford, in order to eradicate a potential attack by a highly unstable and dangerous Regime,” Trump wrote.\n\nNeither Diego Garcia nor Fairford, the key forward operating base for US strategic bombers in Europe, was used in last June’s one-time B-2 bomberstrike on Iranian nuclear sites. In that case, the stealth bombers flew a round trip of about 37 hours from their home base in Missouri.\n\nBut analysts are expecting that any new US attack on Iran might be a much longer campaign, possibly of weeks or more.\n\nIn such a campaign, having the B-2s, as well as B-1 and B-52 bombers, using bases thousands of miles closer to Iran would enable quicker turnarounds to rearm and refuel for more strikes.\n\nWhile the US may have access to other bases in friendly countries closer to Iran, using them could put its prized heavy bomber fleet in reach of retaliatory Iranian missile strikes.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.thetimes.com/uk/politics/article/trump-chagos-islands-deal-iran-attack-british-bases-kcj0gzbr8",
      "text": "The Times"
    },
    {
      "url": "https://ukdefencejournal.org.uk/uk-approvals-required-for-us-use-of-bases/",
      "text": "report from the UK Defence Journal"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/uk/chagos-islands-diego-garcia-explained-intl",
      "text": "the Chagos Islands"
    },
    {
      "url": "https://www.cnn.com/2019/02/25/asia/uk-chagos-mauritius-intl/index.html",
      "text": "ruled"
    },
    {
      "url": "https://www.cnn.com/2025/05/22/uk/britain-chagos-islands-transfer-block-intl",
      "text": "deal to return them"
    },
    {
      "url": "https://www.cnn.com/2025/06/26/politics/hegseth-caine-iran-strikes",
      "text": "strike on Iranian nuclear sites"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/europe/britain-air-base-access-us-iran-intl-hnk-ml",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/europe/britain-air-base-access-us-iran-intl-hnk-ml",
      "text": "Cookie Settings"
    }
  ],
  "hash": "811af42303cbf0da97e1e1d82ab1b8f017e38319cd909e81f3565f5649b26722",
  "scraped_at": "2026-02-23T07:38:43.488651+00:00"
}