{
  "url": "https://lite.cnn.com/2026/02/26/asia/north-korea-kim-parade-nuclear-intl-hnk",
  "title": "Kim Jong Un vows to strengthen nuclear program, watches military parade with daughter | CNN",
  "date": "2026-02-27T07:16:40.746775+00:00",
  "authors": [
    "Analysis by Will Ripley"
  ],
  "text": "Source: CNN\n\nNorth Korean leaderKim Jong Unpromised to strengthen his country’s nuclear weapons program on Wednesday, before presiding over a nighttime military parade, accompanied by his daughter.\n\nAbout 14,000 troops marched through Kim Il Sung Square in the capital of Pyongyang, state media said. Columns of soldiers were seen goose-stepping under floodlights with fighter jets roaring overhead.\n\nKim’s teenage daughter, widely believed to be named Ju Ae, again appeared prominently at the parade beside her father. But despite speculation in South Korea about her potential grooming as a successor, no new official titles were announced as the once-in-five-years ruling party congress wrapped.\n\nIn his closing remarks at the congress, Kim doubled down on expanding the nation’s nuclear arsenal. He called it the party’s “firm will” to strengthen national nuclear power and increase both the number of weapons and the means to deploy them.\n\nBut at his parade, most military hardware was conspicuously absent. No procession of tanks, no towering intercontinental ballistic missiles (ICBM), no hypersonic glide vehicles, no transporter-erector-launchers rumbling past the cameras.\n\nThe restraint is noteworthy because the Kim regime often uses parades to showcase its most menacing weapons, and state propaganda has been leaning into weapons imagery recently.\n\nJust last week,state media aired footageof Kimappearing to take the wheelof a 600mm multiple rocket launcher – a system North Korea has touted as “nuclear-capable” – with rows of dozens of launch vehicles lined up in striking formation. And only four months ago, North Korea staged a massiverain-soaked military parademarking the ruling party’s 80th anniversary, showcasing what state media called its most powerful ICBM and other new strategic systems.\n\nNorth Korea’s Ninth Workers’ Party Congress, a largely rubber-stamp political gathering of the nation’s elite, also brought personnel changes at the top.\n\nKim’s powerful sister, Kim Yo Jong, was promoted to director of a party department after years in a deputy role, solidifying her standing in the inner circle. Several senior party and military posts were reshuffled, elevating younger loyalists while unanimously “reelecting” Kim as general secretary for another five-year term.\n\nSo why the scaled-back military display this time around? One practical explanation is timing. Parades are expensive, logistically complex, and often used to unveil new and upgraded hardware. Showing the same missiles so soon after a major anniversary event could blunt the impact of their appearance.\n\nBut the broader context suggests something more deliberate. Pyongyang appears to be signaling discipline and political control while keeping its strategic leverage in reserve.\n\nAlongside the promise for more nuclear weapons, Kim also reiterated plans for stronger ICBMs, submarine-launch capabilities, and developments involving drones and artificial intelligence.\n\nAt the same time, Kim left conditional room for talks with Washington, but only on Pyongyang’s terms. Prospects for improved relations, he said, depend entirely on the “US attitude,” implying that Washington would need to accept North Korea’s nuclear status and abandon what the regime has long described as a “hostile policy.”\n\nThe timing may be intentional. US President Donald Trump is preparing for a visit to China from March 31 to April 2, a trip that could reshape regional diplomacy. Some North Korea watchers speculate that a Beijing visit could create a narrow opening for a renewed Trump-Kim dialogue, whether directly or through Chinese mediation.\n\nNotably, Trump made no mention of North Korea during hisState of the Union address. It was a striking omission given how frequently he referenced the country during his first term, particularly around the high-profile summit diplomacy with Kim.\n\nTrump did recognize a 100-year-old Korean War veteran during the speech Wednesday, presentingformer fighter pilot Royce Williamswith the Medal of Honor before a bipartisan round of applause. The tribute underscored the enduring legacy of the war, even as contemporary tensions on the peninsula went unaddressed in the speech.\n\nPyongyang’s leverage looks very different from the summit era of Trump’s first term, largely because of Kim’s deepening partnership with Russia’s Vladimir Putin.\n\nKim and Putin signed a “comprehensive strategic partnership” agreement in June 2024 that includes a mutual defense clause, cementing what both sides portray as a de facto alliance. The relationship has grown more consequential as North Korea’s role in Russia’s war in Ukraine has become central to Pyongyang’s propaganda.\n\nState media has repeatedly shown Kim honoring returning North Korean soldiers who fought for Russia and consoling the families of those killed. The ceremonies are often visibly emotional, with Kim portrayed as a benevolent father figure. Earlier this month, heawarded new apartmentsto some of those families.\n\nAgainst that backdrop, Wednesday’s parade being heavy on troops and light on weapons could be deliberately calibrated for Kim’s domestic audience. The emphasis this time around was on unity, loyalty and readiness, while keeping the most provocative systems off-camera.\n\nThe warning to adversaries still came through. State media quoted Kim saying that any violation of the country’s sovereignty would trigger immediate retaliatory strikes. The familiar threat landed as the US and South Korea announced that their own, possibly toned-down, military drills will return to the calendar next month.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/world/asia/kim-jong-un-fast-facts",
      "text": "Kim Jong Un"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/world/video/north-korean-tv-says-kim-drove-nuclear-capable-launcher-digvid",
      "text": "state media aired footage"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/asia/north-korea-multiple-rocket-launchers-intl-hnk-ml",
      "text": "appearing to take the wheel"
    },
    {
      "url": "https://www.cnn.com/2025/10/11/world/video/north-korea-long-range-missiles-military-parade-digvid",
      "text": "rain-soaked military parade"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/politics/sotu-address-donald-trump",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/2023/01/20/asia/korean-war-fighter-pilot-soviet-shootdown-intl-hnk-ml",
      "text": "former fighter pilot Royce Williams"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/world/video/kim-jong-un-gives-homes-to-fallen-soldiers-north-korea-ripley-hnk-digvid",
      "text": "awarded new apartments"
    }
  ],
  "hash": "814aed15c73e031638798317748ac7ba2ff048eee8c9ccc12bb0cdf1a8e5c27a",
  "scraped_at": "2026-02-27T07:16:40.746789+00:00"
}