{
  "url": "https://lite.cnn.com/2026/02/10/us/ntsb-turbulence-united-1890",
  "title": "Turbulence warning was not relayed to plane before flight attendants were seriously injured | CNN",
  "date": "2026-02-11T16:32:02.958221+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPilots aboard a United Airlines flight where three flight attendants were seriously injured were not warned about turbulence reported by a plane in front of them, the National Transportation Safety Board concluded Tuesday.\n\nUnited Flight 1890 was traveling from Los Angeles to Newark Liberty International Airport on February 10, 2024, when the Boeing 777 aircraft flew into the unstable air as it was descending.\n\nTuesday’sfinal reportconcluded a two-year investigation.\n\nThunderstorms and other severe weather were predicted in the general area, but the plane’s radar and electronic weather instruments did not indicate “significant turbulence activity along their descent path,” the NTSB found.\n\nThree minutes before the incident another plane reported “moderate turbulence” in the same area to an air traffic controller, but the information did not get passed along to the United flight. The controller told the NTSB they did not hear the report.\n\n“The controller did not acknowledge or disseminate this report to other aircraft, including UAL1890, as required by Federal Aviation Administration procedures for Pilot Weather Reports,” the NTSB report said.\n\nThe fasten-seatbelt sign was on and the flight attendants were performing final cabin checks when the plane suddenly dropped, then violently pitched back up.\n\nRadar indicated the wind speed changed by nearly 75 miles per hour within just 4,000 feet.\n\nOne flight attendant was lifted to the celling and then thrown to the floor, fracturing her spine. Two other flight attendants were injured and lost consciousness in the galley, with one having a shattered femur, crushed vertebrae and a head injury. The other had facial cuts and bleeding in their brain.\n\nOther flight attendants and several passengers who did not have seatbelts on also hit the ceiling, including a baby being held on a lap and someone in the lavatory.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://t.co/yD0i0ZJUjS",
      "text": "final report"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/ntsb-turbulence-united-1890",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/us/ntsb-turbulence-united-1890",
      "text": "Cookie Settings"
    }
  ],
  "hash": "815f568832856e3683913c8a5268c7ad463d60067d760364f638980fb4dd4b49",
  "scraped_at": "2026-02-11T16:32:02.958234+00:00"
}