{
  "url": "https://lite.cnn.com/2026/02/23/health/rare-disease-fda-drugs-therapies",
  "title": "FDA proposes new system for approving customized drugs and therapies for rare diseases | CNN",
  "date": "2026-02-24T07:32:06.255063+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nFederal health officials on Monday laid out a proposal to spur development of customized treatments for patients withhard-to-treat diseases, including forrare genetic conditionsthat the pharmaceutical industry has long considered unprofitable.\n\nThe preliminaryFood and Drug Administrationguidelines, if implemented, would create a new pathway for bespoke therapies that have only been tested in a handful of patients due to the challenges of conducting larger studies. The FDA announcement specifically mentionsgene editing, although agency officials said the new approach could also be used by other drugs and therapies.\n\nIt’s a shift long sought by patients, advocates and researchers focused on rare diseases, which often do not fit within the pharmaceutical industry’s business model or the FDA’s traditional drug-approval system.\n\n“It is our priority to remove barriers and exercise regulatory flexibility to encourage scientific advances and deliver more cures and meaningful treatments for patients suffering from rare diseases,”FDA Commissioner Marty Makarysaid in a release.\n\nThe announcement comes a week after Makary said the FDA woulddrop its decades-old standardof requiring two clinical trials for standard drug reviews. That was the latest in a series ofchanges to FDA norms and standards, many which have not gone through federal procedures traditionally used to update agency rules.\n\nSenior FDA officials said the recent changes, including the pathway proposed Monday, don’t constitute new FDA standards. The FDA will take comments on its draft guidance for 60 days, before beginning to finalize it.\n\nIn recent years, academic researchers have shown they can use emerging technology to correct individual defects in a patient’s genetic code. Last year, a team at Children’s Hospital of Philadelphia and the University of Pennsylvaniadesigned a therapyusing CRISPR, the Nobel Prize-winning gene editing tool, to treat a baby born with a rare disease that causes ammonia to build up in the blood.\n\nTraditionally, the FDA requires drugmakers to demonstrate the safety and effectiveness of their experimental treatments in clinical studies that compare a set of patients getting the therapy with others taking a sham treatment or an alternative intervention. The more patients enrolled, the stronger the evidence.\n\nBut for conditions that can affect a tiny fraction of people worldwide, drug companies often have little incentive to invest millions of dollars needed to complete a study and bring it through the FDA approval process, which can take a decade or longer.\n\nThe pathway announced Monday would create a standardized process for authorizing experimental treatments and, importantly, offering companies the possibility of commercializing them.\n\nThe FDA already authorizes the use of experimental drugs under what’s called “compassionate use,” for people with no other medical options. But the process is cumbersome to navigate and strictly prohibits companies or researchers from profiting from treatments that haven’t been vetted by the FDA.\n\nThe new pathway’s name — plausible mechanism — is a reference to criteria FDA regulators will require before greenlighting any experimental therapies.\n\nFDA officials say the approach will be reserved for conditions that are well understood and where there is a plausible reason to think that the therapy will act on the underlying genetic or cellular biology of the disease. Researchers must also confirm that the therapy successfully targeted the patient’s genetic or biological abnormality.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/cholesterol-heart-attack-ldl-gene-editing-crispr-7aa18fea7484be8d3de9e00f3e2b01d6",
      "text": "hard-to-treat diseases"
    },
    {
      "url": "https://apnews.com/hub/gene-therapy",
      "text": "rare genetic conditions"
    },
    {
      "url": "https://apnews.com/hub/us-food-and-drug-administration",
      "text": "Food and Drug Administration"
    },
    {
      "url": "https://apnews.com/hub/gene-therapy",
      "text": "gene editing"
    },
    {
      "url": "https://apnews.com/article/fda-trump-makary-vaccines-ultraprocessed-food-safety-ce9df8eb4bba5c950e500c62d975afe2",
      "text": "FDA Commissioner Marty Makary"
    },
    {
      "url": "https://apnews.com/article/fda-drug-approval-studies-makary-prasad-a5aaa5501ae15f264bbd20d0dffa4dc4",
      "text": "drop its decades-old standard"
    },
    {
      "url": "https://apnews.com/article/fda-makary-voucher-drug-reviews-a3f550f229dc4ed196da9d1a2bc86bc3",
      "text": "changes to FDA norms and standards"
    },
    {
      "url": "https://apnews.com/article/crispr-gene-editing-rare-disease-mutation-chop-penn-4ab95afadde97164ae6c2450d79acbf8",
      "text": "designed a therapy"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/health/rare-disease-fda-drugs-therapies",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/health/rare-disease-fda-drugs-therapies",
      "text": "Cookie Settings"
    }
  ],
  "hash": "83208babeba5266bfd218f77eafcb8c89dfafb8d192267b6bbbc462a72a24884",
  "scraped_at": "2026-02-24T07:32:06.255077+00:00"
}