{
  "url": "https://lite.cnn.com/2026/02/10/climate/climate-change-snow-warming-winter-olympics-disaster",
  "title": "In just 25 years, dozens of places will be too warm to host the Winter Olympics | CNN",
  "date": "2026-02-11T16:40:16.388090+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nJessie Diggins is an endurance athlete. The Olympic cross-country skier describes the intensity of suffering her sport can inflict as a “pain cave.” It doesn’t frighten her; she’s used to digging deep, she can control the pain. What does terrify her, however, is how rapidly her sport is changing because of something completely out of her control: climate change.\n\nShe sees the effects everywhere. “I’ve raced World Cups where it was pouring rain and there was barely a strip of snow to ski on, entire seasons were reshaped overnight,” Diggins said. It’s become impossible to hold a winter sporting event without fake snow, shewrotein a blog.\n\nThe Milan Cortina Winter Games in the Italian Alps, which will mark Diggins’ final Games, are no different. Snowmaking machines were busy pumping out snow for weeks.\n\nAs humans continue to burn planet-heating fossil fuels, winter is changing: Snowfall is declining, snowpack is shrinking and temperatures are rising in many places. Where once mountains were blanketed in thick white powder, many lie bare well into winter.\n\nFor those who rely on snow for their livelihoods, every ski season is a nail-biter. For the Winter Olympics, it’s a high-cost, high-stress disaster. Climate change is “reshaping winter sport as we know it,” said a spokesperson for the International Olympic Committee.\n\nAs athletes compete in Italy, the future of the Winter Olympics hangs in the balance. People are not just questioning how to keep the Games alive, but whether theyshould be kept alive at all.\n\nThe Games have changed hugely since the first Winter Olympics, held in France in 1924. Back then, almost all events happened outside, but by the 1980s, sports including ice skating, hockey and curling had moved to indoor rinks, where perfect ice could be guaranteed.\n\nSnow and cold conditions have become increasingly unreliable. February temperatures in every Olympic host city since 1950 have warmed by an average of4.8 degreesFahrenheit (2.7 Celsius), according todatafrom research non-profit Climate Central.\n\nThis year’s Winter Olympics take place in venues across the Italian Alps, with several outdoor events centered around the town of Cortina d’Ampezzo, which previously hosted the Olympics in 1956. In the 70 years since, February temperatures in the town have risen by 6.4 degrees Fahrenheit (3.6 Celsius).\n\nThat translates to around 41 fewer days below freezing each year. Without reliably cold temperatures, snow is wetter and thinner, conditions are rainier — and for athletes that can be dangerous.\n\nAt the 2014 Winter Olympics in Sochi, Russia, warm temperatures were blamed in part forhigh crash and injury rates. “It was like skiing in a slushy,” said Daniel Scott, a professor of geography and environmental management at the University of Waterloo. “People weren’t hitting jumps at the speeds they anticipated. They weren’t getting to landing areas properly,” he told CNN.\n\nAs the world warms, the pool of potential locations for the Games is shrinking rapidly.\n\nIn 2024, scientistsanalyzed93 past and potential hosts for the Winter Olympics and Paralympics, focusing on whether they would have temperatures at or below freezing and be able to reliably deliver thick snow depths.\n\nThey found that even if countries live up to their climate policies and pledges, only 52 of these locations would be suitable for the Games by the 2050s.\n\nThe situation is even more dire for the Paralympics, typically held later in the season in the same location. Only 22 sites would have reliable climate conditions by mid-century, the study found. If humans opt to burn more fossil fuels and increase climate pollution, that number drops to just four.\n\nEven in cities the analysis deemed “climate reliable,” Mother Nature would need a helping hand, said Waterloo’s Scott, an author on the study. By 2050, just four could likely host with natural snow: Niseko in Japan; Terskol in Russia; and Val d’Isère and Courchevel in France.\n\nUnless we address climate change, “the possibility of having Winter Olympics is literally melting away,” said Kaitlyn Trudeau, senior research associate for climate science at Climate Central.\n\nA dearth of snow is the most visible sign of our fast-changing winters.\n\nMuch of the western US haslanguished in snow droughtthis winter due to unusually warm temperatures — meaning a slow start to the ski season and fears for summer water supplies. Salt Lake City, set to hold the 2034 Winter Olympics, saw just 0.1 inches of snow in January, more than 30 below average.\n\nSnowpack in most of the Northern Hemisphere has shrunk significantly over the past 40 years due to climate change, according to a 2024 Naturestudy,which found the sharpest declines, between 10% to 20% a decade, in the Southwestern US and large parts of Europe.\n\nThe relationship between warming temperatures and snow decline is not linear. Everything can seem OK until it very much isn’t, said Justin Mankin, a climate scientist and associate professor of geography at Dartmouth College and an author of the study.\n\nOnce average winter temperatures hit minus-8 degrees Celsius (17 Fahrenheit), snow loss accelerates rapidly even with modest increases in warming, the researchers found. Places can quickly fall off a “snow-loss cliff,” they said.\n\nWhere Mother Nature fails to provide snow, human technology can step in — to a point.\n\nManufactured snow wasfirst usedat the 1980 Games in Lake Placid, New York. Beijing, which held the 2022 Winter Olympics, relied almost entirely on snowmaking.\n\nFor this year’s Olympics, organizers said they will make nearly2.4 million cubic meters of snow, requiring around 250 million gallons of water, enough to fill nearly 380 Olympic-sized swimming pools.\n\nBut even this technology has weather-defined limits. Snow-making machines require low temperatures and relatively dry air — both in short supply due to climate change.\n\nMachine-made snow made in advance of the 2010 Vancouver Olympics melted as the city experienced a record warm January, forcing organizers to scramble trucks and helicopters to bring in more.\n\nThere have been nail-biting moments in Italy. In December, temperatures were so warm, venues could only produce snow during the night, International Ski and Snowboard Federation president Johan Eliaschtold Reuters.\n\nCritics also point to the high energy and water needs of snowmaking, which risk exacerbating the very problem it’s trying to solve.\n\nSnowmaking specialist TechnoAlpin, which is supplying this year’s Winter Olympics, said technology has advanced significantly over recent decades, reducing energy demand and water consumption. “The water used for snowmaking remains entirely within the natural water cycle,” a spokesperson told CNN.\n\nFor Scott, snowmaking is an important adaptation, it just needs to be as sustainable as possible. “Abandoning snowmaking would result in a major increase in unfair and unsafe conditions for athletes, cancelled competitions and eventually a Winter Games without any snow sports,” he said.\n\nBut for others, machine-made snow is a symbol of the fundamental unsustainability of the Winter Olympics.\n\nThe emphasis should be less about how climate change is affecting the Winter Olympics and more about how the Games are affecting climate change, said Carmen de Jong, a hydrology professor at the University of Strasbourg. “How responsible is it still to force Olympic Games under climate change and waning water resources?” she asked.\n\nOne proposal for adapting the Winter Games to a warmer world is to merge the Olympics and Paralympics, although this could make the event unwieldy.\n\nAnother option would be keeping the events separate but moving them earlier in the year. This would make a huge difference for the Paralympics in particular, Scott said.\n\nThe International Olympic Committee said it’s developing a more “flexible” approach. “No single city needs to host everything anymore. The Games must adapt to the hosts,” a spokesperson for the IOC said. And from 2030, climate action will be “a contractual requirement for future hosts,” which will have obligations to minimize planet-heating pollution and protect the environment.\n\nWhat happens to the Winter Olympics is by no means the biggest concern posed by declining snow.\n\nSnow is a reservoir, Mankin said. It stores water in winter and releases it in the spring and summer, providing vital supplies for drinking water, farming and generating hydroelectric power. For the billions who rely on snow for water, its loss is an existential crisis.\n\nBut the Winter Olympics — a big, flashy global event — can draw huge public attention to the ways humans are fundamentally reshaping winter. Winter athletes are “seeing the impacts firsthand,” Olympic skier Diggins told CNN. “Climate change isn’t theoretical; it’s happening on our racecourses and in our training every day. … It’s not just about winter sports, it’s about protecting winter itself.”\n\nIt affects everyone who enjoys the snow, said Mankin, whose children love cross-county skiing. They are still little, and whether they might choose to follow Diggins’ path remains to be seen, but he fears the impacts of the loss of winters as we knew them.\n\n“To have (skiing) go from something my kids could do any day of the week in wintertime… to something that is much more rare and variable is a real tragedy,” he said. “We miss something about the world and a way to be together in it.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://protectourwinters.org/with-a-medal-in-my-pocket/",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/europe/italy-protests-rail-damage-latam-intl",
      "text": "should be kept alive at all"
    },
    {
      "url": "https://www.climatecentral.org/climate-matters/warming-winter-olympics",
      "text": "4.8 degrees"
    },
    {
      "url": "https://www.climatecentral.org/climate-matters/2026-warming-winter-olympics",
      "text": "data"
    },
    {
      "url": "https://research.brighton.ac.uk/en/publications/high-incidence-of-injury-at-the-sochi-2014-winter-paralympic-game/#:~:text=In%20a%20Winter%20Paralympic%20Games,in%20future%20Winter%20Paralympic%20Games.",
      "text": "high crash and injury rates"
    },
    {
      "url": "https://www.tandfonline.com/doi/full/10.1080/13683500.2024.2403133#abstract",
      "text": "analyzed"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/climate/snow-drought-west-water-colorado-river",
      "text": "languished in snow drought"
    },
    {
      "url": "https://www.nature.com/articles/s41586-023-06794-y",
      "text": "study,"
    },
    {
      "url": "https://www.guinnessworldrecords.com/world-records/first-olympic-use-of-artificial-snow",
      "text": "first used"
    },
    {
      "url": "https://apnews.com/article/milancortina-winter-olympics-climate-628ab56e90e89bc02a8a051fee89589a",
      "text": "2.4 million cubic meters of snow"
    },
    {
      "url": "https://www.reuters.com/sports/pressure-builds-milano-cortina-organisers-amid-climate-concerns-funding-issues-2025-12-23/",
      "text": "told Reuters"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/climate/climate-change-snow-warming-winter-olympics-disaster",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/climate/climate-change-snow-warming-winter-olympics-disaster",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8324ab24808bdd9de310daa0ea3031ec7943bab6c05100d5cab5147334cb85de",
  "scraped_at": "2026-02-11T16:40:16.388103+00:00"
}