{
  "url": "https://lite.cnn.com/2026/02/19/politics/douglas-wilson-pastor-pentagon-service-christian-nationalism",
  "title": "Hegseth invited pastor who calls for Christian theocracy to lead Pentagon prayer service | CNN Politics",
  "date": "2026-02-21T07:05:24.383669+00:00",
  "authors": [
    "Kaanita Iyer",
    "Haley Britzky",
    "CNN"
  ],
  "text": "Source: CNN\n\nA controversial pastorwho supports repealing women’s right to voteand believes homosexuality should be a crime led a worship service at the Pentagon this week, saying he was invited byDefense Secretary Pete Hegseth.\n\nDuring a 15-minute sermon in the Pentagon’s auditorium and broadcast live on the department’s internal TV network, Douglas Wilson delivered a sermon sprinkled with military-themed jokes about putting Jesus Christ first and what Jesus can accomplish through believers.\n\n“God can do what he likes, and as we should know by now, what he likes to do is to take the most unlikely materials and do something glorious with it,” Wilson said, according to video of the sermon obtained by CNN. “Take a prayer meeting at the Pentagon for a possible example. Many stranger things have happened. God is great.”\n\nA source who attended the service told CNN Wilson’s message was “pretty vanilla” and steered clear of political rhetoric. Attendees didn’t hear Wilson’s stance on women in the military and in combat.\n\nThe service from Wilson, a self-described Christian nationalist, was part of a regular monthly Christian worship series Hegseth started at the department last summer that critics say has underscored the erosionof the separation of church and stateunder the Trump administration.\n\nThe pastor, who founded his church in Moscow, Idaho, in the 1970s and has since grown it to a network of more than 150 churches internationally, is part of anascendant group of Christian religious leadersfinding influence among MAGA conservatives. Hegseth is the pastor’s most prominent and public follower in the Trump administration.\n\nWilson has publicly described his belief in a patriarchal society where women are expected to submit to their husbands and supports repealing the 19th Amendment granting women the right to vote. Women are banned from leadership positions in his church and are not allowed to vote in congregational decisions.\n\nHe has also advocated for the idea that the US should adopt a Christian theocracy and adhere to a biblical interpretation of society.\n\nThe Pentagon said in a statement to CNN on Friday, “Secretary Hegseth, along with millions of Americans, is a proud Christian and was glad to welcome Pastor Wilson to the Pentagon on Tuesday.”\n\n“The Christian faith is woven deeply into the fabric of our nation and shared by America’s wartime leaders like President George Washington, who prayed for his troops at Valley Forge, and President Franklin D. Roosevelt, who gifted Bibles to America soldiers during WW2 and encouraged them to read it,” Pentagon press secretary Kingsley Wilson added in the statement. “Despite the Left’s efforts to remove our Christian heritage from our great nation, Secretary Hegseth is among those who embrace it.”\n\nHegseth is a member of one of Wilson’s churches in Tennessee and has said he moved to the state in 2022 to send his kids to a school that’s part of a Christian network that Wilson helped found.\n\nIn a previous statement to CNN, Pentagon spokesperson Sean Parnell said: “The Secretary is a proud member of a church affiliated with the Congregation of Reformed Evangelical Churches, which was founded by Pastor Doug Wilson. The Secretary very much appreciates many of Mr. Wilson’s writings and teachings.”\n\nThe Pentagon’s rapid response X accountposted photosconfirmingWilson’s attendance on Tuesday.\n\nHegseth joined Wilson on stage after his sermon, but said he had been running from another meeting and missed the pastor’s remarks.\n\nKris Fuhr, co-founder of the Women in the Service Coalition, said bringing Wilson to the Pentagon was “beyond inappropriate” given his well-established views on the treatment of women and women in the military.\n\n“It was an absolute insult to everyone that room, that someone who represents views that are a total 180 from Army values would be allowed to speak at a denominational-specific, Christian religious service in the Pentagon,” Fuhr said. “When you have a secretary of defense who is so strongly influenced by someone who thinks only white men are worthy, you now have a Secretary of Defense who is not looking for the best and the brightest across his entire talent pool.”\n\nThe source who attended the sermon said this is a “totally voluntary prayer service” and that Wilson is “one of many (preachers) over the last year who have come from several different Protestant denominations.”\n\nThey said there are services for other religions and that they’ve seen Jewish and Buddhist services advertised as well.\n\nThe Pentagon is one of several government agencies that have moved to open meetings with a prayer, host regular faith services and post Bible verses and Christian imagery on social media since President Donald Trump returned to office last year.\n\nWhen asked Thursday aboutHegseth’s monthly prayer serviceand criticism that it is eroding the longstanding tradition of separation of church and state, Wilson told CNN, “The actions taken by the Secretary of War in starting this prayer service are disrupting the ‘longstanding separation of church and state,’ but only if ‘longstanding’ is limited to recent decades.”\n\n“From the Founding of the republic it was not so,” Wilson added. “Worship services used to be held in the Capitol building, starting before the building was completed, and lasting up until the Civil War. Worshipers in that place included such worthies as Jefferson and Madison.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/07/politics/pastor-doug-wilson-christian-domination-trump",
      "text": "who supports repealing women’s right to vote"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/pete-hegseth-political-speech-christian-convention-nashville",
      "text": "Defense Secretary Pete Hegseth"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/trump-religious-liberty-commission-church-state-separation",
      "text": "of the separation of church and state"
    },
    {
      "url": "https://www.cnn.com/2025/08/08/politics/video/christian-nationalist-doug-wilson-pam-brown-digvid",
      "text": "ascendant group of Christian religious leaders"
    },
    {
      "url": "https://x.com/DOWResponse/status/2023872979554509109?s=20",
      "text": "posted photos"
    },
    {
      "url": "https://www.cnn.com/2025/08/07/politics/pastor-doug-wilson-christian-domination-trump",
      "text": "Wilson"
    },
    {
      "url": "https://www.cnn.com/2025/05/21/politics/hegseth-pentagon-christian-prayer-service",
      "text": "Hegseth’s monthly prayer service"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/douglas-wilson-pastor-pentagon-service-christian-nationalism",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/douglas-wilson-pastor-pentagon-service-christian-nationalism",
      "text": "Cookie Settings"
    }
  ],
  "hash": "835d9512b2c6a9bc0ea907cae29fe57018ecbe28cb49ee6adbdf262b79b9192f",
  "scraped_at": "2026-02-21T07:05:24.383681+00:00"
}