{
  "url": "https://lite.cnn.com/2026/02/10/business/retail-sales-december",
  "title": "Americans kept their shopping flat in December, as wage growth cooled | CNN Business",
  "date": "2026-02-11T16:32:29.811049+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe US economy’s engine may be starting to sputter, as Americans’ paychecks lose steam and their debt becomes even more unwieldy, new data showed Tuesday.\n\nRetail sales were unexpectedly flat in the crucial holiday month of December, the Commerce Department said, well below the 0.4% gain economists predicted in a FactSet poll. By comparison, retail sales rose a solid 0.6% in November.\n\nAlso, in the fourth quarter, Americans’ wages grew at the weakest pace in more than four years and a greater share of households fell further behind on their debt, according toseparate reportsout Tuesday.\n\nTaken together, the data suggests that the world’s largest economy ended last year on shaky footing in the face of ongoing affordability concerns. Still, economists widely expect bigger tax returns and the Federal Reserve’s string of interest-rate cuts last year to drive growth.\n\n“There has been a lot of damage done the last few years to household finances – with rising inflation, rising cost of living pressures, rising interest rates,” Ted Rossman, principal analyst at Bankrate, told CNN in an interview. “It was like (consumers) were treading water for a while… but the dam is breaking.”\n\nRetail sales declined across most of the categories tracked by the Commerce Department in December. Furniture stores and specialized, niche stores, such as florists, saw the largest drops in sales — both declining by 0.9%. (This data is adjusted for seasonal swings but not inflation.)\n\nMeanwhile, retail spending edged higher in a handful of categories, rising the most at home improvement stores (1.2%.)\n\nA measure that strips out volatile sales — such as building materials and gasoline — and gives a better indication of underlying demand fell 0.1% in December, according to FactSet, well below the 0.4% advance economists had predicted. It’s a key figure economists refer to as the “retail sales control group.”\n\nThe latest data underscores how US consumers have been under pressure in recent months. Over the past year, hiring in the United Stateshas slowed to a crawl, people’s feelingsabout the economy have crumbledandinflation has remained stubbornly elevated.\n\nDecember’s retail-sales figures, delayed because of last year’s government shutdown, came as Americans’ pay gains slowed to the weakest pace in more than four years, according to a separate report released Tuesday from the Bureau of Labor Statistics.\n\nThe Employment Cost Index, which measures changes in wages and benefits, rose 0.7% during the last three months of 2025, marking the slowest quarterly increase since 2021, BLS data showed.\n\nLower-income consumers are under even greater financial pressures. Well-to-do households are seeing their wealth increase and are powering spending, while lower- and middle-income households are experiencing increased strain. Economists have called this dynamic theK-shaped,two-laneorwindchilleconomy.\n\nLower- and middle-income Americans have leaned more heavily on credit cards and other loans to help them try to keep up asmany aspects of life grow increasingly unaffordable.\n\nBut a growing share of American households are finding it increasingly difficultto pay downbloated credit card bills, to keep up withpricey car payments, to makestudent loan payments, and to have enough money in the bank to cover their monthly mortgage check.\n\nThe percent of auto loan and credit card balances that were seriously delinquent (90 days or more late) were the highest in roughly 15 years, according to the latest household debt and credit report from the Federal Reserve Bank of New York.\n\nThe report, released Tuesday, also showed that newly delinquent mortgages (30 days past due) were the highest in 10 years. The delinquencies are most pronounced in lower-income zip codes, New York Fed researchers noted.\n\nThe opposite is true for those in the highest-income zip codes.\n\nThe latest debt data doesn’t yet raise red flags about overall consumer health however, it does show that some people are really struggling, which could ultimately negatively impact the economy, Justin Begley, an economist at Moody’s Analytics, told CNN in an interview.\n\nIf the delinquencies and defaults that wreak havoc on the individual level start to affect wider swathes of Americans, that can eventually boil up to negatively impact consumer spending, he said. Consumer spending accounts for two-thirds of economic growth.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/economy/us-jobs-report-final-december",
      "text": "has slowed to a crawl"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/economy/us-consumer-confidence-january",
      "text": "about the economy have crumbled"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/economy/us-cpi-consumer-prices-inflation-december",
      "text": "inflation has remained stubbornly elevated"
    },
    {
      "url": "https://www.cnn.com/2025/09/18/business/us-k-shaped-economy-spending",
      "text": "K-shaped"
    },
    {
      "url": "https://www.cnn.com/2025/10/31/business/k-shaped-economy",
      "text": "two-lane"
    },
    {
      "url": "https://www.cnn.com/2025/12/27/business/video/windchill-economy-united-states-rising-prices-vrtc",
      "text": "windchill"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "Cookie Settings"
    }
  ],
  "hash": "83b80e7cc327a640d9978fdc02ecb4996a95a0a312824c930dc5f64f11d67ccb",
  "scraped_at": "2026-02-11T16:32:29.811061+00:00"
}