{
  "url": "https://lite.cnn.com/2026/02/21/middleeast/iran-students-university-protest-intl-hnk",
  "title": "Iranian students hold protests as new university term begins | CNN",
  "date": "2026-02-22T07:09:10.151854+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nStudents held protests at several Iranian universities at the start of a new semester on Saturday, some clashing with pro-government groups, according to local news agencies and posts on social media.\n\nThe protests coincided with ceremonies traditionally held after 40 days to mourn those killed by security forces during last month’s anti-government demonstrations, which saw thousands lose their lives in the worst domestic unrest, opens new tab since Iran’s 1979 Islamic Revolution.\n\nA video purportedly showed rows of marchers at Tehran’s Sharif University of Technology condemning Supreme Leader Ayatollah Ali Khamenei as a “murderous leader,” and calling for Reza Pahlavi, the exiled son of Iran’s toppled shah, to be a new monarch.\n\nState-affiliated news agencies such as SNN carried videos of clashes, with protesters allegedly injuring volunteer student Basij militia by throwing rocks at Iran’s top engineering university. Pro-government Basij members often assist security forces in quelling protests.\n\nProtests were also held in Beheshti and Amir Kabir universities in the capital Tehran and Mashhad University in the northeast, according to videos published by rights group HAALVSH, which Reuters could not verify.\n\nIn the western town of Abdanan, a hotspot for protests, demonstrators chanted “Death to Khamenei” and “Death to the dictator” after the arrest of an activist teacher, according to rights group Hengaw and social media posts.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/middleeast/iran-students-university-protest-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/middleeast/iran-students-university-protest-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "83cbdf0878448b34e357e6fcd3e2be6eaef0c2fd1c1762278fcc9cfdfa9756d5",
  "scraped_at": "2026-02-22T07:09:10.151865+00:00"
}