{
  "url": "https://lite.cnn.com/2026/02/10/europe/two-arrested-highway-heist-italy-intl",
  "title": "Italy highway heist: Two arrested in Italy after armed highway robbery on security truck | CNN",
  "date": "2026-02-11T16:39:49.828807+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nTwo men are set to appear incourt in Italyfollowing a dramatic armed robbery on an armored security truck on a highway on Monday.\n\nA masked gangattacked the vehicle with Kalashnikov rifles and robbed a student of her car as they tried to escape in a heist attempt that concluded in a firefight with the Carabinieri, the Italian police.\n\nThe group, composed of at least six people, fired several shots at the Carabinieri, with one officer sustaining an injury.\n\nItaly’s Defense Minister Guido Crosetto describedthe event as “a bloody incident, with an exchange of fire, and an absolute priority: protecting the community endangered by the madness of criminals.”\n\nCrosettocongratulatedthe officers on their effective response. “Sincere thanks to all the men and women in uniform who, every day, defend us and ensure the safety of our country,” he saidin a statement.\n\nThe gang stopped a vehicle in the road in front of the armored truck belonging to security company Battistolli, before setting it on fire, forcing traffic to stop.\n\nThe security companydescribed the widely shared footage of the incident as shocking, adding, “We express our closeness and solidarity to our colleagues, the bystanders involved, and their families.”\n\nIt highlighted a surge in incidents of this nature, and called for more to be done to improve security. “In the last two years, the Battistolli Group has suffered 14 attacks, a situation that requires attention and concrete action,” it said.\n\nThe suspects, two men aged 38 and 62, will be charged with a range of offensesincluding attempted murder, aggravated robbery and possession of war weapons, according to Italy’s public broadcaster RAI. The injured officer is still being treated in hospital, it added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/europe/italy-femicide-law-intl-hnk",
      "text": "court in Italy"
    },
    {
      "url": "https://www.cnn.com/2025/12/20/europe/italian-police-arrests-drugs-intl",
      "text": "A masked gang"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/europe/two-arrested-highway-heist-italy-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/europe/two-arrested-highway-heist-italy-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "83e529c272f7f0323f140db4bae7e9cc830bd7c9baba04fe09e29755514ad484",
  "scraped_at": "2026-02-11T16:39:49.828820+00:00"
}