{
  "url": "https://lite.cnn.com/2026/02/23/politics/aileen-cannon-jack-smith-special-counsel-volume-2-trump-documents",
  "title": "Judge Aileen Cannon bars the release of special counsel report on Trump’s handling of classified documents | CNN Politics",
  "date": "2026-02-24T07:32:04.177369+00:00",
  "authors": [
    "Devan Cole, CNN"
  ],
  "text": "Source: CNN\n\nSpecial counsel Jack Smith’s final report on Donald Trump’s alleged mishandling of classified records and obstruction of justice at Mar-a-Lago after his first term will not be released, a Trump-appointed judge in Florida ruled Monday.\n\nThedecisionby US District Judge Aileen Cannon, who threw out the case Smith brought against the president before he was re-elected, is a major win in Trump’s efforts to keep the special counsel’s findings forever hidden from public view.\n\nSmith had turned over his final, two-volume report to then-Attorney General Merrick Garland before he left his post in early 2025. The first part of the report, which detailed Trump’s alleged efforts to overturn the results of the 2020 election, was released before Trump returned to the White House. But a legal fight waged by Trump and his co-defendants in the case kept the second part of that report under seal.\n\nCannon said in her 15-page ruling that “it is certainly not customary” for a prosecutor whose case was thrown out to later be allowed to “publicly disseminate large swaths of discovery generated in the case.”\n\n“The Court strains to find a situation in which a former special counsel has released a report after initiating criminal charges that did not result in a finding of guilt, at least not in a situation like this one, where the defendants contested the charges from the outset and still proclaim their innocence,” she wrote.\n\nCannon, who concluded in 2024 that Smith was unlawfully serving as special counsel, went on to chide him for even writing the report in the first place, saying it violated her earlier decisions putting an end to the work of his office on the classified documents matter.\n\n“The Court need not countenance this brazen stratagem or effectively perpetuate the Special Counsel’s breach of this Court’s own order,” she wrote.\n\nCannon declined a request from two of Trump’s former co-defendants in the case to order the report to be destroyed.\n\nTrump’s personal attorney, Kendra Wharton, said in a statement that Cannon was right to “permanently prohibit the release of Volume II of Jack Smith’s illegal report,” adding that “all fruit of Smith’s poisonous tree should be treated accordingly and should never see the light of day.”\n\nTransparency around Smith’s final report on the South Florida federal case against Trump and two of his employees, called Volume II, is still being tested in appeals brought by public transparency groups.\n\nOne of those groups, American Oversight, said Cannon’s latest ruling “continues a troubling pattern of decisions that shield the president from public scrutiny and place secrecy above the public’s right to know.”\n\n“American taxpayers funded this investigation, and they have a right to know what their government uncovered, particularly on matters of national security,” Chioma Chukwu, the group’s executive director, said in a statement.\n\nThis story has been updated with additional statements.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.documentcloud.org/documents/27354699-cannon-ruling-on-jack-smith-report-vol-2/",
      "text": "decision"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/aileen-cannon-jack-smith-special-counsel-volume-2-trump-documents",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/aileen-cannon-jack-smith-special-counsel-volume-2-trump-documents",
      "text": "Cookie Settings"
    }
  ],
  "hash": "84ccee401459fcdfcd571e7a0efdedd082d512d02f470fe4736298eb3787013b",
  "scraped_at": "2026-02-24T07:32:04.177383+00:00"
}