{
  "url": "https://lite.cnn.com/2026/02/18/business/epstein-files-ceo-resign",
  "title": "‘This is not over.’ Corporate America’s Epstein reckoning gathers steam | CNN Business",
  "date": "2026-02-19T07:31:45.332088+00:00",
  "authors": [
    "Matt Egan, CNN"
  ],
  "text": "Source: CNN\n\nA growing wave of business leaders has had their careers derailed after the recent release of millions of files linked to convicted sex offender Jeffrey Epstein.\n\nCorporate America initially saw limited ramifications after the US Justice Department wasforced to release some of the Epstein documentsin late December.\n\nBut now, after subsequent disclosures have revealed Epstein’s cozy relationships with captains of industry, the resignations are gaining momentum.\n\nBillionaireTom Pritzker on Monday joinedthat list of business leaders stepping down from power. The executive chairman of Hyatt Hotels blamed the “terrible judgment” he exercised in keeping ties with Epstein and Ghislaine Maxwell.\n\nPritzker’s exit follows last week’s resignation bytop Goldman Sachs lawyer Kathy Ruemmler, who faced mountingscrutiny over personal messageswith Epstein and gifts he’d given her.\n\n﻿Those corporate leaders have not been accused of wrongdoing, but questions of judgment and of their relationships with Epstein were enough to cost them their positions.\n\nAnd there are likely more revelations and resignations to come, given the millions of documents spanning many years in the files released.\n\n“This is not over. This is just the tip of the iceberg. We’re going to see more prominent people get implicated,” said Bill George, an executive fellow at the Harvard Business School who previously served on the board of directors at Goldman Sachs, ExxonMobil, Target and other companies.\n\nThe fallout in the business world from the recent Epstein files has been slow – but faster than in government.\n\nSome former business leaders now in the Trump administration have faced questions over their ties to Epstein. For instance, emails revealed thatCommerce Secretary Howard Lutnick communicated with Epsteinmore than a decade after he previously claimed to have cut off all contact with the convicted sex offender.\n\nAlthough Lutnick’s ties to Epstein have irked some on Wall Street, there is nothing to indicate that the Cabinet secretary and personal friend of President Donald Trump will face any repercussions inside the White House.\n\n“Markets respond faster than the political world. They can act faster than waiting for the next election cycle,” said Nell Minow, chair of ValueEdge Advisors, which counsels institutional investors. “I don’t think there’s a public company board in America that isn’t doing searches through Epstein documents to make sure no one connected to the company is mentioned.”\n\nMinow said there are a few “third-rail issues” that will likely cause immediate departures in the corporate world.\n\n“The first category is if you lied about it – we’ll call that the Lutnick rule – where you specifically said things that turned out to be lies,” Minow said.\n\nLutnick has not been accused of any wrongdoing related to Epstein.\n\n(A Commerce Department spokesperson told CNN in a statement last week that the focus on Lutnick is “nothing more than a failing attempt by the legacy media to distract from the administration’s accomplishments.” The spokesperson said Lutnick and his wife had “very limited interactions” with Epstein after meeting him in 2005.)\n\nAnother category that would likely unnerve boards of directors, according to Minow, is close ties with Epstein following his controversial 2008 guilty pleato procuring a minor for prostitution.\n\n“There will be more revelations and more departures – voluntary or involuntary,” Minow said.\n\nHeads started to roll in the business world in 2021, whenApollo Global Management CEO Leon Blackand Barclays CEOJes Staley both stepped downbecause of their ties to Epstein.\n\nDuring this more recent round of Epstein disclosures, Larry Summers, the former president of Harvard University and Treasury secretary in the Clinton administration, was among the first business leaders to experience professional blowback.\n\nSummers announced in November hewould pause all public engagementsafter emailsreleasedby a House committee showed years of personal correspondence between the famed economist and Epstein. Summers said he was “deeply ashamed” about his ties to Epstein.\n\nThe Epstein files have forced boards of directors to protect their companies’ reputation.\n\n“It’s a very explosive, toxic issue. Companies are doing damage control, but the damage is very real,” said Daniel Kinderman, a professor at the University of Delaware who studies business and politics.\n\nThe risk for companies is that an executives’ links to Epstein could harm the bottom line by turning off customers and clients and demoralizing the workforce, making it harder to attract and retain talent.\n\nFor example, media scrutiny and social media attention around an executive’s relationship with Epstein could cost a Wall Street bank a lucrative role advising on an IPO or a mega merger.\n\n“Americans are divided on almost everything politically, but there is agreement that association with Epstein is bad. It’s bad for customers, bad for recruiting,” said Kinderman.\n\nFacing a backlash over his appearance in the Epstein files, prominent entertainment and sports agentCasey Wasserman put his talent agency up for saleFriday. Wasserman, who is also chair of the 2028 Los Angeles Olympics, said in a memo to staff that he had become a “distraction” to the company’s “efforts.” Wasserman rode on Epstein’s plane and exchanged suggestive messages with Maxwell, the files the DOJ released show.\n\nBrad Karp, then-chairman of prestigious corporate law firm Paul Weiss,abruptly resignedfrom his post earlier this month amid a firestorm over his email exchanges with Epstein. Karp, one of the most powerful lawyers in the nation, explained his decision by saying that “recent reporting has created a distraction and has placed a focus on me that is not in the best interests of the firm.”\n\nPritzker, the billionaire Hyatt executive, similarly blamed his retirement on a desire to shield the company’s brand.\n\n“Good stewardship also means protecting Hyatt, particularly in the context of my association with Jeffrey Epstein and Ghislaine Maxwell which I deeply regret,” Pritzker said in his Monday statement.\n\nAfter month of standing by Ruemmler, Goldman Sachs CEO David Solomon accepted hisgeneral counsel’s resignation last week.\n\n“My responsibility is to put Goldman Sachs’ interests first,” Ruemmler said in her statement. She has saidpreviously and repeatedlythat she regrets ever knowing the convicted sex offender.\n\nGeorge, the former Medtronic CEO, said he had not discussed the Ruemmler controversy with his former colleagues at Goldman Sachs but that it was a “painful” decision they had to make.\n\n“The Goldman board and CEO did the right thing. They had no real choice,” George said.\n\nThe Epstein fallout has also spread overseas.\n\nSultan Ahmed bin Sulayem wasreplaced last week as head of Dubai-based DP World, one of the world’s largest port operators, following revelations of his ties to Epstein.\n\nMorgan McSweeney, thechief of staffto British Prime Minister Keir Starmer, resigned earlier this month, saying he took “full responsibility” for advising Starmer to appoint Peter Mandelson as UK ambassador to the United States despite his links to Epstein. Starmer himself haspushed backagainst calls for his own resignation over Mandelson’s appointment.\n\nGeorge said it’s crucial that boards of directors hold the powerful accountable in the Epstein scandal.\n\n“Unfortunately, all of this is making the case that elites have protection,” he said. “We should not treat the elites differently from other people. CEOs must meet the highest standard of behavior.”\n\nKinderman, the Delaware professor, said the Epstein files have contributed to a wider backlash against the rich and powerful.\n\n“The Epstein circle is wider than many thought,” he said. “People have every right to be angry at how deep the rot is at the top of society.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/jeffrey-epstein-files-released",
      "text": "forced to release some of the Epstein documents"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hyatt-pritzker-retire-epstein",
      "text": "Tom Pritzker on Monday joined"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-resigns-goldman-sachs-epstein-fallout",
      "text": "top Goldman Sachs lawyer Kathy Ruemmler"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-golman-sachs-epstein-ties-invs-vis",
      "text": "scrutiny over personal messages"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/howard-lutnick-epstein-ties-trump",
      "text": "Commerce Secretary Howard Lutnick communicated with Epstein"
    },
    {
      "url": "https://www.cnn.com/2024/07/01/us/jeffrey-epstein-grand-jury",
      "text": "to procuring a minor for prostitution"
    },
    {
      "url": "https://www.cnn.com/2021/03/22/investing/leon-black-apollo-epstein",
      "text": "Apollo Global Management CEO Leon Black"
    },
    {
      "url": "https://www.cnn.com/2021/11/01/business/barclays-ceo-jes-staley-epstein/index.html",
      "text": "Jes Staley both stepped down"
    },
    {
      "url": "https://www.cnn.com/2025/11/17/politics/elizabeth-warren-larry-summers-harvard-epstein",
      "text": "would pause all public engagements"
    },
    {
      "url": "https://www.cnn.com/2025/11/13/politics/what-to-know-epstein-estate-documents",
      "text": "released"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/casey-wasserman-talent-agency-epstein-maxwell",
      "text": "Casey Wasserman put his talent agency up for sale"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/brad-karp-resigns-chair-paul-weiss-epstein",
      "text": "abruptly resigned"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-golman-sachs-epstein-ties-invs-vis",
      "text": "previously and repeatedly"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/business/dp-world-sultan-sulayem-epstein-intl",
      "text": "replaced last week as head of Dubai-based DP World"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/uk/morgan-mcsweeney-resigns-mandelson-epstein-intl",
      "text": "chief of staff"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "pushed back"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/business/epstein-files-ceo-resign",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/business/epstein-files-ceo-resign",
      "text": "Cookie Settings"
    }
  ],
  "hash": "877265fb930e460674bc1669b29a175569f51d50376898d5bdc88e1f08db47fb",
  "scraped_at": "2026-02-19T07:31:45.332100+00:00"
}