{
  "url": "https://lite.cnn.com/2026/02/28/us/black-braiding-hair-extensions-chemicals-cec",
  "title": "Hair extensions used by Black women have hazardous chemicals | CNN",
  "date": "2026-03-01T07:06:40.258677+00:00",
  "authors": [
    "Leah Asmelash"
  ],
  "text": "Source: CNN\n\nAlmost every Black woman or girl has, at some point, purchased hair extensions for box braids, boho braids, twists or faux locs.\n\nFor many Black women, these “protective styles” are worn year-round to protect and maintain their natural hair. For others, they’re a pre-vacation splurge — an easy way to shield one’s curls from the harshness of salty ocean water or a chlorine-filled pool. Beauty shops feature walls of extension colors — 1b, 30, 27, 24 or maybe even 613 — ready to be purchased and installed by a pro or a patient auntie.\n\nBut a growing number of studies are revealing dozens of potentially dangerous chemicals and carcinogens in these hair extensions: a Consumer Reports studypublished this weekfound lead in 29 brands of extensions, while a peer-reviewed studypublished earlier in Februaryfound dozens of hazardous chemicals, some of which have been linked with cancer, birth defects and reproductive issues,across 43 hair samples. Some samples in the latter study had chemicals that should have required consumer warning labels under California’s Proposition 65.\n\nResearch has yet to determine whether or not these hair extensions are dangerous or could be causing illness. But both studies indicate how a largely unregulated billion-dollar industry fueled by Black women may also be disproportionately harming them.\n\nElissia Franklin, a research scientist and analytic chemist at the Silent Spring Institute, grew up with “all the Black girl styles,” she said, like box braids, regular braids, relaxed hair and straightened hair. In the past, she’d get rashes on her neck after wearing extensions in her hair, but it wasn’t until she was researching flame retardants in couches as an adult that she realized the same chemicals existed in the hair commonly sold at beauty supply stores.\n\nHer research, published in February in the American Chemical Society journal Environment & Health, analyzed common brands of both synthetic and human hair purchased online and from local beauty supply stores. Included in those samples: flame retardants, pesticides, organotins (which are linked to skin irritation) and more. More than 80% of the hair samples tested contained chemicals linked to breast cancer specifically, and all but two of the 43 samples tested contained known hazardous chemicals.\n\nFranklin’s work follows a 2025 Consumer Reports study, which made the rounds on social media last year after finding carcinogens in 10 synthetic braiding hair extensions.\n\nBut even as research about these chemicals mounts, business continues as usual in many hair braiding shops across the country.\n\nThe owner of Passion Braiding Salon outside of Austin, Texas said she heard about some chemicals in braiding extension hair on social media a few months ago, but hasn’t heard concerns from clients, most of whom bring hair purchased elsewhere to appointments. When asked if she was worried about her own exposure to harmful products, she said she wasn’t sure.\n\nMarcy Jones, a braider on the South Side of Chicago, has been braiding hair for seven years. While she has heard of chemicals in hair extensions — some of her clients say they’re “allergic” to the hair, so Jones will pre-wash the extensions — she said she disinfects her tools and isn’t worried about her own exposure.\n\nOne braider at Braids By Queen in Dallas said she wasn’t aware of chemicals in braiding hair, but she always washes any extensions in hot water before use, which she’s done since she was a child in Benin. One Charlotte, North Carolina braider said she hadn’t heard of any risks at all.\n\nWhile many people might use hair extensions without obvious problems, irritation is relatively common. Natural hair forums, websites and influencers have for years provided information about these so-called “allergic reactions.” Soaking the hair in apple cider vinegar is a common at-home remedy that may help reduce irritation with mixed results. Still, box braids and other extension styles can start at $200, depending on the length, width and type, and can take up to 10 hours to complete — meaning many Black women have learned to grin and bear the discomfort.\n\nHennii Dorsey is a co-owner of The Griyn Thumb salon just outside of Atlanta. She grew up wearing braids with extensions and never had a problem, she said, but that changed about 10 years ago. After braiding her hair with extensions, her head felt like it was covered in red ants, she said, “like they were biting me all over my scalp.”\n\n“When I looked at my scalp, I noticed it was red, like it was burning,” Dorsey said. “I had to shave it off, that’s how bad the burn was.”\n\nThe braiding hair changed, she said. She began noticing labels like “non-flammable,” making her wonder about the types of chemicals manufacturers treated the hair with. In her own salon, she began warning clients about the potential side effects of hair extensions. Now, she refuses to use hair extensions altogether — synthetic or human.\n\nWomen who want extensions will take the risk no matter what the research says, Dorsey said, “even if they think it’s cancer-causing.”\n\nThough many of the hair braiders interviewed seemed unconcerned by the potential harm they may face, those braiders are the “most vulnerable population,” said Franklin, the researcher. They work with these products day-in and day out, sometimes for decades, seeing multiple clients a week.\n\n“I do understand where there’s hesitancies,” Franklin said. “What Black hair product is safe? I do think that braiders should be aware, but also so should the manufacturers. It shouldn’t be on the hair braiders to make individual decisions.”\n\nFor every Black woman, the calculus around hair safety can feel ever-changing. Relaxers and chemical straighteners, touted for their easy-to-manage outcomes, saw a decline in use as more people learned aboutformaldehyde, a key ingredient in relaxer products and a carcinogen.\n\nNow hair extensions, used by many women as “protective styles” for their natural hair, may also be dangerous, to say nothing of weaves or wigs. And the potential harms exist beyond the hair itself: many brands of gels, glue, edge-control, oil sheen, detangling spray and other everyday products for Black women have been shown to containformaldehyde-releasing preservatives.\n\n“Black women use more hair products, and we are doing our hair in these very intense styles, more often than probably any other group of people,” Franklin said. “Those chemicals shouldn’t be in the products.”\n\nStill, Franklin gets the sense that no one in her circle is shocked anymore, she said. There’s an expectation that some products are hazardous, she said, and there’s no way to really know what product is completely safe. A product considered to be nonhazardous could later prove to be harmful after all.\n\nEverything carries some sort of risk, Franklin said — our food, our water, even our clothes. Trying to reduce that risk, she said, is all we can do.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.consumerreports.org/health/wigs-hair-extensions/braiding-hair-heavy-metals-vocs-follow-up-test-a9549045438/",
      "text": "published this week"
    },
    {
      "url": "https://silentspring.org/news/hair-extensions-contain-many-more-dangerous-chemicals-previously-thought",
      "text": "published earlier in February"
    },
    {
      "url": "https://pubs.acs.org/doi/10.1021/envhealth.5c00549",
      "text": "across 43 hair samples"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/health/hair-straightening-formaldehyde-fda-deadline",
      "text": "formaldehyde"
    },
    {
      "url": "https://silentspring.org/news/formaldehyde-releasers-found-common-personal-care-products",
      "text": "formaldehyde-releasing preservatives"
    }
  ],
  "hash": "87bdc3ec05beb5dba92151dead547025a876b9dd248aad2ce433b5cb6747e1a3",
  "scraped_at": "2026-03-01T07:06:40.258689+00:00"
}