{
  "url": "https://lite.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
  "title": "US increases military pressure on Iran as countries discuss a deal | CNN Politics",
  "date": "2026-02-18T07:32:04.119585+00:00",
  "authors": [
    "Natasha Bertrand",
    "Zachary Cohen",
    "Haley Britzky",
    "Kylie Atwood",
    "Jennifer Hansler",
    "Avery Schmitz",
    "Mohammed Tawfeeq",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US military is continuing asignificant buildupof air and naval assets in the Middle East as negotiations over a deal with Iran continued with talks in Geneva on Tuesday. The pieces are being moved into place both to pressure Tehran as terms of a deal are discussed and to have options to strike inside the country should negotiations over its nuclear program fail, multiple sources familiar with the matter told CNN.\n\nUS Air Force assets based in the United Kingdom, including refueling tankers and fighter jets, are being repositioned closer to the Middle East, according to sources familiar with the movements.\n\nThe US is also continuing to flow air defense systems to the region, according to a US official, and several US military units deployed in the region that were expected to rotate out in the coming weeks have had their orders extended, said one source familiar with the matter. Dozens of US military cargo planes have transported equipment from the US to Jordan, Bahrain and Saudi Arabia in recent weeks, according to flight-tracking data.\n\nOn Friday evening, multiple fighter aircraft were also given diplomatic clearance to enter Jordanian airspace, according toopen-source air traffic communications. Satellite images show 12 US F-15 attack planes have been positioned at Jordan’s Muwaffaq Salti Air Base since January 25.\n\nMore broadly, open-source flight data reveals there have been over 250 US cargo flights into the region.\n\nThose moves came ahead of talks in Geneva on Tuesday, with Iranian Foreign Minister Abbas Araghchi saying the meeting yielded an agreement on “guiding principles” for future talks with the two sides planning on exchanging drafts for a potential agreement. Araghchi said no timeline has been set for the exchange or for future negotiations.\n\n“We have reached understandings on the guiding principles, but the drafting and writing phase of the agreement will be more difficult,” he said. “Right now we have a much clearer picture of what work needs to happen and what work needs to continue of course both sides still have work to do to get closer together but at least now we have a framework and a clearer path to go on.”\n\nPresident Donald Trump has been threatening military action against Iran for weeks, beginning last month when he warned Iranian leaders that he was prepared to order an attack if the government did not stop killing protesters. And on Friday, he said he believes regime change “would be the best thing that could happen” in Iran.\n\nThe buildup of military assets and emphasis by Trump and senior members of the administration that regime change is preferable has the region on edge and increases the stakes for the negotiations. Trump’s envoy, Steve Witkoff, and his son-in-law, Jared Kushner represented the US for Tuesday’s indirect talks with Omani Foreign Minister Badr Albusaidi acting as mediator between the two and Araghchi.\n\nFor its part, Iran announced naval drills on Tuesday that would include closing parts of the Strait of Hormuz.\n\nThe official Islamic Republic News Agency said the exercises would simulate “real maritime threats.”\n\nIran’s semi-official news agency Fars said the closure would be “for a few hours” in order to “observe safety and navigation protocols” in the strait.\n\nThe administration still does not appear to have a clear understanding of what would come next if it took action and removed the Iranian regime, according to two sources familiar with the matter. Secretary of State Marco Rubio echoed this during a congressional hearing late last month, telling lawmakers that “no one knows” who would take over if the regime fell.\n\nThe likely alternatives could be even more problematic for the US and its allies, sources said. In the short term, the hard-line Islamic Revolutionary Guard Corps would likely fill any leadership void, the US intelligence community believes, according to sources.\n\nThe IRGC “is definitely prominent and functions above the standard military bureaucracy, but it is hard to predict exactly what would happen in a regime collapse scenario,” said one source familiar with recent US intelligence reporting on the matter.\n\nThe US also lacks clear insight into the IRGC’s hierarchy following the US assassination of Iran’s most powerful military commander, Maj. Gen. Qasem Soleimani, during Trump’s first term.\n\nWhereas US intelligence officials had a very good understanding of the power dynamics in Venezuela before the US captured then-President Nicolás Maduro last month, they lack the same insight into who, if anyone, would constitute a viable replacement for Iran’s supreme leader, sources said.\n\nMultiple sources said there were legitimate reasons to consider kinetic action several weeks ago at the height of the Iranian protests. At that point, there was a small window of time when US strikes could have potentially tipped the balance in favor of the opposition, providing momentum for Iranians to overthrow their government organically.\n\nThose sources now wonder whether Trump “missed the moment” and question whether military strikes weeks later would accomplish what they could have last month.\n\nAt the time, however, US military assets were concentrated in the Caribbean rather than the Middle East, limiting the administration’s options and worrying the Israelis, who were concerned they would be left exposed if Iran were to retaliate by attacking them with ballistic missiles.\n\nSince then, Trump has shifted his rationale for a potential attack, framing it around Iran’s reluctance to stop enriching uranium for its nuclear program.\n\n“I think they’ll be successful,” Trump said Friday of the upcoming talks. “If they’re not, it’s going to be a very bad day for Iran.”\n\nUnlike last month, the US now has the USS Abraham Lincoln carrier strike group in the region, the USS Gerald Ford carrier strike group on the way, and fighter jet squadrons and tankers being rapidly repositioned.\n\n“In case we don’t make a deal, we’ll need it,” Trump said Friday, when asked why the Ford was headed to the region.\n\nThe buildup gives the US military extensive strike options should Trump order an attack. Guided-missile destroyers steaming with the carriers, for example, can carry dozens of Tomahawk cruise missiles with a range of 1,000 miles and wielding 1,000-pound conventional warheads. US Navy carrier strike groups usually operate with an attack submarine that can also launch Tomahawks. F-35 and F-15E fighter jets can carry an array of guided bombs and air-to-surface missiles.\n\nAmong the potential targets for strikes are the headquarters of the IRGC and other military installations beyond Iranian nuclear sites, according to multiple sources. There is also some discussion about the US and Israel conducting joint operations, the sources said. Those could resemble Operation Midnight Hammer last summer, when the US struck Iranian nuclear sites toward the end of the 12-day Israel-Iran war, they added.\n\nTrump said over the weekend that the US “doesn’t want any enrichment,” indicating that he will not settle for a deal that allows even low-level uranium enrichment by Iran. Given Iran’s position that enrichment is its right, sources said there may not be space for negotiation.\n\nBut the sources also noted that hard-line positions going into negotiations can always change.\n\nThere are also other ways the Iranian government could try to ward off a US attack, including with economic incentives. During multiple rounds of US-Iran talks last year, there were discussions about possible business deals that could be struck in conjunction with a nuclear agreement, including granting the US privileged access to developing Iran’s oil, gas and rare earths resources, one source said. That topic is expected to be raised again, this person added.\n\nThe head of the United Nations nuclear watchdog, Rafael Grossi, met with Araghchi in Geneva on Monday for what both described as “in-depth technical discussions,” as preparations intensify for the crucial nuclear negotiations Tuesday.\n\nIn public remarks, Rubio has maintained that Trump prefers a diplomatic resolution. But he has also repeatedly stressed that such a deal will be difficult.\n\n“Iran ultimately is governed and its decisions are governed by Shia clerics — radical Shia clerics, okay? These people make policy decisions on the basis of pure theology. That’s how they make their decisions. So, it’s hard to do a deal with Iran,” Rubio said at a press conference in Budapest, Hungary, on Monday.\n\nAsked Sunday whether the administration would inform Congress if it decides to attack Iran or attempt to remove Iran’s supreme leader, Ayatollah Ali Khamenei, Rubio would not commit.\n\n“We’ll follow whatever the law is on it, and it depends on the circumstance it would lead to. But right now, we’re talking about negotiations,” he said at a press conference in Slovakia.\n\n“If that changes, it’ll be obvious to everyone.  And obviously, whatever the law requires us to do, we’ll do,” he added.\n\nRegional allies including the Arab states in the Persian Gulf are deeply concerned that US military action could destabilize the region. They have lobbied for holding off on military action to give diplomacy more time, according to sources familiar with the talks.\n\n“Everybody is pushing against a strike,” said a diplomat from the region. This person added that Israel is the only regional player that has been urging the US to attack.\n\nIran, meanwhile, held further military exercises less than 24 hours ahead of the Geneva talks. On Monday, Iran’s official Islamic Republic of Iran Broadcasting reported that the IRGC had launched a “valiant defense” of three Iranian islands by land, air and sea that are the subject of a longtime border dispute between Iran and the United Arab Emirates.\n\nAccording to the report, IRGC drones are positioned at Iran’s southernmost point, ready to confront any aggressors.\n\nIran’s armed forces chief of staff, Maj. Gen. Abdolrahim Mousavi, warned Sunday that “Trump should know that he would be entering a confrontation that gives harsh lessons, the outcome of which would ensure that he no longer bellows threats around the world,” according to state-run Press TV.\n\nThis story was updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/us-iran-aircraft-carrier",
      "text": "significant buildup"
    },
    {
      "url": "https://tbg.airframes.io/dashboard/home",
      "text": "open-source air traffic communications"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
      "text": "Cookie Settings"
    }
  ],
  "hash": "87d81287ea5d1a74e62a323b61f1c39d09389fe0604f4af2be754f13e7764a84",
  "scraped_at": "2026-02-18T07:32:04.119597+00:00"
}
