{
  "url": "https://lite.cnn.com/2026/02/24/us/mamdani-at-odds-with-police-after-officers-injured-in-snowball-fight",
  "title": "Zohran Mamdani is at odds with NYC police after two officers were injured in a snowball fight | CNN",
  "date": "2026-02-25T07:31:48.179562+00:00",
  "authors": [
    "Katherine Koretski"
  ],
  "text": "Source: CNN\n\nIt started as a viral snowball fight in a historic blizzard. It ended up putting New York Mayor Zohran Mamdani on the opposite side of his city’s police, creating a politically sensitive moment early in his tenure.\n\nSpeaking at a news conference that largely dealt with how New York fared duringthe severe snowstorm that hit the Northeast this week, Mamdani faced several questions about the fight and the injuries suffered by two officers pelted with snowballs.\n\n“From videos I’ve seen, it looks like a snowball fight,” Mamdani said, adding that two officers involved were “facing lacerations on their face.”\n\nAsked whether he thought anyone involved in the incident should be charged with assaulting a police officer if the throwers were to be identified, Mamdani said: “I don’t.”\n\nIn a separatepost on X,he called on New Yorkers to treat officers with respect but joked that “if anyone’s catching a snowball, it’s me.”\n\nMamdani’s initial lighthearted tone contrasted with other key officials. By day’s end, he was being accused by the city’s Police Benevolent Association of a “failure of leadership” and fueling longtime detractors who brought up his past criticisms of law enforcement.\n\n“This was not just a ‘snowball fight,’” thePBA saidin a statement. “This was an assault — by adults throwing chunks of ice and rocks — that landed two police officers in the hospital with head and face injuries.”\n\nHours after the mayor’s news conference, the New York Police Departmentposted on its social mediaseeking tips for two suspects “Wanted for ASSAULT ON A POLICE OFFICER.” The NYPD said “two uniformed police officers were inside Washington Square Park when two individuals intentionally struck the officers multiple times with snow and ice causing injury to their head, neck, and face.”\n\nMamdani’s press team referred to his earlier comments when asked by CNN about the NYPD’s tweet.\n\nNew York Gov. Kathy Hochul, a Mamdani ally, also weighed in, saying, “Our NYPD officers put themselves on the line to protect us every day. It is never acceptable to throw anything at a police officer, full stop.”\n\nAnd Police Commissioner Jessica Tisch, whom Mamdani retained from the prior administration, described the videos of the encounter during the snowball fight as “showing individuals attacking cops.”\n\n“I want to be very clear: The behavior depicted is disgraceful, and it is criminal. Our detectives are investigating this matter,” Tisch said in asocial media post.\n\nIn one video, a crowd is heard jeering the officers and throwing snowballs at them as they are walking. One officer is seen shoving at least two people to the ground as snowballs continue to be thrown.\n\nFootage also shows officers being followed and continuing to be pelted by snow as they walked to their police van.\n\nThe video doesn’t show what happened before the snowballs were thrown. The incident occurred during a planned meetup for a snowball fight in the park, according to aflyershared on social media.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/weather/bomb-cyclone-storm-snow-winds-northeast",
      "text": "the severe snowstorm that hit the Northeast this week"
    },
    {
      "url": "https://x.com/NYCMayor/status/2026338065829036065",
      "text": "post on X,"
    },
    {
      "url": "https://x.com/NYCPBA/status/2026387117098807716",
      "text": "PBA said"
    },
    {
      "url": "https://x.com/NYPDnews/status/2026418885260431579",
      "text": "posted on its social media"
    },
    {
      "url": "https://x.com/NYPDPC/status/2026128921905803638",
      "text": "social media post"
    },
    {
      "url": "https://x.com/sidetalknyc?lang=en",
      "text": "flyer"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/mamdani-at-odds-with-police-after-officers-injured-in-snowball-fight",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/us/mamdani-at-odds-with-police-after-officers-injured-in-snowball-fight",
      "text": "Cookie Settings"
    }
  ],
  "hash": "888f258e77cf6c264edc67c1b16bf665b3e225e6fc5da41d7e6e5b8c4a442c71",
  "scraped_at": "2026-02-25T07:31:48.179571+00:00"
}