{
  "url": "https://lite.cnn.com/2026/02/21/europe/slovakia-ukraine-oil-energy-threat-intl",
  "title": "Ukraine accuses Hungary, Slovakia of ‘blackmail’ over threats to cut electricity | CNN",
  "date": "2026-02-22T07:09:20.391929+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nUkraine’s Foreign Ministry condemned what it ⁠described as “ultimatums ⁠and blackmail” by the governments of Hungary and Slovakia on Saturday, after they threatened to stop electricity supplies toUkraineunless ⁠Kyiv restarts flows of ​Russian oil.\n\nShipments of Russian oil toHungaryand ⁠Slovakia have been cut off since January 27, when Kyiv says a ​Russian drone strike hit pipeline equipment in Western Ukraine. Slovakia and Hungary say Ukraine is to blame for the prolonged outage.\n\nSlovakia’s Prime Minister Robert Fico said on Saturday that he would cut off emergency electricity supplies to Ukraine within two days unless Kyiv resumes Russian oil transit to Slovakia ⁠over Ukraine’s territory. Hungary’s Viktor Orban made a similar threat days earlier.\n\nThe issue has become one of ​the angriest disputes yet between Ukraine and two neighbours that are members of the EU and NATO but whose leaders have bucked the largely pro-Ukrainian consensus in Europe to ⁠cultivate warm ties withMoscow.\n\nSlovakia and Hungary are the only two EU countries that still rely on significant amounts of Russian oil shipped via the Soviet-era Druzhba pipeline over Ukraine.\n\n“Ukraine rejects and condemns the ultimatums and blackmail by the governments of Hungary and the Slovak Republic regarding energy supplies between our countries,” the Ukrainian Foreign Ministry said in a statement. “Ultimatums should ⁠be sent to the Kremlin, and certainly not to Kyiv.”\n\nBetween them, Hungary and Slovakia have been providing around half ‌of European emergency electricity exports to Ukraine, which Kyiv increasingly relies on ​as Russian attacks have damaged its grid.\n\n“If oil supplies to Slovakia are not resumed on Monday, I will ask SEPS, the state-owned joint-stock company, to stop emergency electricity supplies to Ukraine,” Fico ​said in ⁠a post on X.\n\nKyiv said that such actions were “provocative, irresponsible, ‌and threaten the energy security of the entire region.”\n\nThroughout the war that began ⁠with the full-scale Russian invasion whose fourth anniversary falls on Tuesday, Ukraine has allowed its territory to be used for Russian energy exports to Europe, which have been sharply curtailed but not halted.\n\nUkraine has proposed alternative transit routes to ship oil to Europe while emergency pipeline repair works are under way. In a letter seen by Reuters, the Ukrainian mission to the EU proposed ⁠shipments through Ukraine’s oil transportation system or a maritime route, potentially including the Odesa-Brody pipeline linking Ukraine’s main ‌Black Sea port to the EU.\n\nSince October last year, Russia has intensified its drone and missile attacks on the Ukrainian energy system, knocking ⁠out electricity and heat and plunging millions of Ukrainians into long ​blackouts during bitterly cold winter temperatures.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/europe/ukraine",
      "text": "Ukraine"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hungary-russia-oil-orban-intl",
      "text": "Hungary"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/europe/russia-putin-ukraine-war-intl",
      "text": "Moscow"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/europe/slovakia-ukraine-oil-energy-threat-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/europe/slovakia-ukraine-oil-energy-threat-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8899eee1e361e7230aec62816673a85617cb7e72e025dfdd28b43e0ab732c311",
  "scraped_at": "2026-02-22T07:09:20.391943+00:00"
}