{
  "url": "https://lite.cnn.com/2026/02/14/europe/alexey-navaly-russia-poison-death-intl",
  "title": "Alexey Navalny: Russian opposition figure killed by toxin found in poison dart frogs, Europeans say | CNN",
  "date": "2026-02-15T07:10:52.305917+00:00",
  "authors": [],
  "text": "Source: CNN\n\nRussian opposition figure and outspoken Kremlin critic Alexey Navalny, whodied two years ago, was killed while in prison by a lethal toxin found in poison dart frogs in South America, five European countries have saidin a statementSaturday.\n\nAnalyses of samples taken from Navalny’s body have “conclusively confirmed the presence of epibatidine,” the statement said. The substance is not found naturally in Russia, it added.\n\nThe five countries – UK, Sweden, France, Germany and the Netherlands – said Moscow “had the means, motive and opportunity to administer this poison” to Navalny while he was held in a penal colony north of the Arctic Circle.\n\nOnly “the Russian state had the combined means, motive and disregard for international law” to contribute to Navalny’s death, they added.\n\nRussian officials have repeatedly denied being responsible for Navalny’s death and on Saturday Russian news agency TASS quoted the Foreign Ministry spokeswoman Maria Zakharova as dismissing the frog poison claim as “propaganda.” CNN has reached out to the Kremlin for comment.\n\nThe announcement came during theMunich Security Conferencein Germany, during which Navalny’s death was announced in 2024.\n\nAt the event two years ago, Navalny’s wife Yulia Navalnaya came on stage at the conference in tears and received a standing ovation.\n\nSpeaking at the same security conference on Saturday, Navalnaya said: “Two years ago, I was here in Munich. It was the most horrible day (of) my life. I came to the stage and I said that my husband, Alexey Navalny, was poisoned.”\n\nIn apost on Xearlier in the day, Navalnaya said that she “was certain from the first day that my husband had been poisoned, but now there is proof: (Russian President Vladimir) Putin killed (Alexey) with chemical weapon.”\n\n“I am grateful to the European states for the meticulous work they carried out over two years and for uncovering the truth,” she said, adding: “Vladimir Putin is a murderer. He must be held accountable for all his crimes.”\n\nWhen Navalny died, the Russian prison service said that he had “felt unwell after a walk” and “almost immediately” lost consciousness.\n\nHe had been imprisoned in an Arctic penal colony since returning to Russia in 2021 from Germany, where he had been treated after beingpoisoned with Novichok, a Soviet-era nerve agent.\n\nAjoint investigationby CNN and the group Bellingcat implicated the Russian Security Service (FSB) in the poisoning. It found that the FSB had formed an elite team specializing in nerve agents that trailed Navalny for more than three years.\n\nRussia denied involvement then, too, with Putin saying at the time that if the Russian security service had wanted to kill Navalny, it “would have finished” the job.\n\nNavalny, who had organizedanti-government street protestsand used his blog and social media to expose alleged corruption in the Kremlin and in Russian business, was viewed as one of the most serious threats to Putin before his death.\n\nIn a2018 interview with CNN, he said that he had a “clear understanding” of the risks involved in taking on the government.\n\n“But I’m not afraid and I’m not going to give up on what I’m going to do. I won’t give up on my country. I won’t give up on my civil rights. I won’t give up on uniting those around me who believe in the same ideals as me. And there are quite a lot of people like that in Russia,” he said.\n\nIn a statement released on Saturday, British Foreign Secretary Yvette Cooper said that “Russia saw Navalny as a threat. By using this form of poison, the Russian state demonstrated the despicable tools it has at its disposal and the overwhelming fear it has of political opposition.”\n\nUkrainian President Volodymyr Zelensky was asked at the Munich Security Conference if he feared that Putin would use the same toxins against him. “I don’t think about myself because we have already lost a large number of people. I am one of many Ukrainian citizens who continue to fight,” Zelensky said. “I cannot think about Vladimir Putin, about his poisons or toxins that he has or had.”\n\nThe five countries said in their joint statement that they have written to the Organisation for the Prohibition of Chemical Weapons about what they called a “Russian breach of the Chemical Weapons Convention.”\n\nCNN’s Sebastian Shukla, Anna Chernova and Christian Edwards, Svitlana Vlasova and Moriah Thomas contributed to this reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/02/16/europe/alexey-navalny-dead-russia-prison-intl",
      "text": "died two years ago"
    },
    {
      "url": "https://www.gov.uk/government/news/joint-statement-by-the-uk-sweden-france-germany-and-the-netherlands-on-alexei-navalnys-death",
      "text": "in a statement"
    },
    {
      "url": "https://cnn.com/us/live-news/trump-administration-rubio-munich-02-14-26",
      "text": "Munich Security Conference"
    },
    {
      "url": "https://x.com/yulia_navalnaya/status/2022652772500316538",
      "text": "post on X"
    },
    {
      "url": "https://www.cnn.com/2020/09/02/europe/alexey-navalny-novichok-intl",
      "text": "poisoned with Novichok"
    },
    {
      "url": "https://cnn.com/2020/12/14/europe/russia-navalny-agents-bellingcat-ward/index.html",
      "text": "joint investigation"
    },
    {
      "url": "https://cnn.com/2021/01/23/europe/russia-navalny-oposition-demonstrations-intl/index.html",
      "text": "anti-government street protests"
    },
    {
      "url": "https://www.cnn.com/2018/01/27/europe/alexei-navalny-says-putin-regime-is-corrupt-intl",
      "text": "2018 interview with CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/alexey-navaly-russia-poison-death-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/europe/alexey-navaly-russia-poison-death-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "88a13f9e707019b27e9defd9fb675582e3be92e72bc2a12579d7a3083a3afe47",
  "scraped_at": "2026-02-15T07:10:52.305929+00:00"
}