{
  "url": "https://lite.cnn.com/2026/02/27/politics/joe-biden-post-presidency-donald-trump-south-carolina",
  "title": "Joe Biden tries to rebuild a fragile legacy while facing his own doubts | CNN Politics",
  "date": "2026-02-28T07:00:10.243171+00:00",
  "authors": [
    "Edward-Isaac Dovere"
  ],
  "text": "Source: CNN\n\nThe line Joe Biden used to put intonearly every big speech— “I’ve never been more optimistic about America’s future” — is a long way from what he says in private now.\n\nThese days, multiple people who’ve spoken to him over the last year say, Biden often punctuates conversations with: “You think we can actually come back from this?”\n\nThe 83-year-old Bidencontinues to feel out a post-presidencythat may prove to be one of the shortest in history and is already one of the most complicated.\n\nThere are days when Biden is heartbroken, indignant or in disbelief about what is happening as President Donald Trump — the man he defeated in 2020 — returned and movednot just to tear down his accomplishments, but to dig in with petty insults like theautopen photographhe put in Biden’s spot in the “Presidential Walk of Fame” installed at the White House.\n\nBiden knows that because of decisions he and close advisers made and the trends roiling the country and the world, he risks being forgotten for what he feels he accomplished as president and who he is as a man. He’s watching the attacks on democratic norms and the international order that he warned would come from Trump’s return — and registering the disgust directed his way that so many Democrats feel because they blame him for helping make that possible.\n\nNearly two dozen people in contact with the former president spoke to CNN. A wider circle of friends and former aides who tend to use the word “tragic” when discussing Biden worry that those around him so far may not be up to the task of really changing that.\n\n“There’s a general sense in the family that it’s a legacy that was never established,” a friend of the family who asked not to be named told CNN. “It’s like the record skipped a track.”\n\nBiden headed back to South Carolina on Friday night for a friendly invitation he eagerly accepted, on the sixth anniversary of the seismic primary victory that pulled his 2020 candidacy back from the brink and on a direct path to his lifelong dream.\n\nStanding in the atrium of the Columbia Museum of Art, Biden accused Trump of “trying to steal the election” in November’s midterms by creating barriers to voting.\n\n“He knows that he can’t win the vote, so he’ll do everything he can to prevent you from wanting to vote,” Biden charged, predicting that there will be new state laws pushed by Trump toward that end.\n\nShifting one of his other famous lines from his presidential campaign, Biden said, “The battle for the soul of this nation is one that’s never really over.”\n\nTrump, Biden said, “clearly represents the worst of us” — but, he said, the American people are showing they don’t want “a king or a dictator.”\n\nFor all the frailty on display inhis final months in the White House, Biden keeps popping up since leaving office, even as his age continues to show.\n\nHe is heartened by the applause and hugs he gets when he’s spotted walking to his seat on an airplane or – in histrademark choice of travel– back and forth on Amtrak trains between Washington, DC, and Delaware. He took acommercial flightto South Carolina on Friday morning, greeted by admirers – and confronted by a woman about the deaths of children in Gaza, in a war thatbegan during his presidency.\n\nWhile people close to him say they have been encouraged by how he responded to prostate cancer treatments thatended their first course in early October, they acknowledge he needed days to recover from the fatigue brought on by the radiation.\n\nWhile Barack Obama has been thinking about how to reposition himself publicly, Biden has had quiet conversations, over the phone or dinners or in long meetings in his office, with a range of former aides and up-and-coming Democrats.\n\nHe’s had several phone calls with California Gov. Gavin Newsom. He gladly agreed when New York Rep. Alexandria Ocasio-Cortez reached out for a meeting, and they spent over an hour together in his Washington office, one of several conversations they’ve had talking about the parts of his record that lined up with her agenda and what the political future might hold.\n\nSometimes he’s chipping in with governing advice. Sometimes it’s a talk about diplomacy or theology or politics. Sometimes it’s with condolences to a former aide who’s gotten bad medical news or lost someone. Sometimes it’s just a short personal check-in, like when he called Virginia Gov. Abigail Spanberger on Tuesday night shortlybefore her State of the Union responseto wish her luck, then again the next morning to say he thought she’d done a great job making the case against Trump.\n\nHe also called California Sen. Alex Padilla ahead of his Spanish-language response, with the same encouragement and reminder to speak from the heart.\n\n“There’s the political chattering class – ‘Is it too soon? Is it not soon enough?’ – or any of that. I think history will show in time that he was a great president for the term that he served, but I can always use a morale boost,” Padilla said. “And that’s classic Joe Biden.”\n\nPolls that suggest more people saying he did a better job as president than Trump are a boost.\n\nOn Monday night at an event of his own in South Carolina topromote his new book, Newsom was asked how he felt about the former president being used, in the words of on-stage interviewer Jaime Harrison — Biden’s pick for Democratic National Committee chair — as a “political piñata.”\n\nNewsom responded by talking affectionately about Biden’s approach to being a father, then ticked through the highlights of his record as president.\n\n“You go home with the one who brought you to the dance,” Newsom said. “I’ll never turn my back on Joe Biden.”\n\nHe’s not the only prospective future presidential candidate in that boat: At a party fundraising dinner in Nebraska last November, Kentucky Gov. Andy Beshear thanked Biden for his work and led a long standing ovation for him.\n\nSo far, at least, that is not the wider feeling about Biden on the campaign trail this year, with Biden not planning to or being asked to play much of a public role on behalf of Democrats in this year’s midterm campaigns.\n\nAsked how often either good feelings about the former president or recriminations about how he handled the decision to run again come up, Colorado Rep. Jason Crow, who helped lead recruitment of Democratic candidates for the House and continues to advise them on their campaign pitches, said simply, “It doesn’t.”\n\nDan Koh, whose jobs in the Biden administration finished up with being the deputy Cabinet secretary in the White House, told CNN that now as he campaigns for Congress in deep-blue Massachusetts, he’s benefiting from his connection to the former president, which he attributed to “a lot of nostalgia for decency.” Biden alumni have been cheering on Koh’s campaign, including at a big fundraiser for him in Georgetown in December, with speeches from several top Biden White House aides.\n\nOther Biden alumni on the ballot have been struggling with what to say about their association to him, with some even leaving his name out of their websites and campaign pitches entirely.\n\nAn aide to Deb Haaland, his interior secretary now running for governor of New Mexico, forwarded a statement from her walking the line between her connection and moving forward, saying “I’m proud of what we achieved under President Biden, especially shepherding the largest renewable energy transition in the country — one that will lower utility bills for families across the Southwest. But families are still feeling squeezed.”\n\nXavier Becerra, Biden’s secretary of health and human services, is now running for governor in California. An aide told CNN he did not want to discuss the topic.\n\nBut asked if he’d want Biden’s endorsement, California Rep. Eric Swalwell, also running for governor, told CNN, “Of course.”\n\nLast week, Biden’s foundation board met for a dinner at Longwood Gardens, just outside Philadelphia, followed the next day by their first-ever in-person meeting. There was socializing and commiserating, a toast from the former president in which he said he is still optimistic and hearing from people as he travels that they are hopeful for the country, and the beginning of hammering out plans for what kind of library and institution he will actually try to build.\n\nDespite initial stages of research about a facility and meetings with staff at other presidential museums, the only firm decision so far remains the one made last year: the Biden library, whatever shape it takes, will be in his home state of Delaware. Architectural sketches or decisions on focus areas like diplomacy or cancer research are months away at least, with the board set to meet again in May.\n\nThat timeline, though, does not fully reflect the urgency many involved feel with Biden’s age and health very much on their minds, to make sure at the very least there’s a groundbreaking event he can attend.\n\nFundraising remains a problem. The foundation banked very little last year, with some big donors still too mad at him to give, some worried that being associated would put them in the Trump administration’s sights, and some simply unclear on what the plans are.\n\n“In conversations I’ve been having in recent weeks, there’s been a renewed nostalgia for President Biden and the steadiness of his administration,” said Rufus Gifford, who worked at the State Department under Biden and is chairing the foundation board. “Any hangover from 2024 is dissipating.”\n\nBiden has been making occasional speeches decrying Trump — “this isn’t a golden age,” he said in November, but “a very, very dark moment” — and is featuredin an upcoming documentaryabout WNBA star Brittney Griner talking about his work to get her freed from a Russian prison, his views on world affairs and on Vladimir Putin.\n\nBut his main project for now is finishing his memoir, which included reconnecting with several senior aides to go over key moments. That’s expected out later this year, though whether that will be before or after the midterm elections remains unclear.\n\nIn expectation that his foundation and other work will be stepping up, Biden is moving his current senior spokesperson Kelly Scully over to the nonprofit side while bringing back former aide TJ Ducklo to oversee his personal and political communications after a stint at a crisis communications firm in New York, in addition to taking a role with the group known as Democracy Defenders Action.\n\nBiden was having lunch one afternoon at Pizza by Elizabeths in Greenville, the local mainstay a few miles from his home. When he heard a woman at a nearby table was celebrating her 90th birthday, he came over to say congratulations and proceeded to lead the restaurant in singing “Happy Birthday” to her.\n\nThat included roping in Delaware Rep. Sarah McBride, who happened to have come by to eat at the well-known spot herself. McBride has been talking to Biden often the last few months, asking for his thoughts about navigating Congress, hearing him talk about how he overcame the anti-Catholic feelings in his own first race for Senate in 1972 that they both feel has parallels to what she’s faced asthe first trans member of Congress, and getting his guidance as she’s started traveling internationally in Congressional delegations to Denmark and the Munich Security Conference.\n\nMcBride, who was a caregiver to her own husband as he died of cancer, said that the former president seems to her to be doing well physically — while describing him as pained and frustrated by news he is very much keeping up on out of the current White House, and by Republicans in Congress whom he had respected going along with it.\n\n“He has devoted his life to this country and he is pained to see what Donald Trump is doing to this country,” McBride said. “When he sees Donald Trump continue to recycle talking points about the Biden administration and continue to blame the previous administration about harm that is very clearly a byproduct of his own administration, I think there is sort of exasperated recognition that Trump is just never going to change.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://transcripts.cnn.com/show/cnc/date/2023-09-28/segment/12",
      "text": "nearly every big speech"
    },
    {
      "url": "https://www.cnn.com/2025/04/15/politics/biden-post-presidency-legacy-trump",
      "text": "continues to feel out a post-presidency"
    },
    {
      "url": "https://www.cnn.com/2025/12/09/politics/trump-blame-biden-economy-ukraine",
      "text": "not just to tear down his accomplishments"
    },
    {
      "url": "https://www.cnn.com/2025/09/24/politics/biden-autopen-portrait-white-house-trump",
      "text": "autopen photograph"
    },
    {
      "url": "https://www.cnn.com/2025/05/20/politics/biden-book-original-sin-age",
      "text": "his final months in the White House"
    },
    {
      "url": "https://www.cnn.com/2021/04/30/politics/amtrak-joe-biden",
      "text": "trademark choice of travel"
    },
    {
      "url": "https://apnews.com/article/biden-commercial-flight-reagan-airport-fog-delay-25760a27cab9d4b593583681648d1819",
      "text": "commercial flight"
    },
    {
      "url": "https://www.cnn.com/2025/10/12/politics/trump-israel-trip",
      "text": "began during his presidency"
    },
    {
      "url": "https://www.cnn.com/2025/10/20/politics/biden-radiation-therapy-prostate-cancer-treatment",
      "text": "ended their first course in early October"
    },
    {
      "url": "https://www.cnn.com/2022/10/10/politics/barack-obama-midterms",
      "text": "While Barack Obama has been thinking about how to reposition himself publicly"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/politics/video/democratic-response-trump-state-of-the-union-address-digvid",
      "text": "before her State of the Union response"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-gavin-newsom-book",
      "text": "promote his new book"
    },
    {
      "url": "https://www.hollywoodreporter.com/news/politics-news/brittney-griner-documentary-airing-espn-ice-1236486456/",
      "text": "in an upcoming documentary"
    },
    {
      "url": "https://www.cnn.com/2024/11/05/politics/sarah-mcbride-delaware-transgender-congress",
      "text": "the first trans member of Congress"
    }
  ],
  "hash": "895a8897e4877d2cbeef07d8798b74e03c324015a4cb9a7695c89c8028073906",
  "scraped_at": "2026-02-28T07:00:10.243183+00:00"
}