{
  "url": "https://lite.cnn.com/2026/02/26/politics/ken-paxton-john-cornyn-ad-family",
  "title": "Ken Paxton’s daughter defends him after a John Cornyn ad accuses him of ‘dirty deeds’ | CNN Politics",
  "date": "2026-02-28T07:00:51.014650+00:00",
  "authors": [
    "Arlette Saenz"
  ],
  "text": "Source: CNN\n\nTexas Attorney General Ken Paxton deployed his daughter to vouch for him Thursday after a scathing attack ad released by Sen. John Cornyn in their increasingly contentious Republican Senate primary race.\n\nPaxton’s campaignreleased a videofrom his daughter Mattie Hayworth in which she says: “My dad is a really good guy. Loves God. He loves his family and he loves this country.”\n\nShe also wrote acolumnfor the conservative publication Texas Scorecard published Thursday.\n\n“My dad is not perfect; none of us are. But he is a man of deep faith, genuine love for his family, and an unrelenting commitment to doing right by the people of Texas,” Hayworth writes.\n\nThe family support comes as the contest between Paxton, Cornyn and Rep. Wesley Hunt has grown increasingly heated leading up to the March 3 primary. It’s particularly notable given past claims that Paxtonasked a campaign donorto hire someone with whom he was having an affair, allegations that were cited by the Texas House in impeaching Paxton in 2023. He was later acquitted by the Texas Senate.\n\nHis wife, Angela Paxton – a state senator and longtime political adviser – accused him of adultery andfiled for divorcelast year on “biblical grounds.”\n\nA Paxton adviser, speaking on the condition of anonymity to discuss internal strategy, said the ad featuring Hayworth was filmed before Cornyn released an ad that has drawn wide attention, though Paxton’s campaign intended for its video to respond to Cornyn’s.\n\nThe Cornyn Lonestar Victory Fund, a joint effort between the Cornyn campaign and the National Republican Senatorial Committee, leveled a series of attacks against Paxton. CNN could not verify all of the ad’s claims.\n\n“It’s voting time, so let’s cut through the bulls**t,” the ad’s narrator begins. “Crooked Ken Paxton cheated on his wife. She’s divorcing him on ‘biblical grounds.’”\n\n“Now, think of the Paxton dirty deeds we don’t know about yet,” the narrator adds.\n\nIn the op-ed published Thursday, Hayworth accused Paxton’s opponents of “ugly attacks” on her father.\n\n“When his opponent can’t win on policy, he goes after character,” Hayworth wrote. “But anyone who has spent real time with my dad knows that the attacks bear no resemblance to the man they claim to describe.”\n\nPaxton hassurviveda series of controversies throughout his time as the state’s attorney general, including a felony securities fraud investigation that was ultimately settled.\n\n“We overcame them all,” he told reporters last week.\n\nCornyn and his allies havewarned nominating Paxtonto the top of the Republican ticket in November would endanger GOP chances in the traditionally red-voting state.\n\n“We will have an election day massacre,” Cornyn said earlier this month. “If Ken Paxton is at the top of the ticket, we risk losing the Senate seat, losing the majority in the House of Representatives, and it will take a toll on everybody in the ballot.”\n\nIn a statement, Paxton said, “Unlike John Cornyn, who’s become a desperate shell of a man clinging to power, my campaign is not about attacking someone else’s family. It’s about protecting America.”\n\nThe three-way GOP field could result in a late May runoff between the top two finishers if no candidate is able to clear the 50% vote threshold next week.\n\nA University of Houston Hobby School poll conducted in late January found Paxton leading the field among likely voters. Paxton earned 38% support compared to 31% for Cornyn and Hunt at 17%. 12% of those polled said they were undecided.\n\nOne of the biggest question marks in the race is whether President Donald Trump will decide to support a candidate. Trump, who is traveling to Corpus Christi on Friday, has so far withheld an endorsement.\n\n“I just haven’t made a decision on that race yet. It’s got a ways to go,” Trump told reporters earlier this month. “They’ve all supported me. They’re all good, and you’re supposed to pick one. So we’ll see what happens. But I support all three involved.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://x.com/KenPaxtonTX/status/2027101165553586430?s=20",
      "text": "released a video"
    },
    {
      "url": "https://texasscorecard.com/opinion/hayworth-my-dad-is-ken-paxton-and-im-setting-the-record-straight/",
      "text": "column"
    },
    {
      "url": "https://www.cnn.com/2023/05/27/politics/ken-paxton-impeachment-texas-house",
      "text": "asked a campaign donor"
    },
    {
      "url": "https://www.cnn.com/2025/07/10/politics/ken-paxton-divorce-texas-senate",
      "text": "filed for divorce"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/ken-paxton-texas-senate-republican-primary",
      "text": "survived"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/texas-senate-primary-cornyn-paxton-hunt-crockett-talarico",
      "text": "warned nominating Paxton"
    }
  ],
  "hash": "895f6ba0d783352c1f4d7eb39ec43fe7b688aafd7be08e032d1c7e4e217c713b",
  "scraped_at": "2026-02-28T07:00:51.014661+00:00"
}