{
  "url": "https://lite.cnn.com/2026/02/26/business/borge-brende-wef-epstein-files-intl",
  "title": "WEF CEO Børge Brende steps down as the Epstein files claim another top executive | CNN Business",
  "date": "2026-02-28T07:01:29.676109+00:00",
  "authors": [
    "Hanna Ziady"
  ],
  "text": "Source: CNN\n\nA month ago, Børge Brende interviewed US President Donald Trump following hisaddressto government and business leaders in Davos, Switzerland.\n\nOn Thursday, the president and CEO of the World Economic Forum, which organizes the annual gathering in the Swiss alps, announced he was stepping down following an independent investigation into his relationship with the late sex offender Jeffrey Epstein.\n\nBrende’s resignation is the latest in a string ofhigh-profile departureslinked to the publication of the so-called Epstein files, a collection of millions of emails and other documents detailing the activities of the disgraced financier.\n\n“After careful consideration, I have decided to step down as President and CEO of the World Economic Forum,” Brende, a former Norwegian foreign minister, said in astatement. “My time here, spanning 8½ years, has been profoundly rewarding.”\n\nThe forum launched the independent review earlier this month when it emerged that Brende had attended three business dinners with Epstein in 2018 and 2019, as well as communicated with him via emails and text messages.\n\nAt least one of the dinners took place at Epstein’s home in New York, emails show, just weeks before the financier was arrested on federal charges ofchild sex trafficking. Back in 2008, Epstein pleaded guilty to soliciting sex from a minor and was subsequently sentenced to 18 months in prison.\n\nIn a statement earlier this month, after the WEF launched its probe, Brende said he had been “completely unaware of Epstein’s past and criminal activities” and would not have communicated or attended dinners with him had he known. “I recognize that I could have conducted a more thorough investigation into Epstein’s history, and I regret not doing so,” he added.\n\nThere was no indication Brende engaged in wrongdoing, but he joins a growing slate of business leaders and others who have had their careers derailed by revelations contained in the Epstein files, published by the US Justice Department since late December.\n\nThat list includes Hyatt Hotels executive chairmanTom Pritzker; top Goldman Sachs lawyerKathy Ruemmler; andSultan Ahmed bin Sulayem, the CEO of Dubai logistics giant DP World. None have been charged with wrongdoing.\n\nIn 2021, Apollo Global Management CEO Leon Black and Barclays CEO Jes Staley both stepped down because of their ties to Epstein.\n\nIn the WEF statement Thursday, the forum’sco-chairs Larry Fink and Andre Hoffmann thanked Brende for his “significant contributions” to the organization.\n\nThey also said the independent review into Brende’s ties with Epstein had now concluded and that no “additional concerns beyond what has been previously disclosed” were identified.\n\nThe WEF has appointed Alois Zwinggi as interim president and CEO while the process to appoint a permanent successor is underway.\n\nBrende’s departure comes less than a year after the WEF’s founding chairman, Klaus Schwab, stepped down under a cloud, following whistleblower allegations of misconduct. An investigation into the allegations, which concluded in August, found “no evidence of material wrongdoing” by Schwab, according to astatementfrom the WEF.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/01/21/politics/donald-trump-davos-speech-takeaways",
      "text": "address"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/business/epstein-files-ceo-resign",
      "text": "high-profile departures"
    },
    {
      "url": "https://www.weforum.org/press/2026/02/press-statement-from-co-chairs-andre-hoffmann-and-larry-fink-on-behalf-of-the-board-of-trustees/",
      "text": "statement"
    },
    {
      "url": "https://www.justice.gov/usao-sdny/pr/jeffrey-epstein-charged-manhattan-federal-court-sex-trafficking-minors",
      "text": "child sex trafficking"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hyatt-pritzker-retire-epstein",
      "text": "Tom Pritzker"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kathy-ruemmler-resigns-goldman-sachs-epstein-fallout",
      "text": "Kathy Ruemmler"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/business/epstein-files-bin-sulayem-friendship-intl",
      "text": "Sultan Ahmed bin Sulayem"
    },
    {
      "url": "https://www.weforum.org/press/2025/08/news-release/",
      "text": "statement"
    }
  ],
  "hash": "89c14e74234d55180c3059bf86d37cd1c3c61fb3df2741cf84a6fed662064b54",
  "scraped_at": "2026-02-28T07:01:29.676124+00:00"
}