{
  "url": "https://lite.cnn.com/2026/02/16/business/uk-ai-chatbots-online-safety-act-intl",
  "title": "AI chatbots to face strict online safety rules in UK | CNN Business",
  "date": "2026-02-17T07:30:45.540856+00:00",
  "authors": [
    "Hanna Ziady, CNN"
  ],
  "text": "Source: CNN\n\nAI chatbot providers, including ChatGPT and Grok, are facing a crackdown on illegal content in the United Kingdom, as the government promises swift action to make the internet safer for children.\n\n“Today we are closing loopholes that put children at risk, and laying the groundwork for further action,” UK Prime Minister Keir Starmer said in a statement Monday.\n\nBritain’s clampdown comes as artificial intelligence and social media have come under renewed fire for potential harms to young people after the Grok chatbot generatedsexualized images of women and childrenfor weeks on X, prompting amajorglobalbacklash.\n\nCentral to the UK government’s plan is an amendment to the Crime and Policing Bill, which will require AI chatbot providers to comply with duties under the Online Safety Act to protect users from illegal content. Failure to do so could result in fines and other penalties.\n\nThe government will also seek new legal powers designed to fast-track future protections for children’s wellbeing online.\n\nThis will enable it to act quickly on measures such as setting a minimum age of 16 for social media use — a proposal that opened for public consultation last month and follows similar developments inAustraliaandSpain.\n\nOther possible measures include curbing features such as infinite scrolling, tightening safeguards around the sharing of nude images, and examining restrictions on children’s access to AI chatbots and virtual private networks.\n\nThe move highlights a push by legislators globally to ensure that domestic laws keep pace with the breakneck speed of advances in artificial intelligence. The UK’s Online Safety Act, while an ambitious effort to regulate digital platforms, was passed in 2023, when AI chatbots were still in their infancy and were considerably less capable than they are barely three years later.\n\n“One of the difficulties here is that the technology moves on so quickly that the legislation struggles to keep up, which is why for AI chatbots we need to take the necessary measures,” Starmer told parents and young people during an address in south London on Monday.\n\nLast month, the UK government joined a global outcry against Grok after it complied with user requests togenerate sexualized images of women and children. The function was subsequently removed, but not before the UK communications regulator, Ofcom, launched aformal investigation into X, which integrates Grok, over the issue.\n\n“The action we took on Grok sent a clear message that no platform gets a free pass,” Starmer, who has two teenage children, said.\n\n“I see this in the way many parents do, with a real sense of concern about the time that’s spent on social media, the content that’s available on social media, the addictive nature of a lot of what’s happening on social media — the way it draws children in and takes away other aspects of their growing up,” he added.\n\nAlso this week, hearings in alandmark social media trialagainst Meta and YouTube will continue in Los Angeles, probing whether or not platforms such as Instagram are intentionally addictive.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/tech/grok-elon-musk-image-generation",
      "text": "sexualized images of women and children"
    },
    {
      "url": "https://www.cnn.com/2026/01/12/business/indonesia-malaysia-grok-elon-musk-intl-hnk",
      "text": "major"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/tech/eu-probe-grok-sexualized-images-intl",
      "text": "global"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/world/video/business-breakout-grok-ai-hadas-gold-011512pseg1-cnni-biz-fast",
      "text": "backlash"
    },
    {
      "url": "https://www.cnn.com/2025/12/09/tech/australia-social-media-teen-ban-us-explainer",
      "text": "Australia"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/tech/spain-under-16-social-media-ban-intl",
      "text": "Spain"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/tech/grok-elon-musk-image-generation",
      "text": "generate sexualized images of women and children"
    },
    {
      "url": "https://www.ofcom.org.uk/online-safety/illegal-and-harmful-content/investigation-into-x-and-scope-of-the-online-safety-act",
      "text": "formal investigation into X"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/video/berman-duffy-meta-youtube-social-media-cnc",
      "text": "landmark social media trial"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/uk-ai-chatbots-online-safety-act-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/business/uk-ai-chatbots-online-safety-act-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "89d6a0bfb99e54fdabc4f16743fbf072e0c010a59c77517180abbe7450315449",
  "scraped_at": "2026-02-17T07:30:45.540869+00:00"
}