{
  "url": "https://lite.cnn.com/2026/02/24/politics/us-warned-ukraine-ambassador-strikes-black-sea-oil",
  "title": "US warned Ukraine’s ambassador over strikes on Black Sea oil target | CNN Politics",
  "date": "2026-02-25T07:32:10.775395+00:00",
  "authors": [
    "Jim Sciutto",
    "Jennifer Hansler"
  ],
  "text": "Source: CNN\n\nThe Trump administration took the unusual step of warning the Ukrainian government that itsstrikes on a Russian Black Sea oil facilitylate last year had impacted US investments in Kazakhstan, the Ukrainian ambassador to the US revealed Tuesday.\n\n“We have been hearing that Ukrainian attacks to Novorossiysk affected some of the American investments which are being performed through Kazakhstan. And we have heard from Department of State that we should refrain from, from, you know, attacking American interests,” Ambassador Olga Stefanishyna said at a briefing.\n\nStefanishyna said she had received a demarche, which is a formal diplomatic notice, from the US State Department over the matter. CNN has reached out to the State Department for comment.\n\nThe news comes on thefourth anniversary of Russia’s invasionwith no end to the brutal war in site. US-brokered peace talks have shown little sign of a breakthrough. The unusual move to issue the demarche appears to speak to the administration’s priorities and follows Trump’s decision to halt new military aid to Kyiv last year.\n\nThe Ukrainian ambassador said the US did not suggest Kyiv should refrain from attacking Russian military and energy infrastructure.\n\n“It was related to the very fact that American economic interest was affected there,” she said. “We have taken the note on that.”\n\nIn late November, Ukrainian drones struck the Black Sea port of Novorossiysk, damaging not just Russian interests but also a key pipeline, which led to a significant drop in Kazakh oil exports. Chevron is a major shareholder in the Caspian Pipeline Consortium, which carries oil from Kazakh oil fields to the Black Sea for export.\n\nStill, the communication came as Russia was vastly expanding its own missile and drone strikes on Ukrainian cities and energy infrastructure in the midst of Ukraine’s coldest winter in a decade – attacks described by Ukrainian and European officials as a deliberate effort to inflict suffering on civilians.\n\nThe ambassador noted that the missive from the State Department underscored that US does not currently have the same economic interests in Ukraine as it does in Kazakhstan.\n\n“I was really, really sorry that in 35 years of Ukraine independence, having so many chances, we never brought ourselves to the situation where we can do the same,” she told reporters Tuesday.\n\nThe Trump administration has made economic and energy investments a key part of its foreign policy. Last year, the US and Ukraine signed an“economic partnership agreement”that will give Washington access to Kyiv’s mineral resources in exchange for establishing an investment fund in Ukraine.\n\nAs Russia’s full-scale war enters its fifth year, Stefanishyna praised the support of the US to Ukraine, which has changed substantially under the Trump administration.\n\nShe decried what she called a lack of political pressure and failure to give Kyiv the heavy weapons it asked for at the outset of the war in 2022, saying it had allowed Russia to continue to develop.\n\n“Because of lack of sanctions, lack of pressure, lack of commitment, in terms of military systems, we were doing enough for Ukraine to survive, but we were not doing enough for Russia not to evolve,” she said.\n\nStefanishyna called on US lawmakers to pass legislation to increase sanctions on Moscow, saying that a delay in its passage is seen as a win for Moscow.\n\n“It should be either passed now or we will just have to recognize that there’s no will to do it,” she said.\n\n“If we are able to impose more sanctions and more pressure on Russia, they will not be in a position to withdraw from the negotiations,” she added.\n\nNegotiations between Ukraine, Russia, and the US have yet to yield results, and Moscow has continued its relentless assaults on Ukrainian civilian infrastructure.\n\nUkrainian President Volodymyr Zelenskytold CNNMonday that he wants US President Donald Trump “to stay on our side.”\n\n“If they really want to stop Putin, America’s so strong,” he said. Asked if he believes Trump is putting enough pressure on Putin, Zelensky said, “No.”\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/29/europe/russia-shadow-fleet-ukraine-explosions-intl",
      "text": "strikes on a Russian Black Sea oil facility"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/europe/ukraine-war-russia-anniversary-intl-cmd",
      "text": "fourth anniversary of Russia’s invasion"
    },
    {
      "url": "https://www.cnn.com/2025/04/30/europe/ukraine-us-mineral-deal-intl",
      "text": "“economic partnership agreement”"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/europe/zelensky-trump-ukraine-russia-war-intl-latam",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/us-warned-ukraine-ambassador-strikes-black-sea-oil",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/us-warned-ukraine-ambassador-strikes-black-sea-oil",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8a0bd3ffc83f8581a46a6d197302e3f3539ab3133cd09ecc01a8ab4f9d88509c",
  "scraped_at": "2026-02-25T07:32:10.775407+00:00"
}