{
  "url": "https://lite.cnn.com/2026/02/20/politics/dhs-white-house-congress",
  "title": "Lawmakers say they’ve been stonewalled by DHS, undercutting attempts to hold Trump officials accountable | CNN Politics",
  "date": "2026-02-23T07:38:56.221738+00:00",
  "authors": [
    "Annie Grayer",
    "Gabe Cohen",
    "Evan Perez",
    "CNN"
  ],
  "text": "Source: CNN\n\nLawmakers who oversee the Department of Homeland Security say the agency has repeatedly stymied their requests for information in recent months, with even some Republicans alleging they’ve had phone calls go unanswered and data requests left to languish.\n\nAs the Department of Homeland Security has found itself embroiled in controversies across the country over high-profile killings by immigration agents and the resulting bitter policy disputes, lawmakers say they’ve stepped up their efforts to try to get answers for the public. But they’ve often been met with resistance, they said — thwarting their ability to hold anyone accountable.\n\n“I’m not going to sit here on bended knee hoping to God that somebody returns the call,” GOP Rep. Mark Amodei, the Republican who oversees the DHS budget in the House told CNN, after his request to speak with White House Border Czar Tom Homan went unanswered for days.\n\nOne Republican staffer told CNN that the stonewalling extends beyond just thorny policy questions about immigration enforcement. Requests to the Federal Emergency Management Agency on the status of federal disaster funding and questions over potential crimes committed by those detained by federal officers have also been met with silence or evasiveness, the staffer said.\n\nThe result, the staffer said, is not only that GOP lawmakers can’t properly oversee the agency, they can’t help blunt possibly unfair attacks from their Democratic counterparts.\n\n“It’s really a shame that DHS has taken such an adversarial posture on sharing data. In some areas, like on immigration and the border they have a great story to tell, and we could be helping them tell that story,” the staffer explained. “In other areas where the story is not so good, like FEMA, we could also help. But they choose to go at it alone, so it’s on them to defend, which is hard to do when no one believes a word they say or a number they put out. There is no trust and there is no way to verify.”\n\nDemocrats, meanwhile, say they have received virtually no response from their inquiries to DHS. At least 15 letters sent by members of the party to the department have either been ghosted, received a cursory acknowledgement or were given a non-answer, a Homeland Security Committee Democratic aide told CNN. Another Democratic staffer told CNN that when they’ve asked for specific FEMA updates, whether it’s on mitigation projects, staffing plans or briefings on various press releases, they’ve gotten no response.\n\nA DHS spokesperson told CNN the department works through “official channels” and would “not be litigating our relationship” with Capitol Hill through the press. But they also dismissed claims they’ve not engaged with members of Congress.\n\n“Any suggestion that DHS has ‘refused’ to engage with lawmakers is simply false,” the spokesperson said in part, adding that “this administration has been the most transparent administration in history and has spent the last year clearing out congressional correspondence that went unanswered under the last administration.”\n\nSome Republicans told CNN they’ve been able to leverage their personal relationships with Trump administration officials to get their questions answered and others said they had no issues getting quick responses from DHS – “I communicate with them all the time,” GOP Rep. Andy Ogles said. But two top Republican congressman specifically tasked with overseeing DHS are among those who say they’ve run into issues.\n\nAmodei, the chairman of the House Homeland Security Appropriations Subcommittee, sought to speak directly with Homan about the operation in Minneapolis shortly after federal officers’ fatal encounter with Alex Pretti there, as well as to receive a broader status update on the administration’s deportation efforts.\n\nAmodei’s office put in the request in January and was redirected to White House Office of Legislative Affairs Director James Braid to coordinate the conversation. The request went unanswered for 10 days, prompting the Nevada Republican to eventually withdraw the request, Amodei said.\n\nThe administration was focused on executing the mission in Minneapolis at the time of Amodei’s request, an official said when asked by CNN about the request, adding that it could now be arranged.\n\n“At the time, we were prioritizing the actual execution of the mission in Minneapolis,” the administration official said. “Now going forward, we’re happy to offer Chairman Amodei a briefing as well as other congressional committees.”\n\nBut Amodei, who projected confidence he’ll get the information another way, suggested it was a question of respect. “I wish they were more professional with how they dealt with the people who handled their budget,” he told CNN from his Capitol Hill office.\n\nAfter withdrawing his initial request, Amodei has recently spoken with Braid about arranging a call with Homan, the congressman’s office told CNN.\n\nAnother Republican chairman — Rep. Andrew Garbarino of the House Homeland Security Committee — tried for weeks to schedule DHS Secretary Kristi Noem for testimony for the annual worldwide threats hearing before his panel, and eventually resorted to asking the White House in December to lean on her to agree on a date, according to a US official familiar with the discussions.\n\nNoem finally agreed to a hearing, where she was excoriated by Democrats for her handling of immigration, FEMA and other issues. The administration official declined to comment on any coordination with Garbarino, saying they don’t discuss private conversations with members.\n\nGarbarino said at the eventual December hearing that he made “numerous accommodations” for Noem’s appearance.\n\n“This is why this hearing is so important. Congress must hear from the Executive. Oversight is not unfair. And asking questions is not unwarranted. We must ensure the people’s representatives are informed,” the New York Republican said at the time.\n\nCNN has reached out to Garbarino’s office for comment.\n\nAccording to a data analysis compiled by ProQuest Congressional Data and shared with CNN, there has been a 28.7% decline in appearances of DHS officials before congressional committees in 2025, compared to the first year of previous administrations.\n\nDemocratic Rep. Bennie Thompson, the top Democrat on the House Homeland Security Committee, said he’s never seen it this bad.\n\n“I’ve never met Secretary Noem other than the two times she came before the committee last year. I’ve met every secretary since the department was created in my office or in a number of occasions,” Thompson said.\n\nThe Mississippi Democrat said that for a year, he had not had any direct interaction with an ICE official until he met the director the day before his scheduled hearing before the committee earlier this month. Witnesses before a hearing are required to submit their written testimony to Congress the day before a hearing, but Thompson said the ICE director came to his meeting with his prepared testimony in hand and said he was still working on it.\n\n“If the legislative is to function, then the executive branch has to be forthcoming with the information. If they’re not forthcoming with the information, then it’s almost impossible for the legislative branch to basically provide any road maps for future success because we don’t have access to the data,” Thompson said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/dhs-white-house-congress",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/dhs-white-house-congress",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8a1784d850f87111dc20ce4e14691dbfa12d57c4686ec6c9acb9bd404572e29e",
  "scraped_at": "2026-02-23T07:38:56.221752+00:00"
}