{
  "url": "https://lite.cnn.com/2026/02/10/media/paramount-sweetens-bid-warner-bros-netflix",
  "title": "Paramount sweetens hostile bid to stop Netflix-Warner Bros. deal | CNN Business",
  "date": "2026-02-11T16:39:45.616873+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nParamount on Tuesday moved again to sweeten its hostile bid for Warner Bros. Discovery, escalating its effort to derail the company’s pending acquisition by Netflix.\n\nThe David Ellison-led entertainment empire said it would pay Warner Bros. Discovery shareholders (WBD) approximately $650 million for each quarter the Netflix deal is not closed, beginning in 2027.\n\nParamount also said it would “fully and promptly” pay the $2.8 billion fee that Warner Bros. Discovery (WBD) would owe Netflix if their deal is terminated, according toa new SEC filing.\n\nThe filing comes as WBD moves toward closing its $83 billion deal to sell its studios and streaming assets to Netflix. Last month, Netflixrevised its offerto all cash. (WBD’s remaining cable networks, including CNN, would spin off into a separate company called Discovery Global.)\n\nParamount notably did not increase its current $30-per-share, all-cash offer for the entire company, including CNN.\n\nBut the new “enhancements,” Ellison saidin a statement, are meant to provide WBD shareholders with “certainty in value, a clear regulatory path, and protection against market volatility.”\n\nWBD’s shares opened up about 1% on the news. However, to date, there is little evidence that shareholders are siding with Paramount in sufficient numbers. WBD has recentlysaidthat “more than 93%” of its shareholders are “rejecting Paramount’s inferior scheme.”\n\nWBD’s shareholders are expected to hold a special meeting in late March or early April.\n\nMeanwhile, Netflix has been ramping up its PR battle against Paramount’s hostile bid.\n\nDuring a Monday interview on the Fox Business Network, Netflix’s chief global affairs officer, Clete Willems, warned against Paramount’s proposal, saying the company “has identified $6 billion in synergies in the offer that they made, which is code for $6 billion in job cuts.”\n\nWillems also addressed concerns about a Department of Justice probe into Netflix’s business practices, which wasfirst reportedby The Wall Street Journal.\n\nSuch reviews, Willems said, are part of the “totally ordinary course of business” when examining a merger.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/WBD",
      "text": "WBD"
    },
    {
      "url": "https://www.sec.gov/Archives/edgar/data/2041610/000110465926012397/tm2533570d52_sctota.htm",
      "text": "a new SEC filing"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/media/netflix-all-cash-offer-warner-bros-discovery",
      "text": "revised its offer"
    },
    {
      "url": "https://ir.paramount.com/news-releases/news-release-details/paramount-enhances-its-superior-30-share-all-cash-offer-warner",
      "text": "in a statement"
    },
    {
      "url": "https://x.com/brianstelter/status/2014359086763016252",
      "text": "said"
    },
    {
      "url": "https://www.wsj.com/business/media/justice-department-casts-wide-net-on-netflixs-business-practices-in-merger-probe-fd30d7f8",
      "text": "first reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/media/paramount-sweetens-bid-warner-bros-netflix",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/media/paramount-sweetens-bid-warner-bros-netflix",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8a1c7472364890fbc001315427be3f85bab4937767cee2c8b3a74deacc821a4f",
  "scraped_at": "2026-02-11T16:39:45.616886+00:00"
}