{
  "url": "https://lite.cnn.com/2026/02/13/uk/uk-palestine-action-ban-gbr-uk-intl",
  "title": "Palestine Action: UK High Court rules terror ban is unlawful, marking blow to government | CNN",
  "date": "2026-02-14T07:07:55.211110+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe UK High Court on Friday ruled that the government’s decision to ban activist groupPalestine Actionas a terrorist organization last summer was unlawful, marking a major victory for civil liberties campaigners.\n\nThe court found that then-Home Secretary Yvette Cooper’s decision to proscribe the group was disproportionate, raising questions about the arrests of almost 3,000 people at solidarity protests. But Judge Victoria Sharp ruled that the ban remains in place pending an appeal by the goverment.\n\nHuman rights activists had argued the ban represented a sweeping overreach of government power, risked criminalizing political dissent and set a far-reaching precedent for the use of anti-terror laws against protest movements.\n\nThe co-founder of the group, Huda Ammori, had brought the legal challenge against the British government’s decision to ban the group under anti-terrorism laws.\n\nIn an interview with CNN Friday, Ammori said the ruling means “all of those arrests were technically unlawful.”\n\n“We are in a bit of legal limbo at the moment,” she told CNN’s Becky Anderson. “But this is a huge victory, and it’s only a matter of time before the ban is lifted for good.”\n\nThe ruling follows one of the largest campaigns of nonviolent civil disobedience in recent history, with 2,787 people – many of them pensioners or the elderly – arrested at protests nationwide since July.\n\nMost of those arrests were for holding signs that read: “I oppose genocide, I support Palestine Action,” at the demonstrations, according to Defend Our Juries – which has been instrumental in organizing the protests.\n\nA Defend Our Juries spokesperson called for a meeting with the home secretary and London’s police chief, urging them “to right the wrongs of the ban, including the wrongful treatment of all those who have been unlawfully arrested and charged under the proscription.”\n\nLondon’s Metropolitan Police on Friday acknowledged “there will likely be some confusion,” among the public following the government’s announcement to appeal the decision. It said that officers will no longer be making arrests in relation to Palestine Action support but will continue to “focus on gathering evidence.”\n\nFollowing Friday’s ruling, crowds who had gathered outside London’s High Court erupted in cheers and chants of “Free free Palestine,” with some people in tears.\n\n“Thousands of people of conscience saw that branding protest as terrorism was a move straight out of the dictator’s playbook. Together we took action at great personal risk – inspired by each other’s courage. We helped make this proscription unenforceable by saying “we do not comply,” the Defend Our Juries spokesperson said.\n\nLisa Minerva Luxx, who was among the crowd of supporters, told CNN the government should end its appeal. “The British people’s taxpayers’ money shouldn’t continue to be spent on this,” they said. The Home Office has spent nearly £700,000 (approximately $952,000) for work on the case, according to Ammori, citing a Freedom of Information request.\n\nThe case followed a three-day judicial review in December, where lawyers for the group’s co-founder argued the ban was “an extraordinary and unlawful escalation against political dissent.”\n\nPalestine Action is a UK-based group that aims to disrupt the operations of weapons manufacturers connected to the Israeli government and its war in Gaza. It was founded by Ammori and climate activist Richard Barnard in 2020, when the group took its first action to shut down the UK operations of Elbit Systems – Israel’s largest weapons manufacturer. The group’s primary mission is “ending global participation in Israel’s genocidal and apartheid regime.”\n\nSince its founding, Palestine Action has also, among other actions, occupied, blockaded, spray-painted and disrupted the Israeli-French drone company UAV Tactical Systems and the global arms giant Leonardo. It has slashed and spray-painted a portrait of former Foreign Secretary Arthur Balfour – whose 1917 declaration expressed London’s support for establishing a “national home for the Jewish people” in British-mandate Palestine – at Trinity College, Cambridge, and “abducted” two busts of Israel’s first president, Chaim Weizmann, from the University of Manchester.\n\nHowever, it was the group’s late June 2025 action at the RAF Brize Norton air base – where activists vandalized two Airbus Voyager refueling planes with paint and crowbars – that led to its banning.\n\nThe group was proscribed by the Home Office as a terror group days after the air base break-in, which placed it on equal footing with organizations such as al Qaeda and ISIS. The move sparked condemnation from United Nations experts, human rights groups, and politicians.\n\nGovernment lawyers argued proscription of the group was a necessary national security measure.\n\nThe High Court ruling follows one of the UK’s longesthunger strikes, the government’s decision not to award Elbit Systems UK a £2 billion ($2.7bn) British defense ministry contract and the acquittal of activists charged over a break-in at an Elbit Systems UK factory in Bristol this month.\n\nThe ruling also focuses attention on the question at the heart of the Palestine Action debate: How Britain applies counterterrorism laws to domestic protest and the limits of executive power.\n\nCNN’s Mick Krever and Isobel Yeung contributed reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/06/uk/palestine-action-group-ban-protests-uk-intl",
      "text": "Palestine Action"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/uk/palestine-action-uk-hunger-strikers-intl",
      "text": "hunger strikes"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/uk/uk-palestine-action-ban-gbr-uk-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/uk/uk-palestine-action-ban-gbr-uk-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8a83c4ca95e74a7fa50aba18836bbc829e681a3ccc23d934ab63316e16e22ec5",
  "scraped_at": "2026-02-14T07:07:55.211124+00:00"
}
