{
  "url": "https://lite.cnn.com/2026/02/24/politics/kash-patel-fbi-jet-use-explained",
  "title": "Kash Patel’s use of the FBI jet sparks outrage. Here’s why he couldn’t travel to the Olympics any other way | CNN Politics",
  "date": "2026-02-25T07:32:02.605930+00:00",
  "authors": [
    "Evan Perez"
  ],
  "text": "Source: CNN\n\nTop officials at FBI headquarters were tracking the outbreak ofviolence in Mexicoon Sunday after its military killed a drug cartel boss when social media erupted with viral images of Director Kash Patel chugging beer in thelocker room celebrationof the Olympic gold medal-winning US men’s hockey team.\n\nThe FBI for days fought off criticism of the hockey-loving Patel’s trip on the agency plane to Italy for what the bureau said was long-planned official business, which coincided with the medal round of play for Team USA.\n\nOn Tuesday, Sen. Dick Durbin took aim at Patel’s trip in a letter he sent to the Government Accountability Office reporting that whistleblowers told him the director’s past air travel caused delays in high-profile investigations.In the letter, the Illinois Democrat asked the GAO to include his whistleblower complaints into an investigation into Patel’s plane travel and requested the Justice Department’s Office of Inspector General open an investigation.\n\nDurbin alleged in the letter that Patel’s personal travel and priorities have caused delays or issues in high-profile investigations in the past — including in the aftermath of the Charlie Kirk assassination in September and the Brown University shooting in December.\n\nThe FBI has three jets based in Virginia for various operational purposes in addition to the director’s travel, and a fleet of propeller aircraft stationed across the country for surveillance and emergency response missions.\n\n“Unfortunately, as a credible source described to my staff, the tone was set early during Director Patel’s tenure when he said in a meeting with the field offices last year, ‘If you have golf, hockey, fishing, or hunting and beautiful sights, you’re going to see a lot of me,’” Durbin wrote to the GAO. “As has been reported, the Director’s frequent misuse of the FBI’s Gulfstream jets for personal travel has even frustrated White House and DOJ senior staff.”\n\nMuch of the criticism of Patel’s Olympics trip centers on his use of an FBI Gulfstream jet for personal travel since taking office.\n\nIt’s a criticism that has also dogged previous FBI directors, and earlier, attorneys general. And Patel himself, before becoming FBI director, criticized the use of the FBI plane by his predecessor Christopher Wray, suggesting it should be grounded.\n\n“Chris Wray doesn’t need a government-funded G-5 jet to go to vacation,” Patel said when appearing on Glenn Beck’s podcast in 2024. “Maybe we ground that plane — $15,000 every time it takes off.”\n\nBut just like it wasn’t up to Wray then, Patel doesn’t have a choice in how he travels.\n\nA post-9/11 government regulation requires the attorney general, and since 2011, the FBI director, to use government aircraft for all travel, including personal trips. The reason for the policy, according to the Justice Department, is that the president and other top officials must always have secure communications available with the FBI director and attorney general, in case of national security or other emergencies.\n\nSince becoming director a year ago, Patel’s trips to Nashville and other locations to visit his girlfriend, a golfing destination with friends and to attend hockey games have prompted criticism from Democrats who have demanded the FBI provide information about the use of resources.\n\n“Mr. Patel, these planes are not yours. They are the property of the U.S. Government and are paid for by the American people,” Maryland Rep. Jamie Raskin and California Rep. Sydney Kamlager-Dove, wrote in a letter to Patel in December.\n\nPatel and the FBI have defended the use of FBI aircraft, saying that he is complying with federal law that requires reimbursing the government the cost of commercial airline tickets for his personal travel. Critics note that operating the FBI aircraft costs tens of thousands of dollars, far exceeding a commercial ticket reimbursement.\n\nFor his visit to Italy for the Olympics last week, the FBI disputed a CBS News report that Patel was traveling to cheer on the men’s hockey team and cited numerous meetings he was scheduled to have.\n\nA person briefed on the trip told CNN said the visit to Italy included law enforcement meetings and official agreement signings, and had been long planned, well before the US hockey team had made it to the final round of competition.\n\nIn past years, the FBI has dispatched agents to observe Olympics security preparations. Recent FBI directors haven’t personally traveled for those preparations.\n\nStill, when Patel surfaced at the men’s hockey final, there was little surprise. Patel has played hockey for years and is known to be a fan. He turned up with hockey great Wayne Gretzky for games where Washington Capitals star Alex Ovechkin tied and surpassed Gretzky’s all-time goals record.\n\nInside the FBI, Patel’s conduct has divided some employees. Some applaud Patel’s embrace of bro culture, and his frequent rallying and boosting of their work. Others criticize the director’s wearing of an FBI badge, despite the fact he’s not an agent, and have found it embarrassing to see their leader swigging beer and using curse words in a viral hockey celebration video Sunday. Some are circulating AI-generated Youtube videos of Patel’sOlympics trip, including one where a fictionalized version of the FBI director is seen dancing and spraying Champagne around the locker room.\n\nThe video of Patel’s actual visit to the locker room, though, surfaced during in the hours after the game, as top officials were still working to assess safety issues for Americans in parts of Mexico, where cartel gunmen were roaming the streets setting fires to vehicles and buildings, according to a person briefed on the matter.\n\nA senior FBI official said the director was receiving regular updates Sunday about the situation unfolding in Mexico and the FBI has continued to provide necessary support.\n\nThe FBI last year sought to obtain a new long-distance aircraft, according to government bidding proposal records.\n\nThe proposal said the FBI required an “ultra-long-range business jet to enable rapid, global transport of Department of Justice personnel in support of counterterrorism efforts, high-risk operations, and other sensitive missions.”\n\nThe request came amid a push by Dan Bongino, the former deputy FBI director, to also access government aircraft because of security concerns. Typically, deputy FBI directors don’t automatically qualify for private plane travel.\n\nAmid criticism over use of the jets, the Justice Department withdrew the request for proposals for a new plane about a month after it was issued. An FBI spokesman at the time said Bongino’s travel wasn’t the reason for the jet proposal.\n\nSen. Chuck Grassley for years has been a critic on the issue of using government jets for personal travel. The Iowa Republican wrote letters and excoriated former Attorney General Eric Holder and Wray for their use of the FBI aircraft. But at a hearing last fall where Democrats raised questions about Patel’s use of the plane, he took aim at Patel’s critics.\n\n“I find it interesting that my Democratic colleagues seem to bring up your use of the Justice Department planes, yet my Democratic colleagues didn’t seem too interested about my oversight of Wray’s use of the plane,” he said. “I didn’t hear a peep. So, my Democratic colleagues need to be consistent.”\n\nPatel welcomed the lifeline from the Senate Judiciary Committee chairman, interjecting that his use of FBI aircraft was less than that of his predecessors. He also claimed to be saving taxpayers money because instead of having the FBI plane fly from a hangar in Manassas, Virginia, to Ronald Reagan National Airport — he instead travels to Joint Base Andrews in Maryland to avoid landing fees.\n\n“We take off and land at Andrews every single time because it’s cheaper and we do so because it saves the taxpayers’ dollars,” Patel said.\n\nHolder, the former attorney general who was the subject of criticism from Grassley and other Republicans, said he is struck by the silence from the same Republicans on Patel’s travel. Holder said he still believes there’s a legitimate need for FBI directors to travel on government aircraft for emergency secure communications reasons. But he believes Patel is abusing the privilege.\n\nHolder  told CNN in an interview that during his time as attorney general he replaced his family trips abroad to go to Martha’s Vineyard instead.\n\n“Can you imagine the clamor from Republicans if I used a government plane like Patel? All we get now is silence from them,” Holder said.\n\nCNN’s Josh Campbell contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/americas/how-mexico-hunted-el-mencho-latam-intl",
      "text": "violence in Mexico"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
      "text": "locker room celebration"
    },
    {
      "url": "https://www.judiciary.senate.gov/imo/media/doc/2026-02-24%20Letter%20to%20GAO%20and%20DOJ%20IG%20on%20Kash%20Patel%20Olympic%20Travel.pdf",
      "text": "In the letter"
    },
    {
      "url": "https://www.youtube.com/watch?v=ajezdyq4Vos",
      "text": "Olympics trip"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/kash-patel-fbi-jet-use-explained",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/kash-patel-fbi-jet-use-explained",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8a84f5c92faf8f21240aa3e6316f8e9d38c4cff3861b8fbc8b29f42cc260e65c",
  "scraped_at": "2026-02-25T07:32:02.605940+00:00"
}