{
  "url": "https://lite.cnn.com/2026/02/23/health/cdc-deputy-ralph-abraham-departs",
  "title": "CDC deputy director abruptly departs agency | CNN",
  "date": "2026-02-24T07:31:44.999686+00:00",
  "authors": [
    "Jamie Gumbrecht",
    "Brenda Goodman",
    "CNN"
  ],
  "text": "Source: CNN\n\nDr. Ralph Abraham is leaving the US Centers for Disease Control and Prevention, where has been serving as principal deputy director, the agency said Monday. It’s the latest in a string of leadership changes that have shaken the health agency during the second Trump administration.\n\nAbraham, who wassworn inon December 15, “chose to step down to address unforeseen family obligations,” according to astatementposted on the CDC’s website.\n\n“It has been an honor to serve alongside the dedicated public health professionals at the CDC and to support the agency’s critical mission,” Abraham said in the statement.\n\nAbraham’s exit follows the departure of the CDC’s acting director,Jim O’Neill, who left his role at the US Department of Health and Human Services in an ongoing shakeup ahead of this year’s midterm elections. The director of the National Institutes of Health, Dr. Jay Bhattacharya, stepped in to the role ofacting directorof CDC this month.\n\nAfter months without a permanent director following theabrupt removalof Dr. Susan Monarez — the Senate-confirmed CDC director who spent less than a month in office after she refused to rubber stamp anti-vaccine policy changes — Abraham was seen by some as an affable and somewhat steadying presence. He was working out of the CDC’s headquarters in Atlanta and was a medical doctor, a qualification recent Trump appointees had lacked.\n\nLike HHS Secretary Robert F. Kennedy Jr., Abraham promoted health freedom and expressed skepticism about vaccines. Last month, Abraham said the United States’ potential loss of measles elimination status was“not really” a concern, saying it’s “just the cost of doing business with our borders.”\n\nAbraham’s departure is the latest blow to an agency that’s been gutted under the Trump administration.\n\nThe churn of top personnel follows the firings of thousands of agency staff though reduction-in-force cuts. After public outcry and legal challenges, some of those positions were later reinstated.\n\nThe agency also remains rattled after it was the target of aviolent attackby a shooter who had blamed vaccines for his health problems. DeKalb County Police Officer David Rose was killed, and buildings were left pocked with bullet holes.\n\nThe agency has also seen its website altered without input from its career scientists to cast doubt on the safety of vaccines and to remove references to transgender identity and transgender health concerns.\n\nBefore coming to the CDC, Abraham was thesurgeon general of Louisiana. In that post, Abraham controversially ordered health officials to stop promoting mass vaccination. Abraham also ran for governor of Louisiana in 2019 but did not advance to a runoff.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cdc.gov/media/releases/2025/2025-principal-deputy-director.html",
      "text": "sworn in"
    },
    {
      "url": "https://www.cdc.gov/media/releases/2026/2026-statement-on-the-resignation-of-the-cdc-principal-deputy-director.html",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/health/rfk-aides-jim-oneill-hhs-cdc",
      "text": "Jim O’Neill"
    },
    {
      "url": "https://www.cdc.gov/about/leadership/director.html",
      "text": "acting director"
    },
    {
      "url": "https://www.cnn.com/2025/08/27/health/cdc-director-monarez",
      "text": "abrupt removal"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/health/cdc-south-carolina-measles-briefing",
      "text": "“not really” a concern"
    },
    {
      "url": "https://www.cnn.com/2025/08/12/us/cdc-atlanta-shooting-shots-windows",
      "text": "violent attack"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/health/cdc-deputy-director-ralph-abraham",
      "text": "surgeon general of Louisiana"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/health/cdc-deputy-ralph-abraham-departs",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/health/cdc-deputy-ralph-abraham-departs",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8aa94f6509c66fb08f8387335f620271563371e5968db5651c9bf4d2f9b897f0",
  "scraped_at": "2026-02-24T07:31:44.999700+00:00"
}