{
  "url": "https://lite.cnn.com/2026/02/20/politics/cia-retracts-intel-reports-ratcliffe",
  "title": "CIA retracts intel reports that agency says failed to meet standards for political bias | CNN Politics",
  "date": "2026-02-22T07:10:01.317231+00:00",
  "authors": [
    "Sean Lyngaas, CNN"
  ],
  "text": "Source: CNN\n\nCIA DirectorJohn Ratcliffehas ordered the retraction or “substantive revision” of 19 of the agency’s intelligence products after a review determined they failed to meet standards for analytic tradecraft and political independence, the Central Intelligence Agency said on Friday.\n\nThe spy agency released unredacted versions of three of the retracted or revised intelligence reports. The reports covered topics related to LGBT activists in the Middle East, women and White violent extremism, and contraception during the COVID-19 pandemic. One report was issued under the Biden administration, one under the first Trump administration and one under the Obama administration.\n\nFriday’s declassification is the latest move by Ratcliffe to use the agency’s authority to try to the turn the page on what he sees as the CIA’s past errors.\n\nAdeclassified CIA memoreleased last July criticized the analytic work that spy agencies did in concluding that Russia influenced the 2016 presidential election because it wanted Donald Trump to win. Even so, the memo didn’t directly contradict any previous US intelligence.\n\nThe intelligence products released on Friday “fall short of the high standards of impartiality that CIA must uphold and do not reflect the expertise for which our analysts are renowned,” Ratcliffe said in astatement.\n\nTrump’s Intelligence Advisory Board identified the intelligence products in the course of a review of hundreds of CIA analytic products over the last decade, according to the CIA. An internal review led by CIA Deputy Director Michael Ellis concurred that they did not meet agency standards.\n\nSen. Tom Cotton of Arkansas, the Republican chair of the Senate Intelligence Committee, welcomed the CIA’s retractions and revisions.\n\n“I’ve been sending these kind of reports back to the CIA for years and observing that they contain no intelligence,” Cotton said in apost on Xon Friday.\n\nSen. Mark Warner of Virginia, the intel committee’s top Democrat, in a statementslammedthe move as “part of a broader and deeply troubling pattern in this administration: sidelining career experts, undermining inconvenient intelligence assessments, and allowing political considerations to override professional judgment.”\n\n“Our country depends on the Intelligence Community’s ability to provide honest, fearless analysis, even when it is uncomfortable or inconvenient for those in power,” Warner said.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/11/12/politics/john-ratcliffe-cia-director/index.html",
      "text": "John Ratcliffe"
    },
    {
      "url": "https://www.cnn.com/2025/07/03/politics/cia-investigation-russia-trump",
      "text": "declassified CIA memo"
    },
    {
      "url": "https://www.cia.gov/stories/story/dcia-retracts-biased-intelligence-products-to-reinforce-cia-analytic-objectivity/",
      "text": "statement"
    },
    {
      "url": "https://x.com/SenTomCotton/status/2024983274070983133",
      "text": "post on X"
    },
    {
      "url": "https://www.warner.senate.gov/public/index.cfm/pressreleases?ID=C9B2ECCF-727D-42EB-9F63-1CF288F5E7DC",
      "text": "slammed"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/cia-retracts-intel-reports-ratcliffe",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/cia-retracts-intel-reports-ratcliffe",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8ace831e22c2bd5b5a98ff59efbfacc4e9f5cd56a283e6a6d629e41711d25b5b",
  "scraped_at": "2026-02-22T07:10:01.317245+00:00"
}