{
  "url": "https://lite.cnn.com/2026/02/26/economy/mortgage-rate-falls-below-six-percent",
  "title": "Mortgage rates fall below 6% for the first time in more than 3 years | CNN Business",
  "date": "2026-02-28T07:01:23.606884+00:00",
  "authors": [
    "Samantha Delouya"
  ],
  "text": "Source: CNN\n\nUS mortgage rates dropped below 6% this week, cracking a key threshold after years of punishing borrowing costs that sidelined millions of would-be buyers.\n\nOn Thursday, the average 30-year fixed mortgage rate fell to 5.98% for the first time since 2022, according to Freddie Mac.\n\nHomeowners who secured rock-bottom rates during the pandemic have had little incentive to sell and trade up to today’s higher borrowing costs. That reluctance has kept inventory scarce and prices elevated. But a mortgage rate beginning with a “5” could nudge more buyers back into the market and loosen the grip of the lock-in effect that has kept inventory tight, some experts say.\n\n“Nationwide we’re seeing inventory start to stabilize and even rise modestly, which could indicate that homeowners are becoming more comfortable with the current rate environment to consider a move,” said Bhavesh Patel, an executive at Chase Home Lending. “In some pockets across the US, we’re starting to see six or more months of inventory, which could lead to more favorable conditions for buyers.”\n\nWhile rates today are still higher than they were in the early years of the pandemic, this week’s average rate of 5.98% is a significant drop compared to the start of last year, when mortgage rates hovered above 7%.\n\n“A 0.25% drop in the rate can enable a buyer afford about 2.5% more house while keeping the same monthly payment,” Patel said.\n\nLower mortgage rates are already improving buying power. According to a Zillowanalysisthis week, the median-income US household can now afford a $331,483 home, a more than $30,000 increase in buying power since last year. The analysis found that the median-income household has seen roughly 82,300 more homes fall within their budget than a year ago.\n\n“While buying power has already increased $30,000 from last year, mortgage rates below 6% could be an important psychological threshold,” said Kara Ng, a senior economist at Zillow Home Loans. “Round numbers matter, and that headline alone could prompt many sidelined buyers to take another peek at the housing market.”\n\nStill, the affordability improvementsmay not feel significantfor some people looking for a home. Home prices have risen roughly 50% since 2020 and still hover near record highs. The median price for an existing home rose in January for the 31st consecutive month, according to the National Association of Realtors.\n\nSuch gains have added trillions of dollars in net worth to the two-thirds of Americans who are existing homeowners, while renters haven’t seen similar gains in their net worth.\n\nDespite the fact that President Donald Trump says he aims to improve affordability concerns for Americans, he recently said that he doesn’t want to see home prices fall too far.\n\n“People that own their homes, we’re going to keep them wealthy. We’re going to keep those prices up,” he said last month.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.zillow.com/research/buying-power-up-30k-36101/",
      "text": "analysis"
    },
    {
      "url": "https://www.cnn.com/2025/12/26/business/trump-housing-market-reform-home-prices-2026",
      "text": "may not feel significant"
    }
  ],
  "hash": "8b2b8b41fdc56fd902c373f04194805ab453adc77ef254d0dca5afa5191b207a",
  "scraped_at": "2026-02-28T07:01:23.606897+00:00"
}