{
  "url": "https://lite.cnn.com/2026/02/13/politics/us-iran-aircraft-carrier",
  "title": "US sending second aircraft carrier group to Middle East, sources say | CNN Politics",
  "date": "2026-02-14T07:07:42.704862+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Pentagon is sending a second aircraft carrier group – theUSS Gerald Ford– to the Middle East, according to a senior administration official and three sources familiar with the matter, a move that puts pressure on Iran even as President Donald Trump has said talks with Tehran will continue.\n\nTrump told reporters Friday he’s dispatching the second carrier group in case he is unable to reach a diplomatic agreement.\n\n“In case we don’t make a deal, we’ll need it,” he said, later adding the ships would depart if diplomacy is successful.\n\nThe Ford carrier strike group – the US’ most advanced – has been positioned in the Caribbean Sea for several months amid Trump’s campaign in Venezuela, which has included strikes on suspected drug boats in the Caribbean and culminated in the capture of Venezuelan President Nicolás Maduro in Caracas.\n\nIt will now join the USS Abraham Lincoln in the Middle East region, expanding Trump’s options for a potential strike on Iran. The move was first reported by theNew York Times.\n\nThe change comes even as Trump told Israeli Prime Minister Benjamin Netanyahu during a White House visit on Wednesday heintendsto keep pursuing a deal with Iran.\n\n“They want to make a deal, as they should want to make a deal,” Trump said last week. “They know the consequences if they don’t. If they don’t make a deal, the consequences are very steep. So we’ll see what happens.”\n\nTrump said Thursday that he hopes to get a deal with Iran “over the next month.”\n\nBut the president has not ruled out ordering new strikes and has ordered a buildup of assets that would allow for a major US air campaign against Iran’s nuclear and missile assets. Aside from the USS Abraham Lincoln, several US warships have been positioned in the region, comprising what Trump has referred to as a “flotilla.”\n\nThe USS Abraham Lincolnarrived in the Indian Oceanlast month, putting it closer to assist in any potential US operations targeting Iran.\n\nDays later, the Lincoln carrier was transiting the Arabian Sea about 500 miles from Iran’s southern coast when itshot down an Iranian drone.\n\nMeanwhile, delegations from the US and Iranmet earlier this monthin Oman for the first round of negotiations since the US and Israel struck Iran last summer. The talks came after Trumpheld off on strikesagainst Iran after seriously considering military action in response to the country’s brutal crackdown on protesters.\n\nAfter completing talks, US special envoy Steve Witkoff and Trump’s son-in-law Jared Kushnervisited the Lincoln carrier.\n\nA spokesperson for US Southern Command, which oversees the military’s operations in the Western Hemisphere, told CNN  the change in force posture won’t diminish the US’ capabilities in the Caribbean.\n\n“While force posture evolves, our operational capability does not. SOUTHCOM forces remain fully ready to project power, defend themselves, and protect U.S. interests in the region. At the direction of the President and the Secretary of War, we continue mission-focused operations to counter illicit activities and malign actors in the Western Hemisphere.”\n\nCNN has also reached out to the US Central Command, whose purview includes military operations in the Middle East.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/25/americas/aircraft-carrier-uss-gerald-ford-profile-intl-hnk-ml",
      "text": "USS Gerald Ford"
    },
    {
      "url": "https://www.nytimes.com/2026/02/12/us/politics/uss-ford-venezuela-oil.html",
      "text": "New York Times"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-11-26?post-id=cmlie16q400053b6qfyg0dbrw",
      "text": "intends"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/middleeast/iran-carrier-strike-group-indian-ocean-intl",
      "text": "arrived in the Indian Ocean"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/iran-drone-uss-lincoln-tensions",
      "text": "shot down an Iranian drone"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/middleeast/us-iran-oman-talks-explained-intl",
      "text": "met earlier this month"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/politics/strikes-iran-trump-military",
      "text": "held off on strikes"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/politics/kushner-witkoff-visited-uss-abraham-lincoln-carrier-amid-tension-with-iran",
      "text": "visited the Lincoln carrier."
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/us-iran-aircraft-carrier",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/us-iran-aircraft-carrier",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8b6f66232c5a46f617ff2417942a4e8b83eac3ed257e325faae8d9cf7718aaed",
  "scraped_at": "2026-02-14T07:07:42.704876+00:00"
}
