{
  "url": "https://lite.cnn.com/2026/02/11/style/mandy-moore-home-altadena-ad",
  "title": "Mandy Moore and Taylor Goldsmith nearly lost their dream home in the LA fires. Here’s how they rebuilt | CNN",
  "date": "2026-02-11T16:31:27.797477+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIn 2020, Mandy Moore and her musician husband Taylor Goldsmith bought their dream home in Altadena, California, as a family of two, hiring a team to begin renovating the romantic Spanish Colonial Revival property and update its 1930s charm. In 2023, as a family of four, with another baby on the way, they moved in and began living their new life in Altadena’s enclave of historic architecture, mountain views and small-town charm.\n\nNow, as a family of five, they are rebuilding the home they love after it was nearly irreparably damaged in the devastating Los Angeles wildfires last year. Moorecharts their journeyin the March 2026 issue of Architectural Digest, dedicated to Los Angeles.\n\nThe long process process is still ongoing. Their main house has been completed once again, while Goldsmith’s backyard music studio and an additional guesthouse are still under construction. (Goldsmith is the frontman of the LA folk rock band Dawes). Many of the rooms are decorated with a blend of earthy tones and decor with 1970s flare, such as curvilinear furniture, olive green accents and checkerboard rug in their living room, while their children’s rooms provide a sense of gentle escapism, like their sons’ dreamy sky-blue room with built-in bunk beds.\n\n“We wanted the house to age gracefully with the family,” Moore told AD. “That had a lot to do with the colors we chose — softer, richer, more playful.”\n\nTheir home is the joint effort of architect Emily Farnham, interior designer Sarah Sherman Samuel, and the landscape design firm Terremoto.\n\n“Mandy wanted color and pattern and soft edges. Her taste is sophisticated but playful. They’re both so creative. I like to say it’s a very grown-up house but with a little sparkle,” Samuel told the magazine. “They let us run, creatively.”\n\nMoore recalled to AD the January night she and Goldsmith had to evacuate — as the Eaton fire neared their neighborhood, they drove their three children, three cats and dog through the wildfire-stricken area to a friend’s house. They initially believed their home had burned down, but the structure remained intact. They lost most of their belongings due to smoke damage, however, and Goldsmith’s entire music studio — including his collection of vintage instruments — were gone. They were lucky to be spared the worst, and Moore describes the shock of seeing their community for the first time in the wake of the fires.\n\n“It was gutting to be up here before the lots were cleared and you saw the degree of the loss,” Moore said. “I wondered how we were ever going to go back. But I think because there are pockets that are untouched, and so much rebuilding is happening in patches around town, it’s clear that people still want to be here.”\n\nMoore and Goldsmith began rebuilding with their collaborators about four months after the fires. Farnham told AD that “everyone was in shock for a while,” and that she knew they would call when they were ready.\n\nIt was impossible to recreate the exact same home piece by piece, but with everything in the home catalogued by Samuel, they got close.\n\n“We found some new fabrics and rugs to change that up, and similar replacements for vintage pieces that we lost,” she explained. “But everything else remained the same.”\n\nAs Moore and Goldsmith continue work on their property, they’ve also seen their neighbors return and make progress, too. Moore says there’s an “undefeatable spirit” across the wider city.\n\n“People love to dog LA for every reason, and some of it is warranted. But when push comes to shove, people show up for their neighbors,” she said. “I don’t think that was ever more evident than during the fires.”\n\nWith the release of the latest edition of the magazine, AD’s editor in chief Amy Astley unveiled the launch of a new fundraising initiative, Design Making a Difference, partnering with Habitat for Humanity and the Foothill Catalog Foundation, to help rebuild homes lost in the fires. The issue also features a guide to the city with recommendations from famous Angelinos including Kristen Stewart — the issue’s cover star — Lisa Kudrow and Noah Wyle. “It’s a personal tour with a lot of heart,” wrote Astley in her editor’s note.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.architecturaldigest.com/story/mandy-moore-taylor-goldsmith-altadena-home",
      "text": "charts their journey"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/style/mandy-moore-home-altadena-ad",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/style/mandy-moore-home-altadena-ad",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8ba6d5c173049ee3e4dcc60462a075f475ad71111ae44637641c72dc0e5ec302",
  "scraped_at": "2026-02-11T16:31:27.797490+00:00"
}