{
  "url": "https://lite.cnn.com/2026/02/17/politics/tricia-mclaughlin-homeland-security-spokesperson-leaving",
  "title": "Department of Homeland Security spokesperson Tricia McLaughlin to leave agency | CNN Politics",
  "date": "2026-02-19T07:32:10.129793+00:00",
  "authors": [
    "Priscilla Alvarez",
    "Michael Williams",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Department of Homeland Security’s top spokesperson, Tricia McLaughlin, is stepping down.\n\nMcLaughlin is expected to leave her position as assistant secretary next week, a Trump administration official told CNN.\n\nHer departure comes on the heels of high-profile shootings in Minnesota, where conflicting accountscalled into questionthe department’s credibility. McLaughlin was one of the agency’s most vocal — and, apart from Secretary Kristi Noem, most visible — defenders, making appearances across news networks to defend President Donald Trump’s mass deportation agenda and taking to social media to blast reporting on the agency.\n\n“I am enormously grateful to President Trump, Secretary Noem, and the American people for the honor and privilege to serve this great nation,” McLaughlin wrote on social media Tuesday evening.\n\nShe said Lauren Bis, “who has been with me since Day 1 of the Trump Administration,” will take over as assistant secretary for public affairs, and Katie Zacharia, “a dynamic and effective voice in media,” will serve as deputy assistant secretary.\n\nMcLaughlin started to plan her departure in December but stayed in the aftermath of the fatal shootings ofRenee GoodandAlex Prettiby federal immigration agents in Minneapolis, according to a source familiar. Her plans to leave the administration werefirst reportedby Politico.\n\nNoem said in a Tuesdaypost on Xthat McLaughlin “served with exceptional dedication, tenacity, and professionalism.” White House press secretary Karoline Leavitt said onsocial mediathat McLaughlin “has been a strong and fearless voice on behalf of President Trump and the brave men and women of federal law enforcement.”\n\nEven before the killings of Pretti and Good last month,DHS’ public affairs office faced questionsabout its credibility after several incidents in which McLaughlin and the agency made claims that were later undermined by video or statements from local officials.\n\nThe agency’s credibility issues, combined with its officers’ use of aggressive tactics to carry out Trump’s deportation mandate, have led to a drop in public opinion on DHS and its components. Arecent Ipsos pollshowed that 62% of Americans think Immigration and Customs Enforcement’s efforts have gone “too far.”\n\nThe agency’s conduct is a central sticking point inthe partial government shutdownthat began last week after Congress hit an impasse to negotiate reforms in DHS’ immigration operations.\n\nDuring the first Trump administration, McLaughlin worked as the chief of staff for nuclear arms control at the State Department and in the public affairs office at the Treasury Department.\n\nShe went on to work as a spokesperson for Ohio Gov. Mike DeWine, and later, for Vivek Ramaswamy’s 2024 presidential campaign.\n\nMcLaughlin came under scrutiny last yearafter ProPublica reportedthat a firm run by her husband was subcontracted to produce an advertising campaign for DHS in a $200 million deal.\n\nMcLaughlin told ProPublica at the time that DHS had no visibility into which subcontractors were selected and that she recused herself because of the conflict of interest.\n\nShe is the latest top DHS official to leave about a year into the new administration. Immigration and Customs Enforcement Deputy Director Madison Sheahanannounced last monthshe would also step down from her position to run for Congress in her native Ohio.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/invs-videos-show-federal-officer-recovered-gun",
      "text": "called into question"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/us/renee-nicole-good-minneapolis-ice-shooting-hnk",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/immigration-agents-shooting-alex-pretti-invs",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.politico.com/news/2026/02/17/dhs-spokesperson-tricia-mclaughlin-to-leave-trump-administration-00783378",
      "text": "first reported"
    },
    {
      "url": "https://x.com/Sec_Noem/status/2023838985341022616",
      "text": "post on X"
    },
    {
      "url": "https://x.com/PressSec/status/2023911908865081414",
      "text": "social media"
    },
    {
      "url": "https://www.cnn.com/2025/10/18/us/dhs-credibility-chicago-immigration-ice",
      "text": "DHS’ public affairs office faced questions"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/alex-pretti-shooting-minneapolis-crackdown-polls",
      "text": "recent Ipsos poll"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "the partial government shutdown"
    },
    {
      "url": "https://www.propublica.org/article/kristi-noem-dhs-ad-campaign-strategy-group",
      "text": "after ProPublica reported"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/politics/ice-deputy-director-congress-ohio",
      "text": "announced last month"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/tricia-mclaughlin-homeland-security-spokesperson-leaving",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/tricia-mclaughlin-homeland-security-spokesperson-leaving",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8c39c05b8ee0e411d7dba796e7f5751f04786e1f519ab1365d9bf6dc6fb05188",
  "scraped_at": "2026-02-19T07:32:10.129807+00:00"
}