{
  "url": "https://lite.cnn.com/2026/02/24/politics/team-usa-hockey-olympics-trump-state-of-the-union",
  "title": "Trump skates on Team USA’s hockey wins during State of the Union address | CNN Politics",
  "date": "2026-02-25T07:31:33.349621+00:00",
  "authors": [
    "Betsy Klein"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump basked in the gold medal glory of the US Olympic men’s hockey team Tuesday, spending roughly six minutes of hisState of the Union addresscelebrating their victory after meeting with the teamin the Oval Officeearlier in the day.\n\nHis recognition of the team marked one of the few bipartisan moments of the speech, receiving lengthy, raucous applause and chants of “USA” — and proving that sports, even in a time of intense political polarization, can bring people together.\n\nIt cameafter some controversyfollowing the team’shistoric 2-1 Olympic victoryover Canada. Trump regaled the men’s team by phone Sunday as the athletes celebrated in the locker room in Italy, inviting them to his address and even offering to send a military plane to bring them — and the gold-medal-winning women’s hockey team — to Washington, DC.\n\n“I must tell you, we’re gonna have to bring the women’s team — you do know that,” Trump said over a speakerphoneheld by FBI Director Kash Patel.\n\nIf the women weren’t invited, the president said to laughter in the locker room, “I do believe I probably would be impeached, OK?”\n\nThe moment — and the players’ response — prompted significant backlash on social media.\n\nBoth the men’s and women’s hockey teams were formally invited to attend Trump’s address, according to a spokesperson for the women’s team. The women declined the invitation, citing prior academic and professional commitments. Trump said during his Tuesday speech that the women’s team would soon be coming to the White House.\n\nBut members of the men’s team climbed aboard a military plane, landing at Joint Base Andrews on Tuesday afternoon in matching navy American flag sweaters accessorized with their medals. They spent time with the president inside the Oval Office, with Trump trying on Matthew Tkachuk’s gold medal andjokinghe didn’t plan to give it back.\n\nTuesday evening, they played a starring role in Trump’s big speech as he introduced the athletes to drive home an argument that the country is “winning again.”\n\n“Our country is winning again. In fact, we’re winning so much that we really don’t know what to do about it,” Trump said.\n\nHe continued: “To prove that point, to prove that perfect here with us tonight is a group of winners who just made the entire nation proud: the men’s gold medal Olympic hockey team. Come on in.”\n\nIn a dramatic entrance, the team arrived in the House chamber through sets of double doors into the press gallery and received a standing ovation from both Democratic and Republican lawmakers.\n\n“That’s the first time I’ve ever seen them get up,” Trump mused of the Democrats.\n\nTrump also announced that he would award the Presidential Medal of Freedom, the nation’s highest civilian honor, to goalie Connor Hellebuyck, whose performance was key to the first American men’s hockey gold medal since 1980.\n\n“I will soon be presenting Connor with our highest civilian honor … the Presidential Medal of Freedom. Great athletes have gotten that — very great, the best, and I thought he deserved it,” Trump said.\n\nSome of the team members were not in attendance, according to a spokesperson for USA Hockey, who pointed to the National Hockey League schedule, which resumes Wednesday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026?post-id=cmm0zfw7100003b6r5x2sz9zg",
      "text": "in the Oval Office"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/womens-hockey-usa-trump-sotu",
      "text": "after some controversy"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/sport/team-usa-johnny-gaudreau-hockey-gold-medal",
      "text": "historic 2-1 Olympic victory"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
      "text": "held by FBI Director Kash Patel"
    },
    {
      "url": "https://x.com/MargoMartin47/status/2026413306160844935",
      "text": "joking"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/team-usa-hockey-olympics-trump-state-of-the-union",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/team-usa-hockey-olympics-trump-state-of-the-union",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8c3a62298f98b03cd0d30c0dff7bd223c82eb83cf6a13a5e09aa6517177d5cf7",
  "scraped_at": "2026-02-25T07:31:33.349632+00:00"
}