{
  "url": "https://lite.cnn.com/2026/02/16/science/solar-eclipse-ring-of-fire-2026",
  "title": "‘Ring of fire’ solar eclipse: February 2026 path, visibility over Antarctica and partial eclipse for South Africa | CNN",
  "date": "2026-02-17T07:30:20.695870+00:00",
  "authors": [
    "Lily Hautau, CNN"
  ],
  "text": "Source: CNN\n\nA “ring of fire” solar eclipse on Tuesday will mark the first eclipse of 2026, but only about 2% of the world’s population will get to see it, according toTime and Date.\n\nThe event, also called an annular solareclipse, occurs “when the moon passes directly between the Earth and the sun, but the moon is too far away in its orbit to completely cover the sun’s disk,” Dr. C. Alex Young, associate director for science communication in the Heliophysics Science Division at NASA’s Goddard Space Flight Center in Greenbelt, Maryland, said in an email.\n\nThis results in a glowing ring of sunlight surrounding the moon’s dark silhouette, he explained, giving it the name “ring of fire.” If the moon completely covers the sun, it becomes a total eclipse. A partial solar eclipse happens when the moon passes between the sun and Earth, but the sun, moon, and Earth are not perfectly lined up, according toNASA.\n\nThe best view of the ring of fire will be from a sliver of Antarctica, with a partial eclipse visible from the rest of the icy continent, as well as parts of Africa and South America.\n\nAnnular solar eclipses happen every one to two years, however many are not visible from most parts of the world. There will be another annular eclipse on February 6, 2027, according toNASA, and it will be visible to larger swaths of South America and Africa. As for those in the United States, the next opportunity to see an annular eclipse will be in 2039, according to Young.\n\nEclipses come in pairs and occasionally trios. Astronomers call these groups of events eclipse seasons, Young noted, adding that “a solar eclipse is always accompanied by a lunar eclipse about two weeks before or after.” This annular eclipse marks the first eclipse of the season with a total lunar eclipse following on March 3.\n\nThe upcoming annular solar eclipse will be the first since2024. During the event, the moon’s shadow will carve a path 383 miles (616 kilometers) wide and 2,661 miles (4,282 kilometers) long across Earth, according toEarthSky.\n\nBecause the slim ring of fire only passes over Antarctica, many people will need to rely on livestream footage to view it. “It’s all a matter of geometry,” Young said. “You have to be in exactly the right spot along the narrow path of annularity to see it, which makes witnessing an eclipse like this so rare.”\n\nThe annular eclipse will be most dramatic atConcordia Station, Antarctica, beginning at 6:48 p.m. local time (6:42 a.m. ET) and peaking at 7:47 p.m. local time (7:12 a.m. ET), according to Time and Date. The event will last around two hours.\n\nA partial eclipse will be visible across South Africa, South America and Antarctica, according to Time and Date.\n\nArgentina and Chile will be able to see the partial eclipse starting around 7 a.m. local time (5 a.m. ET). Across southern Africa, sky-gazers can expect to see the partial eclipse in early to midafternoon.\n\nTo check when the eclipse will be visible from different locations along its path, seeTime and Date’s website.\n\nIf you do witness the annular solar eclipse, you’ll first notice the moon slowly moving across the sun, creating a partial eclipse. As the coverage increases to about 80%, shadows on the ground begin to sharpen and lose their fuzzy edges, the light around you dims, and shadows start to look curved, Young explained. “It sort of looks like something’s taking a bite out of the sun,” he said.\n\nAt the peak, known as annularity, the moon sits directly in front of the sun from Earth’s perspective, leaving a striking “ring of fire” around the edges. If you look at the ground through eclipse glasses, you’ll see unusual, circular patterns in the shadows, he added.\n\nIt’s important to remember that it is not safe to look directly at the sun during an annular or partial eclipse without proper solar viewing eye protection, according toNASA.\n\n“You need certified eclipse glasses,” Young said. “Regular sunglasses, even very dark ones, are nowhere near sufficient.”\n\nPartial and annular solar eclipses differ from total solar eclipses because there is no moment when the moon fully covers the sun’s bright face. As a result, it is never safe to look directly at a partial or annular eclipse without proper eye protection.\n\nIf you don’t have eclipse glasses, you can use a handheld solar viewer or make a simple pinhole projector. To create the projector, make a small hole in a piece of cardboard. Then, with your back to the sun, hold the cardboard so that sunlight passes through the hole and projects an image of the sun onto a flat surface behind it, Young explained. “You’ll be able to see the ring shape projected right there.”\n\nThis year’s celestial calendar is packed. On February 28, sky-gazers can look forward to a parade of six planets across the night sky.\n\nVisible shortly after sunset, Mercury, Venus, Saturn and Jupiter can be seen with the naked eye depending on weather. Glimpsing Uranus and Neptune, however, may require binoculars or a telescope, according toNASA.\n\nThree days later, on March 3, a total lunar eclipse will be visible for those in Asia, Australia, the Pacific Islands and the Americas. The moon will appearing red, which is why it’s referred to as a blood moon. This total lunar eclipse is “the last one visible from North America until 2028, so it’s the one people should really have on their calendar right now,” Young added.\n\nSky-gazers can also look forward to a number of meteor showers throughout 2026. Here are peak dates for upcoming meteor activity, according to theAmerican Meteor Society.\n\nLyrids: April 21-22\n\nEta Aquariids: May 5-6\n\nSouthern Delta Aquariids: July 30-31\n\nAlpha Capricornids: July 30-31\n\nPerseids: August 12-13\n\nOrionids: October 21-22\n\nSouthern Taurids: November 4-5\n\nNorthern Taurids: November 11-12\n\nLeonids: November 16-17\n\nGeminids: December 13-14\n\nUrsids: December 21-22\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.timeanddate.com/eclipse/solar/2026-february-17",
      "text": "Time and Date"
    },
    {
      "url": "https://www.cnn.com/science/eclipses",
      "text": "eclipse"
    },
    {
      "url": "https://science.nasa.gov/eclipses/types/",
      "text": "NASA"
    },
    {
      "url": "https://eclipse.gsfc.nasa.gov/SEsearch/SEsearchmap.php?Ecl=20270206",
      "text": "NASA"
    },
    {
      "url": "https://www.cnn.com/2024/10/01/science/annular-solar-eclipse-october-time-path",
      "text": "2024"
    },
    {
      "url": "https://earthsky.org/astronomy-essentials/annular-solar-eclipse-february-17-2026/",
      "text": "EarthSky"
    },
    {
      "url": "https://www.timeanddate.com/eclipse/in/antarctica/concordia-station?iso=20260217",
      "text": "Concordia Station"
    },
    {
      "url": "https://www.timeanddate.com/eclipse/solar/2026-february-17",
      "text": "Time and Date’s website"
    },
    {
      "url": "https://science.nasa.gov/eclipses/safety/",
      "text": "NASA"
    },
    {
      "url": "https://www.nasa.gov/blogs/watch-the-skies/2026/01/16/most-notable-2026-astronomical-events-a-year-of-watching-the-skies/",
      "text": "NASA"
    },
    {
      "url": "https://www.amsmeteors.org/meteor-showers/meteor-shower-calendar/",
      "text": "American Meteor Society"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/science/solar-eclipse-ring-of-fire-2026",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/science/solar-eclipse-ring-of-fire-2026",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8cb633741f6721ae5e4965c522b8eeac2b4433fb35ab91d1753919d83615e945",
  "scraped_at": "2026-02-17T07:30:20.695883+00:00"
}