{
  "url": "https://lite.cnn.com/2026/02/26/china/us-air-force-pilot-china-instructor-charges-intl-hnk-ml",
  "title": "Former veteran US Air Force pilot charged with conspiring to train Chinese military | CNN",
  "date": "2026-02-28T07:00:38.788588+00:00",
  "authors": [
    "Brad Lendon"
  ],
  "text": "Source: CNN\n\nA former US Air Force fighter pilot with more than two decades of experience with nuclear delivery systems and aircraft, including advanced F-35 stealth jets, has been arrested and charged with conspiring to help the Chinese military.\n\nGerald Eddie Brown Jr., 65, was arrested in Jeffersonville, Indiana, on Wednesday and charged with violating the Arms Export Control Act by providing training to pilots in China’s People’s Liberation Army Air Force (PLAAF), according to a statement from the US Attorney’s Office for the District of Columbia.\n\n“Providing US military training to our adversaries represents a significant threat to national security,” Lee Russ, executive director of the Air Force Office of Special Investigations Office of Special Project, said in the statement.\n\nBefore his retirement at the rank of major in 1996, Brown served 24 years in the US Air Force.\n\n“During his military career, Brown commanded sensitive units with responsibility for nuclear weapons delivery systems, led combat missions, and served as a fighter pilot instructor and simulator instructor on a variety of fighter and attack aircraft,” the statement said.\n\nHe also flew a range of jets, from the Vietnam-era F-4 Phantom to more modern F-15s and F-16s, according to the statement.\n\nAfter retirement, Brown flew commercial cargo aircraft before joining two US defense contractors to work as an instructor in flight simulators training US pilots to fly the US F-35 stealth fighter and A-10 attack jet, the statement said.\n\nThe Lockheed Martin F-35 is one of the US’s most-advanced aircraft. About 600 of the fifth-generation jets were in service as of the beginning of the year across the US Air Force, Navy and Marine Corps, with more than 1,600 on order, according to FlightGlobal’s World Air Forces 2026.\n\nNineteen allied and partner nations are also part of the F-35 program, according to Lockheed Martin.\n\nIt is expected to be a workhorse in the US and allied fleets for decades to come.\n\nBrown allegedly spent more than two years in China training PLA pilots, traveling there in December 2023 and staying until earlier this month, the US Attorney’s statement said.\n\n“Brown answered questions for three hours about the U.S. Air Force on his first day in the PRC and then, on his second day, prepared and presented a brief about himself for the PLAAF,” the statement said. The rest of the time he trained Chinese pilots, it said.\n\n“Brown’s alleged betrayal exposed sensitive military tactics, threatening the security of our nation, our armed forces, and our allies,” said FBI New York Assistant Director in Charge James Barnacle.\n\nAviation analyst Peter Layton of the Griffith Asia Institute, a former Royal Australian Air Force officer, told CNN that China could have learned a range of things from Brown.\n\n“If I was China, I would also be most interested in ‘nuclear weapons delivery systems’ and the tactics planned to deliver nuclear weapons,” Layton said.\n\nChina could have also tried to learn what tactics F-35 pilots use to avoid detection in both offensive strike and air defense roles.\n\nAnd Layton said US allies and partners are likely to be asking hard questions of the Pentagon.\n\n“If I was an allied nation flying the F-35 I would be very strongly requesting what the US finds has been passed onto the Chinese. And what changes to tactics and procedures the US now suggests should be made,” Layton said.\n\nBut Layton said it’s possible as a simulator instructor, Brown may have just been training US pilots in basic flying, such as take-offs, landings and flying on instruments.\n\n“So possibly no tactics,” he said.\n\nCarl Schuster, former director of operations at the US Pacific Command’s Joint Intelligence Center, said even gaining knowledge of those basic techniques could be useful to China.\n\nSchuster told CNN that “the instructor pilot’s instincts in training and simulated combat flights tell us much about his past training…and what tactics the instructor’s air force of origin may employ in an intercept or ‘dog fight’ once engaged.”\n\n“The instructor insights add context to the remotely collected technical intelligence-based information and open-source materials. You can build a very thorough and complete picture by fusing all that together,” he added.\n\nThe US attorney’s statement said Brown was eager to be training fighter pilots in China.\n\n“In the resumé he prepared for his application, Brown wrote his ‘objective’ as ‘Instructor Fighter Pilot,’” it said, adding that later Brown told a co-conspirator upon his arrival in China: “Now…. I have the chance to fly and instruct fighter pilots again!”\n\nAsked about the case at a briefing on Thursday, Mao Ning, a spokesperson for China’s Foreign Ministry, declined to comment.\n\n“I am not familiar with the situation you mentioned,” Mao said.\n\nBrown allegedly made contact with China through a co-conspirator who was in contact with Stephen Su Bin, a Chinese national who in 2016 pleaded guilty to conspiring to give sensitive US military and export data to China and was sentenced to nearly four years in a US prison.\n\nCNN anchor JimScuitto wrote about Su’s casein his 2019 book, “The Shadow War: Inside Russia and China’s Secret Operations to Defeat America,” saying Su and his partners stole tens of thousands of computer files related to the F-22 and F-35 fighters.\n\nBrown is not the first American flier to be charged with helping train Chinese pilots, nor the first to be linked to Su.\n\nFormer US Marine Corps pilotDaniel Duggan was chargedin 2017 of violating the Arms Export Control Act, specifically for allegedly helping Chinese pilots learn aircraft carrier operations.\n\nDuggan, a naturalized Australian citizen, was arrested in New South Wales in 2022, and is pending extradition to the US.\n\nHe has denied the charges, claiming that US officials knew about his activities and that he was only training civilian pilots as China’s aviation sector boomed.\n\nUS authorities found correspondence with Duggan on electronic devices seized from Su Bin, Duggan’s lawyer Bernard Collaery said in a submission to Australian Attorney General Mark Dreyfus, according toa 2024 Reuters report.\n\nMessages retrieved from Su Bin’s electronic devices show he paid for Duggan’s travel from Australia to Beijing in May 2012, according to extradition documents lodged by the United States with the Australian court, according to Reuters. Collaery said Duggan was unaware of Su Bin’s hacking operations and knew him at the time as an employment broker for a Chinese state aviation company.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2019/05/14/politics/shadow-war-chinese-spy",
      "text": "Scuitto wrote about Su’s case"
    },
    {
      "url": "https://www.harpercollins.com/9780062853646/the-shadow-war/",
      "text": "The Shadow War: Inside Russia and China’s Secret Operations to Defeat America"
    },
    {
      "url": "https://www.cnn.com/2024/12/23/australia/duggan-us-fighter-pilot-extradition-intl-hnk",
      "text": "Daniel Duggan was charged"
    },
    {
      "url": "https://www.cnn.com/2024/05/12/australia/duggan-us-marine-pilot-australia-chinese-hacker-intl-latam",
      "text": "a 2024 Reuters report"
    }
  ],
  "hash": "8d7fe2614b1a04d1bff24f84a99a1319b908dc3b07cf0bfaa5605a055f54ab42",
  "scraped_at": "2026-02-28T07:00:38.788601+00:00"
}