{
  "url": "https://lite.cnn.com/2026/02/10/health/fda-bha-preservative",
  "title": "FDA to reassess the safety of BHA, a preservative used in popular snack foods | CNN",
  "date": "2026-02-12T21:32:07.364142+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFederal health officials said Tuesday they will reassess the safety of a chemical called BHA used in foods including potato chips, cereals, frozen meals and meat products.\n\nThe U.S. Food and Drug Administration issued a new request for information regarding butylated hydroxyanisole, a preservative. The agency’s review “will consider whether BHA is safe under its current conditions of use in food and as a food contact substance,” a statement said.\n\nThe move is part ofa wider effortby the FDA to review chemical additives in the U.S. food supply. In May, the agency identified BHA as a top priority for review.\n\n“We are taking decisive action to ensure that chemicals in our food supply are not causing harm,” FDA Commissioner Marty Makary said in a statement.\n\nThe agency first listed BHA as “generally recognized as safe,” or GRAS, in 1958 and approved it as a food additive in 1961. Since 1991, however, BHA has been classified as “reasonably anticipated to be a human carcinogen” by the National Toxicology Program.\n\nHealth advocacy groups such as the Center for Science in the Public Interest have long urged consumers to avoid products containing BHA because some studies have indicated that the chemical causes cancer in rats, mice and hamsters. BHA has been listed as a known carcinogen under California’s Proposition 65 since 1990.\n\nPackage labeling data indicate that BHA use has declined in recent years, but it remains in many foods, including those marketed to children, the FDA said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/fda-artificial-colors-food-dye-red-b3baba93145eb18c3ef84f8d6a431436",
      "text": "a wider effort"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/health/fda-bha-preservative",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/health/fda-bha-preservative",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8e2371854731af05324f5f08c6463c0f9c020eb285bd30fb53086b9de3432500",
  "scraped_at": "2026-02-12T21:32:07.364155+00:00"
}