{
  "url": "https://lite.cnn.com/2026/02/09/politics/federal-court-blocks-california-law-enforcement-mask-ban",
  "title": "Federal court blocks California’s law enforcement mask ban | CNN Politics",
  "date": "2026-02-11T16:33:29.751492+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA federal judge in California on Monday temporarily blocked the state from enforcing its ban on most law enforcement officersfrom wearing masksduring operations.\n\nUS District Judge Christina Snyder in Los Angeles granted theTrump administration’s requestfor a preliminary injunction, finding that the ban “unlawfully discriminates” against federal agents because it does not equally apply to state law enforcement officers.\n\nSnyder, however, kept in place another law requiring federal officers operating in the state to display either their name or badge number.\n\nThe ruling is a partial win for the Trump administration, which challenged the policies in federal court last year, insisting both be thrown out to protect federal agents.\n\nThe administration had argued that the laws, signed in September in response to immigration raids last summer in Los Angeles, were an unconstitutional attempt to regulate federal law enforcement officers.\n\nAttorney General Pamela Bondi touted the ruling on Monday as a “key court victory” in apost on X.\n\n“We will continue fighting and winning in court for President Trump’s law-and-order agenda — and we will ALWAYS have the backs of our great federal law enforcement officers,” she said.\n\nIn a statement Monday, California Attorney General Rob Bonta stressed that the judge’s ruling “denied the Trump Administration’s attempt to block California from requiring law enforcement officers, including federal agents, to visually identify themselves by agency and either by name or badge number.”\n\n“Safe communities thrive on transparency and trust and California is committed to doing our part to uphold public safety and civil liberties,” he added.\n\nThe mask ban, the first of its kind in the United States according to the Associated Press, seeks to bar neck gaiters, ski masks and other facial coverings for local and federal officers who are conducting official business. There are exceptions for undercover agents, medical masks and tactical gear. The legislation came after months of immigration arrests conducted by masked federal agents using aggressive tactics across the country.\n\nCurrently, there is no federal policy dictating when officers can or should cover their faces during arrests. Historically, officers have almost always concealed their faces only while performing undercover work to protect the integrity of ongoing investigations, law enforcement expertshave told CNN.\n\nFor his part, California Gov. Gavin Newsom has insisted the ban pushes back against the federal government’s use of masked agents without identification or badge numbers to detain people on the streets during immigration raids.\n\n“It’s like a dystopian sci-fi movie. Unmarked cars, people in masks, people quite literally disappearing,” Newsom said at a press conference when he signed the law last year.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/21/us/california-mask-ban-law-enforcement-newsom",
      "text": "from wearing masks"
    },
    {
      "url": "https://www.cnn.com/2025/11/17/politics/mask-ban-law-enforcement-california-trump-lawsuit",
      "text": "Trump administration’s request"
    },
    {
      "url": "https://x.com/AGPamBondi/status/2020987402882515174",
      "text": "post on X"
    },
    {
      "url": "https://www.cnn.com/2025/08/25/us/masks-arrests-ice-tactics-immigration",
      "text": "have told CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/federal-court-blocks-california-law-enforcement-mask-ban",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/federal-court-blocks-california-law-enforcement-mask-ban",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8e7e953ccd9b28e7f78a1f64324a7e6196c7eee164d76dfc7fe64ec27851de53",
  "scraped_at": "2026-02-11T16:33:29.751504+00:00"
}