{
  "url": "https://lite.cnn.com/2026/02/11/politics/palantir-midterms-artificial-intelligence-ai",
  "title": "How allies of AI are ramping up their political donations for the midterms | CNN Politics",
  "date": "2026-02-12T21:30:45.772754+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\n“He’s running from his past, while ICE is in our communities,” the ad’s narrator says.\n\nThe target of the ad is Alex Bores, a congressional candidate in New York City who used to work forPalantir, the tech company with long ties to defense and intelligence agencies.\n\nAn image flashes of Bores’ LinkedIn page. The narrator notes Palantir’s work with US Immigration and Customs Enforcement, whose operations in New York City have sparked outcry on the left.\n\n“ICE is powered by Bores’ tech. Manhattan is smarter than that,” the narrator says.\n\nIn a twist, the ad is backed by some of the very industry forces it condemns. The super PAC   behind it is an affiliate of a new political committee, Leading The Future, launched last summer by a group of tech giants – including Palantir   co-founder Joe Lonsdale – to confront a growing bipartisan backlash to artificial intelligence ahead of the midterm elections.\n\n“Listen, we are on the verge of something amazing for our civilization, right?” Lonsdale said on CNBC in November. “But you have a lot of crazy populists, you have a patchwork of just really intense stuff they are doing that would just break all of this. And we can’t let that happen.”\n\nPalantir allies and leaders from OpenAI and venture capital are wading into the political fray, with more than $100 million already pledged by Leading the Future to boost candidates friendly to AI. They’re also cutting big checks to congressional leaders and President Donald Trump’s political network.\n\nThe stakes are especially high this year. Congress is poised to craft the rules of the road for industry for the next decade or longer, and voters are growing increasingly worried about the consequences of AI development, fromenergy bills to privacy to job loss. Underscoring the tension, several Democrats have been pressured to return campaign contributions from Palantir-linked donors.\n\n“The recent surge in election-related activities of big tech companies such as Palantir and OpenAI can be understood as preemptive measures against potential fallouts from the election,” said Syracuse University professor Hamid Ekbia, the founding director of the Academic Alliance for AI Policy. “Palantir, in specific, is in a vulnerable position because of recent revelations about its heavy involvement with ICE activities.”\n\nBores, who led one of the first major efforts to regulate artificial intelligence at the state level in New York, accused Leading The Future and its industry backers of hypocrisy.\n\n“I quit their company over its ICE contract, choosing principle over my career and millions of dollars. They profited off of it, and are now using those funds to lie to New Yorkers and attack me,” he said in a statement.\n\nPalantir did not respond to multiple requests for comment.\n\nTwo prominent Palantir stakeholders have been active midterm donors: Peter Thiel, a co-founder and billionaire venture capitalist with close ties to Vice President JD Vance and others in the Trump administration, and the company’s CEO, Alex Karp.\n\nBoth Karp and Thiel gave hundreds of thousands of dollars last year to committees aligned with Republican congressional leadership, according to FEC records. Thiel’s giving in 2025 signals reengagement after he largely sat out the 2024 election cycle. Karp has a more enigmatic donor history.\n\nFEC records show that in 2023, Karp gave $360,000 to the joint fundraising committee for Joe Biden and Kamala Harris. A year later, he contributed $1 million to MAGA Inc.\n\nArtificial intelligence has been a boon for Palantir, which has seen its market capitalization skyrocket by more than 1000% since 2022. The defense tech firm has worked to leverage AI alongside its expertise organizing data and logistics.\n\n“Our rise has been, and we believe will continue to be, driven by an increasingly discerning set of companies and institutions in the United States that understand the value of artificial intelligence,” Karpwroteto shareholders this week.\n\nAnd he’s been an outspoken advocate for AI development, framing the argument in absolutist terms.\n\n“We are going to be the dominant player, or China is going to be the dominant player, and there will just be very different rules depending on who wins,” Karp said on “The Axios Show”last year. “So, when people are worried about surveillance, of course, there are huge dangers there, but you know, you will have far fewer rights if America’s not in the lead.”\n\nLeading the Future, the industry-funded PAC, raised more than $50 million in the second half of 2025, including $25 million from OpenAI president and co-founder Greg Brockman and his wife, Anna, as well as $25 million from the venture capital firm a16z, according to Federal Election Commission records. In total, more than $100 million has already been pledged by Leading the Future to boost candidates friendly to AI.\n\nJesse Hunt, a strategist working with LTF, argued that a fractured regulatory landscape is a threat to American competitiveness.\n\nThe tech industry is pushing for a federal standard that would preempt state laws. Trump has voiced support for a moratorium on state regulations,signing an executive orderto do so, and Texas Republican Sen. Ted Cruz proposed legislation to that end.\n\n“How doomer do we get here and how restrictive are the policies that one is advocating for?” Hunt asked. “Ultimately, what we don’t want to do is stunt innovation and allow what is now the global leader in artificial intelligence and the innovation sector to flatline because policymakers fall prey to fringe ideology.”\n\nLTF – and its opponents – expect to face off this year across New York, California, Texas, Illinois and Ohio.\n\nCountering LTF is Public First, an organization led by former Oklahoma Democratic Rep. Brad Carson   and former Utah Republican Rep. Chris Stewart.\n\nThe group is aiming to raise $50 million in fundingand saysit will “focus on electing candidates who champion responsible tech policies that reduce harm and protect against AI’s worst risks.”\n\n“What we’re trying to do at Public First is, in many ways, saving AI from itself,” said Carson. “Because left alone, this kind of no touch approach is going to lead to an incredible public backlash that is already brewing. People are already sharpening their pitchforks.”\n\nWhile emphasizing that “we haven’t made any formal decisions about who we’re going to support or not yet,” the group pointed to candidates like Bores, who sponsoredthe Responsible AI Safety and Education, or RAISE, Actwhile serving in the New York state legislature.\n\nWhen it takes effect in March, the legislation will require AI companies to come up with safety protocols aimed at preventing “critical harm” – such as “the creation or use of a chemical, biological, radiological or nuclear weapon,” the bill states, or the conduct of a crime – and report incidents in development and operations, like data breaches or dangerous malfunctions.\n\nGov. Kathy Hochul, who is running for reelection this year, signed it into law last year and called out AI policy challenges in her State of the State address last month.\n\n“We will not allow technology to undermine our infrastructure, and we won’t let it undermine our democracy either,” Hochul said.\n\nA Gallup survey last year  found that 80% of Americans believe the government should maintain rules for AI safety and data security, “even if it means developing AI capabilities more slowly.” And there are bipartisan concerns about AI data centers driving up utility bills along with potential job losses and industry disruptions.\n\nAnd a loose and politically broad coalition, from Florida Gov. Ron DeSantis to former Trump strategist Steve Bannon, both Republicans, to independent Vermont Sen. Bernie Sanders, is determined to preserve states’ rights to make their own rules.\n\n“Let’s not try to act like some type of fake videos or fake songs are going to deliver us to some kind of utopia,” DeSantis said  at a December event in Sebring, Florida,   touting his proposal for state legislation – a “Citizen Bill of Rights for AI” – providing privacy protections, national security restrictions, and regulations for data center construction.\n\nLong controversial with liberals, Palantir is already coming up in midterm debates.\n\nRep. Raja Krishnamoorthi, the front-runner in the Illinois Senate Democratic primary, was challenged in a recent primary debate for his history of campaign contributions from Palantir Chief Technology Officer Shyam Sankar, totaling just over $29,000 since 2015, including $7,000 last year.\n\n“You already demonstrated that you’re not going to show up when it matters – to take money from one of the ICE contractors, the Chief Technology Officer of Palantir, and that funds your campaign, that demonstrates that that’s not what’s your priority,” said Illinois Lt. Gov. Juliana Stratton, one of Krishnamoorthi’s rivals.\n\n“As for the donation that I received from a Palantir exec, when it came to my attention, we donated it to Illinois migrant rights groups,” Krishnamoorthi responded.\n\nOther Democrats are also returning campaign contributions from Palantir as public scrutiny grows – including an online tracker highlightingtop recipientsof political donations linked to the company.\n\nIn Colorado, where Palantir is headquartered, Sen. John Hickenlooper and Rep. Jason Crow both announced this week that, like Krishnamoorthi, they’d give tens of thousands of dollars to immigrant rights groups to offset years of  donations from Palantir employees, after theColorado Sunmade multiple inquiries about their fundraising records.\n\nThe company’s lightning-rod status also reflects broader concerns about artificial intelligence and its consequences.\n\n“I have yet to see AI solve cancer, and I would love to see it right now,” said Reed Showalter,   a Democratic antitrust attorney running in Illinois’ 7th District. “The consequences have largely been increased costs for electricity and water and a medium-term decrease in employment and wages for the people in both the district, the state, and the country.”\n\nStewart, the former Utah Republican congressman with Public First, acknowledged the difficulty policymakers face grappling with a poorly understood and rapidly developing technology.\n\n“All of us are trying to develop, you know, more thoughtful answers on this, because this is such a new issue,” Stewart said, adding that “it’s not a partisan issue right now, and I hope it doesn’t become a partisan issue.”\n\nHe urged candidates to take voters’ concerns seriously and offer specific solutions on how to deal with AI’s immediate effects.\n\n“In all my 12 years in Congress, I don’t remember ever having a conversation with someone about electrical bills, right? And it’s gonna come up,” he said. “And they’ve got to be prepared to, you know, not just kind of shrug and say, ‘yeah, it’s a problem.’ We’ve got to be prepared to say, ‘this is what we think we should do.’”\n\nThis story and headline have been updated with additional details.\n\nCORRECTION: This story has been corrected to reflect that while some current executives at Palantir have donated to political campaigns and committees, they are not among Leading the Future’s donors.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/07/business/what-is-palantir-nightcap",
      "text": "Palantir"
    },
    {
      "url": "https://www.cnn.com/2025/12/18/business/ai-jobs-economy",
      "text": "energy bills to privacy to job loss"
    },
    {
      "url": "https://www.palantir.com/q4-2025-letter/en/",
      "text": "wrote"
    },
    {
      "url": "https://www.axios.com/2025/11/07/palantir-ceo-alex-karp-interview-axios",
      "text": "last year"
    },
    {
      "url": "https://www.cnn.com/2025/12/11/tech/ai-trump-states-executive-order",
      "text": "signing an executive order"
    },
    {
      "url": "https://publicfirstaction.us/news/chris-stewart-brad-carson-announce-new-organization-and-bipartisan-super-pacs-to-support-ai-safeguards",
      "text": "and says"
    },
    {
      "url": "https://www.governor.ny.gov/news/governor-hochul-signs-nation-leading-legislation-require-ai-frameworks-ai-frontier-models",
      "text": "the Responsible AI Safety and Education, or RAISE, Act"
    },
    {
      "url": "https://purgepalantir.com/",
      "text": "top recipients"
    },
    {
      "url": "https://coloradosun.com/2026/02/09/hickenlooper-crow-donate-palantir-funds-immigrant-groups/",
      "text": "Colorado Sun"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/palantir-midterms-artificial-intelligence-ai",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/politics/palantir-midterms-artificial-intelligence-ai",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8e8046fa972572c2b6b8a171615b81d1b4b3305c004b0428e6afcee73aa66002",
  "scraped_at": "2026-02-12T21:30:45.772769+00:00"
}