{
  "url": "https://lite.cnn.com/2026/02/18/americas/cuba-us-trump-oil-tourism-intl-latam",
  "title": "No food, no fuel, no tourists: Under US pressure, life in Cuba grinds to a halt | CNN",
  "date": "2026-02-18T07:30:57.541072+00:00",
  "authors": [
    "Patrick Oppmann, CNN"
  ],
  "text": "Source: CNN\n\nMandy Pruna remembers with a nostalgia-filled grin the influx of American travelers that came to Cuba after then-US President Barack Obama restoreddiplomatic relationswith the island in 2015.\n\nPruna and his bright red 1957 Chevrolet were in constant demand and he says countless visitors including celebrities like Will Smith, Rihanna and Kim Kardashian paid princely sums – at least for Cuba – to go on classic car tours with him.\n\nHis Chevy was one of three vintage American automobiles that US diplomats selected to be in the background for the flag raising ceremony at the US Embassy in Havana that marked the official restoration of ties between the two countries following decades of bitter animosity.\n\n“All sectors of society benefited from that,” Pruna said, referring to the brief improvement in relations. “You saw people painting their houses, opening new businesses. For me it was fantastic. It was the best era for tourism in Cuba.”\n\nNow, Cuba may be experiencing the most profound moment of economic uncertainty that the island’s residents have endured in decades if not over their entire lives.\n\nThrough military action in Venezuela and threats of tariffs on Mexico, the Trump administration hasshut off the flow of oilto Cuba, attempting to strong-arm the communist-run island into making significant political and economic reforms.\n\nCuba does not appear to have any remaining allies willing to supply the hundreds of millions of dollars-worth of fuel needed to power the economy.\n\nWhat oil the island has left is running out.\n\nThe twin loss of fuel and tourists for people like Pruna has been catastrophic.\n\n“I need gas to be able to work, I need tourists to be able to work,” he said.\n\nAs the crisis drags on,life is slowly grinding to a haltacross this island of nearly 10 million people.\n\nClasses have been suspended at many schools and workers furloughed to save energy. Near vacant hotels have been shuttered and flights from Russia and Canada canceled as there is not enough jet fuel on the island for longer international flights.\n\nThe UK and Canada have warned citizens to avoid non-essential travel to Cuba.\n\nLast week, organizers canceled the yearly Habanos cigar festival that brings in millions of dollars of revenue. Sherrit International on Tuesday announced that the company is pausing nickel and cobalt mining operations in Cuba amid the fuel crunch.\n\nMany government-run hospitals have cut services and a lack of fuel and working dump trucks has caused trash to pile up across whole neighborhoods.\n\nOn nearly every street corner, conversations center on when power cuts are taking place and for how long. At night in Havana, the stars are often clearly visible as most of the city is swathed in near total darkness.\n\nThe Trump administration says the Cuban government needs to finally open the island’s centralized economy before it collapses.\n\n“There’s no oil, there’s no money, there’s no anything,” US President Donald Trump told reporters Monday, adding that Secretary of State Marco Rubio is leading efforts to negotiate with top Cuban officials.\n\nRubio, who is Cuban American and a longtime opponent of the Cuban government, has previously said the only thing he intends to discuss with the island’s communist leadership is when they would relinquish power.\n\n“This is a regime that has survived almost entirely on subsidies – first from the Soviet Union, then from (former Venezuelan President) Hugo Chavez,” Rubio said last week during the Munich Security Conference. “For the first time, it has no subsidies coming in from anyone, and the model has been laid bare.”\n\nAfter so many years of living on the precipice of economic collapse, a humanitarian crisis may be coming for Cuba.\n\nAlready most of the food Cubans consume is imported following decades of their government’s disastrous agricultural policies.\n\nThat tenuous lifeline is at risk though as anti-Castro Cuban-American politicians have called for a total cut-off of assistance from the US.\n\n“This is the moment to stop everything: no more tourism, no more remittances, no more mechanisms that continue to finance and sustain the dictatorship,” said Republican congresswoman from Florida Maria Elvira Salazar, a former journalist at CNN en Español.\n\n“It’s devastating to think about a mother’s hunger, about a child who needs immediate help. No one is indifferent to that pain. But that is precisely the brutal dilemma we face as exiles: to resolve the short-term suffering or to free Cuba forever,” Salazar said.\n\nAlready some of the private sector companies importing food from the US have suspended operations, saying they are no longer able to refrigerate their products during the daily power outages.\n\nFaced with the worsening shortages, Cuban President Miguel Diaz-Canel has called on the population to “resist creatively” and adopt a war-time mentality.\n\n“We will eat what we can produce in each place. Now if there is less fuel then food will not be able to leave from some municipalities to other ones,” Diaz-Canel said during a televised appearance in January.\n\nAt Havana’s “agro-markets” that sell the small selection of food produced on the island, some people warned of the increasing difficulty in bringing fruits and vegetables to the capital from the countryside where they are grown.\n\n“We are paying two, three times as much to restock and keep people happy,” said Anayasi, a food vendor who did not want give her last name for speaking critically of the worsening economic situation. “There’s no food. The impact will be terrible. We won’t have anything.”\n\nClassic car driver Mandy Pruna said he is considering trying to emigrate to Spain with his family. After 20 years making a good living ferrying tourists in his Chevy, he no longer sees a future in his homeland.\n\n“Everything is uncertain at the moment. There’s no fuel. We don’t know if there will be any and how we will pay for it,” he said. “If I have to pay for gas in dollars how do I recoup that if there’s no tourism?”\n\nEarlier that same morning, Pruna said, he had suspended his license to work as a classic car driver.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/videos/world/2016/03/20/president-obama-lands-in-cuba.cnn",
      "text": "diplomatic relations"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/americas/cuba-oil-supply-trump-tariff-mexico-latam-intl",
      "text": "shut off the flow of oil"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/americas/cuba-air-canada-flights-suspended-fuel-supply-latam-intl",
      "text": "life is slowly grinding to a halt"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/americas/cuba-us-trump-oil-tourism-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/americas/cuba-us-trump-oil-tourism-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8ef08a22e66be2a271234f0e23de1937a7be23c522dcc6fceee7d3d57a5c5689",
  "scraped_at": "2026-02-18T07:30:57.541085+00:00"
}