{
  "url": "https://lite.cnn.com/2026/02/09/politics/epstein-files-fbi-employees-presentation-prominent-names",
  "title": "As pressure mounted to release Epstein files, FBI employees compiled allegations against other men | CNN Politics",
  "date": "2026-02-11T16:40:42.798139+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAs the Justice Department faced mounting pressure to release the Epstein files last year, FBI employees were compiling what one described as “salacious” allegations against men in Jeffrey Epstein’s orbit and putting together a presentation that included a list of “prominent names” in the investigative files.\n\nThe 21-slide presentation — released with more than 3 million documents in theEpstein files— outlines the various federal investigations into the late convicted sex offender, his death and his longtime associate Ghislaine Maxwell, who was convicted of child sex trafficking.\n\nOne slide lists a dozen names and notes that “numerous” tips were made anonymously to the FBI’s tip line. Some of the tips included claims of sexual misconduct, while others were not allegations of criminal conduct but rather indicated an association with Epstein.\n\nThe men listed, including PresidentDonald Trump, former PresidentBill ClintonandAndrew Mountbatten-Windsor, have been known to have associations with Epstein and have denied wrongdoing regarding previous allegations against them.\n\nEfforts by FBI employees to compile some of the most explosive claims contained in the Epstein files took place as public backlash mounted last year over the Trump administration’s decision to shut the door on releasing more documents. Separately, the FBI compiled a list of sexual assault allegations related to Trump this past August — many of which appear to have come from unverified tips.\n\nEventually, Congress passed a law in November demanding transparency and the release of all documents, forcing the Trump administration to act.\n\nIt’s not clear from the presentation what steps had been taken to verify any of the allegations. Deputy Attorney General Todd Blanche told CNNearlier this monththat the Department of Justice has no plans to bring additional charges related to Epstein, saying there was nothing in the files to warrant new prosecutions.\n\nCNN has reached out to the DOJ. The FBI declined to comment.\n\nTop Trump administration officials early last year hyped the release of the Epstein files and a purported “client list,” which has been long sought since Epstein’s death in 2019, including by Trump’s base.\n\nAttorney GeneralPam Bondiinitially said last February that a client list was sitting on her desk — though the administration said she was referring to other documents. Later that month, she gave a group of rightwing influencers binders labeled “The Epstein Files: Phase 1,” which turned out to contain already publicized documents related to the sex offender.\n\nUnder pressure because of the lack of new details, Bondi promised more documents would be released.\n\nBut the administration began backtracking,CNN previously reported, sometime around May 2025 — the same month that Bondi told Trump in a meeting that his name was included in the files.\n\nThis sparked backlash that intensified after the DOJ said on July 7 in an unsigned memo that it had concluded there was no client list and that Epstein had died in 2019 by suicide — undercutting conspiracy theories to the contrary. The department did not plan to release any new documents on the matter, an official told CNN at the time.\n\nThree days lateran emailwith the subject line “Response to 07/10/2025 Director’s call” broke down material recovered on Epstein’s devices, evidence items seized, and victims’ reports as to whether they had accused others of sexual misconduct. The short summary indicates at least four or five of Epstein’s victims had accused unnamed men of sexually abusing them, but that the cases were referred to local law enforcement because “there was not enough evidence to federally charge these individuals.”\n\nIn an email later in July, a person at the FBI was asked to write summaries of “salacious statements” made about 13 people, including Trump, Clinton, Mountbatten-Windsor, billionaire Leon Black, and ex-movie mogul Harvey Weinstein.\n\nAmong the short statements provided were details ofnewly disclosed but unverified claimsof sexual assault made against Trump, along with similar claims against Weinstein and Black.\n\nPortions of the emailed list were included in the 21-page presentation that included the logo of the FBI’s Child Exploitation and Human Trafficking Task Force.\n\nThe presentation was created sometime after mid-July 2025, given dates listed in the slides. It featured a timeline of various state and federal investigations into Epstein, details about financial transactions between Epstein and Maxwell, and a list of people who attended “proffer” sessions – meetings with prosecutors in which a person can lay out what evidence or testimony they could provide in a criminal case.\n\nIn response to a request for comment, the White House referred to a press release issued by the Justice Department last month that said the released documents contain “untrue and sensationalist claims against President Trump that were submitted to the FBI right before the 2020 election.”\n\n“To be clear, the claims are unfounded and false,” the press release said, “and if they have a shred of credibility, they certainly would have been weaponized against President Trump already.”\n\nTrump has never been accused by law enforcement of wrongdoing related to Epstein.\n\nAn attorney for Black, who stepped away from running the private equity firm Apollo Global Management in 2021 over his ties to Epstein, said in a statement that there was “absolutely no truth” to the allegations and maintained their relationship was only business related.\n\n“Mr. Black asked for an independent investigation of his relationship with Epstein.  The Dechert law firm investigated and reviewed more than 60,000 documents, interviewed more than 20 people and concluded that Mr. Black paid Epstein for estate planning and tax advice and that he had no awareness of Epstein’s criminal activities,” lawyer Susan Estrich wrote.\n\n“Of the three civil lawsuits filed against Mr. Black, one has been dismissed, the other withdrawn and the other is currently facing a case terminating motion for sanctions. There is absolutely no truth to any of the allegations against Mr. Black,” Estrich said.\n\nRepresentatives for Clinton and Mountbatten-Windsor have not responded to a request for comment.\n\nWeinstein is incarcerated, awaiting a third trial in New York on charges of sexual assault after having already been convicted of similar charges in Los Angeles.\n\n“This is an unverified FBI tip, not a finding, not sworn testimony, and not evidence of anything. Mr. Weinstein denies the conduct described,” Juda Engelmayer, spokesperson for Weinstein, said in a statement to CNN.\n\n“These intake documents exist precisely so anyone can call in anything — including stories that closely resemble allegations that have been in the public domain for years. The fact that a familiar-sounding narrative appears in a tip line during a high-profile document release does not make it true, tested, or corroborated,” he added.\n\nClinton has denied accusations of wrongdoing related to Epstein. He’s scheduled to appear in a deposition as part of the House’s probe into Epstein later this month – and has pushed for that testimony to be made public.\n\n“I will not sit idly as they use me as a prop in a closed-door kangaroo court by a Republican Party running scared,” Clinton said in a post to X last week. “If they want answers, let’s stop the games & do this the right way: in a public hearing, where the American people can see for themselves what this is really about.”\n\nMountbatten-Windsor – the former Prince Andrew who was stripped of his royal title last year over his friendship with Epstein – has not responded to the latest file release.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Epstein files"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/new-documents-trump-epstein",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/clintons-depositions-epstein-contempt",
      "text": "Bill Clinton"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/world/andrew-virginia-giuffre-photo-intl",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/politics/blanche-epstein-gabbard-lemon",
      "text": "earlier this month"
    },
    {
      "url": "https://www.cnn.com/2025/07/07/politics/bondi-epstein-files-client-list-suicide-memo",
      "text": "Pam Bondi"
    },
    {
      "url": "https://www.cnn.com/2025/07/24/politics/trump-epstein-files-pivot-timeline",
      "text": "CNN previously reported"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00164897.pdf",
      "text": "an email"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/new-documents-trump-epstein",
      "text": "newly disclosed but unverified claims"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/epstein-files-fbi-employees-presentation-prominent-names",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/epstein-files-fbi-employees-presentation-prominent-names",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8f963f0da9a2472431d54a8a50f4ee4b56d01d32ea5a43f81e591246e7a278b7",
  "scraped_at": "2026-02-11T16:40:42.798151+00:00"
}