{
  "url": "https://lite.cnn.com/2026/02/07/us/savannah-guthrie-nancy-faith-religion",
  "title": "Savannah Guthrie leans on her faith amid mother Nancy’s disappearance | CNN",
  "date": "2026-02-11T16:34:09.006104+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe day after 84-year-old Nancy Guthriewas takenfrom her Tucson, Arizona, home under the cover of night, her daughter, Savannah, made a heartbreaking appeal to pray for her mother.\n\n“Raise your prayers with us and believe with us that she will be lifted by them in this very moment,” she wrote in herfirst poston social media after her mother’s abduction became public.\n\nTwo days later, in aheartbreaking videoGuthrie, host of NBC’s flagship morning program “Today,” sat sandwiched betweenher older sister and brother.\n\nSpeaking through tears, Guthrie described her mother as a strong, faithful woman and “God’s precious daughter.”\n\nGuthrie’s faith – and insistence on the power of prayer – has been central throughout the almost weeklong saga of her mother’s disappearance.\n\nIn her 2024 bestseller “Mostly What God Does,” Guthrie credits her parents for her religious upbringing and describes how her faith has helped her navigate some of the most difficult times in her life.\n\nAnd, she says she’s come to believe “the pains of this world are not (God’s) original plan and will not be how the story ends.”\n\n“This,” she writes, “is faith.”\n\nOne of Savannah Guthrie’s earliest memories is of her mother, father and brother being baptized in their church.\n\n“There were five of us Guthries,” she writes, “But my sister used to say that God was the sixth member of our family.”\n\nGuthrie’s father died when she was in high school and she recalls how her mom held the family together.\n\n“My mom was so strong and set aside her own grief in many ways, just to be there and make sure that we could all move forward together,” Guthrie recalled during a 2023Mother’s Day segmenton “Today.”\n\n“The greatest gift my mother gave me was faith and belief in God. It changed my whole life.”\n\nBut Guthrie admits throughout her book that she has at times struggled with her faith. And in those moments, Guthrie said her mother would often help her find her way back.\n\nShe recalls how her mom gave her the same Christmas gift for nearly a decade: a plastic-wrapped devotional journal.\n\n“This was our tradition, our special thing, our bond,” she writes. “It was how she encouraged/reminded/prodded me to walk with God as I walked into adulthood.”\n\nAfter college, Guthrie’s mom helped her move from Arizona to Butte, Montana, for her first job in news. The two-day road trip would also mark Guthrie’s first time moving away from home.\n\nBut 10 days after the she started, the news station closed. Guthrie explains experiences like this taught her faith is forged, not in moments of ease or happiness, but in the lowest points of adversity.\n\n“I learned to trust God not because the terrible thing never happened, but because it did,” she writes. “We often turn to prayer in desperation, when … our hearts and souls (are) plagued by the struggle.”\n\n“It’s at these times we need prayer the most. And often when we find it hardest to do.”\n\nIt’s been nearly a week since Nancy Guthrie vanished from her home, and besides ransom notes sent to media outlets across the country earlier this week, investigators said the family has yet to be contacted by her alleged captor.\n\nGuthrie’s son, Camron,posted another pleaThursday afternoon for his mother’s abductor to contact the family.\n\n“Whoever is out there holding our mother. We want to hear from you. We haven’t heard anything directly. We need you to reach out, and we need a way to communicate with you so we can move forward,” he said.\n\nThe video coincided with a deadline the Federal Bureau of Investigation said was set in a ransom note sent to the media.\n\nLocal law enforcement and the FBI are now offering a $50,000 reward for information leading to Guthrie’s safe return. Officials said they have not yet identified a suspect in the case.\n\nIn a poignant chapter of her book, Savannah Guthrie explains how a family tradition helped her grow closer to God.\n\nDuring the summers, Guthrie said her cousin Teri would stage a mock “kidnapping” – piling Savannah and her sister, Annie, into a station wagon with their cousins before embarking on a road trip from Tucson to Phoenix.\n\nDuring the trip the Guthrie girls would find a payphone and call home to their mother who, she writes, “would feign shock … then assure us she’d drive up to retrieve us in a few days.”\n\nIt was during one of these visits that Guthrie said her cousin introduced her to a scripture that would underpin her faith for the rest of her life: Psalm 23.\n\n“Psalm 23 is our secret code, God and me,” she writes of the prominent scripture. “Sometimes in moments of need, it appears out of nowhere.”\n\nGuthrie said she’s learned to find hope and comfort in the scripture, which proclaims “Even though I walk through the darkest valley, I will fear no evil, for you (God) are with me.”\n\n“Wide awake and beset by anxiety, I turn to (Psalm 23) for meditation, a way to train my focus on something other than my worries and fears.”\n\nDecades later, in a cruel twist of fate, the Guthrie family is no longer pantomiming a kidnapping. As Guthrie’s children desperately wait for the phone to ring, Savannah alluded to Psalm 23 in a video message to her mother.\n\n“Mommy … we believe and know that even in this valley, He (God) is with you,” Guthrie said.\n\n“We pray without ceasing and we rejoice in advance for the day that we hold you in our arms again.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/us/timeline-nancy-guthrie-disappearance-missing-person",
      "text": "was taken"
    },
    {
      "url": "https://www.instagram.com/p/DUR7WDckeYN",
      "text": "first post"
    },
    {
      "url": "https://www.instagram.com/p/DUW3mpqD8qd/",
      "text": "heartbreaking video"
    },
    {
      "url": "https://www.cnn.com/us/live-news/savannah-guthrie-missing-mother-investigation-02-05-26#cml9ggza0000d3b6pvwnz9gxq",
      "text": "her older sister and brother."
    },
    {
      "url": "https://www.thomasnelson.com/p/mostly-what-god-does/",
      "text": "Mostly What God Does"
    },
    {
      "url": "https://www.today.com/video/today-anchors-share-lessons-they-learned-from-their-moms-173812805704",
      "text": "Mother’s Day segment"
    },
    {
      "url": "https://www.instagram.com/p/DUZULrXkqXb/",
      "text": "posted another plea"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/us/savannah-guthrie-nancy-faith-religion",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/07/us/savannah-guthrie-nancy-faith-religion",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8fbcafe0fbcf46977c98a61c288d5b88c234f034148b6b7dad6d34f403345ff3",
  "scraped_at": "2026-02-11T16:34:09.006117+00:00"
}