{
  "url": "https://lite.cnn.com/2026/02/24/health/maha-trump-glyphosate-health",
  "title": "What to know about glyphosate, the herbicide behind a Trump executive order that’s angered MAHA moms | CNN",
  "date": "2026-02-25T07:32:52.348054+00:00",
  "authors": [
    "Michal Ruprecht"
  ],
  "text": "Source: CNN\n\nSupporters of the “Make America Healthy Again” strategy have longrailedagainst pesticides, making opposition to them a pillar of the movement.\n\nBut an executive order issued by President Donald Trump last week collides with that long-held stance.\n\nThe orderstatesthatglyphosate— an herbicide foundinRoundup, the world’s most widely used weed killer — is “central to American economic and national security” and calls for an adequate domestic supply.\n\nGlyphosateinhibitsprotein synthesis in plants and microorganisms, leading to their death. Scientists can genetically modify corn, soybeans and cotton — three field crops thataccount forthe vastmajorityof glyphosate use in the United States — to choose which crops survive and which die after glyphosate treatment.\n\nUS Health and Human Services Secretary Robert F. Kennedy Jr., a key figure in the MAHA movement, haslong opposedglyphosate-based pesticides. In 2018, as an attorney, Kennedy helped win a lawsuitallegingthat maker Monsanto knew that Roundup caused cancer. Hereiteratedlast month on Katie Miller’s podcast that “I believe glyphosate causes cancer.”\n\nBut Kennedy sounded a different tone.\n\n“Donald Trump’s executive order puts America first where it matters most — our defense readiness and our food supply,” the HHS chief said in a statement. “We must safeguard America’s national security first, because all of our priorities depend on it. When hostile actors control critical inputs, they weaken our security. By expanding domestic production, we close that gap and protect American families.”\n\nThe day before Trump’s order was announced, Monsanto’s owner, Bayer,proposeda $7.25 billion settlement to resolve current and future claims alleging that the product causes cancer. The settlement would not include an admission of liability or wrongdoing, and Monsantomaintainsthat there is no evidence that glyphosate causes cancer.\n\n“Experts and regulators worldwide have concluded that glyphosate-based products can be used safely as directed,” the companystates.\n\nMoms Across America, a nonprofit that supports the MAHA agenda, has advocated for glyphosate bans andcalledthe new executive order “outrageous,” saying it could shield Monsanto — the only domestic producer of glyphosate — from lawsuits over products sold in compliance with the order.\n\n“I was outraged. I was actually sick to my stomach,” Zen Honeycutt, the group’s founder and executive director, told CNN’s Pamela Brown onThe Situation Roomon Monday. “When I saw this executive order, it was basically a love letter to glyphosate.”\n\nKennedysaidthis month on Theo Von’s podcast that an outright glyphosate ban “would put out of business 80% of our farmers.” He agreed that the nation is “dependent upon something that we know makes us sick” and said his agency is “doing a lot of work” to find alternatives to glyphosate.\n\nRepublican Rep. Thomas Massie hasintroducedabillthat he says would “undo” the order, and Moms Across Americacalledthe Kentucky lawmaker a “true health hero.”\n\nIn 2015, the World Health Organizationclassifiedglyphosate as a probable carcinogen.\n\nWHO “puts other everyday things like drinking hot beverages, a barber’s occupational exposure and eating red meat at the same level of safety hazard as glyphosate,” Monsantosayson its website.\n\nTwo largemeta-analyseshavefoundthat people exposed to glyphosate have a higher risk of cancer. One of those studies estimated that the risk of non-Hodgkin lymphoma increases by 41% for those in the highest exposure categories.\n\nHowever, theUS Environmental Protection Agencyand theEuropean Union’s European Food Safety Authoritysay they have not found a link.\n\n“I worry about any human exposure to carcinogens,” said Dr. Philip Landrigan, a pediatrician at Boston College who has studied glyphosate and its health effects. “But I worry especially when a high proportion of those exposed are children, because children eat more food per pound of body weight per day than adults.”\n\nGlyphosate may also affect children before they’re born, some research says.\n\nA large study in Puerto Ricofoundan association between mothers exposed to glyphosate in the second trimester and preterm births. Other studies have suggested that the pesticide caninterferewith hormones during fetal development.\n\nAnd some types of glyphosates may be more harmful than others.\n\nGlyphosate with surfactant — which helps itstickto plants — is more toxic in lab-grown human cells than the pesticide alone,accordingto researchers in the United Kingdom. In cases where people have ingested glyphosate, formulations containing surfactant haveresultedin more severe symptoms.\n\n“Surfactants probably enhance the ability of the glyphosate to get into the body,” Landrigan said.\n\nIn the mid-1990s, glyphosate and genetically modified cropsformeda powerful partnership in the farming industry, driving glyphosate use up 10-fold over the next two decades.\n\nAs spraying increased, weeds resistant to glyphosateemerged.\n\n“It’s just like overusing antibiotics,” Landrigan said, likening the shift to antibiotic resistance, when bacteria evolve defenses against drugs meant to kill them.\n\nTo fight off hard-to-kill weeds, manyfarmers now layer inadditionalherbicides — such as dicamba and 2,4-D — that werefar less commontwo decades ago.The latter wasusedto produce Agent Orange, an herbicidesprayed bythe US military during the Vietnam War.\n\nLandrigan says farmers are also spraying more glyphosate later in the growing season, closer to harvest, which means it may linger on more products.\n\n“It’s much more likely to carry over into the grain,” he said. “There’s no time for the rain, sun and wind to dissipate it.”\n\nMost of the population has been exposed to glyphosate,accordingto the US Centers for Disease Control and Prevention. That even includes children as young as 3.\n\nMost of that exposurecomes fromproducts like whole-wheat bread, whole-grain cereals and crackers, oatmeal, popcorn and legumes. The pesticide has also beenidentifiedin drinking water.\n\nThe “single most effective” way to reduce exposure to glyphosate is to eat foods with the US Department of Agriculture’s organic seal, according to Landrigan.\n\nCrops with theUSDA Organicsticker arenotgenetically modified, meaning they — like weeds — will die after being sprayed with glyphosate.\n\nLandrigan also recommends buying produce locally and washing it thoroughly before using.\n\n“I don’t think it’s possible in today’s world to avoid these chemicals completely,” he says. “I encourage patients and groups to whom I speak to to do the best they can to minimize their exposure.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/15/health/maha-report-draft-pesticide-ultraprocessed-food",
      "text": "railed"
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2026/02/promoting-the-national-defense-by-ensuring-an-adequate-supply-of-elemental-phosphorus-and-glyphosate-based-herbicides/",
      "text": "states"
    },
    {
      "url": "https://www.epa.gov/ingredients-used-pesticide-products/glyphosate",
      "text": "glyphosate"
    },
    {
      "url": "https://roundup.com/en-us/weed-grass-killers/how-do-roundup-weed-grass-killer-products-work.html?srsltid=AfmBOop42WILq1kdWyZuslqsfE0CNGf4LeFAad0uPXwlbH3sLwRKtUd-",
      "text": "Roundup"
    },
    {
      "url": "https://doi.org/10.1111/j.1742-4658.2011.08214.x",
      "text": "inhibits"
    },
    {
      "url": "https://www.epa.gov/sites/default/files/2019-04/documents/glyphosate-response-comments-usage-benefits-final.pdf",
      "text": "account for"
    },
    {
      "url": "https://water.usgs.gov/nawqa/pnsp/usage/maps/show_map.php?year=2019&map=GLYPHOSATE&hilo=L&disp=Glyphosate",
      "text": "majority"
    },
    {
      "url": "https://www.cnn.com/2025/08/15/health/maha-report-draft-pesticide-ultraprocessed-food",
      "text": "long opposed"
    },
    {
      "url": "https://www.cnn.com/2018/08/10/health/monsanto-johnson-trial-verdict",
      "text": "alleging"
    },
    {
      "url": "https://youtu.be/vm6OspRNnd4?si=18gpBTRU1QHFCNUy&t=1706",
      "text": "reiterated"
    },
    {
      "url": "https://www.bayer.com/media/en-us/monsanto-announces-roundup-class-settlement-agreement-to-resolve-current-and-future-claims/",
      "text": "proposed"
    },
    {
      "url": "https://www.bayer.com/en/is-glyphosate-safe",
      "text": "maintains"
    },
    {
      "url": "https://www.bayer.com/en/is-glyphosate-safe",
      "text": "states"
    },
    {
      "url": "https://www.momsacrossamerica.com/pesticide_coalition_update",
      "text": "called"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/health/video/cnn-blitzer-brown-zen-honeycutt-maha-rfk-trump-hhs-health",
      "text": "The Situation Room"
    },
    {
      "url": "https://youtu.be/yp8z-IaUmD0?si=KLch7YBN6LtmG7jF&t=884",
      "text": "said"
    },
    {
      "url": "https://x.com/RepThomasMassie/status/2024664921816830409?s=20",
      "text": "introduced"
    },
    {
      "url": "https://massie.house.gov/uploadedfiles/no_immunity_for_glyphosate_act1.pdf",
      "text": "bill"
    },
    {
      "url": "https://www.instagram.com/p/DU_GdIYkd7L/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==",
      "text": "called"
    },
    {
      "url": "https://www.iarc.who.int/featured-news/media-centre-iarc-news-glyphosate/",
      "text": "classified"
    },
    {
      "url": "https://www.bayer.com/en/is-glyphosate-safe",
      "text": "says"
    },
    {
      "url": "https://doi.org/10.1016/j.mrrev.2019.02.001",
      "text": "meta-analyses"
    },
    {
      "url": "https://doi.org/10.1080/03601234.2016.1142748",
      "text": "found"
    },
    {
      "url": "https://www.epa.gov/ingredients-used-pesticide-products/glyphosate",
      "text": "US Environmental Protection Agency"
    },
    {
      "url": "https://doi.org/10.1007/s00204-017-1962-5",
      "text": "European Union’s European Food Safety Authority"
    },
    {
      "url": "https://doi.org/10.1289/EHP7295",
      "text": "found"
    },
    {
      "url": "https://doi.org/10.1016/j.envpol.2021.117002",
      "text": "interfere"
    },
    {
      "url": "https://doi.org/10.1016/j.jcis.2022.03.002",
      "text": "stick"
    },
    {
      "url": "https://doi.org/10.1016/j.fct.2022.113380",
      "text": "according"
    },
    {
      "url": "https://doi.org/10.1080/15563650.2019.1623406",
      "text": "resulted"
    },
    {
      "url": "https://doi.org/10.1542/peds.2023-064774",
      "text": "formed"
    },
    {
      "url": "https://doi.org/10.1002/ps.3696",
      "text": "emerged"
    },
    {
      "url": "https://doi.org/10.1016/j.gloenvcha.2021.102239",
      "text": "additional"
    },
    {
      "url": "https://www.epa.gov/caddis/herbicides",
      "text": "far less common"
    },
    {
      "url": "https://www.publichealth.va.gov/exposures/agentorange/basics.asp",
      "text": "used"
    },
    {
      "url": "https://www.cnn.com/2012/08/10/world/asia/vietnam-us-agent-orange",
      "text": "sprayed by"
    },
    {
      "url": "https://doi.org/10.1016/j.chemosphere.2024.142966",
      "text": "according"
    },
    {
      "url": "https://www.sciencedirect.com/science/article/pii/S0278691521007031",
      "text": "comes from"
    },
    {
      "url": "https://doi.org/10.3390/s18092961",
      "text": "identified"
    },
    {
      "url": "https://www.ams.usda.gov/sites/default/files/media/Organic%20Production-Handling%20Standards.pdf",
      "text": "USDA Organic"
    },
    {
      "url": "https://www.usda.gov/about-usda/news/blog/organic-101-can-gmos-be-used-organic-products",
      "text": "not"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/health/maha-trump-glyphosate-health",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/health/maha-trump-glyphosate-health",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8fd1cb84ebb186c73cd94037424e4b4bb21e4700c8d8b3dff1932c4c3aff6129",
  "scraped_at": "2026-02-25T07:32:52.348066+00:00"
}