{
  "url": "https://lite.cnn.com/2026/02/10/politics/gordie-howe-bridge-canada-trump-threat-intl-hnk",
  "title": "Trump says he’ll block Gordie Howe Bridge from Michigan to Canada | CNN Politics",
  "date": "2026-02-11T16:32:17.421130+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPresident Donald Trump threatened Monday to block the opening of a new bridge connecting the US and Canada, again lashing out at his country’s northern neighbor over a range of economic issues as the rift between Washington and Ottawa deepens.\n\nTrump said he would “not allow” the opening of the Gordie Howe International Bridge, a 1.5-mile bridge connecting Detroit and Windsor, Ontario,in a poston Truth Social. Major construction on the bridge is complete, and it’s expected to open this year after a period of testing.\n\n“I will not allow this bridge to open until the United States is fully compensated for everything we have given them, and also, importantly, Canada treats the United States with the Fairness and Respect that we deserve. We will start negotiations, IMMEDIATELY,” the president wrote.\n\nIt is not clear how Trump would block the opening of the bridge. CNN has reached out to the White House, Canadian Prime Minister Mark Carney and the Windsor-Detroit Bridge Authority, which runs the bridge, for comment. White House Press Secretary Karoline Leavitt doubled down on the threat Tuesday, without offering specifics about how Trump planned to make good on it.\n\nTrump also claimed incorrectly that Canada “own(s) both the Canada and the United States side and, of course, built it with virtually no US content.”\n\nCarney Tuesday told reporters in Ottawa that he had spoken with Trump about the bridge and that the dispute “will be resolved.”\n\n“I explained to the president that Canada paid for the bridge, firstly,” Carney said. “Secondly, it’s a property shared between the state of Michigan and the Canadian government and there were American steel and workers involved in the work for the bridge.”\n\nThe more than $4 billion bridge, named for the famous Canadian ice hockey player Gordie Howe, is being fully paid for, built, operated and maintained by Ottawa but will be jointly owned by the government of Canada and the state of Michigan, according to the2012 agreementlaying out the terms of the bridge.\n\nStacey LaRouche, Michigan Gov. Gretchen Whitmer’s spokesperson, said in a statement to CNN Tuesday that the bridge is “all about jobs.”\n\n“It’s good for Michigan workers and it’s good for Michigan’s auto industry. As a reminder, Canada financed the construction of the bridge – which was built by union construction workers from both sides of the border — and it will be operated under a joint ownership agreement between Michigan and Canada,” LaRouche said.\n\n“This project has been a tremendous example of bipartisan and international cooperation. It’s going to open one way or another, and the governor looks forward to attending the ribbon cutting,” she said.\n\nOntario Premier Doug Ford echoed LaRouche’s comments Tuesday, telling reporters that he’s “confident” the bridge will open.\n\n“I’m very confident this bridge is going to open,” Ford told reporters. “I’ll tell you the reason why it’s going to open: because it’s in the best interest of the American economy.”\n\nThe 2012 agreement also stipulates that any iron and steel used in its construction must be produced in either the US or Canada, and one country should not be favored over the other.\n\nWindsor Mayor Drew Dilkenstold CNN newsgathering partner CBC Newsthat US steel was used in the construction of the bridge on the Michigan side of the river.\n\n“It’s just insane,” Dilkens said, responding to Trump’s statement Monday. “I really can’t believe what I’m reading.”\n\nUS Trade Representative Jamieson Greer told Fox Business on Tuesday that negotiations about the bridge would be related to the economic activity it generates.\n\n“The United States needs to make sure that it has its fair share of any proceeds from that bridge and the economic activity that it generates,” he said.\n\nMonday’s comments are the latest in a series of attacks by Trump against Canada, which escalated after Carney delivered aspeech at Davosencouraging middle powers to band together against global superpowers, such as the US.\n\nAt the end of January, Trump said he willdecertify all aircraftmade in Canada and threatened a 50% tariff on Canadian planes.\n\nTrump has alsothreatened to hit all Canadian goods with a 100% tariffif Canada makes atrade deal with China, which the president said “will eat Canada alive” in Monday’s Truth Social Post.\n\nLast month, Carney met with Chinese leader Xi Jinping in Beijing and the two formed a “new strategic partnership,” with Canada easing tariffs on Chinese electric vehicles and allowing up to 49,000 Chinese electric vehicles into its market annually. China is also expected to reduce tariff barriers on Canadian canola seed, lobster and peas later this year.\n\nThe increasing turbulence in US-Canada relations comes ahead of this year’s scheduled review of theUS-Mexico-Canada Agreement(USMCA), the trade deal Trump negotiated during his first term to replace the North American Free Trade Association (NAFTA).\n\nIn Monday’s post, Trump also complained that Ontario — Canada’s most populous province — “won’t even put U.S. spirits, beverages, and other alcoholic products, on their shelves.” Ontario,like other Canadian provinces, pulledAmerican boozefrom the shelves of its provincial liquor retailer last year to protest US tariffs on Canadian goods.\n\nFord said Tuesday the ban would remain in place as long as the tariffs did. “It’s obviously working,” Ford said. “It’s an irritant. But there’s one thing President Trump can do, get rid of Canadian tariffs. All it does is a tax on the American people. It’s a tax on the American economy. Get rid of it, and we’re good to go.”\n\nTrump spoke highly of the bridge’s value to the US in his first term. A2017 joint statementwith former Canadian Prime Minister Justin Trudeau called the Gordie Howe bridge “a vital economic link between the two countries.”\n\nCandace Laing, the president & CEO of the Canadian Chamber of Commerce, said in a statement to CNN on Tuesday that whether the threat to block the bridge was real or just a threat, “blocking or barricading bridges is a self-defeating move.”\n\n“Modern border infrastructure strengthens shared economic security. The path forward isn’t deconstructing established trade corridors, it’s actually building bridges,” Laing continued.\n\nSen. Elissa Slotkin, a Democrat from Michigan, said canceling the project will have “serious repercussions” for Michigan’s economy.\n\n“The President is punishing Michiganders for a trade war he started,” Slotkin said in a post to X Monday. “Canada is our friend — not our enemy.”\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116043090074364624",
      "text": "in a post"
    },
    {
      "url": "https://2009-2017.state.gov/documents/organization/195000.pdf",
      "text": "2012 agreement"
    },
    {
      "url": "https://www.cbc.ca/news/canada/trump-gordie-howe-bridge-9.7081924",
      "text": "told CNN newsgathering partner CBC News"
    },
    {
      "url": "https://www.cnn.com/2026/01/21/world/video/canada-prime-minister-mark-carney-davos-era-of-great-power-rivalry-intl-dsk",
      "text": "speech at Davos"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/business/trump-canada-aircraft-tariff",
      "text": "decertify all aircraft"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/business/trump-canada-tariff-threat",
      "text": "threatened to hit all Canadian goods with a 100% tariff"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/china/china-canada-carney-intl-hnk",
      "text": "trade deal with China"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/china/china-canada-carney-intl-hnk",
      "text": "new strategic partnership"
    },
    {
      "url": "https://www.cnn.com/2024/12/15/politics/usmca-trump-mexico-canada-trade",
      "text": "US-Mexico-Canada Agreement"
    },
    {
      "url": "https://www.cnn.com/2025/10/13/business/canada-trump-tariffs-trade",
      "text": "American booze"
    },
    {
      "url": "https://www.presidency.ucsb.edu/documents/joint-statement-president-trump-and-prime-minister-justin-pj-trudeau-canada",
      "text": "2017 joint statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/gordie-howe-bridge-canada-trump-threat-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/gordie-howe-bridge-canada-trump-threat-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "8ff4af448011b9226a047d240ee728610bbabe1ed41bc49a8f71d5e9545897ff",
  "scraped_at": "2026-02-11T16:32:17.421142+00:00"
}