{
  "url": "https://lite.cnn.com/2026/02/10/politics/donald-trump-police-jeffrey-epstein-2000",
  "title": "Trump told police in mid 2000s ‘everyone has known’ about Epstein’s misconduct | CNN Politics",
  "date": "2026-02-11T16:32:23.616002+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nShortly after the law enforcement investigation into Jeffrey Epstein became public in the mid-2000s, Donald Trump called the Palm Beach, Florida, Police Department to express gratitude, according to a newly released document.\n\n“Thank goodness you’re stopping him,” Trump said, according to the document. “Everyone has known he’s been doing this.”\n\nThedocument— a written record of an FBI interview that a former Palm Beach County police chief told the Miami Herald he gave in 2019 — is likely to fuel more questions about when and what specifically Trump knew about Epstein and his crimes. President Trump and the White House have said repeatedly that Trump broke ties with Epstein in the early 2000s, believing Epstein to be a “creep.”\n\nThe Miami Heraldreportedthe interview memorialized in the document was with Michael Reiter, whose name is redacted. He was the Palm Beach police chief at the time of the call, which appears to have occurred around 2006, according to the Herald. According to the FBI document, Trump told him on the call that people in New York knew Epstein was disgusting. And he said Epstein accomplice Ghislaine Maxwell was “Epstein’s operative,” adding of her, “she is evil and to focus on her.”\n\nTrump also said he was around Epstein once when teenagers were present and “got the hell out of there,” the document says. Trump was one of the “very first people” to call the Palm Beach Police Department when people found they were investigating Epstein, according to the document, which was among millions released by the Justice Department under a new law passed by Congress.\n\nWhite House press secretary Karoline Leavitt on Tuesday said she could not confirm whether the call happened, but argued that if it did, it “corroborates” Trump’s account that he had a falling out with Epstein in the early 2000s and cut ties with the financier.\n\n“It was a phone call that may or may not have happened in 2006. I don’t know the answer to that question,” she said during a press briefing. “What I’m telling you is what President Trump has always said, is that he kicked Jeffrey Epstein out of his Mar-a-Lago club because Jeffrey Epstein was a creep, and that remains true.”\n\nA Justice Department official said, “We are not aware of any corroborating evidence that the President contacted law enforcement 20 years ago.” Reiter’s private security company said in response to an email requesting comment, “Michael Reiter is not participating in interviews at this time.”\n\nThequestion of what Trump knew about Epsteinand his crimes has clouded the president’s second term amid renewed interest in the story and the release of millions of pages of documents related to the late convicted sex offender. Trump has said the two men were friends in the 1990s, and socialized in the same circles in Palm Beach, before having a falling out in the early 2000s that resulted in Trump kicking Epstein out of his Mar-a-Lago club.\n\nTrump has said the falling-out was motivated by Epstein’s attempts to steal his employees but has denied having any knowledge of his crimes.\n\n“The concept of people taking people that worked for me is bad,” Trump told reporters in July. “People were taken out of the spa, hired by him, in other words, gone.”\n\n“When I heard about it, I told him, we don’t want you taking our people – whether it was spa or not spa. I don’t want him taking people, and he was fine and then not too long after that he did it again and I said ‘outta here,’” Trump said.\n\nTrump said hebelieved one of the people taken was Virginia Giuffre, one of the most prominent Epstein survivors who later died by suicide. But Trump later that weektold reportershe didn’t really know why the women were poached from his club.\n\nTrump’s description of Maxwell as “evil” in the document contrasts with how he reacted to her arrest in 2020. He said at the time “I just wish her well.” Maxwell is serving a lengthy prison sentence for sex trafficking.\n\nWhile Maxwell pleaded the fifth during her latest deposition to the House Oversight Committee, her attorney said that she would be willing to “speak fully and honestly if granted clemency by President Trump.” Ina prior interview with Deputy Attorney General Todd Blanche, Maxwell said she “absolutely never” heard Epstein or anyone say Trump had done anything inappropriate.\n\nTrump told CNN in July that hehasn’t thought about giving a pardon or commutation to Maxwell, although he didn’t rule it out.\n\n“It’s something I haven’t thought about,” he said. “I’m allowed to do it, but it’s something I have not thought about.”\n\nThis story has been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA01249718.pdf",
      "text": "document"
    },
    {
      "url": "https://www.miamiherald.com/news/politics-government/article314631578.html",
      "text": "reported"
    },
    {
      "url": "https://www.cnn.com/2025/07/19/politics/epstein-trump-ties-analysis",
      "text": "question of what Trump knew about Epstein"
    },
    {
      "url": "https://www.cnn.com/2025/07/31/politics/virginia-giuffre-trump-epstein",
      "text": "believed one of the people taken was Virginia Giuffre"
    },
    {
      "url": "https://www.cnn.com/2025/07/31/politics/virginia-giuffre-trump-epstein",
      "text": "told reporters"
    },
    {
      "url": "https://www.justice.gov/storage/audio-files/Interview%20Transcript/Interview%20Transcript%20-%20Maxwell%202025.07.24%20(Redacted).pdf",
      "text": "a prior interview with Deputy Attorney General Todd Blanche"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-epstein-files-news-07-25-25#cmditpf8j00003b6nfhsw38b8",
      "text": "hasn’t thought about giving a pardon or commutation to Maxwell"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/donald-trump-police-jeffrey-epstein-2000",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/donald-trump-police-jeffrey-epstein-2000",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9050feead271bb8521cc1b3f4ba3cb2adc1d8e0ccd57e8e9037d52852d2c4832",
  "scraped_at": "2026-02-11T16:32:23.616014+00:00"
}