{
  "url": "https://lite.cnn.com/2026/02/20/economy/us-gdp-economy-q4",
  "title": "US economy slowed sharply in the fourth quarter, expanding at a rate of just 1.4% | CNN Business",
  "date": "2026-02-21T07:05:39.136650+00:00",
  "authors": [
    "Bryan Mena",
    "Alicia Wallace",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US economy grew at a much slower pace in the final months of 2025 as the historic government shutdown weighed on economic activity, ending a year that saw the weakest growth since the pandemic.\n\nStill, it was far from the worst-case scenario economists feared when President Donald Trump unveiled his sweeping tariffs last spring. The economy grew in 2025, despite tariffs, an aggressiveclampdown on immigrationandone of the weakest stretches of job creationsince the Great Recession, largely thanks to wealthy consumers who continued to spend.\n\nGross domestic product, which measures all the goods and services produced in the economy, registered at an annualized rate of 1.4% from October through December, the Commerce Department said Friday. That’s a marked slowdown from the 4.4% rate in the third quarter, and lower than the 1.9% rate economists projected in a poll by data firm FactSet. GDP is adjusted for seasonal swings and inflation.\n\nOverall, the economy grew by 2.2% in 2025, the slowest pace since 2020.\n\nStephanie Roth, chief economist at Wolfe Research, told CNN that last year’s slower growth, compared to prior years, was “great given how much labor supply is down.”\n\n“You could call it ‘Goldilocks,’” she said.\n\nThe cuts in federal spending, due to the shutdown, shaved off 1.1 percentage points from growth last quarter, according to the report, with economists widely expecting most of those losses to be recouped early this year.\n\nConsumers pulling back slightly on goods purchases also took a toll on fourth-quarter GDP.\n\nThe fourth-quarter reading was delayed a month because of last year’s government shutdown.\n\nConsumer spending, the lifeblood of the US economy, slowed in the fourth quarter to an annual rate of 1.4%, the weakest pace since early 2025. Over the past year, spending has been uneven by income bracket, with the poorest Americans buckling under the weight ofrising debt, a slowing labor market and cumulative inflationover the past several years.\n\n“A slower pace of consumer spending was expected for the final quarter of 2025, as some Americans had just shelled out for a new car before electric vehicle tax credits expired,” said Brett Ryan, senior US economist at Deutsche Bank.\n\nHowever, Ryan expects that key economic engine will pick back up in the first part of this year, largely because of tax refunds, adding that there’s “certainly nothing that would get you too concerned about an imminent consumer slowdown.”\n\nThe widening inequality in America has prompted households with fewer means to sour on the economy over the past year. In a separate report on Friday, the University of Michigan reported that consumer sentiment continued to diverge between those with college degrees and stock investments, and those without.\n\n“A sizable month-to-month increase in sentiment for the largest stockholders was fully offset by a decline among consumers without stock holdings,” Joanne Hsu, the survey’s director, said in a release. “Similar divergences were seen across income and education, where higher-income or college educated consumers exhibited increases in sentiment while lower-income or less-educated counterparts did not.”\n\nMeanwhile, business spending edged higher in the fourth quarter to 3.7% from the 3.2% in the prior three-month period. Ryan said that “AI spending is still definitely doing a lot of heavy lifting” on the business investment side.\n\nA separate Commerce Department report released Friday showed that consumer spending remained in the black during December; however, the supports propping up those purchases grew weaker; and inflation heated up to its highest rate in nearly two years.\n\nConsumer spending rose by 0.4% in December, but when factoring in inflation, that pace was just 0.1%from November, according to the shutdown-delayed report originally scheduled for January 29.\n\nPersonal incomes rose 0.3% for the month, in part pushed higher by a substantial settlement made to Maui wildfire victims. When taking inflation into account, personal income growth was flat.\n\nSavings as a percentage of after-tax income dropped to 3.6%, its lowest rate since October 2022.\n\nMeanwhile, the Federal Reserve’s preferred inflation gauge heated up to 2.9%, inching further away from the central bank’s 2% target. It’s the highest annual rate since March 2024.\n\nGoods-related price increases helped to drive the 0.4% monthly inflation gain, Commerce Department data shows. Trump’s slate of steep tariffs on imported goods have resulted in higher prices for certain products such as furniture, appliances and toys.\n\nWhen stripping out volatile energy and food prices, a closely watched measurement of underlying inflation trajectory rose to its highest rate in nearly a year. The core PCE price index rose by 0.4%, to an annual rate of 3%.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/economy/trumps-immigration-jobs-hiring",
      "text": "clampdown on immigration"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "one of the weakest stretches of job creation"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "rising debt, a slowing labor market and cumulative inflation"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/economy/us-pce-consumer-spending-inflation-october-november",
      "text": "from November"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/us-gdp-economy-q4",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/economy/us-gdp-economy-q4",
      "text": "Cookie Settings"
    }
  ],
  "hash": "90c161ae554f9e441d2531522552dbc2d327f722269cf0887e3e5f9ee4bf0c52",
  "scraped_at": "2026-02-21T07:05:39.136663+00:00"
}