{
  "url": "https://lite.cnn.com/2026/02/16/business/hyatt-pritzker-retire-epstein",
  "title": "Hyatt executive chairman steps down over Epstein ties | CNN Business",
  "date": "2026-02-17T07:30:08.264979+00:00",
  "authors": [
    "Ramishah Maruf, CNN"
  ],
  "text": "Source: CNN\n\nBillionaire Tom Pritzker announced on Monday he was retiring as executive chairman of Hyatt Hotels after his association with convicted sex offender Jeffrey Epstein was revealed in the latestrelease of filesby the US Justice Department.\n\nPritzker, who has been executive chairman since 2004, also said he won’t stand for re-election with the company’s board.\n\n“Good stewardship also means protecting Hyatt, particularly in the context of my association with Jeffrey Epstein and Ghislaine Maxwell which I deeply regret,” Pritzker, an heir to the Hyatt fortune, said in a statement.\n\nHe continued, “I exercised terrible judgment in maintaining contact with them, and there is no excuse for failing to distance myself sooner.”\n\nPritzker is the latest powerful figure facing repercussions after the release of files showing the depth of Epstein’s network of business and cultural elites. The released files showed Pritzker in recurring contact with Epstein, even after Epstein’scontroversial 2008 plea dealfor procuring a minor for prostitution.\n\nFor example, economist Larry Summerswas earlier banned for lifefrom the American Economic Association over his ties to the late sex offender. Sultan Ahmed bin Sulayem, the head of DP World, the world’s largest port operator, was alsoreplacedover his intimate friendship with Epstein.\n\nOther global figureshave also faced an outcryand a range of consequences for their relationships with Epstein.\n\nInone example of contact between Pritzker and Epstein in 2018,Epstein enlisted Pritzker’s help in reservations for a woman traveling through Asia who was reportedly a girlfriend of his.\n\n“Going to try to find a new girlfriend for Jeffrey,” the woman wrote in an email when Pritzker asked what she was going to do there.\n\n“May the Force be with you,” Pritzker replied, along with a smiley face emoji.\n\nThe Hyatt board named Mark Hoplamazian, president and CEO of Hyatt, to succeed Pritzker as chairman of the board effective immediately.\n\nCNN has reached out to the Pritzker Organization, which manages the family fortune and investments, and where Pritzker is currentlylistedas executive chairman.\n\nCNN’s Auzinea Bacon contributed to this report.\n\nThis story has been updated with additional context and developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "release of files"
    },
    {
      "url": "http://cnn.com/2025/09/19/politics/alex-acosta-house-oversight-epstein",
      "text": "controversial 2008 plea deal"
    },
    {
      "url": "https://www.cnn.com/2025/12/02/business/larry-summers-lifetime-ban-economic-association-epstein-ties",
      "text": "was earlier banned for life"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/business/dp-world-sultan-sulayem-epstein-intl",
      "text": "replaced"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/epstein-files-trump-ruemmler-lutnick-musk-clinton-accountability",
      "text": "have also faced an outcry"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00540739.pdf",
      "text": "one example of contact between Pritzker and Epstein in 2018,"
    },
    {
      "url": "https://pritzkerorg.com/team/",
      "text": "listed"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hyatt-pritzker-retire-epstein",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/business/hyatt-pritzker-retire-epstein",
      "text": "Cookie Settings"
    }
  ],
  "hash": "90cdd31c369a693512516e28ad489bb57d41c734c7f55fe79ad44805a2ce50c2",
  "scraped_at": "2026-02-17T07:30:08.264991+00:00"
}