{
  "url": "https://lite.cnn.com/2026/02/24/economy/jamie-dimon-warning",
  "title": "Jamie Dimon says AI euphoria, record stocks and banks doing ‘dumb things’ could lead to another financial crisis | CNN Business",
  "date": "2026-02-25T07:32:50.179781+00:00",
  "authors": [
    "Chris Isidore"
  ],
  "text": "Source: CNN\n\nJPMorgan Chase CEO Jamie Dimon warned Monday that current financial conditions and banks doing “dumb things” like taking on risky loans could lead to a market meltdown similar to the one before the 2008 financial crisis.\n\n“There will be a cycle one day,” he said, “I don’t know what confluence of events will cause that cycle. My anxiety is high over it. I’m not assuaged by the fact that asset prices are high. In fact, I think that adds to the risk.”\n\nIn remarks to investors Monday Dimon said the conditions in the market, includingrecord levels, could be cause for concern.\n\n“Unfortunately, we did see this in 2005 and 2006 and 2007, almost the same thing. The rising tide lifting all boats. Everyone was making a lot of money. People were leveraging to the hilt. The sky was the limit,” he said.\n\n“And I think today, the rising tide is lifting all boats. My own view is people getting a little comfortable that this is real, these high asset prices and high volumes, and we won’t have any kind of problem, whatsoever,” he said. “I don’t know how long it’s going to be great for everybody. I see a couple of people doing some dumb things.”\n\nDimon didn’t specify which institutions he was referring to, and assured investors that his bank, the nation’s largest, is “quite cautious,” noting that “we stick to our own rules.”\n\nHe also said that recent concern among investors aboutartificial intelligence disrupting the software sectoris also typical of disruptions in the financial markets in the past.\n\n“There’s always a surprise in a credit cycle,” he said, citing some previous examples of industries that seemed stable bets right up until they developed problems, such as newspapers, utilities and phone companies. “And this time around, it might be software, because of AI….There’s moving tectonic plates underneath it, it causes the industry to be challenged.”\n\nIn October, Dimon warned of weakness in the private credit market after subprime auto lender Tricolor and parts manufacturer First Brands both filed for bankruptcy following allegations of financial fraud. JPMorgan Chase later took a $170 million impairment charge on its loan to Tricolor. “My antenna goes up when things like that happen,” he said at the time. “When you see onecockroach, there are probably more.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/investing/dow-index-us-stocks-50k",
      "text": "record levels"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/ai-disruption-fears-us-stocks",
      "text": "artificial intelligence disrupting the software sector"
    },
    {
      "url": "https://www.cnn.com/2025/10/16/business/jamie-dimon-us-economy-cockroaches",
      "text": "cockroach"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/economy/jamie-dimon-warning",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/economy/jamie-dimon-warning",
      "text": "Cookie Settings"
    }
  ],
  "hash": "913364bc49edb5301dd9143fbb3db21772d8be543a532d9418d6022c624fdb50",
  "scraped_at": "2026-02-25T07:32:50.179794+00:00"
}