{
  "url": "https://lite.cnn.com/2026/02/10/business/mcdonalds-free-caviar-offer",
  "title": "McDonald’s is offering free caviar - yes, caviar - for Valentine’s Day | CNN Business",
  "date": "2026-02-11T16:39:53.891630+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nMcDonald’s is offering a few customers a special Valentine’s meal this year – Chicken McNuggets and caviar.\n\nStarting at 11 am ET on Tuesday, McDonald’s is giving away a limited number of kits including caviar and a gift card for McNuggets atmcnuggetcaviar.com/countdown.\n\nThe giveaway underscores the lengths restaurants and retailers are going to grab customers’ attention, hoping the dollars will follow, as consumers remain gloomy about the economy and keep a tighter hold on their paychecks.\n\nMcDonald’s said in a statement each kit has all you need for “an upscale yet effortless celebration” including a 1oz tin of “McNugget Caviar,” crème fraîche and a Mother of Pearl caviar spoon, along with a $25 gift card.\n\nTargeted campaigns can help boost brand awareness, and sales.A McDonald’s tie-inlast year with “A Minecraft Movie” helped turn around sales after two quarters of sinking numbers. (The movie was released by CNN’s sister company Warner Bros. Pictures.)\n\nAnd withconsumer sentiment at its lowest in well over a decade, businesses have been looking for ways to get customers in the door. In that sense, a free giveaway might not generate immediate revenue, but it can build notice and serve as potentially viral marketing.\n\nWhile McDonald’s clearly made its name selling burgers, its chicken sales arenow on par with beefsales at its restaurants, CEO Chris Kempczinski told investors in 2024.\n\nMcDonald’s toldFood & Winemagazine that the caviar offer was due to customer choice. For years, fans on social media have lauded the “high lowbrow” pairing. Popstar Rihanna even gave it a taste during a TikTokvideoin 2024\n\n“They’ve been pairing Chicken McNuggets with caviar long before we made it official,” the chain told the gourmet magazine.\n\nMcDonald’s reports quarterly earnings on Wednesday. For the first nine months of the year, sales globally were up 1%, excluding the impact of currency exchange rates. Sales at US stores open at least a year were up 2.4% in the third quarter.\n\nCNN’s Jordan Valinsky contributed reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://mcnuggetcaviar.com/countdown",
      "text": "mcnuggetcaviar.com/countdown"
    },
    {
      "url": "https://www.cnn.com/2025/08/06/business/mcdonalds-second-quarter-2025-earnings-minecraft",
      "text": "A McDonald’s tie-in"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/economy/us-consumer-confidence-january",
      "text": "consumer sentiment at its lowest in well over a decade"
    },
    {
      "url": "https://www.cnn.com/2024/10/03/food/mcdonalds-chicken-big-mac",
      "text": "now on par with beef"
    },
    {
      "url": "https://www.foodandwine.com/mcdonalds-free-caviar-kits-11896638",
      "text": "Food & Wine"
    },
    {
      "url": "https://www.tiktok.com/@rihanna/video/7450302638165626158?lang=en",
      "text": "video"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/mcdonalds-free-caviar-offer",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/business/mcdonalds-free-caviar-offer",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9238b01983c39a49f7479bbfb62afe641ade7ecb12306830630b4d4bea8a3897",
  "scraped_at": "2026-02-11T16:39:53.891642+00:00"
}