{
  "url": "https://lite.cnn.com/2026/02/26/entertainment/christina-applegate-bed-ms-scli-intl",
  "title": "Christina Applegate says she largely stays in bed because of multiple sclerosis | CNN",
  "date": "2026-02-27T07:16:23.904776+00:00",
  "authors": [
    "Lianne Kolirin"
  ],
  "text": "Source: CNN\n\nHollywood starChristina Applegatehas said that she spends a lot of time in bed now because of hermultiple sclerosis(MS).\n\nIn 2021, the “Dead to Me” actress revealed that she had been diagnosed with MS. Two years later, she toldVanity Fairthat she was unlikely to appear on camera again due to her struggles with the disease.\n\nMS affects the central nervous system and is considered an autoimmune disease, in which the immune system attacks its own healthy cells. MS, which has no cure,  affects quality of life and can be disabling.\n\nNow the actress, whose memoir “You With the Sad Eyes” is due to publish on March 3, has said the pain she experiences has made it difficult for her to move around.\n\nShe toldPeoplemagazine in an interview published this week that she mostly stays in bed, except when she tries to take her 15-year-old daughter Sadie to school.\n\n“I want to take her; it’s my favorite thing to do. It’s the only time we have together by ourselves,” she said. “I tell myself, ‘just get her there safely and get home so you can get back into bed.’ And that’s what I do.”\n\nOn a pinned post onInstagramlast month, Applegate can be seen speaking from her bed.\n\nShe currently presents a podcast about living with MS calledMeSsy, alongside fellow actress Jamie-Lynn Sigler – best known for her role as Meadow Soprano – who also has the condition.\n\n“My life isn’t wrapped up with a bow,” Applegate said. “People’s lives, sorry for lack of a better term﻿, f**king suck sometimes. So I’m being as honest and raw as I possibly can.”\n\nApplegate’s upcoming book follows her from her early and tumultuous home life in Laurel Canyon in the 1970s and 1980s to her stardom on the sitcom “Married… with Children” and beyond.\n\nDetails released by publishing umbrella groupHachettestates: “A Multiple Sclerosis diagnosis in 2021 confined her to a king-sized bed and the company of memories she’d rather forget: memories of the self-doubt and body dysmorphia that stalked her meteoric rise, of her mother’s fight against addiction and abuse after her father left, and of the tax life had taken on her body and mind that was suddenly coming due.”\n\nApplegate told People: “We all have come from somewhere, some places more painful than others, and it’s what you do with it, I guess. This is not an inspirational book, by any means. But it can inspire.”\n\nAdmitting the book wasn’t easy to write, she said it’s “about a little girl with sad eyes who ended up becoming Christina Applegate.” She admitted that the sad eyes remain “but she’s a stronger, different, resilient human being.”\n\nCNN’s Jack Guy contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://cnn.com/2023/05/08/entertainment/christina-applegate-acting-multiple-sclerosis",
      "text": "Christina Applegate"
    },
    {
      "url": "https://cnn.com/2019/02/27/health/multiple-sclerosis-explainer",
      "text": "multiple sclerosis"
    },
    {
      "url": "https://www.vanityfair.com/hollywood/2023/05/christina-applegate-on-ms-and-its-toll-on-her-life-and-iconic-career-it-f-king-sucks",
      "text": "Vanity Fair"
    },
    {
      "url": "https://people.com/christina-applegate-hopes-to-empower-others-with-her-revealing-memoir-exclusive-11912521",
      "text": "People"
    },
    {
      "url": "https://www.instagram.com/p/DUGXij4DeMp/?hl=en",
      "text": "Instagram"
    },
    {
      "url": "https://www.messythepodcast.com/",
      "text": "MeSsy"
    },
    {
      "url": "https://www.hachettebookgroup.com/titles/christina-applegate/you-with-the-sad-eyes/9780316594929/campaign/?fbclid=PAZXh0bgNhZW0CMTEAc3J0YwZhcHBfaWQMMjU2MjgxMDQwNTU4AAGnDQkJssZaHAdPLBT5WGXuNDYmsrwlZNd119_fJGLwJrCj-92Xfm8X5458QzI_aem_jBynNoPhnARp6cJurspqhg",
      "text": "Hachette"
    }
  ],
  "hash": "92a7dfc7a1c4916f87a5b0a736a7535dcb3179965b58b71a073451f1e9bab37e",
  "scraped_at": "2026-02-27T07:16:23.904790+00:00"
}