{
  "url": "https://lite.cnn.com/2026/02/24/politics/al-green-escorted-out-trump-state-of-the-union-protest",
  "title": "Rep. Al Green escorted out of House chamber early into Trump’s speech after protest | CNN Politics",
  "date": "2026-02-25T07:31:35.393030+00:00",
  "authors": [
    "Ellis Kim",
    "Sarah Ferris"
  ],
  "text": "Source: CNN\n\nRep. Al Green was escorted out of the House chamber just minutes into President Donald Trump’sState of the Union addresson Tuesday night for holding a sign reading “Black people aren’t apes!”\n\n“I wanted the president to see it, and he saw it, and I told him, Black people are not apes, and for him to do what he did was racist, and he knows it. But sometimes we have to let him know in the public that we know it,” the 78-year-old Texas Democrat told CNN shortly after he was escorted out.\n\nGreen, a senior member of the party, is staunchly anti-Trump and is known for his repeated attempts to impeach the president, as well as hisprevious disruptionof one of Trump’s speeches at the US Capitol.\n\nDemocrats had been expecting some kind of public protest from Green, given he is one week out from a difficult primary battle, where he faces a member-on-member race.\n\nHouse Democratic leaders had made their most unambiguous demands and pleas to their rank-and-file of any major address from the president to date: Keep quiet in the House chamber or skip Trump’s speech altogether, according to Democratic members familiar with the conversations.\n\nDemocratic leaders were fearful a spectacle from one of their members could turn the focus away from the president at a time when he is at his weakest moment politically in years, and instead badly divide Democrats.\n\nThey had told their members they didn’t want them bringing in signs that could create awkward moments that could become a scene.\n\n“There was an understanding that members are either going to plan to attend and those who are not going to attend are going to boycott the event and express their opposition to Donald Trump and a variety of the other different things that will be taking place,” House Democratic Leader Hakeem Jeffries said earlier Tuesday, adding that he was “not concerned” anyone would defy his wishes.\n\nAsked whether he had defied instructions from his party leaders, Green said: “I’m not defying the leadership. What I’m doing is making a point to the president.”\n\n“At some point you cannot let racism continue. If you tolerate it, you perpetuate it. I refuse to tolerate racism. The president needs to know that Black people aren’t apes, and he should have apologized for what he did,” he said.\n\nEarlier this month, Trump shared and then deleted a racist video depicting former President Barack Obama and former first lady Michelle Obama as apes in a jungle. The presidentrefused to apologizefor the Truth Social post, insisting he hadn’t seen the final frames containing the offensive content and blaming a staffer for the mistake.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/2025/03/04/politics/al-green-removed-trump-speech",
      "text": "previous disruption"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/donald-trump-obamas-apes-truth-social",
      "text": "refused to apologize"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/al-green-escorted-out-trump-state-of-the-union-protest",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/al-green-escorted-out-trump-state-of-the-union-protest",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9304f559683bd83b1ee0aea598fea9e40fdbb64c7b8ca367c2a0eb16130afd3a",
  "scraped_at": "2026-02-25T07:31:35.393041+00:00"
}