{
  "url": "https://lite.cnn.com/2026/02/19/politics/trump-white-house-ballroom-commission",
  "title": "Trump’s White House ballroom moves one step closer to approval after fast-track vote | CNN Politics",
  "date": "2026-02-20T07:29:00.157065+00:00",
  "authors": [
    "Sunlen Serfaty, CNN"
  ],
  "text": "Source: CNN\n\nThe Commission of Fine Arts fast-tracked approval for President Donald Trump’s East Wing renovation plans Thursday, bringing the president’s quest for a new ballroom one step closer to reality.\n\nIn a unusual move, the committee, an independent federal agency that advises the president and Congress on design plans for monuments, memorials, coins and federal buildings, voted unanimously not only to approve the concept as presented but to approve the final design, an unexpected acceleration of the approval process through this committee.\n\nThe approval came despite the committee’s chair noting the panel received over 2,000 public comments about the project, with over 99% negative.\n\nThe meeting, held virtually on Zoom, was not open to public, in-person comment, so the chairman summarized that much of the  concern was about what commenters felt was “illegal demolition,” “inappropriate scale” and lack of transparency around the project.\n\nThe vote came just an hour after the committee swore in two new members: Trump’s executive assistant, Chamberlain Harris — a 26-year-old without any extensive arts experience — and Pamela Hughes Patenaude, former deputy secretary of Housing and Urban Development during the first Trump administration.\n\nThe addition of the new members meant the meeting was the first held with a panel made up completely of Trump appointees.\n\nSince last year, the president has been installing loyalists on the committee, after gutting the board completely in October as the East Wing demolition got underway.\n\nNewly installed commissioner Harris spoke in support of the project, saying the White House is the “greatest house in world. We want this to be the greatest ballroom in the world.”\n\nThe architect of the project, Shalom Baranes, presented animated and 3-D models of the new East Wing, marking the first time the public has seen and been able to review a more complete mock-up of the project.\n\nThe East Wing renovation project also requires approval from the National Capital Planning Commission that is set to meet next on March 5. The commission is also comprised of Trump loyalists.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-white-house-ballroom-commission",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/trump-white-house-ballroom-commission",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9324d358713e3d61236687357c24334db9d54aed0044426179838f218703302d",
  "scraped_at": "2026-02-20T07:29:00.157081+00:00"
}