{
  "url": "https://lite.cnn.com/2026/02/21/europe/lviv-explosions-terror-attack-investigation-intl-hnk",
  "title": "Deadly explosions in western Ukraine investigated as ‘terrorist attack’ | CNN",
  "date": "2026-02-22T07:09:02.020018+00:00",
  "authors": [
    "Victoria Butenko",
    "Rhea Mogul",
    "CNN"
  ],
  "text": "Source: CNN\n\nAt least one person was killed and dozens more injured in explosions that hit the western Ukrainian city of Lviv early Sunday, in what authorities have labeled a “terrorist attack.”\n\nThe blasts took place as police responded to an emergency phone call about an intrusion at a store near the city center, according to Lviv’s regional prosecutor’s office.\n\nThe first occurred after police arrived at the scene, it said, and was followed by another after the arrival of a second crew.\n\nA 23-year-old policewoman was killed in the attack, while a patrol car and a civilian vehicle were damaged, the prosecutor’s office said.\n\nLviv’s regional prosecutor’s office said it has launched an investigation into “a terrorist act that caused serious consequences,” but added that the circumstances were unclear.\n\n“This is definitely an act of terror,” Lviv mayor Andriy Sadovy said in a post on Facebook.\n\nOfficials have not yet said who is suspected of perpetrating the attack.\n\nMeanwhile, Ukraine’s capital city Kyiv was under a combined missile and drone strikes overnight into Sunday. Explosions were heard in the city following a ballistic missile alert.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/europe/lviv-explosions-terror-attack-investigation-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/europe/lviv-explosions-terror-attack-investigation-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "93a1f13bbb759888f76760f27126815ca4d48760f8279a57cbdb3130129e0ff1",
  "scraped_at": "2026-02-22T07:09:02.020033+00:00"
}