{
  "url": "https://lite.cnn.com/2026/02/26/politics/white-house-epstein-files-problem-trump",
  "title": "Analysis: How the Trump team keeps making its Epstein problem worse | CNN Politics",
  "date": "2026-02-27T07:15:58.588146+00:00",
  "authors": [
    "Analysis by Aaron Blake"
  ],
  "text": "Source: CNN\n\nThe American people don’t need any help being suspicious about the government’s handling of Jeffrey Epstein.\n\nBut the Trump administration keeps giving them more reason to be anyway.\n\nOne of the most bizarre features of this whole saga has been the administration’s astounding number of missteps, delayed disclosures and false claims.\n\nAnd that shows no signs of dissipating.\n\nThe most recent example is reporting this week that the government didnot publish dozens of FBI witness interviews. Those include three related to a woman who accused President Donald Trump of sexually assaulting her decades ago, when she was a minor. (Trump has not been accused by law enforcement of any wrongdoing.)\n\nThe DOJ says it isreviewingwhether any of those missing documents — first reported by NPR and independent journalist Roger Sollenberger — were improperly withheld.\n\nIn a statement, the White House called the allegations against Trump “false and sensationalist” and pointed to a previous DOJ statement that “some of the documents contain untrue and sensationalist claims against President Trump.”\n\nBut the plausibility of the woman’s claims isn’t the main point; the point is that an increasingly politicized Justice Department — one wherea massive banner of Trump was hung last week— did not release documents containing allegations about the president.\n\nIn a vacuum, that would be problematic. But next to everything else, it’s really bad.\n\nRecent polling from Reuters and Ipsos showed75%of Americans said the government is “hiding information” about Epstein’s supposed clients, including 49% who say it “definitely” is doing so. And those numbers have risen — from69% and 36% in July, respectively.\n\nAnd aCNN pollearlier this month showed 67% said the government was intentionally withholding some information that should be released.\n\nHow might people have arrived at such conclusions? Perhaps because of the below.\n\nProminent officials who now serve in Trump’s Justice Department had for years promoted theories about a government cover-up involving Epstein. After Trump’s election in 2024, they promised major disclosures.\n\nBut then they came into office.\n\nThey soon tried to pass offbinders of largely old documentsgiven to right-wing influencers as those major disclosures.\n\nThen some officials suddenly changed their tune on what the documents showed, downplaying the prospect of a client list and saying Epstein had in fact killed himself. Eventually, theyabruptly announcedin July, in an unsigned memo from the FBI, that they wouldn’t release anything else.\n\nThen we learned that sudden change in tunecoincided with Trump being told his name appearedin the Epstein files.\n\nEventually, the administration consented to releasing the Epstein files — but only after it was clear they probably had no other choice. Congress had well more than veto-proof majorities to force the issue.\n\nSpeaking of Trump’s name being in the files, that’s one of several instances of him downplaying his proximity to Epstein using claims that were subsequently undermined or called into question:\n\nWhen Trump hasn’t made demonstrably false claims, he’s often been opaque:\n\nThere have been other data points at least gesturing in the direction that Trump knew Epsteinliked young women. But what he told local Florida police is perhaps the most compelling evidence yet that Trump knew something about Epstein’s crimes way back when.\n\nWhite House press secretary Karoline Leavitt said she couldn’t confirm whether that conversation happened. She added that if it did, it “corroborates” Trump having called Epstein a “creep” and broken ties with him. But Trump has never been forthcoming about why he decided Epstein was a creep.\n\nShortly after she interviewed with Deputy Attorney General Todd Blanche last summer, Maxwell wasmoved to a minimum-security prison camp.\n\nYou begin to see how that might look bad. Maxwell, after all, is a convicted sex offender. She was also saying thingsthat could help Trump— even as he dangled a potential pardon.\n\nBut the administration spent months not explaining why the transfer occurred.\n\nEventually Blanchetold NBC Newsshortly before Christmas that the Bureau of Prisons recommended the transfer, and he suggested he had signed off on it. Blanche said that Maxwell had been facing “numerous threats against her life.”\n\nBut in testimony earlier this month, Bondi said she hadn’t known about the transfer (despite being Blanche’s boss) and claimed Maxwell was transferred to “the same-level facility,” which doesn’t appear to be true.\n\nAfter Congress forced the release of the Epstein files, the administration’s problems have snowballed.\n\nFirst, it blew the 30-day deadline to release all the files.\n\nThen itfailed to redact lots of victim informationwhile apparently redacting more than the law called for in other areas, including thenames of potential and suspected Epstein co-conspirators. The administration claimed it didn’t “redact the names of any men,” but it clearly did.\n\nAnd now we learned that some key documents haven’t been released, including ones that contain allegations about Trump.\n\nA DOJ spokesperson told CNN that any withheld documents were not deleted and were either “duplicates, privileged, (or) part of an ongoing federal investigation.”\n\nBut allegations involving Trump wouldn’t qualify for those buckets, unless they’re claiming some kind of privilege or Trump is under investigation.\n\nIt’s certainly on a smaller scale than the above, but Commerce Secretary Howard Lutnick hasn’t done the administration any favors in its efforts to downplay the Epstein files.\n\nIn an interview published by the New York Post in October, Lutnick recounted his experiences with Epstein, claiming he cut ties with him two decades ago. We’ve since learned from documents and his congressional testimony that thatsimply wasn’t true,although he insisted he did not “have any relationship” with Epstein\n\nLutnick in the same New York Post interview also contradicted the Justice Department by calling Epstein “the greatest blackmailer ever.” He suggested Epstein had indeed lured men to get massages from young women and then used the videos to escape justice.\n\nHe indicated he was surmising some of this, but given what we now know about their past contact, there are fresh questions about what Lutnick knew about Epstein.\n\nGOP Sen. John Kennedy of Louisiana suggested to Bondi at a hearing that the FBI should interview Lutnick about his claims. There’s no indication that’s happened, and the administration has stood by him.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/us/epstein-files-trump-accuser-missing-files-invs",
      "text": "not publish dozens of FBI witness interviews"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026#cmm2k8pvg00003b6r4z7apynr",
      "text": "reviewing"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-banner-justice-department-building",
      "text": "a massive banner of Trump was hung last week"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2026-02/Reuters%20Ipsos%20Core%20Political%20Topline%20February%202026_1.pdf",
      "text": "75%"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2025-07/Reuters%20Ipsos%20Immigration%20and%20Epstein%20Files%20Topline%2007%2018%202025.pdf",
      "text": "69% and 36% in July"
    },
    {
      "url": "https://www.cnn.com/2026/01/18/politics/epstein-files-cnn-poll",
      "text": "CNN poll"
    },
    {
      "url": "https://www.cnn.com/2025/02/28/media/epstein-files-conspiracy-bondi",
      "text": "binders of largely old documents"
    },
    {
      "url": "https://www.cnn.com/2025/07/07/politics/bondi-epstein-files-client-list-suicide-memo",
      "text": "abruptly announced"
    },
    {
      "url": "https://www.cnn.com/2025/07/24/politics/trump-epstein-files-pivot-timeline",
      "text": "coincided with Trump being told his name appeared"
    },
    {
      "url": "https://www.cnn.com/2025/07/31/politics/virginia-giuffre-trump-epstein",
      "text": "liked young women"
    },
    {
      "url": "https://www.cnn.com/2025/08/01/politics/ghislaine-maxwell-federal-prison-texas",
      "text": "moved to a minimum-security prison camp"
    },
    {
      "url": "https://www.cnn.com/2025/07/25/politics/ghislaine-maxwell-trump-epstein-doj",
      "text": "that could help Trump"
    },
    {
      "url": "https://www.politico.com/news/2025/12/21/todd-blanche-defends-moving-ghislaine-maxwell-00702240",
      "text": "told NBC News"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/justice-department-under-scrutiny-for-revealing-victim-info-and-concealing-possible-enablers-in-epstein-files",
      "text": "failed to redact lots of victim information"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/redacted-text-jeffrey-epstein-files",
      "text": "names of potential and suspected Epstein co-conspirators"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/howard-lutnick-jeffrey-epstein-island",
      "text": "simply wasn’t true,"
    },
    {
      "url": "https://nypost.com/2025/10/01/us-news/howard-lutnick-calls-ex-neighbor-jeffrey-epstein-greatest-blackmailer-ever/",
      "text": "the greatest blackmailer ever"
    }
  ],
  "hash": "94437cd3a09730fd80e1803816a7c7b9e39c20b6384fe2873e3a1590c587e172",
  "scraped_at": "2026-02-27T07:15:58.588161+00:00"
}