{
  "url": "https://lite.cnn.com/2026/02/19/uk/misconduct-public-office-andrew-arrest-explained-intl",
  "title": "Why was Andrew Mountbatten-Windsor arrested? ‘Misconduct in public office,’ explained | CNN",
  "date": "2026-02-20T07:28:15.777485+00:00",
  "authors": [
    "Lauren Kent, CNN"
  ],
  "text": "Source: CNN\n\nAndrew Mountbatten-Windsor’s arrest on Thursday marks an extraordinaryfall from gracefor the former prince – and it all hinges on a notoriously difficult-to-prosecute law that experts have criticized for lacking clarity.\n\nPolicearrested Mountbatten-Windsoron suspicion of misconduct in public office, which is a common law offen﻿se in England, meaning it was established through prior court decisions rather than legislation. It dates back hundreds of years and carries a maximum sentence of life imprisonment.\n\nLater in the day, Andrew was pictured leaving the police station. Thames Valley police said he was “released under investigation.”\n\nPolice have not said what led them to arrest the former prince on suspicion of misconduct in public office, but he previously spent a decade as UK trade envoy starting in 2001. He stepped down in 2011 after coming under fire over his association with convicted sex offenderJeffrey Epstein.\n\nUnder English law, the offense concerns “serious wilful abuse or neglect of the power or responsibilities of the public office held,” according to the Crown Prosecution Service, the body that prosecutes criminal cases in England and Wales.\n\nThe prosecution guid﻿ance sets out four elements required to secure a conviction for misconduct in public office: The person accused must be deemed a publicofficer, and there has to be a direct link between the misconduct and abuse of their responsibilities.\n\nThe offense must also be willfully committed, meaning the official must be found to have deliberately done something wrong “knowing it to be wrong or with reckless indifference.” Finally, it must be committed “without reasonable excuse or justification.”\n\nLegal experts say the offense is complicated and murky to prosecute.\n\nWhile Mountbatten-Windsor’s brother King Charles has sovereign immunity, making him exempt from criminal prosecution as well as civil lawsuits, there is nothing to prohibit legal action against the former prince or other members of the royal family.\n\nAreportfrom the Law Commission, which advises the UK government on legal reforms, called it “one of the most notoriously difficult offences to define in England and Wales.”\n\nThe current law is “unsatisfactory, not least because it is punishable with up to a life sentence,” the Law Commission report said in 2020. And in recent years, the definition of the offense has become a moving target.\n\n“In the past two decades, a substantial body of case law has refined, and in some cases shifted, the terms of the offence,” the report said. “Increased usage of the offence by police and prosecutors in recent decades has exacerbated the problem.”\n\nPart of the issue is that there is no simple definition of a public officerin modern times, according to the prosecution service’s guidance. It can encompass obvious elected officials – ministers, mayors and members of parliament – but also civil servants, prison staff, army officers, police constables and even bishops of the Church of England.\n\nThe current law has also been used to prosecute secondary parties, such as journalists who allegedly encouraged public office holders to leak confidential information – something that the Law Commission said has generated significant controversy.\n\nAnd following several high-profile cases, “questions have been raised as to how well-equipped the common law offence is to deal with modern forms of misconduct,” the Law Commission added.\n\nThe seriousness of the offense is also a factor in cases of misconduct in public office, andthere is a “high bar,”according to the Institute for Government, a London-based think tank.\n\n“Because of the ambiguities around the definition and scope of MiPO (misconduct in public office) and the difficulty of establishing all elements of the offence, police and prosecutors have tended to rely on other specific statutory offences where available,” Institute for Government experts have written.\n\nDue to the lack of clarity, the UK government has introduced a bill –the Public Office (Accountability) Bill– to better define what is illegal for public office holders to do and to enshrine that in legislation. That bill has nearly made it through the House of Commons and will soon get passed to the House of Lords.\n\nIf that bill becomes law, British prosecutors might decide not to continue pursuing cases opened under the previous common law offense if they would not meet the requirements for the new legislated offense.\n\nIn short, there are a fair number of open questions in relation to the allegations against Mountbatten-Windsor.\n\n“Allegations of this nature are serious and are likely to involve a complex and detailed criminal investigation,” said legal expert Allan Maidment, a criminal law practitioner at MSB Solicitors in Liverpool. “If charges were ultimately brought, proceedings could take a significant period of time to progress through the Crown Court due to the evidential and legal issues often involved.”\n\nThe former prince has not publicly responded to the latest allegations to emerge after the US Department of Justice﻿ (DOJ) released millions of documents related to Epstein. Mountbatten-Windsor has repeatedly denied all allegations of wrongdoing and said he never witnessed or suspected any of the behavior that Epstein was accused of.\n\nMountbatten-Windsor is not the only high-profile person in the UK under investigation for alleged misconduct in public office.\n\nAbout two weeks ago, British police searched two properties linked toPeter Mandelson, a veteran Labour party politician who has been accused of passing on market-sensitive information that was of clear financial interest to Epstein in the wake of the 2008 financial crisis, when he was serving as Britain’s business secretary.\n\nMandelson had already been removed as Britain’s ambassador to the US in September, following revelations regarding his personal relationship with the late sex offender.\n\nThe US DOJ’s release ofadditional filesin January heaped further scrutiny on his dealings with Epstein, this time in relation to his actions in government. Among the documents is an email exchange from 2009 in which Mandelson appears to discuss Britain’s plans to impose an additional tax on bankers’ bonuses as a punitive, one-off measure following the crash.\n\nMandelson has denied any criminal wrongdoing in connection with Epstein.\n\nSeparate to those investigations, UK police are also“assessing” information about private flightsflown into and out of London’s Stansted Airport following the publication of the millions of US DOJ documents related to Epstein. Stansted is referenced in more than 80 documents in the files released by the DOJ.\n\nStansted Airport said: “All private aircraft at London Stansted operate through independent Fixed Base Operators, which handle all aspects of private and corporate aviation in line with regulatory requirements.”\n\nThe airport said that these terminals are “entirely independent” and “no private jet passengers enter the main airport terminal.”\n\nCNN’s Lauren Said-Moorhouse, Max Foster, Christian Edwards and James Frater contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/world/timeline-andrew-arrest-jeffrey-epstein-intl",
      "text": "fall from grace"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "arrested Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "Jeffrey Epstein."
    },
    {
      "url": "https://assets.publishing.service.gov.uk/media/601bec27e90e0711cc85dd91/Misconduct-in-public-office-WEB11.pdf",
      "text": "report"
    },
    {
      "url": "https://www.instituteforgovernment.org.uk/explainer/misonduct-in-public-office",
      "text": "there is a “high bar,”"
    },
    {
      "url": "https://bills.parliament.uk/bills/4019",
      "text": "the Public Office (Accountability) Bill"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/europe/peter-mandelson-epstein-ties-britain-intl-latam",
      "text": "Peter Mandelson"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "additional files"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/uk/uk-police-stansted-airport-epstein-intl",
      "text": "“assessing” information about private flights"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/misconduct-public-office-andrew-arrest-explained-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/uk/misconduct-public-office-andrew-arrest-explained-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "960c9a15463a353f95d52490a653277fc177ceccbe4eaeb36db1bed1fcfa5425",
  "scraped_at": "2026-02-20T07:28:15.777498+00:00"
}