{
  "url": "https://lite.cnn.com/2026/02/09/americas/cuba-air-canada-flights-suspended-fuel-supply-latam-intl",
  "title": "As US squeezes Cuba’s oil supply, airlines rethink flights and Havana rations health services | CNN",
  "date": "2026-02-11T16:33:23.555959+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nCanada’s largest airline has said it is suspending flights to Cuba due to a shortage of aviation fuel on the island – a move that comes amid a US orchestrated squeeze on the country’soil supplythat has also forced Havana to ration health, transport and school services.\n\nAir Canada said it stopped service to Cuba on Monday but would still carry out “ferry flights” to pick up about 3,000 customers in the country and return them home, while some other airlines said they would continue flying to the Caribbean country but rethink their logistics.\n\n“For remaining flights, Air Canada will tanker in extra fuel and make technical stops as necessary to refuel on the return journey, if necessary,” said Air Canada, which operates an average of 16 weekly flights to Cuba.\n\nThe Spanish airliners Iberia and Air Europa said their services to the island would continue, but flights from Madrid to Havana would need to land in the Dominican Republic to refuel. Meanwhile, American Airlines, Delta Air Lines and Aeromexico told CNN they would continue their operations – with American saying their aircraft could carry enough fuel for the return flights.\n\nThe development comes as the US attempts to cut its long-time communist foe Havana off from receiving oil deliveries from itsregional neighbors, a move that has exacerbated a long-standing fuel crisis on the Caribbean island. On Sunday, Cuba warned airlines that jet fuel would not be available from February 10 to March 11.\n\nIn 2025, Cuba welcomed more than 754,000 visitors from Canada, more than any other country, according to the Cuban National Office of Statistics and Information. That year, the country also reported more than 110,000 visitorsfrom the US, over 56,000 from Mexico and 46,000 from Spain.\n\nThe blow to the country’s tourism industry follows announcements by Havana that it will ration resources in hospitals and prioritize urgent medical care as part of nationwide austerity measures in response to the energy crisis.\n\nUnder the measures, hospital stays and surgical activity will be limited whenever possible.\n\n“(The measures aim) to significantly preserve these essential services, reorganize capabilities, concentrate resources where they are most needed, and ensure the continuity of services to the population,” Health Minister José Angel Portal Miranda said Monday.\n\nOther emergency measures announced by the government in response to the energy crisis include reducing school hours, postponing major sporting and cultural events, and cutting transport services.\n\nThe dwindling fuel supply has also left Cubans facing constant blackouts and long lines at gas stations.\n\nCuban officials have said existing US economic sanctions are largely to blame for the energy crisis, although critics also fault a lack of government investment in infrastructure.\n\nCuban Deputy Foreign Minister Carlos Fernández de Cossío told CNN last week that the government was ready for “meaningful” dialogue with the US to address their differences – but it was not prepared to discuss regime change.\n\nUS President Donald Trump has said Cuba can avoid a total cut-off by striking “a deal” with the US, one potentially requiring the return of property confiscated from Cuban exiles who left the island following the 1959 revolution.\n\nTrump has also called on Mexico to suspend oil shipments to Cuba, but Mexican President Claudia Sheinbaum has said she wants to find a diplomatic solution so her country can continue sending oil to the island without being hit withUS tariffs.\n\n“This sanction being imposed on countries that sell oil to Cuba is very unfair, very unfair. It’s not right, because sanctions that affect the people are not right. One may agree or disagree with the regime in Cuba, but the people should never be harmed,” Sheinbaum said.\n\nMexico is traditionally the second biggest supplier of oil to Havana after Venezuela – but supplies from Caracas have already been disrupted following the capture by US special forces of its President Nicolas Maduro, making Mexico’s contribution even more vital.\n\nThe Mexican government on Sunday shipped more than 800 tons of humanitarian aid to the country, and Sheinbaum promised that more support would follow.\n\n“We are going to help the people of Cuba, as we have always helped people in need,” she insisted.\n\nRussia, a longtime ally of Cuba, said Monday that the situation in the country was “truly critical.”\n\nKremlin spokesman Dmitry Peskov accused the US of implementing a “chokehold” on Cuba.\n\nHe said Moscow was discussing ways to solve the problem or at least provide assistance.\n\n“We are in intensive contact with our Cuban friends through diplomatic and other channels,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/americas/us-cuba-oil-blockade-threat-of-war-intl-latam",
      "text": "oil supply"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/americas/venezuela-oil-reform-approved-latam-intl",
      "text": "regional neighbors"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/americas/cuba-oil-supply-trump-tariff-mexico-latam-intl",
      "text": "US tariffs"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/americas/cuba-air-canada-flights-suspended-fuel-supply-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/americas/cuba-air-canada-flights-suspended-fuel-supply-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9660b94dfe366d87050abf36456e32b30db498aa0d3f0cffb857b81e357a8390",
  "scraped_at": "2026-02-11T16:33:23.555971+00:00"
}