{
  "url": "https://lite.cnn.com/2026/02/17/politics/man-arrested-capitol-loaded-shotgun",
  "title": "Man in tactical vest with loaded shotgun arrested after charging US Capitol, police say | CNN Politics",
  "date": "2026-02-18T07:31:14.265042+00:00",
  "authors": [
    "Holmes Lybrand, CNN"
  ],
  "text": "Source: CNN\n\nAn 18-year-old in a tactical vest who charged the US Capitol with a loaded shotgun Tuesday was quickly arrested, US Capitol Police said.\n\nPolice identified the man as Carter Camacho of Smyrna, Georgia, and said he acted alone. They are working to determine a motive.\n\nCapitol Police Chief Michael Sullivan said Camacho, armed with the loaded shotgun and carrying additional rounds, drove a white Mercedes SUV near the Capitol before exiting and running toward the building.\n\nHe was intercepted by Capitol Police, who drew their firearms and told him to drop his gun and get on the ground, Sullivan said. Camacho complied and laid down before being arrested and taken into custody.\n\n“Who knows what could have happened if we didn’t have officers” at their posts, Sullivan said.\n\n“This individual had a tactical vest on,” the chief said, as well as “tactical gloves.” A Kevlar helmet and gas mask were found in the man’s car, Sullivan said. Police found the car in front of the US Botanic Garden, near the Capitol. They said the vehicle was not registered in his name.\n\nPolice have charged Camacho with carrying a rifle without a license, having an unregistered firearm and ammunition, as well as unlawful activities. He was not previously known to Capitol Police, they said.\n\nLaw enforcement temporarily closed traffic and cautioned people to stay away from the area during the incident.\n\nThe Capitol was quieter than usual on Tuesday, with lawmakers away from Washington this week on a pre-scheduled recess.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/man-arrested-capitol-loaded-shotgun",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/man-arrested-capitol-loaded-shotgun",
      "text": "Cookie Settings"
    }
  ],
  "hash": "968d0cccdc717d0c38138a30c09b2b02e8d7dd66c419377663311fc58341f2be",
  "scraped_at": "2026-02-18T07:31:14.265056+00:00"
}