{
  "url": "https://lite.cnn.com/2026/02/28/science/yuan-dynasty-porcelain-singapore-shipwreck-intl-scli",
  "title": "Record haul of rare Yuan Dynasty blue-and-white porcelain discovered at shipwreck off Singapore | CNN",
  "date": "2026-03-01T07:06:44.391492+00:00",
  "authors": [
    "Issy Ronald"
  ],
  "text": "Source: CNN\n\nIn the waters offSingapore, a recently uncovered a shipwreck with a huge cargo of blue-and-white porcelain is shedding light on the storied Chinese craft produced during the turbulent era of the Mongol Empire.\n\nThe roughly 650-year-old ship, which was likely sailing from China to Temasek, a historic settlement on the site of modern-day Singapore, contained a record haul of Yuan Dynasty porcelain, according to the paper that detailed its discovery.\n\nIt took Michael Flecker, the marine archaeologist who led the investigation, and his team four years to sift through the site of the 14th century wreck and recover the remnants of the ship’s cargo.\n\nThe researchers found roughly 3.5 metrictons of ceramic shards, about 136 kilograms (about 300 pounds) of which was Yuan porcelain – that distinctive blue-and-white, intricately patterned ceramic, as well as several intact or nearly intact porcelain pieces.\n\nAlthough the wreck site was shallow, the researchers battled “strong currents and associated shocking visibility,” meaning they could only dive about once every four weeks, Flecker told CNN.\n\n“Even then, we were occasionally sent tumbling along the seabed or groping our way back to the diver down-line in darkness,” added Flecker, a senior archaeologist at Heritage SG, a subsidiary of the Singapore National Heritage Board.\n\nIn such conditions, the vessel itself mostly disintegrated, though Flecker suspects it was likely a Chinese junk, a type of sailing ship widely used in the early Middle Ages.\n\nScant artifacts survived those conditions, and almost all the porcelain recovered from the site consisted of shards. Still, enough intact objects survived to identify the telltale designs.\n\nOne features a four-clawed dragon; another depicts a phoenix surrounded by a band of chrysanthemums.\n\nThe recurrence of one particularly popular design – mandarin ducks in a lotus pond – even allowed Flecker to date the shipwreck.\n\nThat design was the signature motif of Emperor Wenzong, who restricted it for his personal use during his reign from 1328 to 1332,according to the study. Those restrictions likely ended once he was deposed, meaning that commercial kilns produced many more ceramics featuring this motif, much of which was exported, Flecker said.\n\nThe imperial kilns were likely shut down about 20 years later, following the invasion of the Red Turbans, a peasant rebellion movement, narrowing the window in which this ship could have sunk.\n\nEven if some kilns had continued producing ceramics, the Yuan Dynasty fell in 1368 and the first Ming emperor banned commercial trade around 1371, so even conservative estimates for dating the shipwreck still fall between the late 1320s and 1371, according to the study.\n\nDuring the time Yuan porcelain was produced, it became coveted by elites across Eurasia, said Shane McCausland, professor of the history of art at SOAS University of London (formerly the School of Oriental and African Studies) who wasn’t part of the study.\n\n“This is crockery, it’s not prized in the same way as gold, painting, calligraphy or the greatest architecture,” he told CNN. “Yet, it’s something to do with the translucency, the incredible hardness of it, it’s a kind of material that is a bit miraculous.\n\n“There’s even a belief that it has magical properties that if you put poison on it, it would crack … that partly explains why paranoid rulers would like to have a bit of blue-and-white,” he added.\n\nThe porcelain also illuminates the nature of the trade networks that existed at the time – it was made by Chinese craftsmen, utilizing cobalt that originated from Persia, now modern-day Iran, before being exported along the continental and maritime silk routes, which the Mongols dominated, McCausland said.\n\nFor him, Yuan porcelain represented a major cultural and technological breakthrough in Chinese art under Mongol rule, countering long-running, orthodox perceptions of the imperial dynasty.\n\n“As soon as the Mongols retreated from China in 1368, the knowledge that this blue-and-white was a breakthrough of the Yuan period got lost,” he said.\n\nAs late as the 1930s, scholars would misidentify the porcelain as produced by other dynasties. “In other words, what could the Mongols have had to do with this? They destroyed, they raped, they pillaged,” he said.\n\nThis particular shipment likely set sail from Quanzhou, a port on China’s eastern coast that was close to the creative heartlands in the Fujian, Zhejiang and Jiangxi provinces, bound for Temasek, according to Flecker.\n\nWhile historians already knew Temasek was an important duty-free port during the 14th century, this shipwreck “hints at the extent of local consumption” and “demonstrates the wealth” of the settlement, Flecker said.\n\nThe study was published inJune 2025in the Journal of International Ceramic Studies.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/07/23/style/singapore-long-island-dfi",
      "text": "Singapore"
    },
    {
      "url": "https://www.sciencedirect.com/science/article/pii/S3050997125000132",
      "text": "June 2025"
    }
  ],
  "hash": "96db0f2baca48f0c4db4038d4407bff78543f47a44f0733bd58b7ca1241f60f1",
  "scraped_at": "2026-03-01T07:06:44.391505+00:00"
}