{
  "url": "https://lite.cnn.com/2026/02/24/politics/post-office-texas-black-woman-supreme-court",
  "title": "Supreme Court fails to deliver for Texas woman who claims Postal Service withheld mail because she is Black | CNN Politics",
  "date": "2026-02-25T07:32:41.777656+00:00",
  "authors": [
    "John Fritze",
    "Devan Cole"
  ],
  "text": "Source: CNN\n\nThe Supreme Court on Tuesday ruled against a Texas woman who is attempting to sue the Postal Service, claiming it withheld her mail because she is Black.\n\nJustice Clarence Thomaswrote the 5-4 opinionruling that federal law exempts the USPS from such lawsuits even in some cases where mail carriers intentionally refuse delivery.\n\n“Given the frequency of postal workers’ interactions with citizens, those suits would arise so often that they would create a significant burden for the government and the courts,” Thomas wrote for the majority.\n\nLebene Konan, aTexas real estate agentand landlord, claimed that the USPS has for years intentionally declined to deliver her mail because of a “racially motivated harassment campaign.”\n\nKonan alleged the post office that covers two rental properties she owns in suburban Dallas changed the lock on her post office box and then declined to deliver the mail to the property. She claimed that happened because the carrier and postmaster did not “like the idea that a Black person” owned the properties. She filed more than 50 administrative complaints, according to court records, and received written confirmation from postal authorities that she was entitled to have her mail delivered.\n\nAt one point, Konan said, local postal officials taped a sign to her mailbox announcing in bright red letters that they would not deliver the mail to her tenants.\n\nA federal district court in Texas granted the USPS’ request to dismiss the case. While Americans may generally sue the government for harms that it causes, Congress carved out an exception for claims involving the “loss, miscarriage, or negligent transmission” of mail. The federal court reasoned that what happened to Konan was covered by that exemption.\n\nBut the New Orleans-based5th US Circuit Court of Appealsreversed that decision, allowing the lawsuit to proceed. The exemption, the appeals court ruled, was intended to cover unintentional loss of mail and similar problems – not intentional acts. The Supreme Court’s decision on Tuesday threw out that appeals court decision.\n\nAdvocates on Konan’s side said the case was about more than just the delivery of mail, but also about ensuring that Americans have the ability to sue the government when it intentionally causes harm.\n\n“The majority concludes that the postal exception captures, and therefore protects, the intentional nondeliv­ery of mail, even when that nondelivery was driven by ma­licious reasons,” Justice Sonia Sotomayor wrote in dissent. “Because this interpretation expands the scope of the exception beyond what it can reasonably sup­port, and undermines the FTCA’s sweeping waiver in the process, I respectfully dissent.”\n\nSotomayor was joined by Justice Neil Gorsuch, a conservative, and two other liberals, Justices Elena Kagan and Ketanji Brown Jackson.\n\nChief Justice John Roberts, along with Justices Samuel Alito, Brett Kavanaugh and Amy Coney Barrett joined Thomas in the majority.\n\nThe Justice Department told the Supreme Court that the mail was withheld for a technical reason. Konan, it said, was required to maintain a directory of her current tenants and failed to do so. Whether the postal officials were justified in withholding the mail was not at issue at the Supreme Court – and will now be decided by lower courts.\n\n“Here, there are no allegations that Konan’s mail was destroyed or that it was misplaced by unintentional action,” the appeals court ruled in a unanimous opinion. “Instead, the facts present a continued, intentional effort not to deliver Konan’s mail over a two-year period.”\n\nIn fiscal year 2023, the US Postal Service delivered more than 116 billion pieces of mail to more than 166 million delivery points across the nation, the government noted. If courts embraced Konan’s position, the government said, it could open up the USPS to a flood of lawsuits.\n\nThat was an argument that appeared to resonate with Alito during the oral arguments in October.\n\n“What will the consequences be if all these suits are filed and they have to be litigated?” Alito asked at one point. “Is the cost of the first-class letter going to be $3 now?”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-351_7648.pdf",
      "text": "wrote the 5-4 opinion"
    },
    {
      "url": "https://www.cnn.com/2025/04/21/politics/post-office-mail-not-delivered-because-person-is-black-lawsuit",
      "text": "Texas real estate agent"
    },
    {
      "url": "https://www.ca5.uscourts.gov/opinions/pub/23/23-10179-CV0.pdf",
      "text": "5th US Circuit Court of Appeals"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/post-office-texas-black-woman-supreme-court",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/post-office-texas-black-woman-supreme-court",
      "text": "Cookie Settings"
    }
  ],
  "hash": "96f4c5f1bbcf66db94b92ff0049e5a9aed98e28928fa2a0051a13c913f32896e",
  "scraped_at": "2026-02-25T07:32:41.777669+00:00"
}