{
  "url": "https://lite.cnn.com/2026/02/24/sport/achraf-hakimi-psg-rape-trial",
  "title": "Achraf Hakimi: Judge orders PSG soccer star to stand trial in rape case, lawyer says appeal planned | CNN",
  "date": "2026-02-25T07:32:43.819608+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nParis Saint-Germainand Morocco defender Achraf Hakimi has been ordered to stand trial in a rape case, lawyers told the Associated Press on Tuesday.\n\nHakimi’s lawyer Fanny Colin said she will appeal the judge’s decision that followed recommendations from the Nanterre public prosecutor’s office, which last August called for the player to stand trial.\n\nColin said a date for the trial has not been set.\n\nRachel-Flore Pardo, who represents the plaintiff, told the AP her client welcomed the order committing the case to trial “with relief,” adding it “is fully consistent with the evidence in the file.”\n\nHakimi, one of the best defenders in the world, has denied any wrongdoing andsaid on Xhe “calmly awaits” a trial that “will allow the truth to emerge publicly.”\n\n“Today, an accusation of rape is enough to justify a trial, even though I contest it and everything shows that it is false. This is as unjust for the innocent as it is for genuine victims,” he said on the eve of a crucialChampions Leagueplayoff against Monaco.\n\nHakimi was given preliminary charges of rape in March 2023 after a 24-year-old woman accused him. She said she was raped by Hakimi at his home in a Paris suburb. In the French legal system, preliminary charges mean judges have strong reason to suspect a crime was committed but are allowing time for further investigation before deciding whether to send a case to trial.\n\n“A trial has been ordered based on an accusation that rests solely on the word of a woman who obstructed all investigations, refused all medical examinations and DNA testing, refused access to her mobile phone, and refused to provide the name of a key witness,” Colin said.\n\nColin claimed that two successive psychological assessments of the plaintiff “revealed a lack of clarity regarding the facts she claims to denounce, as well as the absence of any post-traumatic symptoms.”\n\nIn her statement, Pardo said if the justice system has been exemplary in this case, “the broader handling of this affair serves as a reminder of one thing: There remain environments where the Me Too movement has yet to break the sound barrier, chief among them the world of men’s professional football.”\n\nPSG coach Luis Enrique was asked in a news conference on Tuesday ahead of the Monaco match whether Hakimi’s case changes anything for the team and whether he remains the vice captain. Luis Enrique said only, “This is in the hands of the justice system.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/05/31/sport/psg-changed-image-champions-league-spt-intl",
      "text": "Paris Saint-Germain"
    },
    {
      "url": "https://x.com/AchrafHakimi/status/2026242310422311281",
      "text": "said on X"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/benfica-goalkeeper-anatoliy-trubin-looks-for-more-champions-league-magic-against-real-madrid",
      "text": "Champions League"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/sport/achraf-hakimi-psg-rape-trial",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/sport/achraf-hakimi-psg-rape-trial",
      "text": "Cookie Settings"
    }
  ],
  "hash": "97d38844d3de13a8d9414406a9f4fe2de84b3cd6c8108d70ebcc0f12fb4ab066",
  "scraped_at": "2026-02-25T07:32:43.819619+00:00"
}