{
  "url": "https://lite.cnn.com/2026/02/18/media/talarico-colbert-fcc-carr-cbs-view-equal-time",
  "title": "How an FCC ‘equal time’ letter to ABC pressured CBS into intervening with Colbert | CNN Business",
  "date": "2026-02-19T07:31:39.130281+00:00",
  "authors": [
    "Brian Stelter, CNN"
  ],
  "text": "Source: CNN\n\nA recent FCC inquiry to ABC about a possible “equal time” rule violation at “The View” raised concerns at CBS that “The Late Show with Stephen Colbert” could be targeted next, according to people familiar with CBS’s deliberations.\n\nThe government pressure clearly had an impact. Lawyers for CBS contacted Colbert’s show during his Monday taping. The unusual intervention became a national news story when Colbert told viewers all about it that evening.\n\nIn a follow-up on Tuesday night, Colbert said of CBS parent company Paramount, “I’m just so surprised that this giant, global corporation would not stand up to these bullies.”\n\nThe “bullies,” in Colbert’s telling, are Trump administration appointees who are using antiquated FCC regulations to pressure Trump critics on broadcast TV.\n\nMany critics are now calling out CBS for flinching rather than forcefully standing up to politically motivated intimidation.\n\n“Just likethe Jimmy Kimmel fiascofrom last year, the FCC didn’t have to actually do anything — just issue threats bold enough to scare those who control broadcast networks to obey in advance,” longtime media critic Eric Degganswrote.\n\nThe threats have come from FCC chair Brendan Carr, who indicated last month that his Trump-aligned agency will enforce the “equal time” rule that previous agency heads downplayed.\n\nThe rule states that if one candidate for public office gets free airtime on a local TV or radio station, the other candidates for that office have a right to airtime, too.\n\nFCC regulations do not apply to cable channels like CNN or streaming platforms like YouTube, which is why Colbert directed his fans to YouTube on Monday night.\n\nThe CBS intervention stemmed from Colbert’s interview with James Talarico, a Texas state representative and rising star in the Democratic Party, who is currently running in the Texas Senate primary.\n\nThe other leading candidate in the race is Rep. Jasmine Crockett, who has also appeared on Colbert in the past, but not during this Senate primary campaign.\n\nA strict reading of the “equal time” rule indicates that the third candidate in the race, Ahmad Hassan, would also qualify for equal time.\n\nBut the rule contains big exemptions for news coverage, and for the past two decades, that exemption has also been thought to apply to late-night and daytime talk shows.\n\nCarr is trying to eliminate those exemptions — and observers say it’s no coincidence that those shows skew left. President Donald Trump frequently inveighs against Colbert and other late-night hosts.\n\nCarr “had not gotten rid of [the exemption] yet, but CBS generously did it for him,” Colbert asserted Tuesday night.\n\nColbert said CBS “told me unilaterally that I had to abide by the equal time rules, something I have never been asked to do for an interview in the 21 years of this job.”\n\nCBS said in a statement that “The Late Show” was given “legal guidance” about how to abide by the FCC regulations.\n\nTalarico leaned into the controversy on Tuesday, incorrectly claiming that Trump’s FCC “refused to air” the interview, when in fact CBS made that decision.\n\n“Trump is worried we’re about to flip Texas,” Talarico wrote on X.\n\nHis team also noted that the YouTube video registered millions of views. Curiosity about the controversy helped the interview attract a much larger audience than it would have on the traditional CBS platform.\n\nThe attention was timely for Talarico — coming at the start of the primary’s early voting window — and lucrative for his campaign.\n\nOn Wednesday morning, the campaign said it raised $2.5 million, a single-day record for Talarico, in the 24 hours after the “censored” “Late Show” visit.\n\nColbert predicted something like this would happen.\n\nAs soon as Carr came out in January and foreshadowed a more aggressive approach to “equal time,” Colbert talked about it on “The Late Show.”\n\n“I’ve got to watch what I say about Trump because Johnny Law is once again coming after yours truly here,” he quipped.\n\nColbert cited a New York Times headline about a looming late-night “crackdown” by the FCC and said, “So, let’s talk about these new crackdown rules that my lawyer warned me not to talk about.”\n\nA few weeks later, Colbert was back on the air saying lawyers had been in touch about the Talarico interview.\n\nThe CBS decision-making was informed by the FCC’s action against ABC.\n\nAs Reuters first reported on February 7, Carr opened an investigation into “The View” after Talarico was interviewed on that show. (Crockett has previously appeared on “The View,” too.)\n\nThe FCC did indeed send a “letter of inquiry” to ABC about “The View,” a person familiar with the matter confirmed to CNN.\n\nA letter is the FCC’s first step in assessing whether a violation has occurred. There has been a back-and-forth with ABC since then, the source added.\n\nThe FCC’s enforcement powers are limited. Despite the president’srepeated callsfor station licenses to be revoked, any such action is exceedingly unlikely and would trigger lengthy legal challenges.\n\nStill, the recent scrutiny of ABC weighed on CBS management, because it signaled an uncertain regulatory environment.\n\nABC declined to comment on the FCC inquiry about “The View.” But a network source told CNN that the program “regularly hosts sitting leaders and political candidates to discuss differing viewpoints. The format is consistent with how the show has operated for years.”\n\nThat’s likely what the FCC was told, as well.\n\nWhen CBS cancelled Colbert’s show last summer, in a change that takes effect this May, Trump celebrated the decision and said he thought ABC’s Jimmy Kimmel would be canned next.\n\nABC briefly suspended Kimmel’s show last September amid public pressure from Carr, highlighting both the FCC chair’s use of his platform to browbeat broadcasters, as well as the public backlash to the government intimidation of broadcasters.\n\nBob Corn-Revere, chief counsel at the Foundation for Individual Rights and Expression,saidon Tuesday that Carr has been wielding FCC power “in new and laughable ways.”\n\n“By putting pressure on late-night talk shows critical of the Trump administration while openly admitting that conservative talk radio is immune from the FCC’s ire, he’s making himself the poster boy for big government putting its thumb on the scale of political debate,” Corn-Revere said.\n\nCarr did not respond to requests for comment on the Colbert matter.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/entertainment/jimmy-kimmel-risk-takers",
      "text": "the Jimmy Kimmel fiasco"
    },
    {
      "url": "https://ericdeggans.substack.com/p/the-fcc-cbs-and-colbert-a-few-things",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2025/09/19/media/trump-carr-fcc-abc-kimmel-license-threat",
      "text": "repeated calls"
    },
    {
      "url": "https://www.thefire.org/news/fire-statement-stephen-colberts-james-talarico-interview-and-continued-fcc-pressure",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/media/talarico-colbert-fcc-carr-cbs-view-equal-time",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/media/talarico-colbert-fcc-carr-cbs-view-equal-time",
      "text": "Cookie Settings"
    }
  ],
  "hash": "97ed33abbed5188cae81fd92a6bd9577db8cadb51a635cc0143fcef8265f7df2",
  "scraped_at": "2026-02-19T07:31:39.130294+00:00"
}