{
  "url": "https://lite.cnn.com/2026/02/17/economy/federal-reserve-ai-job-market-rates",
  "title": "Warsh says AI could help the Fed lower interest rates. Disagreements are already brewing | CNN Business",
  "date": "2026-02-19T07:32:41.129357+00:00",
  "authors": [
    "Bryan Mena",
    "John Towfighi",
    "CNN"
  ],
  "text": "Source: CNN\n\nAdvances in AI are unlikely to push down interest rates in the short term, a key Federal Reserve official said Tuesday — a stark contrast toFed Chair nominee Kevin Warsh’s plan for slashing borrowing costs.\n\n“I expect that the AI boom is unlikely to be a reason for lowering policy rates,” Fed Governor Michael Barr said in prepared remarks during an event in New York.\n\nIn December, Warsh, whom President Donald Trump named last month as his pick to lead the central bank after Fed Chair Jerome Powell’s term ends in May, suggested that business adoption of artificial intelligence would usher “in the most productivity-enhancing wave of our lifetimes.”\n\nThe central bank should take the same leap of faith that they did with the internet under Fed Chair Alan Greenspan and lean toward cheaper borrowing costs, he said.\n\nBarr’s latest remarks show there’s already some disagreement brewing within the Fed’s powerful 12-person rate-setting committee on how AI could change the world’s biggest economy. That’s crucial because Fed officials each have only one vote per person, including the chair, when they meet eight times a year to set interest rates. That means Warsh would need to get his colleagues on board with lowering rates.\n\nIn his speech, Barr outlined various ways the technology could affect hiring, productivity and wages, saying he expects AI “will have a transformative effect on the economy” overall.\n\nThe most likely impact of AI on the economy is that “some occupations are displaced while new ones emerge, as AI is increasingly integrated into many existing roles,” Barr said.\n\n“But AI adoption occurs gradually enough that large and widespread joblessness is avoided,” he added. Still, it’s possible that “there might be serious short-term disruptions in the labor market,” which should be addressed by society as a whole, including Congress, rather than just the Fed itself, Barr said.\n\nOverall, AI has become a salient economic issue for central bankers around the world. In addition to Barr, several Fed other officials, including Chair Jerome Powell, have said the technology will likely have wide-ranging effects on the US economy — the extent and timing of which remains to be seen.\n\nIn his December interview, Warsh said AI could prove to be “structurally disinflationary,” suggesting the Fed may have a clear path to continue lowering rates.\n\nIn response to a question posed by CNN, Barr refuted that view, saying it is “very hard to say that productivity would be disinflationary.” He added that stronger productivity, boosted by AI, could push up the so-called neutral rate of interest, a theoretical level of borrowing costs that neither stimulates nor weakens economic activity.\n\n“There’s more demand for business investment, the savings rate falls because people are anticipating longer lifetime earnings, and so all of that would suggest” a higher neutral rate, Barr said.\n\nA higher neutral rate implies that the economy can withstand higher interest rates, meaning it does not warrant the big rate cuts the Trump administration wants. And Barr isn’t the only Fed official with that view.\n\nCleveland Fed President Beth Hammack, who votes on policy moves this year, said in a December interview with the Wall Street Journal, that the neutral rate “could be more upward biased, if (AI) is having more material productivity impact.”\n\n“Technology has always been a disinflationary force in the ecosystem, but it’s still early to be gauging when productivity gains from AI will fully transpire,” said Michael Hans, chief investment officer at Citizens Private Wealth.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/business/live-news/fed-chair-nominee-kevin-warsh-01-30-26",
      "text": "Fed Chair nominee Kevin Warsh"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/economy/federal-reserve-ai-job-market-rates",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/economy/federal-reserve-ai-job-market-rates",
      "text": "Cookie Settings"
    }
  ],
  "hash": "98301c687dd6ac40c942a85ec4f8438f79bf8dee7a40a82d53e97b4f808826b1",
  "scraped_at": "2026-02-19T07:32:41.129371+00:00"
}