{
  "url": "https://lite.cnn.com/2026/02/20/politics/supreme-court-tariffs",
  "title": "Supreme Court rules that Trump’s sweeping emergency tariffs are illegal | CNN Politics",
  "date": "2026-02-23T07:38:04.450501+00:00",
  "authors": [
    "John Fritze",
    "Devan Cole",
    "Elisabeth Buchwald",
    "Tierney Sneed",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Supreme Court on Friday ruled that President Donald Trump violated federal law when he unilaterallyimposed sweeping tariffs across the globe, a striking loss for the White House on an issue that has been central to the president’s foreign policy and economic agenda.\n\nThe decision is arguably themost important loss the second Trumpadministration has sustained at the conservative Supreme Court, which last year repeatedly sided with the president in a series of emergency rulings on immigration, the firing of the leaders of independent agencies and deep cuts to government spending.\n\nChief Justice John Robertswrote the majority opinionand the court agreed 6-3 that the tariffs exceeded the law. The court, however, did not say what should happen to the more than $130 billion in tariffs that has already been collected.\n\n“The president asserts the extraordinary power to unilaterally impose tariffs of unlimited amount, duration, and scope,” Roberts wrote for the court. “In light of the breadth, history, and constitutional context of that asserted authority, he must identify clear congressional authorization to exercise it.”\n\nThe emergency authority Trump attempted to rely on, the court said, “falls short.”\n\nTrump received the news of the tariffs in a note while he was meeting with governors at the White House on Friday morning. After he read the note, he said aloud “that’s a disgrace” and then left the room shortly after, according a governor in the room.\n\nAt a news conference Friday afternoon, the president criticized the justices — two of whom he appointed — who ruled against him.\n\n“The Supreme Court’s ruling on tariffs is deeply disappointing, and I’m ashamed of certain members of the court, absolutely ashamed for not having the courage to do what’s right for our country,” Trump said in the White House briefing room.\n\nJustices Amy Coney Barrett and Neil Gorsuch, both Trump appointees, joined with Roberts and the three liberal justices in the majority. Justices Clarence Thomas, Samuel Alito and Brett Kavanaugh dissented.\n\nThe president and Justice Department officials had framed the dispute in existential terms for the country, telling the justices that “with tariffs, we are a rich nation” but that without them, “we are a poor nation.” A group of small businesses who challenged the duties similarly warned that Trump’s position represented a “breathtaking assertion of power” to effectively levy a tax without oversight from Congress.\n\nIn his opinion, Roberts brushed aside an argument from the administration that the president had power to use tariffs to regulate commerce. That was an issue that came up during the oral arguments last year as Trump suggested the president had inherent authority to issue the tariffs.\n\n“When Congress grants the power to impose tariffs, it does so clearly and with careful constraints,” Roberts wrote. “It did neither here.”\n\n“We claim no special competence in matters of economics or foreign affairs,” Roberts wrote. “We claim only, as we must, the limited role assigned to us by Article III of the Constitution. Fulfilling that role, we hold that IEEPA (the International Emergency Economic Powers Act) does not authorize the president to impose tariffs.”\n\nThe 6-3 majority offered no clarity on the specific practical question of what to do with the money the administration has already collected through Trump’s tariffs. The issue of refunds has loomed large over the case, with Trump administration officials saying that potential repayments could have devastating consequences for the US economy.\n\nAs of December 14, the federal government had collected $134 billion in revenue from the tariffs being challenged from over 301,000 different importers, according to United States Customs and Border Protection data as well as a recent filing submitted by the agency to the US Court of International Trade.\n\nThat question will likely need to be sorted out by lower courts.\n\nIn his dissent, Justice Brett Kavanaugh noted that the court said “nothing today about whether, and if so how, the government should go about returning the billions of dollars that it has collected from importers.”\n\n“That process is likely to be a ‘mess,’” Kavanaugh wrote.\n\nTrump on Friday didn’t commit to returning the revenue collected, only saying he believes the issue will be litigated for years to come.\n\n“Even though the Supreme Court has already ruled in dozens of cases involving the second Trump administration, those all involved emergency applications; this was the first Trump-related case to which the Court gave full review – and it’s an overwhelming loss for Trump on both the specific legal question and the more general ability to broadly use statutes like IEEPA,” said Steve Vladeck, CNN Supreme Court analyst and professor at Georgetown University Law Center.\n\n“What that underscores is that, for as controversial as the court’s grants of emergency relief to the Trump administration have been over the past 13 months, the court is still willing to assert itself when these cases reach the merits – something that we’re likely to see again later this term in the birthright citizenship and Lisa Cook cases.”\n\nThe case was the most significant involving the American economy to reach the Supreme Court in years, challenging the legality ofTrump’s “Liberation Day” tariffs, as well as duties he imposed on imports from China, Mexico and Canada. At stake were tens of billions of dollars in revenue the government has already collected.\n\nThe so-called “reciprocal” tariffs raised duties as high as 50% on key trading partners, including India and Brazil, andas high as 145%on China in 2025.\n\nTrump has relied on a 1970s-era emergency law, the International Emergency Economic Powers Act, or IEEPA, to levy the import duties at issue in the case. That law allows a president to “regulate … importation” during emergencies. The administration argued the word plainly includes the power to impose tariffs, but the businesses noted that the words “tariff” or “duty” never appear in the law.\n\nThat raised a series of difficult questions for the Supreme Court itself, which incaseaftercaseinvolving controversial policies from former President Joe Biden, ruled that an administration cannot take certain executive actions unilaterally without explicit authorization from Congress. That is particularly true, the courtrepeatedly ruled, when policies involve “major” political or economic questions.\n\nIn 2023, for instance, the conservative majority relied on the “major questions doctrine” to blockBiden’s student loan forgiveness plan. A year earlier, the court stopped Biden’s vaccine and testing requirement for 84 million Americans, concluding that Congress never explicitly gave the government the power to demand those measures during the Covid-19 pandemic. Even some conservatives said the same logic should apply when it came to Trump’s tariffs.\n\nTrump offered several counter-arguments, most notably that the tariffs implicate foreign affairs, where courts have traditionally referred to the executive branch.\n\nRoberts did not accept that position.\n\n“Taxes, to be sure, may accomplish regulatory ends,” the chief justice wrote. “But it does not follow that the power to regulate something includes the power to tax it as a means of regulation.”\n\nThe president has other more established authorities to levy tariffs without input from Congress. But each of those come with strings attached, such as time limits, that would make it harder for Trump to pursue his on-again-off-again strategy of raising and then lowering barriers as a negotiating tactic.\n\nAnother provision of law, for instance, clearly allows a president to raise tariffs — but only up to 15% for a maximum of 150 days. Another authority gives the president the power to impose higher tariffs for national security reasons. It can only be used to target specific industries and requires an investigation by the Commerce Department.\n\nEvery lower court that has reviewed Trump’s emergency tariffs found they violated federal law, though for different reasons. In one case, led by a New York-based wine importer called V.O.S. Selections, the US Court of International Tradeconcluded in Maythat IEEPA didn’t authorize Trump’s emergency duties. That decision wasaffirmed months later by an appeals courtin Washington, DC.\n\nIn a separate case, an Illinois-based educational toy company, Learning Resources, sued in a federal district court in Washington, which also ruled against Trump. The case quickly went to the Supreme Court, leapfrogging the DC Circuit.\n\nThe courts in both cases put their rulings on hold temporarily, allowing the administration to continue to collect the tariffs while the appeals played out.\n\nA significant question looming over the arguments was whether all businesses would be entitled to tariff payment refunds if the justices rule against the Trump administration’s use of emergency powers to impose tariffs.\n\nThe filing was in response to a group of importers, including Costco, requesting a preliminary injunction to prevent CBP from finalizing their tariff payments, a process formally known as liquidation. The importers argued that it was imperative for their payments to be unliquidated to get refunds down the road. Their request for a preliminary injunction was denied, however.\n\nThe three-panel judge explained that their verdict was supported by the administration’s promise to refund IEEPA tariff payments, if it came down to it, even if entries were liquidated. However, the administration has stated that it would likely be a laborious process.\n\nJustice Elena Kagan wrote a concurrence, joined by the two other liberals, to rebuff some of the reasoning that the three conservative justices ruling against Trump put forward for blocking the tariffs.\n\nShe specifically took aim at their use of a judicial doctrine known as “major questions,” which says that if Congress is giving the president the power to take an action with major economic or political consequence, it must use specific legislative language saying that it is doing so. The conservative court repeatedly relied on the major questions doctrine to shoot down major policies enacted by the Biden administration, including his efforts to forgive student loans.\n\nKagan has in the past criticized the conservative majority’s use of the major questions doctrines to halt executive actions on environmental regulations. Likewise, she was wary of using that tool to strike down Trump’s tariffs, even though she agreed with the decision to do so.\n\n“The use of a clear-statement rule here is unnecessary because ordinary principles of statutory interpretation lead to the same result,” she wrote. ” It is not just that the Government’s arguments fail to satisfy an especially strict test; it is that they fail to satisfy the normal one.”\n\nShe said that the normal tools of statutory interpretation pointed to the ruling against tariffs, because the relevant law gives the President the emergency authority to “regulate” the importation of goods and nothing in the definition of that word “naturally refers to levying taxes”\n\nFor that and other reasons laid out in her concurrence, “straight-up statutory construction resolves this case for me,” Kagan wrote. ” I need no major-questions thumb on the interpretive scales.”\n\nIn a rare statement, former Vice President Mike Pence praised the ruling against Trump as “a Victory for the American People and a Win for the Separation of Powers enshrined in the Constitution of the United States.”\n\n“Our Supreme Court has reaffirmed that the Constitution grants Congress – not the President – the power to tax,” Pence wrote in a post on X.\n\n“American families and American businesses pay American tariffs – not foreign countries. With this decision, American families and businesses can breathe a sigh of relief,” the post continues. “With this historic decision, America can now return to the pursuit of Free Trade with Free Nations under the Constitution of the United States!”\n\nGOP Sen. Rand Paul and Rep. Don Bacon have both faced the president’s ire for criticizing his tariffs and backing legislation aimed at blocking them.\n\nBacon was one of only a handful of House Republicans to rebuke President Donald Trump’s tariffs in a vote on the House floor last week.\n\n“I feel vindicated as I’ve been saying this for the last 12 months,” Bacon said in a statement. “In the future, Congress should defend its authorities and not just rely on Supreme Court. Besides the Constitutional concerns I had on the Administration’s broad-based tariffs, I also do not think tariffs are smart economic policy. Broad-based tariffs are bad economics.”\n\nAt his White House news conference, Trump announced alternative options, including an immediate 10% global tariff.\n\n“Now I’m going to go in a different direction, probably the direction I should have gone the first time,” Trump said, calling it “even stronger than our original choice.”\n\nThe court only struck down one method for imposing tariffs – the use of the International Emergency Economic Powers Act.\n\nThere areother provisionsof the Trade Act of 1974, the Trade Expansion Act of 1962 and the Tariff Act of 1930 that he could try. He already used some of these in his first term.\n\nSection 122 of the Trade Act of 1974, for example, allows tariffs of up to 15% for up to 150 days under certain circumstances.\n\nAnother possibility isSection 338 of the Tariff Act of 1930, commonly known as “Smoot-Hawley.” It allows tariffs of up to 50% for five months on a country that “discriminates” against US commerce. Treasury Secretary Scott Bessenthas cited thisas a possible backup.\n\nCNN’s Aaron Blake, Kaitlan Collins, Rebekah Riess, Morgan Rimmer, Lauren Fox and Sarah Ferris contributed to this report.\n\nThis story is breaking and will be updated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/supreme-court-trump-tariffs-11-05-25",
      "text": "imposed sweeping tariffs across the globe"
    },
    {
      "url": "https://www.cnn.com/2025/11/02/economy/scotus-trump-tariffs",
      "text": "most important loss the second Trump"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf",
      "text": "wrote the majority opinion"
    },
    {
      "url": "https://www.cnn.com/2025/04/02/business/liberation-day-trump-tariffs",
      "text": "Trump’s “Liberation Day” tariffs"
    },
    {
      "url": "https://www.cnn.com/2025/05/06/business/tariffs-price-increases-shortages-ports",
      "text": "as high as 145%"
    },
    {
      "url": "https://www.cnn.com/2023/06/30/politics/supreme-court-student-loan-forgiveness-biden",
      "text": "case"
    },
    {
      "url": "https://www.cnn.com/2022/06/30/politics/supreme-court-climate-change-epa-regulations/index.html",
      "text": "case"
    },
    {
      "url": "https://www.cnn.com/2025/05/29/politics/tariffs-major-questions-doctrine-supreme-court",
      "text": "repeatedly ruled"
    },
    {
      "url": "https://www.cnn.com/2023/06/30/politics/supreme-court-student-loan-forgiveness-biden",
      "text": "Biden’s student loan forgiveness plan"
    },
    {
      "url": "https://www.cnn.com/2025/05/28/business/us-court-blocks-trumps-tariffs",
      "text": "concluded in May"
    },
    {
      "url": "https://www.cnn.com/2025/08/29/business/trump-tariffs-appeals-court-ruling",
      "text": "affirmed months later by an appeals court"
    },
    {
      "url": "https://www.cato.org/blog/supreme-court-got-it-right-ieepa-dont-pop-champagne-yet",
      "text": "other provisions"
    },
    {
      "url": "https://www.cato.org/commentary/trump-has-many-options-supreme-court-strikes-down-tariffs",
      "text": "Section 122 of the Trade Act of 1974"
    },
    {
      "url": "https://www.cov.com/-/media/files/corporate/publications/2016/12/law360_the_presidents_long_forgotten_power_to_raise_tariffs.pdf",
      "text": "Section 338 of the Tariff Act of 1930"
    },
    {
      "url": "https://www.reuters.com/legal/government/bessent-expects-supreme-court-uphold-legality-trumps-tariffs-eyes-plan-b-2025-09-01/",
      "text": "has cited this"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "Cookie Settings"
    }
  ],
  "hash": "983d165358bcfb508efe7986dab4be31956d1233bc40ab5bdc60f7e105ce590a",
  "scraped_at": "2026-02-23T07:38:04.450515+00:00"
}