{
  "url": "https://lite.cnn.com/2026/02/12/politics/mark-kelly-pentagon-lawsuit-ruling",
  "title": "Judge says Pete Hegseth is unlawfully retaliating against Sen. Mark Kelly over ‘illegal orders’ video | CNN Politics",
  "date": "2026-02-12T21:29:15.392110+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA federal judge on Thursday shut down Defense Secretary Pete Hegseth’sattempts to punish Democratic Sen. Mark Kellyover his urging of US service members to refuse illegal orders, ruling that the Pentagon chief’s actions were unconstitutionally retaliatory.\n\nThe decision landed two days after a grand jury in Washington, DC, declined to approve charges sought by federal prosecutors against the Arizona senator and several other Democratic lawmakers who taped a video last year warning that “threats to our Constitution” are coming “from right here at home,” and repeatedly implored service members and the intelligence community to “refuse illegal orders.”\n\nTogether, the grand jury declination and ruling fromsenior US District Judge Richard Leonrepresent major impediments to efforts by aides of President Donald Trump to use the levers of government to punish Kelly, a retired Navy captain and former astronaut, over his participation in the video.\n\nLeon, an appointee of former President George W. Bush,wrote in a scathing, 29-page rulingthat Hegseth was trampling over the First Amendment rights of Kelly and that his moves are an impermissible form of government retaliation.\n\n“That Senator Kelly may be an ‘unusually staunch individual’ does not minimize his entitlement to be free from reprisal for exercising his First Amendment rights,” Leon wrote. “Senator Kelly was reprimanded for exercising his First Amendment right to speak on matters of public concern.”\n\nThe Pentagon, the judge wrote, was targeting “unquestionably protected speech” that is actually entitled to “special protection” under the law.\n\nHegseth said the administration would “immediately” appeal the decision. The Justice Department, which represents the Pentagon in the case, insists that Hegseth’s actions are unreviewable by federal courts or, at the very least, owed a great deal of deference by judges examining disputes like the one at hand.\n\n“This will be immediately appealed. Sedition is sedition, ‘Captain,’” he wrote in a statement posted to X.\n\nApplauding Leon’s ruling earlier Thursday, Kelly acknowledged in a statement that “this might not be over yet, because this President and this administration do not know how to admit when they’re wrong.”\n\n“One thing is for sure: however hard the Trump administration may fight to punish me and silence others, I will fight ten times harder. This is too important,” the senator said.\n\nSpeaking to reporters, the senator said he wouldn’t be surprised if prosecutors in DC again attempt to persuade a grand jury to indict him.\n\n“I wouldn’t put anything past them, of course,” Kelly said. “You know this president has a habit of doubling down on sh*tty ideas, on bad precedent, on breaking the law, on violating people’s constitutional rights of Americans. He doubles down on it.”\n\nKelly’s case, brought last month, came just after Hegseth announced the Pentagon would pursue administrative action against the senator, including reducing his last military rank, which would lower the pay he receives as a retired Navy captain, and issuing a letter of censure.\n\nBoth Hegseth and Trump have publicly attacked Kelly over avideo posted in Novemberby the Arizona lawmaker – and five other Democrats with a history of military or intelligence service – urging service members not to obey unlawful orders that could be issued by the Trump administration.\n\n“When viewed in totality, your pattern of conduct demonstrates specific intent to counsel servicemembers to refuse lawful orders. This pattern demonstrates that you were not providing abstract legal education about the duty to refuse patently illegal orders. You were specifically counseling servicemembers to refuse particular operations that you have characterized as illegal,” Hegseth wrote to Kelly last month in the censure letter.\n\nLeon forcefully rejected Hegseth’s attempt to extend existing loopholes on First Amendment protections for active-duty service members to retirees such as Kelly, imploring the administration to “be grateful for the wisdom and expertise that retired servicemembers have brought to public discussions and debate on military matters in our Nation over the past 250 years.”\n\nCiting a friend-of-the-court brief filed by former high-ranking military officials who warned that many service members are already declining to opine on matters of public importance out of fear of also being retaliated against, Leon called that reality “a troubling development in a free country!”\n\n“Defendants’ argument runs up against our Nation’s long tradition of retired service members, including those holding elected office, routinely contributing to the public discourse in ways critical of current military policy,” he wrote.\n\nLeon is the latest federal judge to frustrate Trump’s efforts to go after his perceived political enemies. In several other cases, judges have stymied the president’s retribution crusade bykilling criminal casesbrought against former FBI Director James Comey and New York Attorney General Letitia James and ruling against the president’s attempts to hamstring the work of Mark Zaid, a notable whistleblower attorney.\n\nIn the “illegal orders” video released in November, the lawmakers don’t specify which orders service members have received, or might receive, that could be illegal.\n\nBut it was posted as US military officials, including thecommander of US Southern Command, and US allies,including the UK, questioned the legality of a series of military strikes targeting suspected drug traffickers in the Caribbean and eastern Pacific and as the Trump administration faced multiple court challenges to Trump’s decision last year to send scores of federalized state National Guard members to Democratic-led cities.\n\nThe video enraged Trump, who suggested the six lawmakers engaged in “SEDITIOUS BEHAVIOR, punishable by DEATH!”\n\nProsecutors from the US Attorney’s Office in DC reportedly pursued less serious charges when they presented their case to the grand jury on Tuesday.\n\nThough it’s generally rare for grand juries to decline to approve charges sought by prosecutors, such rejections have occurred more frequently in recent months as the administration has pursued legally dubious cases. Prosecutors can try again to secure the indictments against the lawmakers.\n\nThis story has been updated with additional details Thursday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/12/politics/kelly-lawsuit-unlawful-orders-video-hegseth",
      "text": "attempts to punish Democratic Sen. Mark Kelly"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/mark-kelly-hearing-case-challenging-pentagon-punishment",
      "text": "senior US District Judge Richard Leon"
    },
    {
      "url": "https://www.documentcloud.org/documents/26953150-order-in-mark-kelly-case/",
      "text": "wrote in a scathing, 29-page ruling"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/politics/hang-democrats-trump-seditious-behavior",
      "text": "video posted in November"
    },
    {
      "url": "https://www.cnn.com/2025/11/24/politics/james-comey-letitia-james-indictments-dismissed",
      "text": "killing criminal cases"
    },
    {
      "url": "https://www.cnn.com/2025/10/16/politics/southern-command-caribbean-strikes-holsey",
      "text": "commander of US Southern Command"
    },
    {
      "url": "https://www.cnn.com/2025/11/11/politics/uk-suspends-caribbean-intelligence-sharing-us",
      "text": "including the UK"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/mark-kelly-pentagon-lawsuit-ruling",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/mark-kelly-pentagon-lawsuit-ruling",
      "text": "Cookie Settings"
    }
  ],
  "hash": "984ba0912f5d237f91cd9661cd091e336099d055e4e8c5883c3ed6f91cdecb60",
  "scraped_at": "2026-02-12T21:29:15.392123+00:00"
}