{
  "url": "https://lite.cnn.com/2026/02/12/climate/trump-repeals-epa-endangerment-finding",
  "title": "Trump delivers a deadly blow to EPA’s ability to regulate climate pollution | CNN",
  "date": "2026-02-12T21:29:11.324842+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Trump administration delivered a deadly blow to longstanding US climate policy on Thursday, finalizing rules that revoke the Environmental Protection Agency’s ability to regulate climate pollution.\n\nFirst issued in 2009, the endangerment finding determined that six greenhouse gases could be categorized as dangerous to human health under the Clean Air Act. It has underpinned the EPA’s authority to limit planet-warming pollution from the oil and gas industry, power plants and vehicles since the Obama administration and is considered the federal government’s most powerful tool to tackle climate pollution and the country’s contribution to the global crisis.\n\n“We are officially terminating the so-called endangerment finding,” President Donald Trump said on Thursday, calling the policy “disastrous.”\n\nTrump said repealing the regulations “has nothing to do with public health.”\n\n“This was all a scam, a giant scam,” Trump said on Thursday. “This was a rip off of the country by Obama and Biden.”\n\nIn addition, the Trump administration will finalize a repeal of rules that regulate greenhouse gas emissions from vehicles, since they stem from the finding. Under former President Joe Biden, the EPA sought to tighten those standards to prod the auto industry to make more fuel-efficient hybrids and electric vehicles — an effort the industry has since backtracked on.\n\nBy getting rid of the endangerment finding, the administration can more easily overturn other rules that reduce climate pollution emitted from power plants and oil and gas operations, although those will take separate regulatory processes to overturn.\n\nThe full text of EPA’s repeal of the endangerment finding wasn’t made available before the Trump administration announced it, but the justification for the repeal laid out in an EPA press release relies far more on legal arguments than an outright rejection of climate science.\n\nThe agency is arguing that the Obama and Biden administrations exceeded their legal authority when they used the Clean Air Act to regulate climate pollution. This is in contrast to last summer, when the agency first proposed the repeal. The EPA proposal was then based in part on a hastily produced report authored by five climate contrarians that questioned the severity of climate impacts like wildfires, extreme heat and stronger storms.\n\nInstead of doubling down on that Thursday, the Trump EPA in a press release concluded the Clean Air Act “does not provide statutory authority for EPA” to put forward vehicle emissions standards “including for the purpose of addressing global climate change, and therefore has no legal basis for the Endangerment Finding and resulting regulations.”\n\nHowever, in the same press release announcing the repeal, EPA Administrator Lee Zeldin nodded to the administration’s opposition to climate policy.\n\n“Referred to by some as the ‘Holy Grail’ of the ‘climate change religion,’ the Endangerment Finding is now eliminated,” Zeldin said in the EPA’s press release. While speaking next to Trump on Thursday, however, Zeldin’s remarks were slightly different.\n\n“Today, the Trump EPA has finalized the single largest act of deregulation in the history of the United States of America. Referred to by some as the holy grail of federal regulatory overreach, the 2009 Obama EPA endangerment finding is now eliminated,” Zeldin said on Thursday.\n\nLegal precedent has granted the government regulatory powers over climate pollution.The US Supreme Court ruled in 2007 that EPA had the authority to regulate climate pollution from greenhouse gases. And in 2022, the US Supreme Court upheld the EPA’s authority to regulate greenhouse gases from power plants, but narrowed the agency’s scope significantly, prompting the Biden administration to formulate rules aimed only at making individual power plants more efficient.\n\nThe 2022 Supreme Court ruling “never questioned that EPA had the authority to regulate greenhouse gases,” said Meredith Hankins, legal director for federal climate at the Natural Resources Defense Fund. “That was settled law.”\n\nBut the endangerment finding repeal will thrust that question back into the courts, where litigating the repeal could take years, and potentially go all the way to the nation’s highest court. A former top Biden EPA official told CNN he believes this move shows the Trump administration is playing a legal long game.\n\n“Their definition of winning I believe has been and will be when they take final action and defend their action in the courts, to permanently remove EPA’s Clean Air Act authority to regulate greenhouse gases,” said Joe Goffman, who led EPA’s Office of Air and Radiation under Biden.\n\nIf the Trump administration repeal is “upheld in court, no future EPA will be able to regulate (carbon dioxide) emissions,” said Jeff Holmstead, an energy attorney with the law firm Bracewell, and a former high-ranking EPA official in the George W. Bush administration. Congress could pass a new law that specifically directs the EPA to regulate climate pollution, but there is little bipartisan consensus on addressing the issue.\n\nZeldin laid out the agency’s argument, saying EPA has no authority to regulate certain kinds of pollution unless Congress passes a law giving them express permission.\n\n“If Congress didn’t authorize it, EPA shouldn’t be doing it,” Zeldin said on Thursday. “If Congress wants EPA to regulate the heck out of greenhouse gasses emitted from motor vehicles, then Congress can clearly make that the law.”\n\nClimate, public health and environmental groups are already promising legal challenges to the agency’s move.\n\n“Earthjustice and our partners will see the Trump administration in court,” said Abigail Dillen, president of the environmental legal group. “The courts have repeatedly affirmed EPA’s obligation to clean up climate pollution. There is no way to reconcile EPA’s decision with the law, the science, and the reality of disasters that are hitting us harder every year.”\n\nOn Thursday, a coalition of public health groups including the American Lung Association and the American Public Health Association announced they would sue the administration, calling the regulatory appeal “unlawful.”\n\nAttorneys for the Natural Resources Defense Fund recently emphasized that even with a conservative Supreme Court, the EPA’s authority to regulate greenhouse gas emissions has been reaffirmed multiple times. NRDC attorneys suggested that EPA’s legal arguments are relatively novel, which could make the EPA’s move more vulnerable to being overturned in court.\n\n“It’s not something that has been done before,” said Hankins.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/climate/trump-repeals-epa-endangerment-finding",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/climate/trump-repeals-epa-endangerment-finding",
      "text": "Cookie Settings"
    }
  ],
  "hash": "98563891a3dac2e25b030373caab5dc95e4e468cc0b50826f5f66b72d7f960be",
  "scraped_at": "2026-02-12T21:29:11.324858+00:00"
}