{
  "url": "https://lite.cnn.com/2026/02/26/politics/texas-democratic-primary-early-voting-data",
  "title": "Democratic primary turnout is surging in Texas, according to early voting data | CNN Politics",
  "date": "2026-02-27T07:16:42.786527+00:00",
  "authors": [
    "Edward Wu"
  ],
  "text": "Source: CNN\n\nEarly voting data ahead of next Tuesday’sUS Senate primaries in Texassuggest a sharp rise in Democratic turnout, pointing to a continuing trend of strong enthusiasm among the party’s base.\n\nThrough Tuesday, about 850,000 ballots had been cast in the Democratic primary, according to data from the Associated Press. That’s nearly 60% more than the number of votes cast at the same point in the 2020 Democratic presidential primary, the last statewide primary in Texas to feature a major competitive Democratic contest.\n\nIt’s also more than the entire advance turnout and over double the number of votes cast on the equivalent day in the 2022 Democratic gubernatorial and 2024 Democratic presidential primaries. Many of the more populous counties exceeded their entire primary turnout for those years with several days of early voting and Election Day remaining.\n\nOn the Republican side, advance turnout was about 15% higher than it was at this point in 2022 and slightly trailed turnout one week out from the 2024 primary. It was also slightly ahead of Republican turnout at this point in 2020, when Donald Trump faced only marginal opposition.\n\nThere’s growing evidence of a Democratic advantage in motivation to vote since Donald Trump returned to the White House. Through the last year, Democratic candidates have outperformed 2024 presidential margins inHouse special electionsandstatewide races, andDemocratic voters have consistently been more likely to describe themselves as extremely motivated to votein CNN’s polling.\n\nThe surge of voters in the Democratic primary raises the possibility that more Texans will cast ballots in the Democratic primary than the Republican one.\n\nDemocrats in Texas have only matched GOP primary numbers in recent years when they have had competitive presidential elections. Democratic turnout was much higher than Republican turnout in the 2008 presidential primaries, and voters split roughly evenly in casting their ballots in the 2020 primaries.\n\nEach year featured a highly competitive race on the Democratic side but less of one on the Republican side by the time Texas voted, which boosted relative turnout in the Democratic primaries. Both the Democratic and Republican Senate primaries are competitive this year.\n\nSo far, about 54% of votes cast in this year’s primaries have been on the Democratic side. That ratio far outpaces the Democratic pace of casting votes in 2022 or 2024. Early votes tend to tilt slightly more Democratic than Election Day votes do, and in both of those years, the final electorate (including Election Day ballots) was about 2 points less Democratic relative to the early vote at this point.\n\nIf this year’s vote follows the same trend, a narrow majority of Texas primary voters would have cast their ballots in the Democratic over the Republican primary.\n\nEven if the primary surge in Democratic participation holds through next Tuesday, the pattern may not hold in the much higher turnout general election. Primaries tend to attract the most enthusiastic voters, while the electorate expands in general elections. In 2008, the Democratic presidential primary had double the turnout of the Republican primary – and Democrat Barack Obama went on to lose the state to Republican John McCain by double digits.\n\nVoters are also casting votes in Arkansas and North Carolina ahead of Tuesday, and signs point to an increase in Democratic turnout relative to past races.\n\nRoughly a quarter million votes had been cast in North Carolina’s Democratic Senate primary through Tuesday, up over 50% relative to the equivalent day in 2022. Turnout was up a more modest 8% in the Republican Senate primary, though the GOP race is expected to be less competitive this year than it was in 2022.\n\nRegistered Democrats had cast more ballots than registered Republicans (42% to 28%, with the remaining 30% of voters unaffiliated). This 14-point gap was up from 8 points on the equivalent day in 2022 (41% to 33%). Unaffiliated voters are also more likely to have cast ballots in the Democratic primary: Roughly 55% of unaffiliated voters cast a ballot in the Democratic primary over the Republican primary this year, up from 36% choosing the Democratic ballot in 2022.\n\nIn Arkansas, nearly 40,000 votes had been cast in the Democratic Senate primary through Tuesday (nearly 80% of total advance turnout in 2022, with several days left of early voting to go). Over 80,000 votes had been cast in the Republican primary, just under 50% of the 2022 total advance vote.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/18/politics/texas-senate-primary-cornyn-paxton-hunt-crockett-talarico",
      "text": "US Senate primaries in Texas"
    },
    {
      "url": "https://www.cnn.com/2025/11/26/politics/tennessee-special-election-democrats-momentum",
      "text": "House special elections"
    },
    {
      "url": "https://www.cnn.com/2025/11/04/politics/election-takeaways-new-york-new-jersey-virginia",
      "text": "statewide races"
    },
    {
      "url": "https://www.cnn.com/2026/01/18/politics/cnn-poll-democrats-are-deeply-motivated-for-the-midterms-despite-having-dismal-views-of-party-leaders",
      "text": "Democratic voters have consistently been more likely to describe themselves as extremely motivated to vote"
    }
  ],
  "hash": "98690f044d6c5ddf054aecaea7568c113ec18fbc72cbff0a6f7ca18592954c9b",
  "scraped_at": "2026-02-27T07:16:42.786542+00:00"
}