{
  "url": "https://lite.cnn.com/2026/02/28/middleeast/obituary-ayatollah-ali-khamenei-hnk-intl",
  "title": "Obituary: Who was Ayatollah Khamenei? He battled the US and Israel for decades as Iran’s supreme leader | CNN",
  "date": "2026-03-01T07:06:23.284289+00:00",
  "authors": [
    "Abbas Al Lawati",
    "Laura Smith-Spark"
  ],
  "text": "Source: CNN\n\nAyatollah Ali Hosseini Khamenei, who ruled Iran with an iron fist as its supreme leader for nearly four decades, facing off against the US and Israel while crushing dissent and advancing a controversial nuclear program at home, has been killed, a seismic development that plunges his nation and the region into uncharted territory.\n\nMultiple Iranian state media outlets confirmed Khamenei’s death on Sunday morning, hours after US and Israeli officials declared he had been killed in their joint strikes targeting his regime.\n\nOne of the Middle East’s most powerful men, Khamenei dominated Iran during a reign defined by resistance and resilience — standing firm against decades of Western and Israeli pressure aimed at forcing the Islamic Republic to bend to their will. Under his leadership, Iran expanded its influence far beyond its borders, earning a reputation as a formidable and dangerous regional power to be reckoned with.\n\nBut his death comes at a time when Iran is arguably at its weakest since he took power in 1989. Decades of Western sanctions had already left the country isolated and economically battered before American and Israeli strikes in June 2025 dealt his rule a severe blow.\n\nNew attacks launched on February 28 specifically targeted Khamenei and other top leaders, devastating his residence and offices in Tehran.\n\n“The Supreme Leader of Iran Has Reached Martyrdom,” state broadcaster IRIB reported Sunday morning.\n\nKhamenei was killed “in his office in the household of the leader” while “carrying out his duties” at the time of the attack early on Saturday, state media Fars News Agency reported.\n\nSatellite images from Airbusshowedblack smoke rising from the leader’s Tehran compound after the attack. The images appear to show that several buildings in the compound were severely damaged by strikes.\n\nThe latest US-Israeli strikes followed the crushing of Iranian anti-government protests that began in late December over economic grievances but quickly turned political, spreading across all 31 of the country’s provinces within weeks. The regime responded with a brutal crackdown, killing thousands of protesters and prompting a global outcry and a threat of intervention from US President Donald Trump.\n\nThat intervention came on Saturday, when Trump said the US military was undertaking a “massive and ongoing operation to prevent this very wicked, radical dictatorship from threatening America and our core national security interests.”\n\nHe also called on the Iranian people to “take over your government,” adding that they now “have a president who is giving you what you want, so let’s see how you respond.”\n\nIn the final years of Khamenei’s stubborn rule, the country grew increasingly isolated, plagued by corruption and sinking deeper into economic turmoil, with dwindling prospects for a swelling youth population and shrinking middle class.\n\nKhamenei’s supporters argue that he was pushed against the wall for pursuing a foreign policy that defied the United States and Israel, and that his death was the ultimate price he paid for that stance.\n\nUnder Khamenei’s leadership, Iran advanced a controversial nuclear program that became the defining fault line between the Islamic Republic and the West, and which he used as a bargaining chip to gain leverage over adversaries.\n\nHe ruled a nation of 90 million people with a 2,500-year-old civilization, maintaining an iron grip as he consolidated power.\n\nThough surrounded by enemies, Khamenei long kept them at bay. After he became his country’s top political and religious authority following the death of the previous supreme leader, Ayatollah Ruhollah Khomeini, in the aftermath of the Iran-Iraq war, Iran avoided major direct attacks from its adversaries for more than three decades — even as other regional foes of the United States and Israel fell one by one. The regime entrenched itself with the formation of the “Axis of Resistance,” a loose network of allied groups spread throughout the region that allowed Tehran to project power at its enemies’ doorstep.\n\nBut all that — along with the aura of fear and intimidation that Khamenei carefully cultivated — began to unravel in his final years. The chain of events triggered by the October 7, 2023, attacks on Israel by Hamas shattered the image of Iran as an impenetrable and defiant regional power.\n\nThe axis started to crumble soon after the attacks. Israel launched a devastating war on Hamas, then turned its sights on Hezbollah in Lebanon, one of Iran’s most prized proxies. Israeli forces later moved into Syria following the fall of President Bashar al-Assad.\n\nEmboldened by a string of battlefield successes, Israeli Prime Minister Benjamin Netanyahu vowed to “finish the job,” culminating in a bold and unprecedented strike on Iran itself in June 2025, ostensibly to dismantle its nuclear program and its ability to defend itself. The Israeli strikes ultimately drew in the US, which struck three Iranian nuclear sites in the final days of the war. Trump declared that the facilities had been “obliterated.”\n\nSix months after that 12-day war, Iran had lost most of its bargaining chips with Israel and the West, including much of its nuclear leverage and its regional proxies. The regime found itself embroiled in an even deeper economic crisis, fueling mass public protests.\n\nWith few options remaining, the government reluctantly returned to talks with the US but refused to budge on its demand to continue enriching uranium, a fuel for nuclear power plants that can also be used to build a bomb.\n\nIranian officials and an Omani mediator sounded optimistic about a deal after the last round of talks on Thursday, with Omani Foreign Minister Badr Albusaidi saying a deal was “within reach.” By Saturday morning, the US and Israel had launched a surprise attack on Iran.\n\nTo his supporters, Khamenei was the steadfast, fearless leader who transcended mere politics and inspired devotion. To his critics, Iranian and foreign, he was a feared tyrant bent on crushing those opposed to him while keeping his country isolated from the West.\n\nHe was only the second leader of the Islamic Republic and by far the longest-serving. His rule shaped the regime’s national psyche, and his death is likely to transform it profoundly.\n\nKhamenei, who wasborn in 1939 in Mashhad, Iran’s holiest city, became a Shiite Muslim cleric at a young age. He was an activist before the 1979 Islamic Revolution, helping to organize protests against the shah of Iran, Mohammad Reza Pahlavi, and serving time in prison for it.\n\nHe was also a target for the new Islamic regime’s opponents and escaped an assassination attempt in 1981 that left his right arm useless.\n\nNot long afterward, he was elected president on a platform deeply hostile to the West and its liberal ideology, and especially to the United States — threatening a hard fight in the event of war.\n\n“We in no way are willing to start an all-out war with the US, but if it so happens, we will inevitably put up a very strong defense,” he said.\n\nHe was a protégé of Khomeini, who led the struggle to overthrow the shah and founded the Islamic Republic. When Khomeini died in 1989, Khamenei became his successor within a matter of weeks.\n\nWhile lacking Khomeini’s theological standing, Khamenei proved to be politically shrewd. Over time, he consolidated control over Iran’s armed forces, intelligence services, judiciary and state media to ensure that no major decision could be made without his approval.\n\nIt was Khamenei’s advancement of Iran’s nuclear program that ultimately led to the attacks on Iran by Israel and the US.\n\nThough he repeatedly claimed the program was for peaceful purposes — and even issued a religious decree, or fatwa, proclaiming that nuclear weapons were forbidden by Islam — he steadfastly supported the development of nuclear energy as a matter of national sovereignty and strategic leverage.\n\nBy the time Hassan Rouhani, a centrist politician, succeeded hard-liner Mahmoud Ahmadinejad as president in 2013, the nuclear showdown with the West had turned into Iran’s biggest foreign policy challenge. With Khamenei’s approval, Rouhani’s administration negotiated the 2015 nuclear deal (known as the Joint Comprehensive Plan of Action, or JCPOA) with world powers, including the US. The deal was meant to free the Iranian economy from years of crippling sanctions in return for limits on Iran’s nuclear program, notably its enrichment of uranium.\n\nBut Khamenei remained skeptical. His reluctance to fully embrace the deal contributed to its fragility. When Trump unilaterally exited the agreement in 2018, Iran continued to abide by it. But a year later, Tehran said it would no longer be bound by its commitments if the other parties to the JCPOA were in breach of theirs.\n\nKhamenei seized the moment to accelerate uranium enrichment and leaned ever further into a “resistance economy” doctrine — emphasizing self-sufficiency and confrontation over compromise.\n\nIn late June 2019, new US sanctions were imposed on Khamenei himself, as well as his office, to block Iran’s access to the international finance system. Trump’s punitive “maximum pressure” policy crippled Iran’s economy and effectively denied its people the nuclear pact’s promised benefits.\n\nThe election of reformist President Masoud Pezeshkian in 2024 on a platform of reengaging with the world and resolving Iran’s nuclear standoff brought hope of reinvigorating Iran’s economy and reintegrating the Islamic Republic into the international community. Talks resumed with the US a year later, but hopes of reaching a detente with the West were crushed by Israel’s attack on Iran in the middle of those talks, as it sought to capitalize on its military gains after the October 7 attacks.\n\nEight months later, Iran and the US began another round of indirect talks, mediated by Oman. Despite engaging with Tehran, the Trump administration started the biggest American military buildup in the Middle East in over two decades. Trump sent mixed signals, saying talks had been going well, while advocating regime change in Iran.\n\nWhile Iran always denied any involvement in or prior knowledge of the October 7 attacks by Hamas and allied militias, the assault and the seismic regional events it triggered had major implications for a key pillar of Khamenei’s legacy: a reliance on the Islamic Revolutionary Guard Corps (IRGC) and proxy groups it supported to project power beyond Iran’s borders.\n\nUnder Khamenei, Iran’s influence extended into Iraq after Saddam Hussein’s ouster in 2003. In the following years, Tehran also became a major player in regional conflicts, including Syria’s civil war, where IRGC forces were at the forefront of operations.\n\nThe IRGC, which reported directly to Khamenei, became the most powerful military institution in Iran, holding deep influence over domestic politics and the economy. It also wielded huge influence over key armed groups elsewhere in the region, such as Lebanon’s once formidable Hezbollah, Hamas in Gaza, the Houthis in Yemen and several armed Shiite groups in Iraq and Syria. In 2019, the US added the IRGC to its list of designated terrorist groups in an unprecedented move against another country’s armed forces.\n\nIn the 2010s, as the threat from the Islamic State (ISIS) terrorist group grew, so did Iran’s involvement in neighboring Arab countries. Many Shiite Muslims saw ISIS as an existential threat, and while Iranian-backed militias had some success in pushing back the group, their campaigns also deepened regional sectarian tensions.\n\nSunni Muslims often viewed the fight not just as a battle against terrorism, but as an Iranian-led war on their sect. Powerful Arab states in the Persian Gulf saw Iran’s moves as part of a broader effort to expand a “Shiite Crescent” across the region, heightening fears of unrest at home. By the mid-2010s, several Arab states in the gulf had severed diplomatic ties with Tehran.\n\nKhamenei didn’t back away, instead doubling down on support for Iran’s proxies. ISIS was eventually crushed by a multinational coalition in 2019, and Iran’s regional influence solidified. A battered Syria turned into a key staging ground for the IRGC, placing Iranian forces and allies right at Israel’s doorstep. In time, Saudi Arabia restored ties with Iran through secret, Chinese-brokered talks, and other gulf states soon followed. By then, Iran had managed to improve relations with several neighbors. Despite crippling sanctions, it appeared strategically ascendant — its regional reach more secure than ever.\n\nThat strategic depth was dismantled bit by bit by Israel after the October 7 attacks. With its proxies crippled, Iran became vulnerable and finally itself became a target of both Israel and the US. After that 12-day war in June, Tehran was left with little negotiating leverage, its nuclear facilities heavily damaged, its proxies nearly neutralized and its economy in tatters.\n\nIran saw repeated pushes for reform during Khamenei’s rule, and repeated crackdowns on those efforts. He worked to contain the reformist movement of President Mohammad Khatami in the late 1990s and backed the brutal suppression of protests that erupted amid claims that the 2009 elections had been rigged in favor of the hard-line Ahmadinejad.\n\nKhamenei’s public backing of Ahmadinejad and the subsequent crackdown cemented his image as a leader intolerant of dissent and reluctant to change.\n\nThe 2021 election of Ebrahim Raisi as president marked the culmination of Khamenei’s ideological ambitions: a political landscape dominated by conservative and loyal forces with little room for dissent. Raisi was even considered by some as the natural successor to Khamenei and his worldview.\n\nUnder Raisi, Iranian security forces cracked down on demonstrations sparked by the death of Mahsa Amini, a 22-year-old woman who died in the custody of Iran’s morality police after being arrested for allegedly violating the country’s mandatory hijab laws. The protests quickly evolved into a nationwide uprising led largely by women and young people.\n\nOnce again, Khamenei used the full force of the state to stifle calls for change, with hundreds killed and thousands arrested in the crackdown. Raisi’s untimely death in a helicopter crash in 2024 provided Khamenei with another opportunity to address public frustration, and many saw the election of the reform-leaning Masoud Pezeshkian as a step in that direction.\n\nBut Pezeshkian’s reformist agenda — and his hopes of delivering a nuclear deal that could bring economic and social relief to his people — were abruptly derailed by Israel’s attacks.\n\nWhen protests erupted six months later, he acknowledged the limits of his government’s ability to address the economic grievances that fueled the demonstrations. For many Iranians, the president had failed to pull the country out of isolation, failed to revive a nuclear deal and failed to deliver the long-promised prosperity.\n\nIn late January, the US began a massive military buildup around Iran while engaging in talks with Tehran via Omani mediation. Those talks never formally collapsed, and all sides were signaling varying degrees of progress just hours ahead of the attacks that ultimately led to Khamenei’s death.\n\nFor Khamenei, it was a final reckoning. He had spent decades warning that engagement with the West was pointless and that Iran’s enemies would eventually strike. Even if the foundations he spent years building were wiped away, for Iran’s hard-liners, he had finally been vindicated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl?post-id=cmm6s5fyr00003b75zxk7364a",
      "text": "showed"
    },
    {
      "url": "https://english.khamenei.ir/news/2130/bio",
      "text": "born in 1939 in Mashhad"
    }
  ],
  "hash": "988e42c1f624e1c2c984ab17c14fe5bdf2b205ed7f96dd16ed992804d5da95b4",
  "scraped_at": "2026-03-01T07:06:23.284301+00:00"
}