{
  "url": "https://lite.cnn.com/2026/02/15/middleeast/crime-epidemic-inequality-israeli-arabs-intl",
  "title": "A killing a day: How a crime epidemic is spotlighting inequality in Israeli society | CNN",
  "date": "2026-02-15T07:10:37.713663+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA mother shot dead outside a supermarket. A man killed after leaving a mosque. A doctor gunned down while treating patients. These shocking cases are no longer anomalies: they are the toll of a violent crime epidemic sweeping across Israel.\n\nThe victims are allPalestinian citizens of Israel. Homicides in their community have risen so dramatically that one person has been killed every day on average this year. Palestinian citizens make up 20% of the country’s population, and many say the Israeli government has not only failed to curb the crime wave, but that its inaction has helped spur a cycle of violence largely perpetrated by Arab organized crime groups.\n\nThe data bears out a stark inequality: Israel Police has solved just 15% of homicides in Israel’s Arab communities versus 65% among Jewish Israelis, according to data from Israel’s parliament, the Knesset, and Eilaf, the Center for Advancing Security in Arab Society.\n\nPalestinian citizens of Israel are descendants of those who were notexpelled or forced to flee their homeswhen Israel was established in 1948. They were given citizenship but lived under military rule until 1966, and many say they continue to face discrimination in Israeli society.\n\nLast year was the deadliest on record for the community, with 252 killed – the vast majority by gunfire – according to a report published byAbraham Initiatives,a group that advances social inclusion and equal rights for Israel’s Palestinian citizens.\n\nAnd 2026 is already off to a bloody start, with 46 killed so far, according to the group.\n\nIt is a deadly reality that has raised alarm bells, with tens of thousands of the country’s Palestinian citizens taking to the streets in recent weeks – joined by some Jewish Israelis – to demand government action.\n\n“No to killing, no to death, we want to live in justice,” demonstrators chanted in Arabic at a January protest in Sakhnin, a majority Palestinian city in northern Israel, which drew tens of thousands of people.\n\nAttendees told CNN it was the largest demonstration the Arab community has seen in years, culminating a multi-day general strike from shop owners.\n\nWhat began there has since grown into a nationwide protest movement, with strikes and demonstrations taking place almost daily across Israel. Streets across the country were filled with a sea of black flags and water fountains were dyed red as citizens declared a “national day of disruption.”\n\nA week after the Sakhnin strike, Israeli President Isaac Herzog made a rare visit to the city, where he met with local Arab authorities and protest organizers.\n\nHe said the fight against crime and violence in the Arab community “must be at the very top of the national priorities and be addressed with the utmost determination” calling it a “moral obligation.”\n\nAnd on Thursday, Israel’s Police Commissioner Daniel Levi declared crime in the Arab community “a state of national emergency” and “an intolerable situation that must stop.”\n\nHe called on other government agencies to join the police in helping address the issue.\n\nFor many Palestinian citizens of Israel, those declarations ring hollow. Qasem Awad has waited for more than a year for his son’s killer to be brought to justice.\n\nHis son, Abdullah, a doctor from Mazra’a in the western Galilee, was treating a mother and her two children at a clinic last February when a masked gunman walked in and fatally shot him at close range. He was 30 at the time.\n\nAbdullah had been filling in for another doctor that day. His father believes he was mistaken for someone else.\n\n“If you look at the Palestinian Arab community in Israel, how many are being killed daily and for no reason?” Awad said. “These people have nothing to do with the world of crime. They are collateral damage, and my son is one of them.”\n\nIn the days following Abdullah’s death, his parents say Israel Police visited and assured them they would investigate his death and identify the perpetrator.\n\nMore than a year later, the pledge remains unfulfilled, and the family says it hasn’t heard from law enforcement authorities.\n\nIf his son had been Jewish, Awad believes the killer would’ve been arrested “in an hour”.\n\nLike many others in his community, Awad believes the Israeli government intentionally neglects crime perpetrated against Palestinian citizens.\n\n“It is part of a policy to divide and conquer. ‘Let them kill each other while we sit back and relax,’” he said.\n\nAwad points to the speed with which Palestinian perpetrators are brought to justice in crimes against Israelis.\n\n“The technological tools and know-how are available for them to catch the killers. But when it is affecting the Arab demographic, they no longer have the tools or the know-how?” he asked.\n\nAccording to the Eilaf report, Palestinian citizens of Israel face “selective enforcement” of the law.\n\n“On the one hand, a tough approach towards political activity andfreedom of expression, and on the other, a soft approach towards criminals and crime,” the report said.\n\nIn response to a query from CNN, the Israel Police said in a statement that a “thorough and complex investigation was launched” following the killing of Dr. Awad, where authorities have questioned “dozens of involved parties, with the aim of locating the suspects and uncovering the truth.”\n\nData compiled by Abraham Initiatives shows that homicide cases among Palestinian citizens of Israelmore than doubled in 2023.\n\nThat was far-right Minister of National SecurityItamar Ben Gvir’sfirst full year overseeing the police.\n\nBen Gvir, who was convicted for supporting terrorism and incitinganti-Arab racism, has rejected responsibility, instead blaming local Arab leaders for turning a “blind eye” to criminal activity. Last month, he said he had “allocated enormous resources to the fight against crime and criminal organizations.”\n\nCritics say his actions speak louder than his words. Within months of entering office, Ben Gvir cut off key funding for an anti-Arab crime initiative called “Stop the Bleeding,” launched by the previous government. The next year, he dismissed the police official in charge of fighting crime in Arab society and put a lower-ranking official in his place.\n\nOn Sunday, Ben Gvir defended the job he’s done, saying on Kan Reshet Bet radio that there have been “great successes” during his tenure. “I don’t work for the Arabs, not just for the Arabs,” he said. “I work for everyone.”\n\n“There is 20% less murder in the Jewish sector, let’s put that on the table … 60% fewer murders of Jewish women, and 20% fewer car thefts.” Ben Gvir said crime in the Arab sector is a “grave phenomenon” and he intends to “combat it.” But he blamed the Attorney General, with whom he has had an ongoing feud, and “40 years of neglect” from authorities for the surge, despite record killings during his tenure.\n\nThe concern is not only the surge in killings, but the increasing brazenness with which they are carried out.\n\nAccording to Eilaf’s report, three out of four killings last year occurred in public spaces, indicating the “dangerous normalization of open crime… without any real fear of immediate intervention or effective deterrence.”\n\n“In light of weak governance, limited police presence, and declining trust in institutions, organized crime in Arab towns found a fertile ground for expansion, gradually building its economic and social influence by exploiting the vacuum left by the state,” said Rawyah Handaqlu, the head of Eilaf.\n\nShe says the violence reflects the “exclusion and marginalization” of Palestinian citizens of Israel, arguing that the state has frequently relegated crime and violence to simply being a product of Arab society, which “holds society responsible for a reality imposed on it.”\n\nAida Touma-Suleiman, a Palestinian member of the Knesset who actively raises the crime issue in parliament, believes the first step to eradicate crime in the Arab community is to topple the right-wing government, which she describes as “racist, fascist and criminal.”\n\n“When the government is not acting… not holding the criminals responsible and not prosecuting them, it’s like sponsoring them,” she told CNN at the Sakhnin protest. “We want them to do the work they are supposed to do, and we want to give our young people the security to develop and to feel that they are living.”\n\nIn December, the Israeli Prime Minister’s Office announced plans to redirect $70 million from a program designed to promote Arab economic development to the police to address “severe nationalistic crime” in the Arab community.\n\nThe Mosawa Center, a group advocating equal rights for Palestinian citizens, called it a “dangerous political step” that would do nothing to combat crime.\n\n“While the ministry fails to use the budgets already at its disposal, it is pushing to cut budgets allocated to other areas such as education and housing and transfer them to its own coffers,” it said in a statement. “This can only be interpreted as a deliberate policy of further impoverishing Arab society and plunging it deeper into crises, including the scourge of crime.”\n\nBack at his home in Mazra’a, Awad’s wait for justice continues. He finds comfort only in the photographs of his late son.\n\nAsked if he has any hope that there will be justice for his death, he sighs and points to the ceiling.\n\n“Justice only exists up there, with God.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/06/16/middleeast/israel-iran-tamra-shelters-latam-hnk-intl",
      "text": "Palestinian citizens of Israel"
    },
    {
      "url": "https://www.cnn.com/2024/05/15/us/nakba-day-anniversary-palestinians",
      "text": "expelled or forced to flee their homes"
    },
    {
      "url": "https://abrahaminitiatives.org/",
      "text": "Abraham Initiatives,"
    },
    {
      "url": "https://www.cnn.com/2025/03/10/middleeast/israel-freedom-of-speech-crackdown-intl",
      "text": "freedom of expression"
    },
    {
      "url": "https://www.cnn.com/2023/09/08/middleeast/israel-arab-citizens-crime-mime-intl",
      "text": "more than doubled in 2023"
    },
    {
      "url": "https://www.cnn.com/2025/06/10/uk/uk-sanctions-israel-ministers-smotrich-ben-gvir-intl",
      "text": "Itamar Ben Gvir’s"
    },
    {
      "url": "https://www.cnn.com/2023/01/03/middleeast/israel-palestinians-jerusalem-ben-gvir-intl/index.html",
      "text": "anti-Arab racism"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/middleeast/crime-epidemic-inequality-israeli-arabs-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/middleeast/crime-epidemic-inequality-israeli-arabs-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "98c48d7d51df780e9a35fe2a08c68b9bf47e279c33895c2ea35ab51f109e3e20",
  "scraped_at": "2026-02-15T07:10:37.713676+00:00"
}