{
  "url": "https://lite.cnn.com/2026/02/13/asia/north-korea-kim-jong-un-daughter-succession-intl-hnk",
  "title": "Could Kim Jong Un’s teenage daughter be North Korea’s next leader? | CNN",
  "date": "2026-02-13T07:30:41.187558+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA young teenage girl shrouded in mystery and intrigue could very well be the next leader of the isolated hermit nationNorth Korea.\n\nSome experts believe leader Kim Jong Un is grooming his daughter to be his successor ashe brings her alongon increasingly frequent and high-profile excursions, fueling speculation in recent years.\n\nThe exact age of the girl, believed to be namedKim Ju Ae, is unknown, but she is widely believed to be in her early teens.\n\nThe succession theory was boosted further on Thursday after South Korea’s spy agency said it believes the dictator has “entered the stage of nominating her as successor.”\n\nThe National Intelligence Service (NIS) delivered this updated assessment in a closed-door briefing with lawmakers, who later shared their findings with reporters.\n\nBesides simply appearing at significant events, Ju Ae now appears to have “expressed opinions on some measures” in policy, the NIS said, according to lawmakers.\n\nNone of this has been officially confirmed and much remains unknown about the Kim family. Little information comes in or out of North Korea, one of the world’s most closed-off and repressive countries.\n\nThepandemic deepened this isolation, with borderssealed shut, and most remaining diplomatic missions and international nonprofits leaving the country.\n\nBut intelligence agencies watch closely for any events that might offer a clue, especially on the future of the Kim dynasty which has ruled North Korea for generations.\n\nOne such event will be a major political gathering expected to take place later in February, the first in five years, with the country possibly setting new priorities and reshuffling officials.\n\nLawmakers said the NIS will closely monitor if Ju Ae attends the meeting, the level of protocol given to her, as well as any symbolic titles and other clues.\n\nWestern experts believe Kim has three children and that Ju Ae is the middle child, though there’s no way to verify this.\n\nThe world first learned about Ju Ae’s existence in 2013 when American basketball star Dennis Rodman made a controversial visit to the capital Pyongyang. He later told The Guardian: “I held their baby Ju Ae and spoke with (Kim’s wife) as well.”\n\nJu Ae remained hidden in the shadows until her first public appearance in 2022 whenaccompanying her fatheras he oversaw the launch of an intercontinental ballistic missile (ICBM). Remarkable photos showed the leader holding the hand of a young girl, chubby-cheeked with bangs and a long ponytail, against the backdrop of a towering missile.\n\nMore public appearances came in the following years, including atmilitary events,such as a parade in the capital where she gazed out at rows of ICBMs.\n\nHer first public trip abroad came last September when she accompanied her father to Beijing to attend Chinese leader Xi Jinping’s military parade.\n\nIn a show of force during the parade, Kim and Russian President Vladimir Putin flanked Xi, walking ahead of other world leaders, forming a trio of authoritarians aligned in their mission to create a new world order, countering the West.\n\nAs they projected that stark message to the world in a spectacle watched by millions, somewhere in Beijing – hidden from cameras – was young Ju Ae.\n\nShe’s the only Kim child with any visibility, with state media regularly addressing her as “beloved daughter” and “dear daughter.”\n\nIf Kim has any other children, they have never been shown in public.\n\nBut not everyone thinks Ju Ae has been anointed as the successor. Some experts argue it’s just a PR stunt to attract international attention.\n\nFor many decades, it’s been a mystery how successors in the Kim family are chosen, one expert previously told CNN. So, why change that now?\n\nKim’s other children may be chosen instead and it could be a deliberate choice to keep them out of sight for now, preserving their anonymity and allowing them more options in education or training, experts have told CNN.\n\nKim himself studied in Switzerland in the 1990s. But that’s an unlikely option for Ju Ae with the spotlight firmly on her.\n\nA lot can happen between now and the moment of eventual succession. It could be many more years before Kim – believed to be in his 40s – needs to pass the baton.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/asia/north-korea",
      "text": "North Korea"
    },
    {
      "url": "https://www.cnn.com/2025/09/02/china/kim-jong-un-daughter-beijing-intl-hnk",
      "text": "he brings her along"
    },
    {
      "url": "https://www.cnn.com/2025/06/18/asia/north-korea-covid-report-intl-hnk",
      "text": "pandemic deepened this isolation"
    },
    {
      "url": "https://www.cnn.com/travel/north-korea-tourism-reopening-intl-hnk",
      "text": "sealed shut"
    },
    {
      "url": "https://www.cnn.com/2022/11/18/asia/north-korea-kim-jong-un-daughter-intl",
      "text": "accompanying her father"
    },
    {
      "url": "https://www.cnn.com/2023/02/08/asia/north-korea-kim-jong-un-daughter-banquet-intl-hnk/index.html",
      "text": "military events,"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/asia/north-korea-kim-jong-un-daughter-succession-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/asia/north-korea-kim-jong-un-daughter-succession-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "993fba8bb6ac71c1056fc9dc169c0c602ae755a801927356ebbd76e9a19173e9",
  "scraped_at": "2026-02-13T07:30:41.187570+00:00"
}