{
  "url": "https://lite.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
  "title": "Three House Republicans cross party lines to block effort to shield Trump from challenges to his tariffs | CNN Politics",
  "date": "2026-02-11T16:31:50.560929+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nSpeaker Mike Johnson failed to reinstate a ban on lawmakers’ ability to challenge PresidentDonald Trump’s tariffs when three Republicans crossed party lines to vote with Democrats.\n\nThe House sank a procedural vote Tuesday night that contained language blocking votes in the chamber that object to Trump’s tariffs through July. The move opens the door for Democrats to move forward with forcing votes to repeal the president’s tariffs, in a blow to the administration.\n\nWith razor-thin margins in the House, three Republicans – GOP Reps. Thomas Massie, Don Bacon and Kevin Kiley – were enough to sink the vote. Johnson can only afford to lose one Republican vote to advance legislation with his current margin.\n\nThe Senate haspassed at least three resolutionsrebuking Trump’s tariffs, but routinely ran into resistance in the House where members were blocked from forcing votes on the matter.\n\nFollowing the vote, Bacon said in a statement that he doesn’t “like putting the important work of the House on pause, but Congress needs to be able to debate on tariffs.”\n\nThe Nebraska congressman went on to say that “tariffs have been a ‘net negative’ for the economy and are a significant tax that American consumers, manufacturers, and farmers are paying.”\n\n“Article I of the Constitution places authority over taxes and tariffs with Congress for a reason, but for too long, we have handed that authority to the executive branch. It’s time for Congress to reclaim that responsibility,” hewrote on X.\n\nGOP leaders had argued that lawmakers should support the rule to allow the Supreme Court time toweigh in.\n\nJohnson, however, acknowledged the challenges he faces withsuch slim marginsin the House.\n\n“Look, this is life with a small majority. I mean, you know, I need unanimity every day, and we didn’t get it tonight,” he told reporters after the vote.\n\n“The vast majority of the House Republicans agree wholeheartedly with the president, and we’re going to give him the latitude to continue his trade policy,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2025/10/30/politics/trump-global-tariffs-senate-rebuke",
      "text": "passed at least three resolutions"
    },
    {
      "url": "https://x.com/RepDonBacon/status/2021418451911295376?s=20",
      "text": "wrote on X"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/where-is-supreme-court-ruling-on-trump-tariffs",
      "text": "weigh in."
    },
    {
      "url": "https://www.cnn.com/politics/narrow-house-majority-congress-dg",
      "text": "such slim margins"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/house-trump-tariffs-vote-republicans",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9b7e0ffb1dda04ebfff023f504abd977725366783cb4f2c050c14821f683766a",
  "scraped_at": "2026-02-11T16:31:50.560943+00:00"
}