{
  "url": "https://lite.cnn.com/2026/02/27/politics/clinton-epstein-investigation-trump-analysis",
  "title": "Analysis: Why the Clintons’ ordeal might end up backfiring on Trump | CNN Politics",
  "date": "2026-02-28T07:00:20.438311+00:00",
  "authors": [
    "Analysis by Stephen Collinson"
  ],
  "text": "Source: CNN\n\nWhen former President Bill Clinton testifies to a congressional committee Friday on the Jeffrey Epstein scandal, he will be setting a precedent that President Donald Trump may come to regret.\n\nThe 79-year-old former president’s deposition followsthe closed-door testimony of his wife, former Secretary of State Hillary Clinton, who on Thursday blasted the Republican-run House Oversight probe as a cover-up to protect Trump.\n\nNeither of the Clintons nor Trump is accused by law enforcement of criminal wrongdoing in relation to Epstein. But the ex-president and the current one were bothacquainted with himand are both mentioned multiple times in Justice Department files on Epstein.\n\nThe battle by Trump’s allies to draw the Clintonsinto their investigationwas always destined to create bitter political theater, given their enormously high profiles and decadeslong histories of fierce duels with Republicans.\n\nBut their arrival before the committee also has the potential to backfire on the GOP. First, their involvement is offering new fuel to the Epstein saga, which the White House has beentrying unsuccessfully to quellfor months.\n\nAnd the testimony of the Clintons is raising uncomfortable parallels that will discomfit Trump and his inner orbit. For instance, if the standard for required testimony is being mentioned in the Epstein files, why are prominent Republicans also mentioned in the files not being hauled before the committee?Commerce Secretary Howard Lutnick’sdescriptions of his past interactions with Epstein were undercut by files released by the DOJ — but he has not so far received a subpoena to match those sent to the Clintons. There is no allegation of criminal wrongdoing against Lutnick.\n\nBill Clinton’s past contact with Epstein will surely interest the committee. But isn’t there a double standard if Trump, who was mentioned in the files numerous times, is not also put under oath?\n\nAnd former Secretary Clinton’s appearance — although, in her telling, she had no information about Epstein’s conduct — creates a model of a spouse being asked about her husband’s links to the accused sex trafficker. Some observers might wonder whether first lady Melania Trump might have similar insight about the times her husband and Epstein moved in similar orbits before and after their marriage in 2005. While there would surely be a mighty constitutional fight over an attempt to compel testimony from a sitting president, the first lady has no formal constitutional role, and there appear to be no legal barriers to such a summons.\n\nIt is not unprecedented for a former president to testify to Congress.\n\n19th-century President John Tyler was subpoenaed to appear in a probe into the misuse of public funds by his former secretary of state, Daniel Webster. Theodore Roosevelt testified before a congressional committee investigating antitrust issues in the steel industry in 1911 — one of a number of former presidents to appear as witnesses, according to a 1983 article by Stephen Stathis, an analyst in American history at the Congressional Research Service.\n\nTrump refused a subpoena to testify to the House committee that investigated the January 6, 2021, riot by his supporters at the US Capitol. He sued to block the summons amid a fierce constitutional dispute over the separation of powers, and it was eventually withdrawn when the committee’s work ended.\n\nPrevious testimony by earlier presidents mostly focused on policy issues, whereas the deposition by Clinton touches on personal matters.\n\nDemocrats have already said they will deepen scrutiny into Epstein’s history if they win back the House majority in November’s midterm elections. Given the cycle of retribution that currently dominates US politics, it would be no surprise if they tried to compel testimony from Trump before, or after he leaves office.\n\nTrump has appeared to empathize with the Clintons after his bitter former sparring partners were forced to give depositions. The precedent of family members being hauled before a congressional committee might be alarming for him, especially given the possibility of a Democratic House majority next year. And the principle that will be underscored on Friday — that a former president can be compelled to give testimony on a matter that has no obvious separation of powers issues — might complicate Trump’s own future once he’s left office.\n\nHouse Oversight Committee Chairman James Comer denied he was running a partisan investigation. “This isn’t just Democrats,” he said. Comer noted that the panel had heard from former Labor Secretary Alex Acosta and former Attorney General Bill Barr. Both served during Trump’s first term. Acosta was the former US attorney for the Southern District of Florida who signed off on a controversial state plea deal for Epstein in 2008.\n\nDemocrats accuse Comer of running the investigation as a partisan ruse to shield Trump. But the tantalizing patterns established by the Clinton testimony mean it might become a liability for Trump by exacerbating intrigue about Epstein.\n\nThe Clintons initially fought hard to avoid testifying to the committee, regarding it as a partisan attempt to turn the focus away from Trump over the Epstein files. But they reversed course so as not to be deemed in contempt of Congress, with some Democrats expected to vote with the GOP to punish their non-appearance.\n\nThe presence of the Clintons — at depositions near their home in Chappaqua, New York — shows the saga’s gathering and self-reinforcing momentum after years when justice was denied to women allegedly trafficked and abused by Epstein.\n\nCalls for accountability and for powerful people to say what they knew about his conduct have seen prominent legal, business and entertainment executives step down from senior positions.\n\nIn Britain, former Epstein friends Andrew Mountbatten-Windsor and former Cabinet minister Peter Mandelson were arrested on suspicion of misconduct in public office. Mandelson’s lawyers have said his arrest was baseless. Mountbatten-Windsor, the former Prince Andrew, has denied all past accusations against him and denied he ever witnessed the behavior of which Epstein is accused. He has yet to comment on his arrest. Both men have been released from custody and investigations continue.\n\nBill Clinton’s deposition will mark another extraordinary twist in a long political career dogged by scandal but also featuring multiple comebacks and unlikely moments of political redemption. It will renew a heated political showdown with Republicans that stretches back more than 30 years — in which the first two-term Democratic president since Franklin Roosevelt got the upper hand.\n\nHe is sure to be asked about photos in which he appeared with Epstein; with the late pedophile’s now-jailed accomplice Ghislaine Maxwell; and with an unidentified woman in a hot tub. Clinton flew on Epstein’s jet at least 16 times between 2002 and 2003, according to a CNN review of flight logs and court documents. He denies knowledge of Epstein’s crimes and said he distanced himself from him long before he was federally charged in 2019.\n\nDemocrats on the committee expect the former president’s testimony to cover more ground than that of his wife. “I think there’s more to talk about tomorrow,” Virginia Rep. Suhas Subramanyam said. “Will it further our investigation significantly? I don’t know. Maybe, maybe not.”\n\nThe deposition of Clinton, who was president between 1993 and 2001, is also the latest embarrassing moment when the former commander in chief’s private life has been publicly scrutinized. This undignified trend goes back to when Clinton was governor of Arkansas and his first presidential campaign in 1992, and culminated when he was impeached during his second term over an affair with White House intern Monica Lewinsky.\n\nClinton escaped being ousted from office in a Senate trial. But in later years, the imbalance in the power dynamic between the president and the much-younger Lewinsky has often been seen in a harsher light, following the #MeToo movement and revelations about the circle of influential men who knew Epstein.\n\nThe ex-president is a veteran of multiple depositions and moments of public scrutiny during the legal controversies and political scraps that helped define his career. He was known as a nimble witness and at his peak possessed extraordinary political skills. Yet it was testimony under oath that almost caused his political demise. In 1998, Clinton testified under oath that he never had sexual relations with Lewinsky. The statement was later a cornerstone of the articles of impeachment against him.\n\nHis testimony on Friday will be watched to see whether he retains the sharp linguistic dexterity and political nous to repel GOP attacks after a series of health challenges in retirement. At the Democratic National Convention in 2024, he told delegates he was not sure how many more such gatherings he’d be able to attend. “Lord, I’m getting old,” he said.\n\nHillary Clinton testified Thursday she had no information about Epstein’s alleged crimes and accused Republicans of making a false attempt to show transparency. “I had no idea about their criminal activities,” Clinton said of Epstein and Maxwell. She continued, “I do not recall ever encountering Mr. Epstein. I never flew on his plane or visited his island, homes, or offices. I have nothing to add to that.”\n\nIn her statement to the committee, she also accused Comer of targeting her for political reasons and called on the panel to question Trump. “What is being held back? Who is being protected? And why the cover-up?” she asked.\n\nIn mounting a counter-attack against Republican scrutiny on the private life of her husband, Hillary Clinton was reverting to a familiar tactic to which she has frequently returned in their political careers that spanned his two White House terms and her own presidential campaigns in 2008 and 2016.\n\nThe former secretary of state reiterated that she had no answers to GOP questions about the former president’s relationship with Epstein. Comer said that she replied to questions with the words “I don’t know, you’ll have to ask my husband” more than a dozen times. He added: “We have a lot of questions for her husband tomorrow.”\n\nVideo of the former first couple’s separate testimony is expected to be released within days. That will allow every American to witness the return to the political stage of one of the most compelling double acts in modern politics.\n\nBut this was one return to the spotlight that both Clintons would have preferred to avoid.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/politics/hillary-clinton-deposition-epstein-bill",
      "text": "the closed-door testimony of his wife"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/new-documents-trump-epstein",
      "text": "acquainted with him"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/politics/how-bill-hillary-clinton-are-preparing-depositions-jeffrey-epstein",
      "text": "into their investigation"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/politics/white-house-epstein-files-problem-trump",
      "text": "trying unsuccessfully to quell"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/howard-lutnick-epstein-ties-trump",
      "text": "Commerce Secretary Howard Lutnick’s"
    }
  ],
  "hash": "9bd9a24faca59ea9e9ae67aa66d41d5945e4db910bef5be0524da9859999bab8",
  "scraped_at": "2026-02-28T07:00:20.438324+00:00"
}