{
  "url": "https://lite.cnn.com/2026/02/11/politics/white-house-governors-trump-stitt-moore-polis",
  "title": "Governors association says all members now invited to White House meeting as Trump defends exclusion of Moore and Polis | CNN Politics",
  "date": "2026-02-12T21:30:11.131233+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe National Governors Association said Wednesday that a traditionally bipartisan meeting at the White House next week is back on after invitations were extended to all of its members, even as President Donald Trump continued to rage against two of the nation’s Democratic governors and the organization’s co-chair, GOP Gov. Kevin Stitt.\n\nThe Oklahoma Republican told his fellow governors in a Wednesday letter that all members — including Democratic governorsinitially excludedfrom NGA’s business meeting at the White House — are invited to the event, citing a “misunderstanding in scheduling.”\n\n“I am writing to inform you that President Donald J. Trump is inviting all governors of the 55 States and territories to the Friday, Feb. 20 NGA Business Breakfast at 8:30am est,” Stitt wrote Wednesday in a letter shared with CNN. “He was very clear in his communications with me that this is a National Governors Association’s event, and he looks forward to hosting you and hearing from governors across the country. President Trump said this was always his intention, and we have addressed the misunderstanding in scheduling.”\n\nThe apparent reversal comes after Stitt told NGA members Monday that the organization would no longer facilitate the White House meeting, citing the decision to only invite Republicans and to further exclude from a White House dinner two governors who have publicly quarreled with Trump: Maryland’s Wes Moore, who co-chairs the NGA with Stitt, and Colorado’s Jared Polis.\n\n“Because NGA’s mission is to represent all 55 governors, the Association is no longer serving as the facilitator for that event, and it is no longer included in our official program,” Stitt wrote Monday in a letter shared with CNN. “We cannot allow one divisive action to achieve its goal of dividing us. The solution is not to respond in kind, but to rise above and to remain focused on our shared duty to the people we serve.”\n\nA source with the National Governors Association confirmed that Democratic governors had initially been excluded from the morning business meeting, but had begun to receive invitations to the bipartisan event Wednesday. A White House spokesperson confirmed to CNN that all members of the NGA were invited to Friday’s business meeting.\n\nBut Trump further complicated matters Wednesday afternoon, when he  weighed in on the back and forth in a post to hisTruth Social platform, lambasting Stitt, who he said “incorrectly stated my position” on the NGA meeting and blasting Moore and Polis.\n\n“The RINO Governor of the Great State of Oklahoma, in which I won all 77 Counties, three times (The only person to do so!), incorrectly stated my position on the very exclusive Governors Annual Dinner and Meeting at the White House,” Trump said. “The invitations were sent to ALL Governors, other than two, who I feel are not worthy of being there.”\n\nThe president also singled out Polis,who has blocked his efforts to pardon election denier Tina Peters on state charges, and Moore, who he said is “doing a terrible job on the rebuilding of the Francis Scott Key Bridge” and has “allowed Baltimore to continue to be a Crime Disaster.”\n\nIn another post, Trump doubled down on his criticism of Stitt, whobroke with the presidentearlier this year on immigration enforcement.\n\n“When Kevin Stitt, the very mediocre (at best!) RINO Governor of Oklahoma, was losing his Election to a Democrat, primarily because he did a bad job, he called for my help. I Endorsed him, and he won — Sorry, my cherished Oklahoma, to have done that to you!” Trump added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/white-house-democratic-governors-meeting",
      "text": "initially excluded"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116054089500353661",
      "text": "Truth Social platform"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/politics/tina-peters-colorado-jared-polis",
      "text": "who has blocked his efforts to pardon election denier Tina Peters on state charges"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/politics/republican-concerns-trump-immigration-minnesota",
      "text": "broke with the president"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/white-house-governors-trump-stitt-moore-polis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/politics/white-house-governors-trump-stitt-moore-polis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9be5f7ba1912fe1af8934938201e6a3bd85b325518a47fbeb5d1307d8131afb5",
  "scraped_at": "2026-02-12T21:30:11.131247+00:00"
}