{
  "url": "https://lite.cnn.com/2026/02/26/style/stardew-valley-video-game-anniversary",
  "title": "Stardew Valley at 10: The pixel art farm game that became an unlikely phenomenon | CNN",
  "date": "2026-02-28T07:01:48.022122+00:00",
  "authors": [
    "Jacqui Palumbo"
  ],
  "text": "This is the life you lead in Stardew Valley, the pixel art indie game that is celebrating its 10th anniversary and has sold nearly 50 million copies to date, making it one of the biggest-selling video games of all time. It ranks higher than the most successful releases of heavyweight franchises, including Pokémon, The Legend of Zelda and Call of Duty. The 2D farm simulator has also spawned two global orchestra tours of its soundtrack, a cookbook and a board game.\n\nTo say that Stardew Valley is an underdog game would be an understatement. Its creator, Eric Barone (known as ConcernedApe), worked on it alone straight out of college, inspired by its 1990s spiritual predecessor Harvest Moon, Nintendo’s cult-classic farming RPG. The computer science graduate had never worked on a video game before, nor did he have any experience making pixel art. It took him nearly five years to feel comfortable enough with his artistic abilities to release the game’s 1.0 version for PC. He now makes updates available for consoles and on mobile, too.\n\nStardew Valley “has been popular beyond my wildest dreams. It completely changed my life,”Barone said from his office in Seattle, where he’s based. “I was not expecting at all for the game to take off. I thought it would maybe sell a handful of copies with a very niche market.”\n\nOver the course of Stardew Valley’s 15-minute days, you run through chores, unlock Pelican Town’s secrets and (perhaps) save it from the grip of late-stage capitalism with the help of some cute forest spirits. I first played the game in 2018, somewhat skeptical that I would find enjoyment in a farming simulator. I quickly found myself staying up late to design tribute farms to my wives of choice. (First Maru, then Abigail, then Haley, if you care). Since then, I have played some 500 hours, lovingly referring to the state it puts me in as “manic farm mode.” Whenever I have put the game down, I‘ve eventually come back — sometimes in place of therapy, sometimes because new updates have expanded its magical world. Barone recently announced he is releasing a seventh major update.\n\nThe game has cultivated a fanbase that is generally kind and patient, increasingly rare qualities in the gaming world, and online more broadly. Barone is grateful that the Stardew Valley community is “uncommonly good,” as he put it. Players — myself included — enthusiastically show off their farms on Twitch, Discord, Pinterest, YouTube and Reddit to largely encouraging feedback, even if their designs are still works-in-progress, to put it kindly.\n\nCelebrities, too, have revealed their ardent love for the game online, including “2 Broke Girls” actor Kat Dennings and comedian Bobby Lee, both of whom enthusiastically agreed to chat all-things-Stardew for this story. “I haven’t been more excited about doing an interview in forever,” said Dennings in a video call from her home in Los Angeles.\n\nDennings does not consider herself a gamer, but she has also fallen under the spell of Stardew’s charming world, naming her farm’s chickens after the Golden Girls andcrediting the game with cultivating her own real-life gardening habit. It may also have brought about her marriage to musician Andrew W.K., she said, laughing, as the in-game character she always chooses to wed bears a striking resemblance to her own husband.\n\n“I can’t seem to marry anyone but Elliot,” she explained of her 2D husband. “(He’s) mopey, dramatic, gorgeous, stunning. His hair, amazing. (He) gives you little gifts and leaves you alone. Again, there are some similarities to the man I ended up actually marrying. And I don’t know whether I, like, manifested that by marrying Elliot so many times, but it’s possible. He plays the piano. God, he’s just like my husband.”\n\nLike many players, Dennings took solace in the game during the Covid-19 pandemic, when so-called “cozy” game that deemphasize stress and combat, like Animal Crossing, provided an escape from reality. Stardew is arguably notthatcozy — if you’re anything like me, you might find your blood pressure rising as you cross all your tasks off in a spreadsheet — but it has been instrumental in the genre’s renaissance.\n\nIn Stardew Valley, you choose how you spend your time. Some days you design your farm with fruit trees and cute furniture; others, you chug triple-shot espressos and drop through underground mines to fight monsters. In the game’s third year, grandpa’s ghost returns to analyze your progress, and though there’s loads more to do — including meeting all the hard-earned goals to reach “perfection” — it only ends when you choose to put it down.\n\n“There are so many ways you could play Stardew Valley,” Dennings said. “You could just farm, if you want. You could spend every day cutting trees.” Some players set self-imposed limitations for fun, like never leaving their farm for the nearby town to see how far they can progress as a recluse with extremely limited resources.\n\nLee, meanwhile, runs a tight ship, maximizing profits with high-value crops, gemstones and animal goods on a maximalist farm that the comedian jokingly — maybe — refers to as a “sweatshop.” (At a certain point in the game, you can automate your harvesting using junimos, the game’s tiny, berry-like forest spirits). He’s made hundreds of millions of in-game gold to date.\n\n“I have a lot of money — not in my real life, but in the game,” he said from his home in Los Angeles.\n\nThe comedian returns to the game to get lost in what he calls “pure joy,” though he joked that he told his therapist to “f**k off” when they told him it was time to address his time spent in the game.\n\n“I don’t like what’s going on in the world, especially in this country,” he said, noting that he loves Stardew for the same reason he loves the wholesome TV series “The Great British Baking Show.”\n\n“It’s very warm and safe,” he said.\n\nOthers have  argued that the game represents a simple life that is becoming harder to obtain.\n\n“It’s a game that lets you live out your wildest fantasies, such as owning a home, having friends, being financially stable — that’s a fantasy — going outside, sometimes,” said the gaming influencer Jourdan Silva (@jourdangames) in arecent Instagram Reel.\n\nBut it’s the game’s emotional qualities, belied by its simple artwork, that keeps many people invested. The villagers reveal more about their lives, with sweet romantic scenes and poignant moments unfolding around the town. There are even redemption arcs, like that of Shane, the town alcoholic who turns around his bottom-of-a-bottle fortunes with a love for raising chickens. Dennings said the game’s storytelling has brought her to tears.\n\nLee, too, has had emotional moments associated with the game, and particularly its music. Barone — who is also a musician — scored the original 70-song soundtrack, which offers arrangements for the game’s seasons, locations and characters, and has added another 30 tracks through its updates. Last year, Lee took a first date to the Symphony of Seasons concert tour — and soon realized he shouldn’t have.\n\n“It was a mistake because she had no idea what Stardew Valley was,” Lee recalled. “And when the opening music started playing, I had tears just running down my face. It was like I had a spiritual awakening, you know what I mean? Like a mind shift, if you will. It was so beautiful — and I never saw that date again.”\n\nBarone said it has been surreal attending the concerts, during which a 35-piece orchestra performs his music to crowds of thousands of people. (The second tour concludes its 130-show run this April). Growing up, the developer made indie music with different bands — “basically it was never very popular,” he said. Through Stardew, he’s seen one of his dreams become reality: “People were listening to my music and appreciating it.”\n\nStardew’s discoveries can feel endless, as Barone continues to add more content with each update. Some additions are obvious — new areas to explore, new characters, new farm types. Other smaller details are left for players to uncover. In the fifth update, Barone added ducks; players soon found if you put them next to bodies of water, they would hop in with a splash and happily swim.\n\n“You’re sh**ting me,” Dennings said when I told her that the ducks could swim.\n\nBarone hasn’t ruled out future updates after he releases version 1.7, though he said, at some point, it will feel like too much content for one game.\n\nThese days, Barone has a small operational staff, though he still works as the sole developer. There’s a new world on the way, too: Haunted Chocolatier, which, as the title suggests, will see players run a chocolate business from a haunted house in another quaint pixel-art town. There’s no release date as of yet. And, unlike Stardew, Barone isn’t “pinned down by the existing content; I can literally do anything,” he said. “I haven’t made any promises about anything. So, I feel way more free.”\n\nFor now, players have plenty more to return to within Pelican Town, including two new marriage candidates, who are likely to reignite the “spouse wars,” as Barone affectionately calls the heated debates among Stardew fans over who is the ideal virtual life partner. It’s the only thing within the community that verges on division.\n\nThough Stardew may never be adapted to TV or film — Barone has previously said that he is very protective of the IP — fans still eagerly “fancast” the best actors for the job, coming up with their own hypothetical casts. Though Dennings believes Stardew Valley should remain contained within its own little world, she readily offers up the character she feels most like: Sebastian, the dark-haired emo boy who codes at his computer in his parents’ basement. But then again, it’s Kat Dennings, and she has range — she could also be Sandy, the vivacious desert trader, she suggested, or the rarely seen divorcee witch.\n\n“I’ll play grandpa,” she finally decided. Appealing to the wider Stardew community, she declared: “Hey, listen, fancast me as grandpa. I could do it.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.instagram.com/reels/DCh1mUzvVDG/",
      "text": "recent Instagram Reel"
    }
  ],
  "hash": "9bf8efda9ebd18245ddf1ed1a7690c75eb5fa44c7f23eb4736147c077c74c383",
  "scraped_at": "2026-02-28T07:01:48.022134+00:00"
}