{
  "url": "https://lite.cnn.com/2026/02/19/business/automakers-selling-driving-data-to-insurance",
  "title": "Your car could be ratting you out to your insurance company | CNN Business",
  "date": "2026-02-20T07:29:14.288959+00:00",
  "authors": [
    "Chris Isidore, CNN"
  ],
  "text": "Source: CNN\n\nThe day before Philip Siefke went shopping for a new car insurance policy, he happened to hit his brakes hard while driving. Not 24 hours later, when he priced a policy with Progressive, he was shocked to find the insurer already knew about that mundane experience.\n\n“I’m like, how the eff did they have my information?” Siefke said. “I was pissed.”\n\nHe called Progressive and demanded to know how the insurer had such detailed information about his driving habits. The information came from Toyota, a rep explained to the incredulous Siefke.\n\n“She said, ‘Probably you signed up for a research project, and it’s coming from your telemetry that’s in your car,’” Siefke said. When he protested that he’d done no such thing, “she said, ‘Oh yeah, you did. Just about everybody does.’”\n\nAbout 90% of new cars on the road collect information on the driving behavior of whoever is behind the wheel, according to Telemetry, an automotive strategic advisory firm. Many automakers sell that information to third parties like insurance companies.\n\nCar buyers do have to agree to allow the collection and sale of their data—but that agreement is often buried deep in the fine print of the documents people sign when they buy the car, part of the sheaf of papers about prices, loan terms and warranties.\n\n“Technically, they had permission,” said Sam Abuelssamid, auto analyst with Telemetry. “It’s something that people should be aware of, but are not.”\n\nMost people have no idea they’re agreeing to the sale of their data, said John Yanchunis, an attorney at Morgan and Morgan whom Siefke hired to sue Toyota, Progressive and a third party-data provider in April 2025.\n\n“If you go to buy a car, you have a single focus, right? The price,” Yanchunis said.\n\n“They don’t give people that choice to see what’s going to happen with this data at the time of the acquisition of the product. They bury it. And why do people bury things? Because they don’t want consumers to know what they’re doing.”\n\nThe collection and sale of driving data is widespread across the automotive industry, the Federal Trade Commission noted in a 2024warningto consumers. The auto companies, however, say this data is collected with the intent to use the information to protect drivers.\n\nIndustry trade groups like the Alliance for Automotive Innovation defend the collection of driving data. It says automakers use these programs to provide information that support cars’ proper functioning and improve safety. For example, by alerting the automaker if the car has an issue that needs servicing.\n\n“No, your car isn’t spying… it’s keeping you safe,” the Alliance titled its 2023statement“Yes, your vehicle is generating and transmitting certain safety data. That’s by design.”\n\nConsumer advocacy groups and the FTC, however, flag privacy concerns.\n\n“Car brands quietly entered the data business by turning their vehicles into powerful data-gobbling machines,” said areportfrom the Mozilla Foundation, a technology privacy interest group, which characterized the auto industry as “the worst product category we have ever reviewed for privacy.”\n\nIn its 2024 consumer warning, the FTC wrote that “cars can collect a lot of data about people. This data could be sensitive…and its collection, use, and disclosure can threaten consumers’ privacy and financial welfare.”\n\nAlthough the FTC said it has been tracking this issue for years, the agency has brought only one case against a company. In anorderresolved just last month, the FTC prohibited General Motors and its OnStar service from selling this kind of data for five years “without adequately notifying consumers and obtaining their affirmative consent.”\n\nThere was no financial penalty for GM, which said it had discontinued the practice of selling the information it collects to third parties a year before the FTC order. The company noted that the program “was created to promote safer driving behavior, (but) we ended that program due to customer feedback.”\n\nFor Siefke’s lawyer, Yanchunis, it’s not a question of safety; it’s about both privacy and informed consent.\n\n“People should have the right to decide what they want to share with third parties, and they should not have those privacy rights taken from them without choice,” he said.\n\nSiefke feels he didn’t get that choice, and that he ended up paying for it.\n\nLast January, despite his reservations, Siefke moved forward with a Progressive policy that cost less than $300 a month. With a good driving record that included no tickets in almost a decade and no accidents since the 1990s, he thought he’d maintain a good rate.\n\nBut when it came time to renew his policy six months later, his rate had jumped to more than $400 a month with no explanation.\n\nMeanwhile, the case he filed against Toyota, Progressive, and the third-party data company is still pending. It was moved from the courts to arbitration—Siefke had also unknowingly agreed to arbitrate any disputes when he bought the car.\n\nToyota wouldn’t comment on ongoing litigation but said it only sells driving information to third parties “when the customer provides consent and directs Toyota Motors North America to do so.” Progressive did not respond to a request for comment.\n\nMeanwhile, Yanchunis expects the widespread data collection to continue. He recalled what 1930s criminalWillie Suttonsaid when someone asked why he robbed banks: “That’s where the money is.”\n\n“In the 21st century, we’re where the money is. Information, data, that’s the money,” Yanchunis said. “Companies harvest it, aggregate it, make money off it. And look, I understand that. But again, it comes back to choice: People ought to have the right to choose what’s being taken from them.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.ftc.gov/policy/advocacy-research/tech-at-ftc/2024/05/cars-consumer-data-unlawful-collection-use",
      "text": "warning"
    },
    {
      "url": "https://www.autosinnovate.org/posts/communications/Telematics%20Data%20Memo%20to%20Interested%20Parties.pdf",
      "text": "statement"
    },
    {
      "url": "https://www.mozillafoundation.org/en/privacynotincluded/articles/its-official-cars-are-the-worst-product-category-we-have-ever-reviewed-for-privacy/",
      "text": "report"
    },
    {
      "url": "https://www.ftc.gov/news-events/news/press-releases/2026/01/ftc-finalizes-order-settling-allegations-gm-onstar-collected-sold-geolocation-data-without-consumers",
      "text": "order"
    },
    {
      "url": "https://www.fbi.gov/history/famous-cases/willie-sutton",
      "text": "Willie Sutton"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/business/automakers-selling-driving-data-to-insurance",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/business/automakers-selling-driving-data-to-insurance",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9c007bbf7393b37553392b249d049203f0477cb7de85c1c0759f1e35448ffa5c",
  "scraped_at": "2026-02-20T07:29:14.288972+00:00"
}