{
  "url": "https://lite.cnn.com/2026/02/20/us/evidence-nancy-guthrie-investigation-vis",
  "title": "Tracking the evidence in the Nancy Guthrie investigation | CNN",
  "date": "2026-02-22T07:11:33.238709+00:00",
  "authors": [
    "Chelsea Bailey",
    "Way Mullery",
    "CNN"
  ],
  "text": "Source: CNN\n\nIt’s been nearly three weeks since Nancy Guthrie vanished from her secluded Tucson, Arizona, home in the dead of night, and investigators say they are no closer to identifying a leading theory or motive behind her abduction.\n\nThe saga has become a waking nightmare for Guthrie’s family, with her daughter, “Today” show host Savannah Guthrie, posting a series of increasingly heartbreaking pleas on social media for her mother’s abductors to “do the right thing” and bring Guthrie home.\n\nA private donor is backing anew $100,000 rewardfor information leading to the arrest of Guthrie’s captors. Meanwhile, the Pima County Sheriff’s Department and the FBI have increased their rewardto $100,000.\n\nInvestigators are facing mounting pressure to piece together the fragmented puzzle of evidence they’ve gathered. From chilling surveillance footage and alleged ransom notes to DNA and a collection of gloves, here’s a look at what we know about the evidence in the investigation:\n\nIn perhaps the biggest break in the case so far, investigators on February 10 released surveillance footage and images recovered from Guthrie’s doorbell camera.\n\nThe Nest camera was reported missing after Guthrie’s abduction, but investigators partnered with Google, which owns the camera company, to recover some of the data.\n\nThe grainy video shows a man in a ski mask approaching Guthrie’s front door and attempting to cover her doorbell camera with a gloved hand. He then walks off the porch and picks up shrubbery to try to cover the lens.\n\nThe FBIlater describedthe person as the “suspect in the kidnapping of Nancy Guthrie.” The agency said the man is approximately 5-foot-9 to 5-foot-10 tall with an average build.\n\n“We hope this updated description will help concentrate the public tips we are receiving,” the FBI Phoenix office said.\n\nSavannah Guthrie latershared the footageon her social media accounts with the caption, “someone out there recognizes this person.”\n\n“We believe she is still out there,” she writes, “Bring her home.”\n\nIn the footage and images released by the FBI, the suspect appears to have a gun holstered near the center of his waist –an unusual position– and is seen wearing a backpack with reflective straps.\n\nThe FBI later said the backpack he’s wearing is a black, 25-literOzark Trail Hiker Pack.\n\nThe Pima County Sheriff’s Department told CNN the backpack is only sold at Walmart, and investigators are working with the retailer to gather more information.\n\nAs they searched the area around Guthrie’s home, investigators recoveredmultiple gloves.\n\nBut, a glove found about two miles from the house appeared to visually match the ones worn by the suspect, according to the FBI. Authorities took DNA samples from the glove and ran it through the national database known as CODIS, which compares a DNA sample against the profiles of more than 19 million known offenders.\n\nBut it did not return any matches.\n\nAuthorities have not determined if the glove is connected to the kidnapping.\n\nInvestigators say they have also recovered DNA from Guthrie’s property that doesn’t match the 84-year-old or anyone close to her. Although they have not disclosed where the DNA was recovered, they’ve said they’re still working to find a match.\n\nAfter the DNA on the glove failed to return a match in CODIS, investigators will likely turn to the growing field of genetic genealogy – which has led to breakthroughs in several high-profile cases, including Bryan Kohberger and the Gilgo Beach murders.\n\nGenetic genealogy capitalizes on the popularity of consumer DNA products to compare a forensic DNA sample against the profiles in the databases of private companies, like Ancestry. Even if the suspect has never personally used an at-home DNA service, a family member may have, and this can unlock clues to their identity.\n\nThroughout the investigation, multiple media outlets have received purported ransom notes from people claiming to be Guthrie’s captor. While authorities have not said whether the ransom notes are authentic, investigators have said they are taking them seriously.\n\nDays after Guthrie went missing, TMZ was among the first to report on an initial note demanding millions of dollars in Bitcoin for her safe return. According to the outlet’s founder,Harvey Levin, the note began by saying Guthrie was “OK, but scared.”\n\nLevin said the letter included one detail that has not been reported: the placement of Nancy Guthrie’s Apple Watch. The note also included two deadlines. The same letter was also sent to local CNN affiliates KOLD and KGUN.\n\nKOLD later reported asecond notehad been sent to its tip email and shared with investigators.\n\nA manhas also been chargedwith sending a fake ransom threat in connection with the case. The FBI said he was “trying to profit” from the case and there was “no evidence to connect” him to her disappearance.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://88crime.org/pcso-nancy-guthrie/",
      "text": "new $100,000 reward"
    },
    {
      "url": "https://www.fbi.gov/wanted/kidnap/nancy-guthrie/@@download.pdf",
      "text": "to $100,000"
    },
    {
      "url": "https://x.com/FBIPhoenix/status/2022084453699350981",
      "text": "later described"
    },
    {
      "url": "https://www.instagram.com/p/DUlnfdsEWAL/?hl=en",
      "text": "shared the footage"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/us/video/firearms-expert-analyzes-masked-subjects-gun-and-holster-in-nancy-guthrie-disappearance-lcl",
      "text": "an unusual position"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-news-updates-02-15-26#cmlo8iusj0000356pdwe12edx",
      "text": "Ozark Trail Hiker Pack"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-news-updates-02-16-26?post-id=cmlonfpb400003b6p3rcty134",
      "text": "multiple gloves"
    },
    {
      "url": "https://www.cnn.com/us/live-news/savannah-guthrie-mom-nancy-missing-02-06-26?post-id=cmlatf5k900003b6pzns5o5cn",
      "text": "Harvey Levin"
    },
    {
      "url": "https://www.cnn.com/us/live-news/savannah-guthrie-mom-nancy-missing-02-06-26?post-id=cmlbeimhj00053b6pod6dslw6",
      "text": "second note"
    },
    {
      "url": "https://www.cnn.com/us/live-news/savannah-guthrie-mom-nancy-missing-02-06-26?post-id=cmlbglasq0000356p3p8yau2d",
      "text": "has also been charged"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/evidence-nancy-guthrie-investigation-vis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/evidence-nancy-guthrie-investigation-vis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9c198cc518024519fe94c907155c2833b4d32b8b500a1adba77f52d5adf44a19",
  "scraped_at": "2026-02-22T07:11:33.238724+00:00"
}