{
  "url": "https://lite.cnn.com/2026/02/12/politics/carrie-prejean-boller-religious-liberty-commission-removed",
  "title": "Chair of Trump’s Religious Liberty Commission removes member after heated hearing on antisemitism | CNN Politics",
  "date": "2026-02-12T21:30:28.771451+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe chairman of President Donald Trump’s Religious Liberty Commission said Wednesday that he ousted a member of the commission after she sparred with fellow members during a contentious public hearing on antisemitism.\n\nTexas Lt. Gov. Dan Patrick, who chairs the commission,said on Xthat it was his call to remove Carrie Prejean Boller, a former Miss California USA, after tense exchanges during the hearing Monday over what constitutes antisemitism in the US.\n\nBoller, during the hearing, defended conservative commentator Candace Owens, who hasboosted conspiracy theoriesandembraced antisemitic rhetoricto her millions of online followers.\n\n“Carrie Prejean Boller has been removed from President Trump’s Religious Liberty Commission,” Patrick said. “No member of the Commission has the right to hijack a hearing for their own personal and political agenda on any issue. This is clearly, without question, what happened Monday in our hearing on antisemitism in America. This was my decision.”\n\nBoller challenged Patrick’s authority to oust her,insisting on X, “As the name states, this is President Trump’s Religious Liberty Commission, not yours. You did not appoint me to the Commission, and you lack authority to remove me from it. This is a gross overstepping of your role and leads me to believe you are acting in alignment with a Zionist political framework that hijacked the hearing, rather than in defense of religious liberty.”\n\nCNN has reached out to the White House and the commission to confirm that Boller has been removed from the commission.\n\nDuring the hearing, Boller argued that Owens is not antisemitic.\n\n“I haven’t heard one thing out of her mouth that I would say is antisemitic,” she said.\n\nThe hearing featured multiple witnesses, including first-hand accounts of students and others who said universities failed to protect Jewish students amid pro-Palestinian protests during the Israel-Hamas war in Gaza,the Associated Press reported.\n\nSeth Dillon, CEO of the conservative satirical site The Babylon Bee, which routinely lampoons progressives, was there to testify that conservatives need to push back against a growing antisemitic movement on the right, according to the AP.\n\nBoller challenged him, questioning whether critics of Israel should be considered antisemitic, the AP said. Dillon said no, but that context matters. There are “people who try to conceal their antisemitism under the guise of merely criticizing Israel,” he said.\n\nShe also disputed Dillon’s criticisms of Owens.\n\n“You should look up more of her statements,” Dillon said, citing such things as Owens saying her critics were “of the synagogue of Satan.”\n\nPresident Trump created the commission last year and charged it with “exploring the foundations of religious liberty in America,” and “identifying current threats to domestic religious liberty.”\n\nLate Wednesday night, Boller was still listed as a member of the commissionon the White House’s website.\n\nThe commission is the subject of a new federal lawsuit this week from progressive religious groups, according to the AP. The suit says the panel fails to represent diverse views and religions and consists almost entirely of conservative Christian members.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/DanPatrick/status/2021600879703478438",
      "text": "said on X"
    },
    {
      "url": "https://www.cnn.com/2025/12/16/politics/candace-owens-erika-kirk-podcast",
      "text": "boosted conspiracy theories"
    },
    {
      "url": "https://www.cnn.com/2024/03/22/media/candace-owen-out-ben-shapiro-daily-wire-anti-semitism",
      "text": "embraced antisemitic rhetoric"
    },
    {
      "url": "https://x.com/CarriePrejean1/status/2021728963572404534?s=20",
      "text": "insisting on X"
    },
    {
      "url": "https://apnews.com/article/trump-religious-liberty-commission-antisemtism-0cbdc1f1aa62286aa7688495555b0aa5",
      "text": "the Associated Press reported."
    },
    {
      "url": "https://www.whitehouse.gov/briefings-statements/2025/05/president-trump-announces-religious-liberty-commission-members/",
      "text": "on the White House’s website"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/carrie-prejean-boller-religious-liberty-commission-removed",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/carrie-prejean-boller-religious-liberty-commission-removed",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9c21394afee9ea7b05e854e0d82853d74caf9fe6170b0648c00ca2416830aee7",
  "scraped_at": "2026-02-12T21:30:28.771465+00:00"
}