{
  "url": "https://lite.cnn.com/2026/02/25/us/lausd-fbi-search-warrants-alberto-carvalho",
  "title": "FBI is serving search warrants at the LAUSD’s headquarters and superintendent Alberto Carvalho’s home | CNN",
  "date": "2026-02-26T07:31:08.224453+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nThe FBI served search warrants Wednesday at the Los Angeles Unified School District’s headquarters and the home of its leader, a former Superintendent of the Year who was knighted by Spain for his work.\n\nFederal officials would not give details of the nature of the investigation involving the nation’s second-largest school district andSuperintendent Alberto Carvalho’s home. The district said in a statement that it “is cooperating with the investigation and we do not have further information at this time.” The FBI also searched a third location near Miami, where Carvalho previously led the public schools.\n\nTV news footage showed agents in FBI shirts and jackets outsideSuperintendent Alberto Carvalho’s modest home in the San Pedro neighborhood about 20 miles south of downtown Los Angeles.\n\nRukelt Dalberis, a spokesperson for the FBI’s Los Angeles field office, confirmed agents were at the properties to serve warrants but declined to comment further because affidavits laying out details for the basis for the searches were under seal.\n\nOver the past five years in Los Angeles, Carvalho has been lauded for the district’s improvements to academic performance. He won similar praise while overseeing Miami-Dade County Public Schools, Florida’s largest school district, where the national superintendents association named him Superintendent of the Year in 2014.\n\nBut both districts also drew scrutiny under his watch.\n\nIn 2024, Carvalho heavily touted an education technology company that developed an AI chatbot named “Ed” for the Los Angeles district to help students, calling it “a game changer.” But less than three months after unveiling the technology and paying the company $3 million, the district dropped its dealings with AllHere, which collapsed into bankruptcy. Months later, founder, Joanna Smith-Griffin, was charged with securities and wire fraud, along with identity theft.\n\nCarvalho denied personal involvement in the selection of AllHere, according to the Los Angeles Times. After Smith-Griffin was indicted, Carvalho said he would appoint a task force to examine what went wrong with the LAUSD project. There have been no announcements of any task force being appointed.\n\nDuring his tenure in Florida, Carvalho also drew scrutiny in 2020 after a nonprofit he founded solicited a $1.57 million donation from an online education company the district was planning to use but later dropped. The district’s inspector general determined the donation didn’t violate state or district ethics policies but did create the “appearance of impropriety” and should be returned. The nonprofit instead distributed the donation to Miami-Dade teachers in$100 gift cards.\n\nSpain knighted the Portugal-born administrator in 2021 for his work in expanding Spanish-language programs for Miami-Dade County schools.\n\nMonths later, Carvalho took the job in California and became a harsh critic of the Trump administration’s aggressive immigration crackdown, especially followingraids in Los Angeleslast year. When its 500,000 students returned to classes in the fall, Carvalhourged immigration authoritiesnot to conduct enforcement activity within a two-block radius of schools.\n\n“I would be the biggest hypocrite in the world, regardless of my position today, if today I did not fight for those who find themselves in the same predicament I faced over 40 years ago when I arrived in this country at the age of 17 as an undocumented immigrant,” Carvalho said at a news conference last year.\n\nCarvalho arrived in Los Angeles at a critical moment, as the district found itself flush with funding from state and federal Covid-19 relief money but still struggling with the impacts of the pandemic, including learning losses and declining enrollment. He previously sparred with Florida Republican Gov. Ron DeSantis over his order that schools not require masks during the pandemic.\n\nThe Miami-Dade school system said in a statement that it was aware of the investigation involving Carvalho but did not have any comment at this time.\n\nJames Marshall, an FBI spokesman in Miami, told the AP that agents searched a residence in Southwest Ranches, which is in Broward County west of Fort Lauderdale, on Wednesday morning and “have since cleared the scene.” He said no further information was available.\n\nWednesday’s search is the second time in a week the Justice Department has taken action against the Los Angeles school district. On February 19, the Trump administration joineda lawsuitalleging the district discriminates against White students under its decades-olddesegregation policy.\n\nLos Angeles Mayor Karen Bass’s office said it had no information about the search, noting the public school system operates independently of city government.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://superintendent.lausd.org/",
      "text": "Superintendent Alberto Carvalho"
    },
    {
      "url": "https://superintendent.lausd.org/",
      "text": "Superintendent Alberto Carvalho"
    },
    {
      "url": "https://www.miamidadeig.org/resources-oig/pdf/2021-MDCPS/2021-06-29-review-K12-foundation-new-education-initiatives.pdf",
      "text": "appearance of impropriety"
    },
    {
      "url": "https://mca.dadeschools.net/AuditCommittee/AC_July_19_2022/Item11%28c%29.pdf",
      "text": "$100 gift cards"
    },
    {
      "url": "https://www.cnn.com/2025/08/14/us/los-angeles-schools-immigration-crackdown-fears",
      "text": "raids in Los Angeles"
    },
    {
      "url": "https://www.cnn.com/2025/08/14/us/los-angeles-schools-immigration-raids-fears",
      "text": "urged immigration authorities"
    },
    {
      "url": "https://apnews.com/article/los-angeles-schools-lawsuit-discrimination-1776-project-da1c0137c236af59d396a675021524f5",
      "text": "a lawsuit"
    },
    {
      "url": "https://integration.lausd.org/apps/pages/index.jsp?uREC_ID=4407108&type=d&pREC_ID=2635586",
      "text": "desegregation policy"
    }
  ],
  "hash": "9c80c17b1c7391b0d6a13b7b6822f24359400adb0467172e1e61d0d7f94b217d",
  "scraped_at": "2026-02-26T07:31:08.224464+00:00"
}