{
  "url": "https://lite.cnn.com/2021/11/09/entertainment/margins-of-error-podcast",
  "title": "What my uncle Neil Sedaka taught me about hit making | CNN",
  "date": "2026-02-28T06:59:04.654173+00:00",
  "authors": [
    "Analysis by Harry Enten"
  ],
  "text": "Source: CNN\n\nA few months ago, I was listening to the radio in the car with my buddy Noam. He said to me, “Your uncle is far more respected in the music industry than” — and he named the artist on the radio.\n\nMy uncle isNeil Sedaka. I won’t tell you who the other artist he mentioned was,but he’s someone with many number one hits in the 1970s and has a nickname for his fans.\n\nMy moment with Noam was game changing for me, even though have known for a long time that the man I know as Uncle Neil was famous. I can recall seeing gold and platinum records lining his apartment. There are photos of Uncle Neil with the guy with big sunglasses in his kitchen. Not to mention that I’ve been backstage at a few concerts.\n\nStill, I hadn’t realized how rare his success was, so I decided to talk with my Uncle Neil and look into how his career illustrates the overall arc of the changing music industry.You can listen to our conversation on this “Margins of Error” podcast.\n\nSome of the younger people reading this may not know who Uncle Neil is. You might confuse him with Neil Diamond or even Neil Young, but I bet most of you will have heard the phrases “love will keep us together” or “breaking up is hard to do.” Those were both number one songs in this country, and Uncle Neil wrote the music for both of them.\n\nUncle Neil is considered so timeless that he was asked to guest host on season two of “American Idol” in 2003. Soon after, contestant Clay Aiken charted with Uncle Neil’s “Solitaire” making him one of a few artists to chart in the top 20 of the Billboard Hot 100 five decades (1950s, 1960s, 1970s, 1980s and 2000s).\n\nBut what makes Uncle Neil so rare is that he both wrote and sung most of his top hits. He’s one of only about 80 artists to have partially written and sung at least three No. 1 songs on the Billboard Hot 100.\n\nAnd as the “American Idol” appearance hints at, Uncle Neil was able to transcend pop trends and reach success across wildly different musical eras. He’s one only of about ten artists to have three No. 1 hits that he sung and wrote with more than a dozen years in-between his first and last No. 1 hit.\n\nYou probably recognize some of the other names on that list like Madonna, Mariah Carey, Elton John and Janet Jackson.\n\nIndeed, Uncle Neil wasn’t just about length, but about depth. From 1959-1963, he became the second best-selling artist next to Elvis Presley. Uncle Neil knew he was on top of the world when he saw his first number one hit (the aforementioned “Breaking Up Is Hard To Do”) on the Billboard Hot 100.\n\nBut the current music industry is very different.There are now more Billboard charts than we can count. In my Uncle’s heyday, you listened to songs on a record or over the radio; there are so many options at our fingertips now.  All you need to do is press a piece of glass.\n\nAccording to Will Page, a former Chief Economist at Spotify, as of 2021, there are over 75,000 songs a day being released via streaming and over 70 million songs available to us at any time because of streaming.\n\nThese numbers are rapidly changing and are far different than back in the day.\n\nIn the 1970s, at place like Tower Records, you’d have about 40,000 albums to choose from.\n\nThe way we view success for today’s artists are much more varied than they were 65 years ago when Uncle Neil was getting his start.\n\nIs a song a hit if it is trending on YouTube? What if it becomes associated with a Tik-Tok meme?  The idea of radio plays and selling songs just doesn’t hold the same water as it used to.\n\nPut another way, they don’t always reflect the wider cultural issues and conversations that are happening.\n\nIf the Billboard Hot 100 was Uncle Neil’s “bible” of success, what are the guideposts today? Are there any?\n\nYou’ll have totune into find out.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/27/entertainment/neil-sedaka-death",
      "text": "Neil Sedaka"
    },
    {
      "url": "https://www.cnn.com/audio/podcasts/margins-of-error/episodes/5eef1e2c-418c-4d32-a68f-add6014ce285",
      "text": "You can listen to our conversation on this “Margins of Error” podcast."
    },
    {
      "url": "https://www.cnn.com/audio/podcasts/margins-of-error/episodes/5eef1e2c-418c-4d32-a68f-add6014ce285",
      "text": "tune in"
    }
  ],
  "hash": "9cd20f841f2b54006b308d1f995ce89e438de699eb32001157500fb9c10b1b8a",
  "scraped_at": "2026-02-28T06:59:04.654185+00:00"
}