{
  "url": "https://lite.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
  "title": "California avalanche: Treacherous conditions stall the recovery of ski group’s bodies near Lake Tahoe | CNN",
  "date": "2026-02-20T07:27:53.477969+00:00",
  "authors": [
    "Elizabeth Wolfe",
    "Chris Boyette",
    "Cindy Von Quednow",
    "CNN"
  ],
  "text": "Source: CNN\n\nEight close friends and experienced skiers had long planned a backcountry trip in the rugged Sierra Nevada Mountains, but their trek ended in tragedy as a football-field-sized crush of snow and ice overtook their tour group.\n\nA skier cried “avalanche!” in the remote stretch of the Sierra Nevada Mountains, but the group was soon overcome by the deluge Tuesday.\n\nSix of those friends, mothers and wives, are now counted among nine killed or presumed dead in theavalanche near California’s Lake Tahoe. Identified in a statement by their families as Carrie Atkin, Liz Clabaugh, Danielle Keatley, Kate Morse, Caroline Sekar and Kate Vitt, the women were described as passionate skiers who cherished their time together in the mountains.\n\nThey were experienced in the backcountry conditions, were prepared for the rough travel and had avalanche safety equipment, according to the statement. They also weren’t alone, in a group of 15 total including four experienced guides.\n\nBut the conditions that day proved to be severe. While two of the friends and four other survivors were rescued from the “horrific” aftermath Tuesday, the family members of nine others in the group received devastating news. The bodies of eight had been left on the icy mountainside, and one other was still missing, presumed dead among the blanket of snow.\n\n“We are devastated beyond words,” the families’ statement read. “We are heartbroken and are doing our best to care for one another and our families in the way we know these women would have wanted.”\n\nSekar and Clabaugh were sisters, their brother toldThe New York Times, who said he was wounded to have lost both of them.\n\n“These are two of the best people I’ve ever known,” McAlister Clabaugh told the newspaper. “They were incredible sisters, mothers, wives and friends. And the idea that they are both gone is, I don’t even know how to put it into words.”\n\nThe six friends lived in the Bay Area, Idaho, and the Truckee–Tahoe region, the statement said.\n\n“Our hearts go out to those that lost their lives and a community of skiers, a community of families from the Bay Area,” California Gov. Gavin Newsom said Thursday.\n\nNewsom noted his wife has a connection to some of the victims. “Turns out a lot of mutual friends in Marin County. Just learning some of my wife’s old family friends,” he said.\n\n“I’ve been in that area many, many times. Stayed in those cabins just a year or so ago, and very mindful of the terrain and the nature of this,” Newsom added, referring to huts the group stayed in during the trip.\n\nThe deadliest avalanche in California’s recorded history has drawn rescue and recovery resources from as far as Los Angeles — about 500 miles away.\n\nIncident response teams are waiting for a break in the storm when they may safely trek back to the rough terrain, which officials described as “vertical in nature,” to bring home the bodies.\n\n“Due to hazardous weather conditions, avalanche victims cannot be safely extracted off the mountain today. Recovery efforts are expected to carry into the weekend,” the Nevada County Sheriff’s Office said in an update on Thursday.\n\n“We’re kind of at the will of Mother Nature at this point,” Placer County Sheriff Wayne Woo said at a news conference on Wednesday.\n\nCrews face the ongoing threat of additional avalanches on Thursday with over a foot of snow in the area. Sustained winds reaching up to 20 mph, punctuated with even stronger gusts, will whip up snow and limit visibility, hampering teams’ ability to navigate the mountainside.\n\n“Extreme weather conditions, I would say, is an understatement,” Nevada County Sheriff Shannan Moon said on Wednesday.\n\nThe battering snow is expected to subside Thursday night, offering rescuers a reprieve on Friday and the weekend.\n\nEven on a good day, the area is not for the inexperienced.\n\n“It’s a very remote, rugged area on the north side of the highway there. It is not a groomed area or a ski resort area. This is a backcountry area,” Moon said.\n\nAs a result of the avalanche, the Tahoe National Forest closed all lands and trails in the Castle Peak areauntil March 15, forest officials announced Thursday.\n\n“Due to the current instability of the snowpack and need to prioritize first responder access to the area, members of the public are prohibited from entering the closure area,” officials said in asocial media post.\n\nFifteen people were on the guided trip this week, officials said. Blackbird Mountain Guides, the tour company that organized the trip, said six clients and three guides are among those killed, while five clients and one guide survived the avalanche.\n\nOne of the people killed was the spouse of a Tahoe Nordic Search and Rescue team member, making the search and recovery effort particularly wrenching for their personnel, Woo said.\n\nSome of the victims were also members of the Sugar Bowl Academy community, the private school and US Ski and Snowboard club said in a statement.\n\nThe survivors consist of four men and two women; those confirmed and presumed dead include seven women and two men, Moon said.\n\nThe Blackbird Mountain Guides group had spent three days traversing Castle Peak’s wild terrain and staying in huts near Donner Summit — an area that before 2020 was closed to the public for nearly a century.\n\nAs the group made their way back to civilization Tuesday morning, one of the skiers spotted an oncoming avalanche, said Nevada County sheriff’s operations Capt. Rusty Greene, citing a survivor’s account.\n\nMoon said the avalanche wasclassifiedas a 2.5 on a five-level scale that measures the destructive potential of moving avalanche debris.\n\n“A two would bury a person. A three would bury a house, and it’s right in the middle of those two,” Moon told CNN.\n\nThe snowpack the skiers had been traveling on had a weak layer that had been loaded up with snow, making conditions ripe for an avalanche, according to Chris Feutrier, USDA forest supervisor for the Tahoe National Forest. The area was under the second-highest level, a 4 of 5, of an avalanche threat Tuesday.\n\nAt 11:30 a.m., the Nevada County dispatch center received a 911 call reporting the avalanche, Moon said. Though dozens of search and rescue personnel swarmed to the area, it would take crews several hours to reach the group in “horrific” conditions, she said.\n\n“Lots of snow, gale force winds, winds making it impossible to see,” Moon said of the conditions. For their own safety, rescue crews had to proceed at a “slow and steady pace.”\n\nAs the surviving skiers — some of whom were injured — waited, they scrambled to form a makeshift shelter and stay warm, Moon said. They also attempted to find the rest of their group, and were able to locate three bodies before rescuers arrived.\n\nBefore rescue units arrived on the scene, they knew at least six people had survived. The surviving group had been communicating with them via emergency beacons and iPhone SOS signals, Moon said. One of the guides was able to communicate with rescuers by text during the hours crews were trying to reach them.\n\nBy around 5:30 p.m., rescuers were able to reach the avalanche site, Moon said. With no road to the remote scene, they drove as far as they could on a snowcat, a specialized snow vehicle equipped with large treads, before they had to ski the rest of the way.\n\nTwo of the survivors were unable to walk due to their injuries, the sheriff said. Rescuers were able to get them over two miles of snow to the awaiting snowcats.\n\nThe bodies of the skiers killed in the avalanche had to be left behind, authorities explained, as the sheer terrain and extreme weather made it dangerous for first responders to coordinate their removal.\n\nBlackbird Mountain Guides said all four guides on the trip were American Mountain Guides Association trained or certified in backcountry skiing.\n\nThey were also certified instructors with the American Institute for Avalanche Research and Education. The company noted that guides in the field had been in communication with senior guides at their base about conditions and route decisions.\n\nBlackbird said it is still working to understand exactly what happened and that investigations are underway.\n\nThe company suspended all field operations through at least February 22, as it supports families and staff.\n\n“We ask that people following this tragedy refrain from speculating. We don’t have all the answers yet, and it may be some time before we do. In the meantime, please keep those impacted in your hearts,” the company said.\n\nThough survivors made it safely off the mountain, families of the deceased are enduring a dayslong wait to be reunited with their loved ones’ remains. The mission, Moon said, has gone “from a rescue to a recovery.”\n\nAuthorities have been in regular contact with the families, but the Nevada County Sheriff’s Office said Thursday it is unable to confirm the identifications, ages or cities of origin for all of the deceased victims “until the recovery mission is completed.”\n\n“It’s a difficult conversation to have with loved ones,” Moon said Wednesday. “I can’t even imagine the amount of questions and stress that those families are going through right now.”\n\nA community vigil in memory of the victims will be held at 6 p.m. Sunday in downtown Truckee. Additionally, there will be an interfaith service at Church of the Mountains at 5:30 p.m. Monday.\n\n“The best thing we can do is surround our athletes and families with care and support while providing the necessary space and time for grief and healing,” Stephen McMahon, executive director of the Sugar Bowl Academy, said.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "avalanche near California’s Lake Tahoe"
    },
    {
      "url": "https://www.nytimes.com/2026/02/19/us/tahoe-avalanche-victims-sisters.html",
      "text": "The New York Times"
    },
    {
      "url": "https://www.fs.usda.gov/r05/tahoe/alerts/castle-peak-avalanche-closure?fbclid=IwY2xjawQEb09leHRuA2FlbQIxMABicmlkETJEVDUwS0luM0QwRmZNSDM0c3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHlYvowvmoJJMpLrMXB3lmLK61GMUwJVejFX-v3ue_8jhAmUJZFluBQ2QnYIq_aem_aLLGP2blkR0Jf7QbsdgyTg",
      "text": "until March 15"
    },
    {
      "url": "https://www.facebook.com/photo/?fbid=1386293883539889&set=a.308275298008425",
      "text": "social media post"
    },
    {
      "url": "https://avalanche.org/avalanche-accidents/#/report/4187d5a2-dbbc-437d-8ac8-8c5dd4d0b1f9",
      "text": "classified"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9cf1b349dd28e10f7ae1edea88e297235dc3ebd7ac24e00bbff51e01df0d0398",
  "scraped_at": "2026-02-20T07:27:53.477985+00:00"
}