{
  "url": "https://lite.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
  "title": "A stronger-than-expected jobs report could signal a labor market turnaround – with caveats | CNN Business",
  "date": "2026-02-12T21:31:13.438048+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nUS job growth washistorically weak last year. And US job growth was significantly stronger than expected at the start of this year.\n\nIn the January jobs report released Wednesday – a Schrödinger’s cat of employment snapshots – the seemingly opposed dynamics both held true.\n\nThe US economy added an estimated 130,000 jobs last month, and the unemployment rate ticked down a tenth of a percentage point to 4.3%, according to new Bureau of Labor Statistics data.\n\nThat’s far stronger than the 75,000 net gain economists had projected, and it’s only 51,000 jobs shy of the entirety of the jobs created in 2025, BLS data shows.\n\nJanuary jobs reports aretypically among the most complex: There’s usually some seasonal post-holiday employment quirks, and it’s also a time when the BLS does a statistical fine tuning that can deeply reshape the view of past years’ labor markets.\n\nBut even so, this complicated and noisy jobs report provided a touch of clarity about what this year could bring to US households and the broader economy.\n\n“The labor market appears to be stabilizing,” Heather Long, chief economist with Navy Federal Credit Union, told CNN. “That’s the first step to recovery.”\n\nJanuary marked the strongest month of job creation since December 2024.\n\nHealth care and social assistance drove the lion’s share of last month’s employment gains, with an estimated 123,500 jobs added.\n\nThat was followed by the 34,000 jobs gained in professional and business services, including employment services, administrative and other white-collar roles. Construction, likely helped by unseasonably warm weather at the start of the month, added 33,000 jobs.\n\nMany other sectors, notably government (-42,000 jobs), either shed jobs or reported very weak gains.\n\nWednesday’s jobs report also included a slew of data revisions – including an annual benchmarking, a yearly update of seasonal adjustment factors, and a recalibration of how the BLS captures employment changes at new and closed businesses – that showed past job gains were much weaker than initially thought.\n\nNotably, the US economy added just 181,000 jobs in 2025, versus the previously estimated 584,000. That’s the one of the worst years ever for job creation outside of a recession, BLS data shows.\n\nThe annual benchmark revision, which squares the survey-drawn monthly payroll estimates with comprehensive but lagged data from employers’ quarterly tax filings, showed there were 898,000 fewer jobs added between April 2024 and March 2025.\n\nOn a not seasonally adjusted basis, the downward revision was 862,000 – the second-largest negative adjustment on record behind a downward revision of 902,000 in 2009, according toBLS data that goes back to 1979.\n\nSuch large swings, positive or negative, typically occur in times of swift and significant economy change.\n\nThe likeliest contributors to last year’s large swing included declining survey response rates, models that previously didn’t accurately capture jobs created and those lost at new and closed businesses, and misreporting issues (such as counting contract or informal workers or initially reporting more immigrant workers in the surveys than unemployment insurance reports).\n\nThe headline numbers for job gains and unemployment should quell fears that the US labor market is at risk of deteriorating, said Josh Hirt, senior economist at Vanguard.\n\nWith a caveat.\n\n“I don’t think that one should take this report to show that the labor market is reaccelerating at this point,” he added.\n\nThat’s because the underlying dynamics of the labor market haven’t dramatically shifted in one month’s time.\n\nBeneath the surface, the US economy is likely in the throes of a “jobless expansion,” EY-Parthenon economist Greg Daco told CNN.\n\nIt’s also a labor marketin transition.\n\nThere’s a significant amount of pressure being applied on both the demand for labor as well as the supply of workers, he said.\n\nThe combination ofthe Trump administration’s historic deportation pushand the aging of the massive Baby Boomer population means that the economy doesn’t need to add many jobs to keep unemployment steady, Daco said.\n\nThat break-even rate is “very close to zero or potentially in negative territory,” he said.\n\nAt the same time, demand for workers has softened, giving employers the upper hand and putting a squeeze on wage gains.\n\nIncome loss as a result of that is a big worry for lots of families, Daco said.\n\nThat dynamic could land especially heavy in kitchen-table discussions already bogged down by affordability concerns. New data this week showed that agrowing share of Americans are finding it harderto keep up with rising costs and increasingly unwieldy debt loads.\n\nWednesday’s report indicated that the labor market is neither falling apart nor booming, Hirt noted.\n\nRather, he said, it paints a picture of stabilization.\n\nAnd that dynamic could prove critical for US households and the broader economy later this year, he said, adding that the first half of the year could be “somewhat choppy.”\n\nJob creation likely will be softer until more “pro-growth” aspects come into play in the second half of the year, he said.\n\nExpectedlylarger-than-typical tax refundscould juice consumer spending, and with it, the economy; new tax incentives could open up hiring and fuel furtherproductivity-related investments in AIand infrastructure; and there should be an easing in uncertainty and volatility due totrade mattersandother sweeping policy changes, he said.\n\n“We think all of those things should translate into both growth as well as hiring,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/economy/us-jobs-report-final-december",
      "text": "historically weak last year"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/economy/us-jobs-report-january-preview-revisions",
      "text": "typically among the most complex"
    },
    {
      "url": "https://www.bls.gov/web/empsit/cestn.htm#tb5",
      "text": "BLS data that goes back to 1979"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/economy/us-labor-market-outcomes",
      "text": "in transition"
    },
    {
      "url": "https://www.cnn.com/2025/08/24/us/immigration-disappearing-migrants-ice-cec-vis",
      "text": "the Trump administration’s historic deportation push"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "growing share of Americans are finding it harder"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/business/tax-refunds-increase-2026",
      "text": "larger-than-typical tax refunds"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/tech/ai-replacing-jobs-concerns-radiology",
      "text": "productivity-related investments in AI"
    },
    {
      "url": "https://www.cnn.com/2025/12/11/business/global-impact-us-tariffs-trump-intl",
      "text": "trade matters"
    },
    {
      "url": "https://www.cnn.com/politics/immigration",
      "text": "other sweeping policy changes"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9cf6f6f3fb692814b63c5b715ecb9944ae5d1c3c252b467a97427fb28d286109",
  "scraped_at": "2026-02-12T21:31:13.438061+00:00"
}