{
  "url": "https://lite.cnn.com/2026/02/19/politics/trump-attorney-contempt-minnesota-immigration",
  "title": "Minnesota judge holds federal attorney in civil contempt, a first in Trump’s second term | CNN Politics",
  "date": "2026-02-20T07:28:44.019376+00:00",
  "authors": [
    "Devan Cole",
    "Tierney Sneed",
    "CNN"
  ],
  "text": "Source: CNN\n\nA federal judge in Minnesota held a Trump administration attorney in civil contempt for “flagrant disobedience of court orders” in the case of a noncitizen swept up in the immigration crackdown there earlier this year.\n\nThe contempt finding by US District Judge Laura Provinzino on Wednesday appears to mark the first time a federal attorney has faced court-ordered sanctions during President Donald Trump’s second term.\n\nIt comes as judges in the Twin Cities and elsewhere have grown increasingly impatient with the administration’s repeated violations of court orders, particularly in fast-moving immigration cases.\n\nThe appointee of former President Joe Biden said that starting Friday, the lawyer, Matthew Isihara, must pay $500 each day that the immigrant is not given back identification documents that weren’t initially returned to him when he was released last week from an Immigration and Customs Enforcement facility, as she had ordered.\n\nAs Provinzino imposed the sanction, she brushed aside Isihara’s attempt to explain that the violation wasn’t intentional, but instead a result of the case slipping through the cracks amid an “enormous volume of cases” stemming from Operation Metro Surge.\n\n“The government’s understaffing and high caseload is a problem of its own making and absolutely does not justify flagrant disobedience of court orders,” the judge said during a hearing Wednesday, according to a transcript obtained by CNN.\n\n“I don’t believe I need to do additional hand-holding on this. I think it’s clear what needs to happen,” she added. “Petitioner needs to get his documents immediately, and there will be a $500 sanction any day beyond tomorrow that they are not received by his attorney.”\n\nCNN has reached out to the Justice Department for comment.\n\nIsihara is amilitary attorney who went to the Twin Cities to helpthe Justice Department handle a flood of immigration cases brought by noncitizens seeking to be released from ICE custody, which had overwhelmed its team on the ground, leading to non-compliance issues in other cases.\n\nProvinzino on February 9 ordered the government to release the man, a Mexican national who had lived in Minnesota since 2018, after she determined that he was being unlawfully detained. Her order mandated that he be released in Minnesota no later than February 13 and that all his property be handed over to him. But the government flouted that order in three different ways, the judge said, including by releasing him in Texas, where he was being held, and not giving him back his identification documents.\n\n“It’s very troubling, in the court’s review of this record,” the judge said as she ticked through the various violations. She noted later that Isihara and his colleagues hadn’t done any work on the case until that morning.\n\n“It’s a capacity issue, your honor, and that’s the fundamental underlying issue,” Isihara said. “It’s not any willful attempt to defy the court.”\n\nProvinzino and her colleagues on the bench in Minnesota had regularly been threatening to hold Justice Department lawyers or immigration officials in civil contempt in recent weeks as non-compliance issues in dozens of cases stemming from Operation Metro Surge continued to add up. But the monetary sanctions represent a turning point.\n\n“We’ve seen other cases in which district judges have opened more formal contempt proceedings, but this is the first time we’ve seen a court directly use its coercive power to try to compel immediate compliance with a court order,” said Steve Vladeck, CNN legal analyst and professor at Georgetown University Law Center.\n\n“The notion that lawyers must themselves pay a price for their client’s non-compliance with court orders is hardly new, but it may be long overdue in the context of the current administration,” Vladeck added.\n\nIsihara’s explanation to the judge mirrored similar statements made earlier this month by a different Trump administration lawyer who found herself in the hot seat over repeated violations of court orders in immigration cases she was handling in the Twin Cities.\n\nThat lawyer, Julie Le, wasremoved from her post in Minnesotaafter she told Judge Jerry Blackwell the violations were the result of both a personnel shortage and lackluster procedures intended to ensure orders are followed.\n\n“And, yes, procedure in place right now sucks. I’m trying to fix it,” she said. “The system sucks. This job sucks.”\n\nCompliance issues in immigration cases are not limited to Minnesota.\n\nIn Baltimore on Wednesday, a Trump-appointed judge scrutinized claims that federal immigration agencies had violated a 2024 settlement agreement meant to protect some young migrants with pending asylum claims from being deported.\n\nAt least a handful of the young migrants covered by the settlement were deported last year before they were given the opportunity to have their asylum claims heard, as guaranteed by the agreement.\n\nUS District Judge Stephanie Gallagher did not rule from the bench on a request from lawyers for the migrants for the government to be held in civil contempt. Instead, she said she would be scheduling an evidentiary hearing to hear live testimony from Department of Homeland Security officials after a DOJ lawyer was not able to answer her questions about why those migrants were deported.\n\nIn New Jersey, a high-ranking Justice Department official told a federal judge there last week the government had identified more than 50 instances of violations of court orders across hundreds of immigration cases brought in the state since early December.\n\nThe accounting was undertaken by two dozen lawyers with the US Attorney’s Office in New Jersey after Judge Michael Farbiarz found that the government had violated his order in the case of an Indian national challenging his detention. The judge had directed officials to not transfer the man out of New Jersey while his case played out, but he was nonetheless flown to Texas.\n\nThe DOJ official, Jordan Fox, told the judge that many of the violations occurred when a migrant challenging their detention was moved from one facility to another even after a judge had expressly prohibited such a change.\n\nFox said the violations were accidental and due to “logistical delays in communicating the court order” to the relevant ICE officials or “administrative oversight of the court order.”\n\nThe other violations included missing filing deadlines or not giving an immigrant a bond hearing within the timeframe outlined by a judge.\n\nFarbiarz, a Joe Biden appointee, is still weighing what to do in the case of the Indian national, but he made clear Tuesday that he is unhappy with the noncompliance identified by the lawyers.\n\n“This falls below the relevant standards,” he wrote in an order directing the US Attorney’s Office to explain in coming days how it will work to ensure the pattern isn’t repeated. “Judicial orders should never be violated. And they very rarely are, especially not by federal officials.”\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/politics/pentagon-military-lawyers-minneapolis-immigration-crackdown",
      "text": "military attorney who went to the Twin Cities to help"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/prosecutor-job-sucks-minnesota-hold-me-in-contempt",
      "text": "removed from her post in Minnesota"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-attorney-contempt-minnesota-immigration",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/trump-attorney-contempt-minnesota-immigration",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9cf6edb060cff8bd0c87e5332b6e1fedada925dbc167b5e9022015c33a590979",
  "scraped_at": "2026-02-20T07:28:44.019389+00:00"
}