{
  "url": "https://lite.cnn.com/2026/02/26/us/pentagon-shoots-down-cbp-drone",
  "title": "Pentagon shoots down US Customs and Border Protection drone with laser system, lawmakers say | CNN",
  "date": "2026-02-27T07:15:16.789172+00:00",
  "authors": [
    "Pete Muntean",
    "Alexandra Skores",
    "Katherine Dautrich"
  ],
  "text": "Source: CNN\n\nThe US military used a controversial anti-drone laser system to shoot down a unmanned aircraft operated by US Customs and Border Protection in Texas, according to congressional representatives.\n\n“Our heads are exploding over the news that DoD reportedly shot down a Customs and Border Protection drone using a high risk counter-unmanned aircraft system,” three Democrats on the House Committee on Transportation and Infrastructure said in a statement.\n\nIt’s not clear when the shoot-down happened. CNN has reached out to the Department of the Defense and CBP for more information.\n\nAs a result of the incident, the Federal Aviation Administration implemented a temporary flight restriction Thursday evening ﻿above the town of Fort Hancock, Texas, to “ensure safety.”\n\nThe small town is about 50 miles south of El Paso, Texas, along the Mexican border.\n\nThe top Democrat on the House committee Rick Larsen, along with Reps. André Carson and Bennie Thompson were notified of the shoot down Thursday through official channels, a congressional source tells CNN.\n\n“We said MONTHS ago that the White House’s decision to sidestep a bipartisan, tri-committee bill to appropriately train C-UAS (counter unmanned aerial system) operators and address the lack of coordination between the Pentagon, DHS and the FAA was a short-sighted idea. Now, we’re seeing the result of its incompetence,” the statement said.\n\nThe shoot-down comes about two weeks after the use of a military laser system by CBP designed to disrupt drones near El Paso prompted the FAA to abruptly shut down a large swath of airspace up to 18,000 feet over the city for 10 days. The move effectively shut down El Paso airport, but was reversed after about eight hours.\n\nBecause of the location of the new restrictions implemented Thursday they are not expected to have any impact on commercial flights.\n\nThe top Democrat on the Senate Aviation Subcommittee, Tammy Duckworth called for an investigation into the “dysfunction” endangering the nation’s aviation system.\n\n“The situation is alarming and demands a thorough, independent investigation,” the senator said in a statement. “I will be calling on the Inspectors General of the Departments of Defense, Transportation and Homeland Security to launch a joint investigation into the recent scandals in El Paso and now Fort Hancock.”\n\nSee Full Web Article",
  "links": [],
  "hash": "9d1e4fd9c97d349f0b481a23ffc60c61d98d6ff0f365265184e94b6c7f6a44e3",
  "scraped_at": "2026-02-27T07:15:16.789186+00:00"
}