{
  "url": "https://lite.cnn.com/2026/02/18/india/bill-gates-india-summit-keynote-intl-hnk",
  "title": "Bill Gates cancels AI summit keynote address amid scrutiny over Epstein links | CNN",
  "date": "2026-02-19T07:30:35.058047+00:00",
  "authors": [
    "Lex Harvey",
    "Esha Mitra",
    "CNN"
  ],
  "text": "Source: CNN\n\nBill Gates has pulled out of delivering his keynote address at an AI summit in India Thursday, his foundation said, as the billionairefaces scrutinyover his ties to late convicted sex offender Jeffrey Epstein.\n\n“After careful consideration, and to ensure the focus remains on the AI Summit’s key priorities, Mr. Gates will not be delivering his keynote address,” the Gates Foundation said in a statement just hours before he was due to speak.\n\nNo reason was provided for the abrupt withdrawal.\n\nCNN has reached out to the Gates Foundation, the Gates Foundation India and the summit organizers for comment.\n\nThe Microsoft founder hascome under firein recent weeks over two recently released draft emails Epstein appears to have written to himself, in which he claims he facilitated sexual encounters for Gates and helped him obtain medication to hide a sexually transmitted infection from his wife.\n\nIt’s not clear who wrote the draft messages from 2013 saved in Epstein’s email account, but they are addressed from Epstein to himself.\n\nGates has strongly denied these claims as “false.”\n\nThe tech billionaire was due to speak at the AI Impact Summit in New Delhi, billed as one of the biggest AI conferences in the Global South. Indian Prime Minister Narendra Modi inaugurated the summit Thursday morning.\n\nGates has been in India this week ahead of his planned address.\n\nOn Tuesday, Gates met with N. Chandrababu Naidu, the Chief Minister of Andhra Pradesh, according to a post on Gates’X account, which thanked the Indian politician for the “warm welcome.”\n\nGates Foundation India had confirmed Gates’ attendance at the AI Impact Summit just two days ago.\n\n“Bill Gates is attending the AI Impact Summit. He will be delivering his keynote as scheduled,” the organizationposted on XTuesday.\n\nThe foundation said it will now be represented at the summit by Ankur Vora, President of Africa and India Offices, according to the Thursday statement.\n\nThenewly-released trancheof files related to Epstein have cast a fresh shadow over Gates’ ties to the convicted sex offender, revealing a series of graphic, unverified allegations as well as a degree of philanthropic coordination between the two that is more detailed than previously known.\n\nThe emails were made public as part of the Justice Department’s latest release of files involving the notorious sex predator, which have implicated dozens of rich and powerful people around the world.\n\nThe files contain numerous other emails between Epstein and Gates, showing them coordinating meetings and discussing Gates’ philanthropic work. All of the documented interactions with Gates occurred after Epstein’s 2008 conviction on prostitution-related charges.\n\nGates has strongly denied the claims and a representative of Gates, previously telling CNN: “These claims are absolutely absurd and completely false. The only thing these documents demonstrate is Epstein’s frustration that he did not have an ongoing relationship with Gates and the lengths he would go to entrap and defame. While Mr. Gates acknowledges that meeting with Epstein was a serious error in judgment, he unequivocally denies any improper conduct related to Epstein and the horrible activities in which Epstein was involved. Mr. Gates never visited Epstein’s island, never attended parties with him, and had no involvement in any illegal activities associated with Epstein.”\n\nGates wassubsequentlyasked about the latest documents in an interview with CNN-affiliate Nine News in Australia.\n\n“Apparently Jeffrey wrote an email to himself. That email was never sent, the email is you know, false. So I don’t know what his thinking was there. It just reminds me, you know, every minute I spent with him I regret and I, you know, apologize that I did that,” Gates said.\n\nHe added: “It’s factually true that I was only at dinners, you know, I never went to the island. I never met any women. And so, you know, the more that comes out, the more clear it’ll be that although the time was a mistake, it had nothing to do with that kind of behavior.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/kfile-gates-scrutiny-justice-department-documents",
      "text": "faces scrutiny"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/kfile-gates-scrutiny-justice-department-documents",
      "text": "come under fire"
    },
    {
      "url": "https://x.com/BillGates/status/2023509972714496206",
      "text": "X account"
    },
    {
      "url": "https://x.com/BMGFIndia/status/2023659618686431386?s=20",
      "text": "posted on X"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/epstein-files-release-doj-01-30-26",
      "text": "newly-released tranche"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/business/melinda-bill-gates-epstein-reaction-intl-hnk",
      "text": "subsequently"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/india/bill-gates-india-summit-keynote-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/india/bill-gates-india-summit-keynote-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9d5db11abcf00d972c137ccb4746731e0d617771615293fb92c71b973b91108b",
  "scraped_at": "2026-02-19T07:30:35.058062+00:00"
}