{
  "url": "https://lite.cnn.com/2026/02/13/politics/jeffrey-epstein-paleontology-dinocon",
  "title": "Jeffrey Epstein’s interest in dinosaurs has led to a reckoning in the paleontology community | CNN Politics",
  "date": "2026-02-14T07:07:15.898625+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA British dinosaur convention is banning some paleontologists named in theJeffrey Epstein filesfrom attending DinoCon – as the global scientific community becomes the latest to grapple with the convicted sex offender’s connections to prominent people in the worlds of business, politics and academia.\n\n“As a result of the release of half of the Epstein files, it has come to light that a select number of scientists, authors and researchers relevant to the field of palaeontology allegedly engaged in correspondence with members of the Epstein organisation after the conviction of Jeffrey Epstein,” DinoCon said in astatement posted on X. “We want to state that all respective individuals are banned from all of our events.”\n\nDinoCon, which is set to take place in late July in Birmingham, also called on other paleontology organizations to take “firm action” with their membership, saying: “We do not tolerate those who allow this behaviour to go unchallenged within our community.”\n\nThe convention’s stand comes after the Society of Vertebrate Paleontology acknowledged in aFacebook postthis month that the names of some of its members have appeared in the Epstein files, prompting “questions and concern within the broader community.” The society’s executive committee emphasized, however, that “the appearance of a name, or even an email, in released documents does not, in itself, establish wrongdoing.”\n\n“Should credible information emerge that warrants action under our existing policies, we will address it promptly and appropriately,” President Stuart Sumida said. “Until then, we ask that members rely on verified sources and refrain from speculating and demanding action without due process.”\n\nDinoCon’s co-director Nathan Barling said in a statement to CNN, “There are many hundreds of scientists” whose names happen to be mentioned in the millions of documents related to Epstein released by the Justice Department – and that the only those who had direct contact with Epstein after his conviction are banned from the convention.\n\nEpstein, who died in 2019 while awaiting trial on sex trafficking charges, had long been interested inscienceand evolution. He frequently hosted dinners and meetings that brought together high-profile scientists and intellectuals, several of whom pitched the financier on funding their research.\n\nAmong Epstein’s donations: He gave $6.5 million to Harvard University in 2003 to fund its Program for Evolutionary Dynamics, a now-defunct project to understand evolution using mathematics.\n\nSome scientists have sought to disavow their previous ties to Epstein. Among them, a Massachusetts Institute of Technology professorSeth Lloyd, who apologized to Epstein’s victims in 2020 and was placed on administrative leave several years after accepting research donations and a personal financial gift.\n\nLast week, Jack Horner, who served as a technical advisor for the “Jurassic Park” movies and went fossil hunting with Epstein, addressed his associations with the disgraced financier in a statement cited by media outlets and reported in full byKTVQ.\n\n“I was aware that (Epstein) had previously been charged with soliciting a prostitute and had served a sentence, but I was not aware of any additional allegations or misconduct,” Horner said. “I want to make it perfectly clear that I knew nothing more than that! No amount of money in the world would have lured me to meet with a known sexual predator!”\n\n“Regardless, my decision to pursue him as a donor, was extremely poor judgement!” he said.\n\nCNN has reached out to Horner for comment.\n\nAccording to documents released by the DOJ, Horner visited Epstein’s ranch in New Mexico and asked him for funding for a research summit in 2012, years after Epstein had pleaded guilty to state charges of procuring a minor for prostitution and solicitation of prostitution in Florida and became registered as a sex offender.\n\nIn an email to Epstein’s longtime assistant Lesley Groff onAugust 7, 2012, Horner said, “I wanted to thank you for all your help in getting me to Jeffrey’s ranch, it was a lot of fun, and although we didn’t find any dinosaur fossils, we did discover that he has ocean front property, a nice beach with loads of shellfish, potential for marine reptiles, and a really cool old railway.”\n\n“Jeffrey and the girls were very gracious hosts as were [redacted],” Horner added. The paleontologist later said in the email, “Please give my best to Jeffrey and the girls.”\n\nIn his statement last week, Horner says that “the girls” he’s referring to were introduced to him “as college students, two of whom claimed to be adept in genetics.” He added: “There was nothing weird, inappropriate, or out of the ordinary.”\n\n“Nothing I observed or experienced during my short stay at the ranch indicated or suggested the conduct that came to light,” Horner continued. “That said, I regret my use of the term ‘girls’ in emails referring to the students, rather than using more appropriate language. I (now) understand the students may have been victims of Epstein, and I deeply regret that I did not realize this at the time.”\n\nThe possibility of Epstein providing funding support for a summit focused on efforts to reverse engineer dinosaur traits frommodern day birdsappeared to have been discussed during the visit, according to the August 2012 email.\n\nInanother email exchangeon September 1, 2012, Horner sent Groff a proposal of his summit and asked if Epstein could help fund it. Inlate Octoberof that year when the summit was scheduled, Horner sent an email thanking Groff and Epstein for making it possible.\n\nHorner added in his statement, that he visited Epstein’s ranch again in 2016 with a graduate student to look for vertebrate fossils. He says Epstein wasn’t there at the time.\n\nDocuments in the Epstein files also refer to a fossil hunt withRobert F. Kennedy Jr., who is now the secretary of the Department of Health and Human Services. In 2012, Epstein relayed toGhislaine Maxwell, who is now serving a 20-year sentence for sex trafficking minors for Epstein, that he had gone “dinosaur and fossill hunitngwith jack horner on the ranch.”\n\nMaxwell replied: “Love that - didn’t we go fossil hunting with him and Bobby Kennedy in N Dakota?”\n\nEpstein responded, “yes.”\n\nAccording totranscripts released by the Justice Department,Maxwell mentioned the fossil hunting trip during an interview last year with Deputy Attorney General Todd Blanche.\n\n“Bobby knew Mr. Epstein,” Maxwell said, according to transcripts, to which Blanche asked: “How do you know that?”\n\n“Because we went on a trip together. Was – we went to – dinosaur bone hunting in the Dakotas,” she replied.\n\nCNN has reached out to the Department of Health and Human Services for comment.\n\nCNN’s Sarah Owermohle and Dejania Oliver contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Jeffrey Epstein files"
    },
    {
      "url": "https://x.com/DinoConUK/status/2020949932606136337",
      "text": "statement posted on X"
    },
    {
      "url": "https://www.facebook.com/vertpaleo/",
      "text": "Facebook post"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/jeffrey-epstein-genetic-test-joseph-thakuria-harvard",
      "text": "science"
    },
    {
      "url": "https://www.cnn.com/2020/01/10/us/jeffrey-epstein-mit-professor-donation",
      "text": "Seth Lloyd"
    },
    {
      "url": "https://www.kbzk.com/news/local-news/extremely-poor-judgment-horner-responds-to-epstein-email-controversy",
      "text": "KTVQ"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00407150.pdf",
      "text": "August 7, 2012"
    },
    {
      "url": "https://www.gofundme.com/f/making-a-live-dinosaur",
      "text": "modern day birds"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00405668.pdf",
      "text": "another email exchange"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01767484.pdf/",
      "text": "late October"
    },
    {
      "url": "https://www.cnn.com/2025/11/24/health/gold-standard-science-explainer",
      "text": "Robert F. Kennedy Jr."
    },
    {
      "url": "https://www.cnn.com/2025/12/17/politics/maxwell-habeas-corpus-petition",
      "text": "Ghislaine Maxwell"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00941270.pdf",
      "text": "dinosaur and fossill hunitng"
    },
    {
      "url": "https://www.justice.gov/storage/audio-files/Interview%20Transcript/Interview%20Transcript%20-%20Maxwell%202025.07.25-cft%20(Redacted).pdf",
      "text": "transcripts released by the Justice Department,"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/jeffrey-epstein-paleontology-dinocon",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/jeffrey-epstein-paleontology-dinocon",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9d77afa291e070018995a9f40721541ec2462d6f32f48d423467a2589fa27850",
  "scraped_at": "2026-02-14T07:07:15.898639+00:00"
}
