{
  "url": "https://lite.cnn.com/2026/02/16/europe/taylor-swift-vienna-terror-plot-charges-intl",
  "title": "Austria files charges against suspect over planned 2024 Taylor Swift attack | CNN",
  "date": "2026-02-17T07:30:22.761522+00:00",
  "authors": [
    "Story by Reuters"
  ],
  "text": "Source: Reuters\n\nAustrian prosecutors have filed terrorism-related and other charges against a suspect arrested shortly before a 2024Taylor Swiftconcert in Vienna, where they said he planned to carry out an Islamistmilitant attack.\n\nThe Vienna prosecutors’ office plans to bring a criminal case against the 21-year-old suspect in Wiener Neustadt, a town near Vienna, accusing him of producing a small amount of the explosive triacetone triperoxide and attempting to purchase weapons illegally, it said in a statement Monday.\n\nThe statement referred to the suspect’s arrest in August 2024, the same month as three planned Swift concerts were canceled at short notice after Austrian authorities said they had foiled an attack.\n\nThe statement from the prosecutors’ office did not name the suspect, but he was identified by Austrian media as Beran A and is the only person arrested in connection with the planned attack. Beran A’s lawyer was not immediately available for comment but has previously disputed accusations against his client.\n\nThe prosecutors’ statement said the suspect was a member of the Islamic State group and that he is accused of carrying out online research into a type of shrapnel bomb used by that group, and of spreading Islamic State “propaganda material” online.\n\nIf convicted, he faces up to 20 years in prison, the statement added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/entertainment/taylor-swift-opalite-music-video",
      "text": "Taylor Swift"
    },
    {
      "url": "https://www.cnn.com/2024/08/08/europe/isis-inspired-suicide-terror-attack-taylor-swift-vienna-intl",
      "text": "militant attack"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/europe/taylor-swift-vienna-terror-plot-charges-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/europe/taylor-swift-vienna-terror-plot-charges-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9e8fe58e48d1361801426c159dc48c9c1e4561fd02f3deb548b7729ab874aefe",
  "scraped_at": "2026-02-17T07:30:22.761536+00:00"
}