{
  "url": "https://lite.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
  "title": "A snowstorm will hit the East Coast this weekend, but how much snow will fall is still in question | CNN",
  "date": "2026-02-22T07:10:44.089353+00:00",
  "authors": [
    "Meteorologist Chris Dolce, CNN"
  ],
  "text": "Source: CNN\n\nA potent winter storm will impact the Northeast starting on Sunday, but there are still questions about how big its punch of snow and strong winds will be for some areas.\n\nSnow totals and the chances for a more significantbomb cyclonehave been trending up over the last 24 hours, particularly along the coast, as forecast models come into slightly better agreement.\n\nAs a result, the first winter storm watches — calling for 6 inches or more of snow — have been issued. They span from the mid-Atlantic, including Philadelphia, to New York City and coastal southern New England. Possible blizzard conditions are mentioned in the watch for Long Island, New York.\n\nBut models still diverge a bit on the storm’s exact track Sunday into Monday, which will determine if this is a blockbuster nor’easter with heavy snow and damaging winds across the region, or just a major storm closer to the coast with moderate snowfall farther inland.\n\nA shift of less than 100 miles in the storm’s final track could decide which outcome wins out, and although forecast models have come into better agreement since Thursday, there are still enough differences to create anunusually high amount of uncertaintyfor a storm that’s set to begin as soon as Sunday morning.\n\nWe’ll be more confident on the storm’s track and impacts by Saturday, but the trend means you should start preparing for a more impactful storm Sunday night through Monday.\n\nHere are the scenarios that are in play:\n\nThe storm tracks far enough offshore to prevent it from being a major event everywhere but some coastal areas.\n\nStill, at least moderate snow and gusty winds would impact an area from southern New England into the mid-Atlantic Sunday into Monday. That could include Boston, New York City, Philadelphia and Washington, DC.\n\nIn parts of the mid-Atlantic, the precipitation could start as rain until colder air arrives and changes it over to snow.\n\nSnow totals would be about a half-foot or less in most places in this scenario. Those totals would be impactful and are likely to slow down travel, but should be manageable.\n\nThe exception might be along the immediate coast from New Jersey through Long Island and into southeast New England. These areas have the best shot at significant snow and strong winds that could whip up blizzard conditions, making travel more difficult.\n\nTree branches could be snapped and scattered power outages are possible because of heavy, wet snow and the force of strong winds.\n\nAt least minor to moderate coastal flooding is possible with the Sunday night high tide from the Jersey Shore up the coast to southeast New England.\n\nA powerful storm develops close enough to the Northeast coast to deliver major impacts over a widespread area — including from Washington, DC, to New York and Boston.\n\nSnow totals would be much heavier for a larger area in this scenario, easily topping 6 inches, with some possibly seeing a foot or more.\n\nHeavy snow and strong winds would make travel very difficult on roads and at airports beginning Sunday morning or afternoon and lasting through Monday. There’s a solid chance for blizzard conditions in coastal areas.\n\nThe combination of heavy, wet snow and gusty winds might break tree branches and knock out power in spots.\n\nThis scenario would also produce at least minor to moderate coastal flooding from the Jersey Shore to southeast New England with high tide Sunday night or early Monday morning.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2022/12/21/us/bomb-cyclone-xpn",
      "text": "bomb cyclone"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/weather/winter-storm-forecast-models-disagreement",
      "text": "unusually high amount of uncertainty"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9e98d22606bcef94f2469215f1488102d4bf986d253ff3c6c86fa209e495470b",
  "scraped_at": "2026-02-22T07:10:44.089366+00:00"
}