{
  "url": "https://lite.cnn.com/2026/02/20/politics/azerbaijan-president-protesters-guards-attack",
  "title": "Protesters say they were attacked by bodyguards for Azerbaijan president after Trump’s Board of Peace meeting | CNN Politics",
  "date": "2026-02-22T07:10:27.790315+00:00",
  "authors": [
    "Emily R. Condon, CNN"
  ],
  "text": "Source: CNN\n\nProtesters calling for the release of political prisoners in Azerbaijan told CNN they were attacked by security guards protecting the country’s President Ilham Aliyev in Washington, DC on Thursday following President Donald Trumps’s inauguralBoard of Peace meeting.\n\nFootage circulated on social media shows protesters being thrown to the ground as a group of suited men physically apprehend them outside the hotel Aliyev was staying in.\n\nThe demonstrators had gathered outside of the hotel to advocate for political freedom of political prisoners and journalists. They had intended to be peaceful, according to protester Adil Amrakhly, who spoke to CNN via a translator. The incident happened as the group made its way toward Aliyev’s motorcade, which was returning from the Board of Peace event.\n\n“If his (Aliyev’s) security personnel can attack peaceful protesters in the center of Washington, DC, it raises serious concerns about what happens to opposition members and the more than 400 political prisoners currently detained in Azerbaijan,” Amrakhly said.\n\nAmrakhly told CNN the group was waiting near the hotel’s main entrance for Aliyev’s return and ran toward another entrance when they saw his vehicle approach it instead.\n\nA spokesperson for Azerbaijan’s embassy to the US denied the claims, saying that Aliyev’s guards “had no choice” but to respond when “protesters violently attempted to enter the protected area and took offensive actions against the presidential vehicle.”\n\nThey added that the hotel was included in the US Secret Service’s official security perimeter for the event.\n\nAnother protester, Rahim Yagublu, whose father, Tofig Yagublu, is imprisoned in Azerbaijan, told CNN, “We did nothing to (the guards.)”\n\n“The videos clearly show that I was only chanting slogans while they were hitting me,” Yagublu said.\n\nThe Metropolitan Police Department told CNN it is aware of the incident and no arrests were made. The US Secret Service, which was on the scene, declined to comment and has referred the issue to the State Department, according to MPD.\n\nThe State Department did not respond to CNN’s request for comment.\n\nAmrakhly, who lives in Virginia and is an organizer for the Charter of the American Organization of Azerbaijani Political Refugees, said five people were injured, including one person with a concussion. He said some protesters’ family members, who still live in Azerbaijan, experienced political intimidation on Friday, with questioning at police stations and in their workplaces.\n\nYagublu told CNN that he is worried about his father now and fears the Azerbaijani government may torture or kill him in response. Last year, Tofig Yagublu was sentenced to nine years in prison for criticizing the government, according to the advocacy group Freedom Now.\n\nAzerbaijan’s embassy did not respond before publication to comments alleging intimidation against the relatives of the protesters.\n\nThe incident recalls an incident in 2017 during which security officials for Turkish President Recep Tayyip Erdogan beat up protesters outside the country’s embassy in Washington. The US later dropped charges against 11 of the 15 bodyguards who were indicted after the brawl.\n\nCNN’s Anna Chernova contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-launches-his-board-of-peace-with-lofty-pledges-but-questions-remain",
      "text": "Board of Peace meeting"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/azerbaijan-president-protesters-guards-attack",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/azerbaijan-president-protesters-guards-attack",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9ec686dd80ea83067d62112fb84f1262bcc6757a3731fbb905f53abd7a9df32f",
  "scraped_at": "2026-02-22T07:10:27.790330+00:00"
}