{
  "url": "https://lite.cnn.com/2026/02/11/style/milan-cortina-winter-olympics-snoop-dogg",
  "title": "Snoop Dogg’s fashion at the Milan Cortina Winter Olympics 2026 | CNN",
  "date": "2026-02-12T21:31:38.981604+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAfter delighting onlookers with a series of stylish cameos at the Paris Games in 2024, Snoop Dogg is back at the Olympics with a new, slightly more official, job: coach. The gig comes with a fresh wardrobe of looks cooler than the snow-capped Italian alps.\n\nSo far, he’s been spotted draped in a full-length, white fluffy coat and fire engine-red hat and gloves, watching the women’s downhill race, and casually chatting with onlookers at the curling mixed doubles, adorned in a zip-jacket emblazoned with Team USA players’ faces.\n\nWandering the icy streets of Cortina in a furry hat, houndstooth coat and enough swagger to make the snowflake medal hanging from his neck jangle in agreement, Coach Snoop (as one of his beanies reads) appears in his element.\n\nIt’s the first time Team USA has had an honorary coach, a volunteer role that involves Snoop lending “his signature humor and heart to help motivate Team USA athletes,” according to theUS Olympic & Paralympic Committee.\n\nThe rapper-turned-hype man is a longtime sports fan, popping up in sometimes unexpected ways. Last July he became co-owner and investor in the Welsh football club, Swansea City. He was a torch-bearer at the 2024 Paris Games – and did so again at this year’s Winter Olympics. Much like in 2024, Snoop is reprising his role as a special correspondent for NBC, bringing his distinctive bold and flamboyant style and a genuine enthusiasm for whichever sport he happens to be commentating on – or throwing himself into, flailing limbs and all.\n\n“It’s going down in Cortina,” hetold NBCwhile walking the festive streets ahead of the opening ceremony, in sunglasses. “We got the beautiful people, good food, high fashion. I mean, I’m having a blast.”\n\nSo too, it seems, are the people behind his Team USA-themed wardrobe. Scroll on for Snoop Dogg’s most memorable Olympics outfits so far.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.usopc.org/news/2025/december/10/coach-snoop-joins-the-team-behind-the-team-as-team-usa-s-first-honorary-coach",
      "text": "US Olympic & Paralympic Committee."
    },
    {
      "url": "https://www.instagram.com/p/DUcHSU0kfF3/",
      "text": "told NBC"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/style/milan-cortina-winter-olympics-snoop-dogg",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/style/milan-cortina-winter-olympics-snoop-dogg",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9f14de52365b279d9f97f1719a2a68857e8750a560d8424faf76a91d36f26a87",
  "scraped_at": "2026-02-12T21:31:38.981618+00:00"
}