{
  "url": "https://lite.cnn.com/2026/02/12/style/ireland-artists-basic-income-intl-scli",
  "title": "Ireland is paying artists a basic income in a pioneering scheme | CNN",
  "date": "2026-02-12T21:30:04.648102+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Irish government is implementing a pioneering scheme that will give 2,000 artists a basic income for three years, allowing them to focus on their creative output while maintaining an adequate standard of living.\n\nUnder the scheme, which follows a three-year pilot, eligiblecreativeswill receive €325 ($386) a week for three years followed by a period of three months when their income will steadily reduce.\n\nThe income is taxed, but is not contingent on their output, allowing creatives to have a relatively stable income, plan ahead and work fewer other jobs to sustain themselves.\n\nAny type of artist, from writers, visual artists and actors to musicians, make-up designers and directors, will be eligible to apply.\n\n“It’s a fundamental change,” said Peter Power, an artist, musician and designer who sits on the steering committee of the National Campaign for the Arts, which lobbied for the scheme.\n\n“It changes your relationship with banks, landlords, savings,pensions. The fundamental architecture of being a secure citizen becomes available to you… it’s hard to put a metric on that,” he told CNN.\n\nFor artists like Aisling O’Mara who were lucky enough to make it onto the pilot scheme, the basic income offered a lifeline and a way to remain in the creative industries. It was “life changing,” she told CNN Wednesday, particularly because she discovered she was pregnant around the same time she was accepted onto the scheme.\n\nWithout it, “I don’t think it would be feasible for me and my daughter to continue living the way we are, and I don’t think it would have been possible for me to still be in this industry,” she said.\n\n“The thing about acting is you need to give it time, you need to be able to put time into your auditions… you need to prep for these things,” she added.\n\nHer career, which she balances with teaching work, flourished while she was on the scheme and she is now playing the lead role in a theatrical adaptation of Katriona O’Sullivan’s bestselling memoir “Poor.”\n\nStill, she is acutely aware of the financial instability even successful actors face. “I have friends in their 40s who are hugely successful in the industry couch surfing… that is wild to me.”\n\nNot every artist will receive a basic income under the government’s new policy. More than 8,000 eligible artists applied for the original pilot scheme but only a quarter were randomly selected to participate.\n\nAnd there is a time limit to the income too, meaning that creatives like O’Mara will have to recalibrate once their three years come to an end. They will be ineligible to apply for the next funding cycle, and have to apply for the chance to receive the basic income again, three years later.\n\n“We all want a society that’s fair for everybody but for now there’s a limit,” said Power. “This is an entirely new branch of funding, of ideology around how art is valued culturally and socially. This is new, we have to see this as a first step.”\n\nWhen asked what support was available for artists in between these funding cycles, a spokesperson for the Department for Culture, Communications and Sport told CNN that “record funding over €140 million ($167 million) has been provided for the Arts Council in 2026 which is an increase of 75% since 2020.”\n\nThey did not say whether the scheme would be expanded in the future.\n\nMost pilot schemes testing different forms of universal basic income never make it past the trial stage.\n\nBut, Power says, the success of the pilot combined with the unique place the arts have in Irish culture, especially in the wake of the Covid-19 pandemic, allowed this policy to reach a more permanent form.\n\nThe Department for Culture, Communications and Sport said an independent cost-benefit analysis found that, for every €1 invested, society received the equivalent of €1.39 in economic and social benefits back.\n\n“We have a complex relationship with our own heritage, our own history, our own voice as a culture, our own language, our own art,” Power said. “A lot of where we find value as a culture resides in storytelling, resides in making art.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/07/18/style/female-artists-breaking-the-mold",
      "text": "creatives"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/style/ireland-artists-basic-income-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/style/ireland-artists-basic-income-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9f4627655baf40369895b3a1cc7e7da5944103afc6b7e817841aa0aeaf9c9b2a",
  "scraped_at": "2026-02-12T21:30:04.648116+00:00"
}