{
  "url": "https://lite.cnn.com/2026/02/10/europe/ukraines-railway-russia-target-intl",
  "title": "Russia targets another critical part of Ukraine’s infrastructure: Its railways | CNN",
  "date": "2026-02-11T16:32:58.745825+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIn the midst of a blizzard sweeping across central Ukraine last month, Iryna Vlasenko had a dilemma.\n\nShe needed to get her 7-year-old daughter, who was seriously ill, to a children’s hospital in Kyiv. But she couldn’t get to the main railway station in Khmelnytskyi, more than 300 kilometers (more than 180 miles) from the capital.\n\nSo shetextedUkraine’s railway operator in desperation. Could the train stop in her village, Korzivtsi?\n\nA short time later, she got a reply. “Hello! We will stop the train in Korzivtsi.”\n\nVlasenko was able to get her daughteron the trainthe next morning.\n\nHer story is one of many about that show the way Ukraine’s state railway company – Ukrzaliznytsia – has become such an important wartime lifeline for Ukrainians: For soldiers returning on leave, moving supplies, providingmobile medical facilitiesand for connecting the outside world with Kyiv and other cities.\n\nThe rail line between Kyiv and the Polish border has also carried dozens of foreign leaders to the Ukrainian capital during the war, usually at night, and has taken Ukrainian President Volodymyr Zelensky and his ministers out of Ukraine as they have lobbied for international support abroad. There are still no commercial flights in or out of Ukraine.\n\nIn recent months, Russia has stepped up drone attacks on railway hubs and infrastructure, and even the trains themselves.\n\nAt the end of January, five people were killed when drones hit a passenger train in the Kharkiv region, setting three carriages on fire. Video from the scene showed a soldier helping rescue a woman and her baby. The woman was taking the child to see its father. The route carries military personnel returning from leave, but also many civilians.\n\nPosting video of one of the burning carriages, Ukrainian President Volodymyr Zelensky said,:“There is, and can be, no military justification for killing civilians in a train carriage.”\n\nSince the war began, nearly 100 railway employees have been killed, according to Ukrzaliznytsia.\n\nRussian targeting of Ukraine’s extensive rail network is in part driven by its economic importance but also to deliver a psychological blow. The French Foreign Ministry said last week that repeated attacks on the railway network “demonstrate Russia’s desire to destroy Ukrainian civilian infrastructure and are part of the same pattern of terror as the strikes on the Ukrainian energy network.”\n\n“Everyone understands how symbolic and important it is for Ukrainians in frontline communities when rail connections are maintained,” said Oleksandr Pertsovskyi, CEO of Ukrzaliznytsia.\n\nPertsovskyi told CNN there were more Russian attacks on rail infrastructure last year – 1,195 – than in the previous two years combined, including the targeted destruction of dozens of power substations.\n\nLocomotive depots and junctions were also being targeted, he said, as were rail lines in places like Odesa to hamper Ukrainian exports. Sometimes, dozens of Russian drones would target the same location, according to Pertsovskyi.\n\nOn one day recently, there were seven drone attacks on the same railway station, according to Ukrainian Prime Minister Yulia Svyrydenko.“Russia is deliberately attacking our logistics routes – this is deliberate terror against people and civilian logistics,” she wrote on Telegram.\n\nThe station targeted is on the busy rail corridor from Zaporizhzhia in the south to Dnipro. Locomotives and carriages as well as the line itself were damaged in the drone attack, forcing Ukrzaliznytsia to introduce back-up bus services to connect the cities. In other areas, trains make emergency stops if there is warning of an impending attack.\n\nPertsovskyi told CNN that the Russians’ goal was “to cut off entire corridors or entire regions, such as Donetsk, Sumy and Chernihiv” in the north and east.\n\nMany soldiers fighting in the east used to catch trains from the critical hubs of Kramatorsk and Sloviansk in Donetsk when going on leave. But as the frontlines crept closer to both cities, Ukrzaliznytsia suspended services to the two cities in November.\n\nUkrzaliznytsia is responding to the intensity and growing accuracy of Russian attacks by trying to protect critical points on the system and by dispatching rapid recovery teams.\n\nOn one day in January “we had four bridges destroyed, and they were restored in 10 hours,” Pertsovskyi said. “It takes a lot of resources to have the materials for restoration, to have the right teams and equipment.”\n\nBoth the railway company and the government are determined to keep the trains rolling as a crucial part of Ukraine’s resistance.\n\n“Russia can destroy tracks and carriages, but it cannot break the system that holds the country together,” said Deputy Prime Minister Oleksiy Kuleba last week.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.threads.com/@_vlasenko._.iryna_99/post/DTYYTDfiCTG?xmt=AQF0QRPUnU_QSeu216RhgBSsry5R-bikHcwVaWldyhnsqkZxizliwGmmBCqJzpYwM2kkQw7b&slof=1",
      "text": "texted"
    },
    {
      "url": "https://www.threads.com/@_vlasenko._.iryna_99/post/DTZ-Z3QCMLc?xmt=AQF0iF_K_m0fi7D1QdQJdIV6r-Q80Jq0E4bdseLZva8n4Xc8qV0LU5n2UWmN1wSytX-xV5lZ&slof=1",
      "text": "on the train"
    },
    {
      "url": "https://www.cnn.com/2024/09/12/world/video/hospital-trains-ukraine-russia-war-digvid",
      "text": "mobile medical facilities"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/europe/ukraines-railway-russia-target-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/europe/ukraines-railway-russia-target-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "9f611c041bcd8f9e50deae9639053eadb305f4c19d14b383f4f5cc70d72322ec",
  "scraped_at": "2026-02-11T16:32:58.745837+00:00"
}