{
  "url": "https://lite.cnn.com/2026/02/17/tech/meta-mark-zuckerberg-addiction-trial-testimony",
  "title": "Tough questions — and grieving families — await Mark Zuckerberg at social media addiction trial Wednesday | CNN Business",
  "date": "2026-02-18T07:32:41.324051+00:00",
  "authors": [
    "Clare Duffy, CNN"
  ],
  "text": "Source: CNN\n\nJoann Bogard stood in a Capitol Hill hearing room two years ago and watched Mark Zuckerbergapologizeto grieving parents who traced the deaths of their children to the online world he helped create.\n\nParents packed the hearing room, holding photos of the children they had lost. Bogard clutched a picture of her late 15-year-old son, Mason, and thought: It has to get better now.\n\n“I thought, you can see all of these pictures of these children who’ve died in this room at once, and it’s going to be overwhelming, and it’s going to change,” she said.\n\nInstead, she said, “it’s just getting worse.”\n\nThe Meta CEO will once again face grieving families when he testifies on Wednesday in alandmark social media addiction trialin Los Angeles. A number of the parents who witnessed that 2024 apology are flying in from around the country in hopes of securing a courtroom seat to watch Zuckerberg’s witness testimony.\n\nMeta and YouTube areaccusedof intentionally designing addictive features that hooked a now-20-year-old woman as a child and harmed her mental health. The lawsuit brought by “Kaley” and her mother is the first of more than 1,500 similar lawsuits to go to trial.\n\nZuckerberg has repeatedly been called before Congress to address concerns about his platforms, but Wednesday will mark the first time he must testify about youth safety claims before a jury. If the jury sides with Kaley, it could set a precedent for holding social media companies responsible for harmful or dangerous design decisions, after years of tech giants fending off lawsuits with the content liability shield in a law calledSection 230.\n\nA Meta spokesperson has said “we strongly disagree” with the allegations in Kaley’s lawsuit and “are confident the evidence will show our longstanding commitment to supporting young people.”\n\nMeta rolled out“teen accounts,”default privacy settings and content restrictions for under-18 users in the months after Zuckerberg’s apology. But many parents say existing safety tools still put too much of the onus on parents and teens themselves to stay safe online.\n\nBogard became anonline safety advocateafter Mason died in 2019 attempting the “choking challenge,” which she says he learned about from YouTube videos. Her lawsuit against YouTube was dismissed on Section 230 grounds, but she is planning to appeal.\n\n“We’re all doing our best as parents, but we’re fighting these trillion-dollar companies,” Bogard said. She hopes the trial will finally “convince Congress that they have to step up” and pass online safety legislation.\n\nMeta is also standing trial inNew Mexico in a separate caseaccusing the company of creating a “breeding ground” for sexual predators and exposing children to sexually explicit material. Later this year, the first of hundreds oflawsuits brought by school districtsagainst social media companies is also set to go to trial — in a legal approach that mirrors the tobacco trials of the late 1990s.\n\n“While New Mexico makes sensationalist, irrelevant and distracting arguments, we’re focused on demonstrating our longstanding commitment to supporting young people,” including working with experts and law enforcement, a Meta spokesperson told CNN.\n\nLosses could put Meta and other tech platforms on the hook for up to billions of dollars in damages and require them to change their platforms. YouTube has also said that the claims in Kaley’s lawsuit are “simply not true.” Kaley sued Snap and TikTok as well; the two companies settled before the trial began but remain defendants in hundreds of other cases.\n\nZuckerberg’s testimony is likely to focus on the “reasonableness” of the steps Meta has taken to protect young users — whether the company has done enough, said Kimberly Pallen, a partner on the litigation and arbitration team at the law firm Withers.\n\n“I’m sure he’s going to talk about the fact that he has children and this is really important to him … I think he’s going to just talk about everything that they’re doing to make it seem like ‘we’re doing the best we can,’” Pallen told CNN. “That’s probably what it’s going to come down to: From the jury’s perspective, are they doing enough? And do they care?”\n\nKaley began using YouTube at the age of 6 and Instagram at 9, according to her lawyer, Mark Lanier. She sometimes used Instagram for “several hours a day,” at one point spending more than 16 hours on the platform a day at age 16, Lanier said, despite her mother’s efforts to curb her use. Kaley claims addictive features led her to develop anxiety, body dysmorphia and suicidal thoughts and that she experienced bullying and sextortion on Instagram.\n\nMeta’s lawyer has argued that it was Kaley’s difficult family life, rather than social media, that caused her mental health challenges.\n\nZuckerberg’s court appearance follows that of Instagram chief Adam Mosseri last week. A group of parents slept on the courthouse steps to ensure they had seats forhis testimony.\n\nMosseri said he does not believe social media can be “clinically addictive,” although he acknowledged that use of Instagram can become “problematic.” He also testified that Instagram makes “less money from teens than any other demographic.”\n\nBut internal documents produced in the discovery phase of the social media litigation raise questions about Meta’s focus on teen users and the effectiveness of its safety features.\n\nOne Meta document identifies “tweens” ages 10 to 12 as an especially valuable group because of their greater likelihood to remain on the platform long-term, according to an analysis from the Knight-Georgetown Institute. Thereportcompares social media companies’ public statements about safety as required under a new EU law to findings from the internal documents.\n\nThe analysis also cites Meta findings that only a tiny fraction of young Instagram users were enrolled in its parental oversight tool as of March 2025, although the company touts it as central to its safety push.\n\n“Hundreds of millions of teens worldwide use Teen Accounts today and since launch, teens have seen less sensitive content, experienced less unwanted contact, and spent less time on Instagram overnight,” Meta spokesperson told CNN. “Further, 97% of teens aged 13-15 have stayed in these built-in restrictions.”\n\nPeter Chapman, associate director of the Knight-Georgetown Institute, acknowledged that the review wasn’t a comprehensive look at the companies’ communications. But he said that from reviewing the companies’ documents, “you see a sophisticated system of tracking risks, mitigations and use, and we see platforms communicating less about those sorts of hard metrics when they announce or communicate about safety tools.”\n\n“These trials are so important to us because they’re finally going to hold these tech companies accountable for their knowledge, their design … and the trade-offs they made at the risk of our own children being harmed,” Julianna Arnoldtold CNNahead of Kaley’s trial.\n\nArnold’s 17-year-old daughter Coco died after an older man she connected with on Instagram sold her a fentanyl-laced pill; she is now among the hundreds of families suing the company.\n\n“We want to see the executives up testifying and really learning the truth of what happened,” she said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/videos/business/2024/01/31/mark-zuckerberg-apology-hearing-video-vpx.cnn",
      "text": "apologize"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/tech/instagram-youtube-social-media-trial",
      "text": "landmark social media addiction trial"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/tech/instagram-youtube-social-media-trial",
      "text": "accused"
    },
    {
      "url": "https://www.cnn.com/2023/02/18/tech/section-230-explainer",
      "text": "Section 230"
    },
    {
      "url": "https://www.cnn.com/2024/09/24/business/video/meta-instagram-teen-accounts-restrictions-contd-digvid",
      "text": "“teen accounts,”"
    },
    {
      "url": "https://www.facebook.com/masonsmessage/",
      "text": "online safety advocate"
    },
    {
      "url": "https://www.cnn.com/2024/03/08/tech/raul-torrez-new-mexico-meta-lawsuit-protecting-children",
      "text": "New Mexico in a separate case"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/tech/social-media-youth-mental-health-lawsuit-meta-tiktok-snap-youtube",
      "text": "lawsuits brought by school districts"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/tech/instagram-chief-trial-social-media-addiction",
      "text": "his testimony"
    },
    {
      "url": "https://kgi.georgetown.edu/research-and-commentary/measuring-risk-what-eu-risk-assessments-and-us-litigation-reveal-about-meta-and-tiktok/",
      "text": "report"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/business/video/meta-youtube-tiktok-trial-julianna-arnold-vrtc",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/tech/meta-mark-zuckerberg-addiction-trial-testimony",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/tech/meta-mark-zuckerberg-addiction-trial-testimony",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a00d359d90ad672131f8ff708b9f4e063f39251621211536a2f500b9cc80a8fa",
  "scraped_at": "2026-02-18T07:32:41.324065+00:00"
}