{
  "url": "https://lite.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
  "title": "Grand jury declines to indict Democratic lawmakers who urged service members to disobey illegal Trump orders | CNN Politics",
  "date": "2026-02-11T16:31:52.626375+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA federal grand jury on Tuesday declined to indict Democratic lawmakers who posted a videourging service members and intelligence officials to disobey any illegal ordersfrom the Trump administration, according to two people familiar with the matter.\n\nThe Justice Department’s case focused on a 90-second video clip that featured six democrats, including Sens. Elissa Slotkin of Michigan and Mark Kelly of Arizona. The video, which outraged the Trump administration, had warned that “threats to our Constitution” are coming “from right here at home,” and repeatedly urged the military and intelligence community to “refuse illegal orders.”\n\nThe declination is a rebuke of the administration’s efforts to paint the six lawmakers — all of whom served in either the military or intelligence services — as dangerously undermining the president’s authority as commander in chief.\n\nIt was not immediately clear which of the lawmakers were facing indictments. CNN has asked the Justice Department for comment.\n\nAnd while the indictment was rejected by the grand jury, it is also an extraordinary escalation of the Justice Department’s willingness to prosecute who speak about against President Donald Trump and his administration’s actions.\n\nIt’s rare for grand juries to decline to approve charges sought by prosecutors, but such rejections have occurred more frequently in recent months as the administration has pursued legally dubious cases.\n\nAs CNN previously reported, a grand jurypreviously declinedto bring an indictment against Letitia James, the New York attorney general who defeated Trump and his company in court.\n\nProsecutors, however, canstill try to secure indictmentsagainst the lawmakers.\n\nThe video, posted in November, was met with immediate backlash from the Trump administration, including from the president, who accused the lawmakersof sedition“punishable by DEATH.”\n\nWithin weeks, Slotkin and Kelly, along with Reps. Chrissy Houlahan and Chris Deluzio of Pennsylvania, Jason Crow of Colorado and Maggie Goodlander of New Hampshire, said they had been contacted by federal prosecutors as part of an investigation into their actions.\n\nKelly on Tuesday called the attempt to secure an indictment an “outrageous abuse of power.”\n\n“It wasn’t enough for Pete Hegseth to censure me and threaten to demote me, now it appears they tried to have me charged with a crime — all because of something I said that they didn’t like. That’s not the way things work in America,” Kelly said in a statement.\n\nSlotkin, who organized the 90-second video, called the grand jury’s decision “score one for the Constitution, our freedom of speech, and the rule of law.”\n\nSlotkin, in apost on X, decried the Trump administration for its continued efforts to “weaponize our justice system against his perceived enemies,” saying that the case was brought “at the direction of President Trump, who said repeatedly that I should be investigated, arrested, and hanged for sedition.”\n\nCrow issued a blunt warning to the Trump administration.\n\nAmericans, he said, “should be appalled by the fact that Donald Trump and his goons at Department of Justice and everywhere else are weaponizing their justice system just to try to silence dissent and to crush political opponents.”\n\n“Not only should Americans be angry at that — they have chosen the wrong people. If these fuckers think that they’re going to intimidate us and threaten and bully me into silence, and they’re going to go after political opponents and get us to back down, they have another thing coming,” he said, adding that the “tide is turning” as Americans “are rising up against the corruption and the rank abuse of this administration.”\n\nDeluzio, meanwhile,saidhe wouldn’t be intimidated “for a single second by the Trump Administration or Justice Department lawyers who tried and failed to indict me today,” as Goodlander similarly said she would uphold her oath against any threats.\n\n“Today an American grand jury honored our Constitution by standing up to an outrageous abuse of presidential power and taxpayer dollars. No matter the threats, I will keep doing my job and upholding my oath to our Constitution,” she said in a statement.\n\nAnd Houlahan similarly celebrated the grand jury, sayingon X, “This is good news for the Constitution and the free speech protections it guarantees. The grand jury upheld the rule of law – this is a win for all Americans.”\n\nBut after the failed attempt, House Speaker Mike Johnson said the six Democratic lawmakers “probably should be indicted.”\n\n“I mean, look, I think that anytime you’re obstructing law enforcement and getting in the way of these sensitive operations, it’s a very serious thing, and it probably is a crime. And, yeah, they probably should be indicted,” the Louisiana Republican told reporters in the Capitol.\n\nJohnson told reporters he thinks the Democrats in the video went “further” than articulating the law as it relates to illegal orders.\n\n“They were suggesting that they disobey orders, and I think that crosses the line. It’s very serious. I’m glad new attention has been paid to it, and I hope that they straighten up their act,” he said.\n\nKelly’s participation in the video has drawn scrutiny from the Pentagon, where Defense Secretary Pete Hegseth is working to punish the senator over it by reducing his last military rank, which would lower the pay he receives as a retired Navy captain, and issuing a letter of censure.\n\nBut those plans could be upended as soon as this week. A federal judge in Washington has promised to rule by Wednesday on Kelly’s bid to undo Hegseth’s plans.\n\nThe judge haspreviously appeared skepticalthat the secretary’s actions were constitutional, saying at a hearing last week that he thought Hegseth was trampling on Kelly’s First Amendment rights by retaliating against him for his participation in the video.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/19/politics/democratic-lawmakers-urge-troops-to-disobey-illegal-orders",
      "text": "urging service members and intelligence officials to disobey any illegal orders"
    },
    {
      "url": "https://www.cnn.com/2025/12/11/politics/justice-department-fails-reindict-letitia-james-second-time",
      "text": "previously declined"
    },
    {
      "url": "https://www.cnn.com/2025/12/12/politics/justice-department-can-keep-trying-reindict-letitia-james-risks",
      "text": "still try to secure indictments"
    },
    {
      "url": "https://www.cnn.com/2025/11/20/politics/trump-democrats-seditious-behavior",
      "text": "of sedition"
    },
    {
      "url": "https://x.com/senatorslotkin/status/2021401432235155834?s=12&t=pGRDCLW4doqvCAo6IKNMjw",
      "text": "post on X"
    },
    {
      "url": "https://x.com/RepDeluzio/status/2021412729953624536?s=20",
      "text": "said"
    },
    {
      "url": "https://x.com/RepHoulahan/status/2021416954083541444?s=20",
      "text": "on X"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/mark-kelly-hearing-case-challenging-pentagon-punishment",
      "text": "previously appeared skeptical"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/jury-declines-to-indict-lawmakers-illegal-orders-video",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a070e7a9202f245af96c226972b89496df8d986388373df1da4573d0d3d359d2",
  "scraped_at": "2026-02-11T16:31:52.626387+00:00"
}