{
  "url": "https://lite.cnn.com/2026/02/09/politics/trump-bad-bunny-halftime-super-bowl-hnk",
  "title": "Trump calls Bad Bunny’s Super Bowl halftime show performance ‘one of the worst, EVER’ | CNN Politics",
  "date": "2026-02-11T16:41:25.479357+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPresident Donald Trump – who skippedthe Super Bowland instead attended a watch party in Florida – denounced Bad Bunny’s halftime performance as “a slap in the face” and said “nobody understands a word”the Puerto Rican rapperwas saying.\n\n“The Super Bowl Halftime Show is absolutely terrible, one of the worst, EVER! It makes no sense, is an affront to the Greatness of America, and doesn’t represent our standards of Success, Creativity, or Excellence,”Trump saidin a post on Truth Social. “This ‘Show’ is just a ‘slap in the face’ to our Country, which is setting new standards and records every single day.”\n\nBad Bunny, born Benito Antonio Martínez Ocasio, rocked the stage Sunday night with many of his biggest hits,powerful imageryand theatrical nods to songs andsymbolsfrom throughout his Spanish-language catalog. Several huge stars,including Lady Gagaand Ricky Martin, made appearances.\n\nDuring the performance, Bad Bunnydelivered a unifying message, expanding the meaning of “God bless America” to include all nations of the Americas – from Chile to Canada.\n\n“God bless America, whether it’s Chile, Argentina,” Bad Bunny said as he proceeded to list more than 20 nations in North and South America, and displayed the flags of many of them. He stood beside the US flag and the flag of Puerto Rico, a US territory.\n\nHe also displayed a message written on a football that read: “Together we are America.”\n\nThe president criticized both the language and choreography of the performance. “Nobody understands a word this guy is saying,” Trump wrote in his Truth Social, adding that the dancing was “disgusting,” particularly for young children watching across the US and around the world.\n\nYet the US has one of the highest numbers of Spanish speakers of any nation in the world. About 41.8 million people in the country speak Spanish at home – roughly 13.5% of the population – according to Census Bureaudatafrom 2019. Some studies estimate the number of US Spanish speakers could be closer to 48.6 million, as of 2015, if non-Hispanic people and undocumented people are included, according to a report from Instituto Cervantes.\n\nTrump’s criticism is hardly surprising. Hepreviously saidBad Bunny, was a “terrible choice” for the halftime show.\n\nOne of the most-streamed artists in the world, Bad Bunny performed just a week aftermaking Grammys history, winning album of the year for “Debí Tirar Más Fotos (I Should Have Taken More Photos),” the first Spanish-language album to claim the Recording Academy’s top prize.\n\nDuring the ceremony, he delivered a pointed political message in protest of recent actions of Immigration and Customs Enforcement amid Trump’s sweeping immigration crackdown nationwide.\n\nAccepting the award for best música urbana album, Bad Bunny began his speech: “Before I say thanks to God, I’m gonna say: ICE out!”\n\n“We’re not savage, we’re not animals, we’re not aliens,” he added. “We are humans and we are Americans.”\n\nControversy surrounded Bad Bunny’s halftime performance since hisselection was announcedin September.\n\nConservative circles had opposed his appearance on sports’ biggest stage and the conservative non-profit group Turning Point USA offered a counter-programming show with Kid Rock and other artists friendly with the Trump administration.\n\n“The All-American Halftime Show” was filled with the imagery of country music, guitars and the group’s founder, the late Charlie Kirk.\n\nThe Bad Bunny halftime performance made plenty of other people happy – from fans in Santa Clara, California, to watch parties in Puerto Rico and across the country – where social media buzzed about the artistry on display and the slew of stars who made cameos during the performance.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/super-bowl-seahawks-patriots-02-08-26?t=1770604320605",
      "text": "the Super Bowl"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/entertainment/bad-bunny-how-to-understand-songs-intl-latam",
      "text": "the Puerto Rican rapper"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116038200403048483",
      "text": "Trump said"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/super-bowl-seahawks-patriots-02-08-26?post-id=cmlehr2a4000g3b6vcger7cwm",
      "text": "powerful imagery"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/super-bowl-seahawks-patriots-02-08-26?post-id=cmlehmkzn00053b6vwwfoe24n",
      "text": "symbols"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/super-bowl-seahawks-patriots-02-08-26?post-id=cmleg0f9200003b6qjn1smfpn",
      "text": "including Lady Gaga"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/super-bowl-seahawks-patriots-02-08-26?post-id=cmleht5d2000m356snd2tzurv",
      "text": "delivered a unifying message"
    },
    {
      "url": "https://www.census.gov/library/stories/2022/12/languages-we-speak-in-united-states.html",
      "text": "data"
    },
    {
      "url": "https://www.cnn.com/2026/01/25/politics/trump-super-bowl-lx-football",
      "text": "previously said"
    },
    {
      "url": "https://www.cnn.com/2026/02/01/entertainment/bad-bunny-grammys-speech-ice",
      "text": "making Grammys history"
    },
    {
      "url": "https://www.cnn.com/2025/09/29/entertainment/bad-bunny-super-bowl-halftime-subversive",
      "text": "selection was announced"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/trump-bad-bunny-halftime-super-bowl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/trump-bad-bunny-halftime-super-bowl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a0c5c991d8ee8d704994d6fdd773636cb0aa094359b869e2c7cb03e6c0488009",
  "scraped_at": "2026-02-11T16:41:25.479370+00:00"
}