{
  "url": "https://lite.cnn.com/2026/02/11/politics/epstein-files-video-showed-face-person-undercover",
  "title": "Published Epstein files included video showing the face of an undercover FBI employee | CNN Politics",
  "date": "2026-02-12T21:30:41.651084+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Justice Department’songoing struggle with redactionsin the released records related to Jeffrey Epstein continued Wednesday when it was discovered that the face of an undercover FBI employee was left uncovered in a video.\n\nThe department requested CNN make the face of an undercover person unidentifiable in a published video of an FBI sting operation to obtain a black book of Epstein’s contacts.\n\nThe 2009 video shows Epstein’s former Palm Beach house manager Alfredo Rodriguez trying to sell a little black book of addresses and phone numbers, claiming it contained powerful people and victims of Epstein, to the undercover person.\n\n“You will see a lot of important people here,” Rodriguez says in the video, adding that the book includes phone numbers for underage girls.\n\nAfter this video was published by CNN, the Justice Department said it failed to obscure the face of an undercover person in the video, when it included in the most recent dump of Epstein documents. CNN has updated its video with the face of the undercover person obscured.\n\nThe original link where the video was found no longer includes the document.\n\nCNN had reached out to the FBI and Justice Department before initially publishing the video. The FBI told CNN to contact the Justice Department, which did not return requests for comment Wednesday.\n\nThe video was taken two years after the FBI demanded Rodriguez turn over any Epstein documents, according to court documents. Rodriguez instead tried to sell the book for $50,000, those documents say.\n\nRodriguez also claimed in the video that Ghislaine Maxwell — Epstein’s longtime co-conspirator who has since been convicted for her role in the crimes and is currently in prison — kept a database of girls, which included naked images.\n\n“The teenagers, they had braces,” Rodriguez says. He did not, however, provide evidence of the alleged database’s existence.\n\nThe video shows the undercover person hand Rodriguez a bag of cash before ending.\n\nThe former house manager was later arrested for failing to turn over the book as evidence but claimed it was his property and “insurance policy,” worrying that Epstein would make him “disappear,” according to court records.\n\nHe eventually pleaded guilty to obstruction charges and was sentenced to 18 months in prison. Rodriguez died in 2014.\n\nIt’s not thefirst instancethat the Justice Department failed to redact certain information in the millions of files released on Epstein.\n\nThe department continues to face severe backlash over publishing documents that included the names of victims and over-redacting information related to those who may have aided Epstein in his crimes.\n\n“If any man’s name was redacted, that should not have been, we will, of course, unredact it,” Attorney General Pam Bondi said during a congressional hearing Wednesday. “If a victim’s name was unredacted, please bring it to us and we will redact it.”\n\nBondi added: “We were given 30 days to review and redact and unredact millions of pages of documents, our error rate is very low.”\n\nThis story and headline have been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "ongoing struggle with redactions"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/justice-department-under-scrutiny-for-revealing-victim-info-and-concealing-possible-enablers-in-epstein-files",
      "text": "first instance"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/epstein-files-video-showed-face-person-undercover",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/politics/epstein-files-video-showed-face-person-undercover",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a0daa12cea75e235e40ee08cb38275ae134d6a25c704b9c66c245bacec7b7390",
  "scraped_at": "2026-02-12T21:30:41.651097+00:00"
}