{
  "url": "https://lite.cnn.com/2026/02/11/sport/nhl-returns-winter-olympics",
  "title": "NHL returns to Winter Olympics in Milan Cortina after controversial buildup | CNN",
  "date": "2026-02-11T16:38:40.436464+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe superstars of the NHL will return toWinter Olympicaction later on Wednesday, bringing with them thousands of fans from across the world, but it’s been far from a smoothbuildupto the Games.\n\nIt’s been 12  years since the NHL last featured at the Olympics – the league opted out of the 2022 Games because of the pandemic and decided against allowing players to compete at the 2018 edition, saying the competition would disrupt the hockey season.\n\nNow, though, they are not only competing, but they’re coming in droves – each of the 32NHLteams will have at least one representative at the Games.\n\nThe excitement in Milan is palpable then, with the men’s tournament starting with Slovakia taking on Finland on Wednesday, before Team USA gets its campaign underway against Latvia on Thursday.\n\n“It’s going to be extremely exciting. We’re very excited they are coming back,” IOC Sports Director Pierre Ducreytoldreporters last month.\n\n“Twelve years – it was a lot of work from a lot of people to make sure this happens.”\n\nDucrey’s words perhaps underplay the amount of work it took from all sides to ensure the NHL players would be present.\n\nConstruction delays and concerns about the safety of the ice at Milan’s Santagiulia Ice Hockey Arena and secondary Rho facility had drawn headlines for weeks last year. It got to the point where NHL Deputy Commissioner Bill Daly warned that the league would not send its players if there were any safety concerns.\n\nIt resulted in the NHL sending its own experts to trial events at the venues in January, which, to everyone’s relief, went well. The venues may not be perfect, but they are fit to host the world’s best players and their fans.\n\n“The ice was a little bit beat up when we were practicing today, but there have been a lot of teams on it,” Team USA’s coach Mike Sullivantoldreporters after the team’s first practice sessions this weekend.\n\n“At the end of the day, both teams got to play on the same surface, so we’re thrilled to be here, and we love every minute of it.”\n\nTeam USA has not won the men’s Olympic gold medal since the “Miracle on Ice” in 1980, and a whole generation of stars has so far missed out on the opportunity to play at an Olympics during the NHL’s 12-year absence.\n\nIt means there is an element of pressure for Team USA, which heads into Milan Cortina as perhaps the team most likely to topple favorite Canada.\n\nHistory, though, proves the Canadians will be tough to beat – they won gold in the last two Winter Olympics that involved NHL players and will once again boast a packed roster.\n\n“Playing for Team Canada over the years, that’s something you learn is part of it, that expectation and that responsibility,” Pittsburgh Penguins and Canada star Sidney Crosbysaidbefore the competition started.\n\n“We understand that, we have high expectations ourselves, and you’ve got to go out there and play and do all the things that are necessary to try to win. You can’t think too far ahead, but we understand that’s the expectation.”\n\nTwelve nations will compete for medals in Milan Cortina, organized into three groups of four.\n\nThe tournament begins with a three-game round-robin stage. The three group winners and the best overall runner-up advance to the quarterfinals.\n\nThe other eight nations are ranked 5-12 based on points and must compete in a single-game qualification match to move on.\n\nOnce the quarterfinal field is set, the competition shifts to a traditional knockout format, ending with the final on February 22.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/sport/milan-cortina-winter-olympics-2026",
      "text": "Winter Olympic"
    },
    {
      "url": "https://cnn.com/2026/01/13/sport/olympics-2026-winter-hockey-venues-nhl",
      "text": "buildup"
    },
    {
      "url": "https://www.nhl.com/news/nhl-players-on-rosters-for-2026-winter-olympics",
      "text": "NHL"
    },
    {
      "url": "https://cnn.com/2026/01/13/sport/olympics-2026-winter-hockey-venues-nhl",
      "text": "told"
    },
    {
      "url": "https://apnews.com/article/nhl-players-milan-olympics-7ce78a7bda9abbb47606f5bafc6ca04b",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/02/sport/winter-olympics-quiz/",
      "text": "Miracle on Ice"
    },
    {
      "url": "https://apnews.com/article/milan-olympics-nhl-cd910b7b6bf0067f5f7ed11cf8ad890b",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/sport/nhl-returns-winter-olympics",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/sport/nhl-returns-winter-olympics",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a11b4d893cd187fa2a86304bfc79b6ed589d3b9717f5a9cfc692a8b3c8eca895",
  "scraped_at": "2026-02-11T16:38:40.436477+00:00"
}