{
  "url": "https://lite.cnn.com/2026/02/20/us/measles-related-admissions-propublica",
  "title": "South Carolina hospitals aren’t required to disclose measles-related admissions. That leaves doctors in the Dark. | CNN",
  "date": "2026-02-22T07:10:09.449280+00:00",
  "authors": [
    "Jennifer Berry Hawes, ProPublica"
  ],
  "text": "This story was originally published byProPublica, a nonprofit newsroom that investigates abuses of power. Sign up to receiveits biggest storiesas soon as they’re published.\n\nIn mid-January, an unassuming man in khakis and a button-down shirt walked to a wooden lectern at a school board meeting in Spartanburg County, South Carolina. Most chairs in the audience were empty. The man, Tim Smith, was the only person signed up to speak during public comments. He had five minutes.\n\n“I trust that each one of you had a good Christmas and New Year’s,” he began. “Unfortunately, I can’t say the same thing.”\n\nHis wife is an assistant teacher at a public elementary school in the county, epicenter of the state’s historic measles outbreak, and shortly before winter break she’d received a notice that a child in her classroom had measles. Given his wife is fully vaccinated, he wasn’t worried.\n\nThen, she began to get sick. And sicker. She got a measles test and, to their shock, it came back positive. She was apparently among the very rare breakthrough infections.\n\nFrightened, they took her to the hospital that night. “My wife was throwing up,” Smith said at the meeting. “She had diarrhea. She couldn’t breathe. All for what? This is — it’s absolute insanity.”\n\nDr. Leigh Bragg, a pediatrician working a county away, wasn’t even aware that anyone in South Carolina had been hospitalized with measles-related illnesses until a short time later when she logged on to Facebook and saw someone relay the distraught husband’s comments.\n\nPart of the reason Bragg didn’t know is that South Carolina doesn’t require hospitals to report admissions for measles, potentially obscuring the disease’s severity. In the absence of mandatory reporting rules, she and other doctors are often left to rely on rumors, their grapevines of colleagues, and the fragments of information the state public health agency is able to gather and willing to share.\n\nWith973 reported cases, South Carolina’s measles outbreak has ballooned into the nation’s largest since the virus was declared eliminated in the U.S. 25 years ago. Yet, since state health officials first confirmed the outbreak on Oct. 2, the state’s hospitals have reported only 20 measles-related admissions, or about 2% of cases. Some infectious disease experts say that the true number is likely much higher.\n\nHospitalization rates can vary greatly by a measles outbreak’s location and who is getting infected. But the Centers for Disease Control and Prevention estimatesabout 20% of measles caseswill result in admissions.\n\n“A hospitalization rate at 2% is ludicrous,” said Dr. Paul Offit, director of the Vaccine Education Center and an infectious disease physician at Children’s Hospital of Philadelphia who served on the Centers for Disease Control and Prevention’s immunization advisory committee.\n\n“It’s vast underreporting,” Offit said. “Measles makes you sick.”\n\nMeasles is among the most contagious of viruses. In 2026 so far, almost half of states have reported cases. Yet it’s left largely to each state to decide how much infectious disease reporting to require about it.\n\n“We don’t think we are getting an accurate picture at all of how these illnesses are impacting our community,” Linda Bell, the South Carolina state epidemiologist, said at a briefing last month. “We’re just not getting a picture of that now with the small number of hospitalizations that are known to us.”\n\nBell said the state Department of Public Health is urging hospitals to report their measles-related admissions, and seven hospitals have done so. (There are at least a dozen acute care hospitals in the Upstate alone.) But the state cannot force them to do so. Bell also said that the agency, which sets infectious disease reporting requirements, hasn’t considered adding hospitalizations to the list because the primary purpose of public health surveillance is to understand disease transmission, frequency and distribution — not to track complications.\n\nThat leaves doctors like Bragg advising patients, including vaccine-resistant parents, without the benefit of confirmed, real-time data about how many South Carolinians have been hospitalized with measles. Severe complications include pneumonia, dehydration and a potentially life-threatening brain swelling called encephalitis.\n\n“It’s a very big disservice to the public not reporting complications we are seeing in hospitals or even ERs,” Bragg said. “Measles isn’t just a cold.”\n\nProPublica contacted state health agencies across the South and found most do not require hospitals to report measles-related admissions. Alabama does. So does Virginia, although it doesn’t release that data to the public. Like South Carolina, North Carolina and Texas don’t require reporting of hospitalizations, but epidemiologists can identify them during case investigations.\n\nDuring the Texas measles outbreak last year, 99 people were hospitalized out of 762 cases.\n\nThat’s a rate of about 13%. In South Carolina, the reported rate is 2%.\n\nReal-time hospitalization data can show where to target resources and help hospitals prepare for an influx of patients. “As vaccine rates decrease, it could also really help us understand the changing epidemiology of measles in this current context,” said Gabriel Benavidez, an epidemiology professor at Baylor University in Texas.\n\nWhen ProPublica asked hospitals across the Upstate, the northwest quadrant of South Carolina where the outbreak is concentrated, if they are reporting their measles-related admissions to the state and how many patients they had treated, few responded. Only Spartanburg Regional Healthcare System shared its total. (As of mid-February, the number was four.)\n\nA spokesperson for Prisma Health, a Greenville-based nonprofit that owns eight acute-care hospitals in the Upstate, said its hospitals are “reporting everything we are supposed to report.” She wouldn’t say how many measles patients have been hospitalized at Prisma hospitals or how many the system has reported to the state.\n\nBragg, who is board certified in pediatrics and pediatric infectious disease, works in the region of South Carolina where the outbreak is concentrated. It’s a highly religious expanse with the state’s lowest student vaccination rates. She recently met with a parent questioning the recommended vaccines for a 1-year-old child, which includes a first dose ofmeasles vaccine.\n\n“We’re in the middle of a measles outbreak,” Bragg thought.\n\nThen she began a 30-minute discussion of the vaccine’s extreme safety and 97% lifetime effectiveness when two doses are given. She explained that 95% of people in South Carolina who have gotten measles were unvaccinated. She rattled off historic risks of measles complications.\n\nYet Bragg couldn’t tell the parent just how severely ill their fellow South Carolinians were getting from the outbreak sickening people around them.\n\nShe had heard about pneumonia, ICU admissions — and even a case of encephalitis. But she hadn’t been able to confirm it, or find out if it was a child, much less how the patient fared. (Shortly after, Bell announced that the state health agency had learned of encephalitis cases in children, but she didn’t provide the numbers of patients or their outcomes.)\n\nAs president of the South Carolina chapter of the American Academy of Pediatrics, Dr. Martha Edwards is connected to physicians across the state. “All I’m hearing about are ‘complications of measles,’” which can mean a lot of different things, she said.\n\nCommunicating the risks of severe illness is all the more important because few of today’s parents have seen measles up close. Neither have most practicing doctors.\n\nEarly in his career, Dr. William Schaffner, a professor at Vanderbilt University who focuses on the prevention of infectious diseases, worked with the CDC to implement the measles vaccine. When he tells medical students today that in the 1960s, before the measles vaccine, 400 to 500 kids died of measles and its complications each year, “They’re stunned.”\n\n“If the severity of the illness cannot be ascertained — if it can’t be determined — it can’t be appropriately communicated to the public,” Schaffner said. “And the public might get the false impression that measles is milder than it really is.”\n\nAt a briefing, Dr. Robin LaCroix, a Prisma pediatric infectious disease physician, said the organization’s physicians “have seen the whole gamut of acute and post-measles infections that have afflicted these children. They are sick.” Children have become listless and suffered blotchy rashes, coughing and coughing spasms, dehydration and secondary infections including pneumonias.\n\nMeasles infections are particularly dangerous for babies who cannot get vaccinated yet and young children who haven’t gotten the second dose. Infections during pregnancy also pose severe risks for mothers who are not vaccinated or immune, including miscarriage and a tenfold increase in death due to pneumonia. Mothers can pass on the virus to their babies, “which can be catastrophic,” said Dr. Kendreia Dickens-Carr, a Prisma OB-GYN.\n\nMore than 900confirmed measles cases have been reported across the country already in 2026, compared with 2,281 in all of 2025. Most of this year’s cases are in South Carolina, but Florida has reported 63 cases and neighboring North Carolina 15, including one hospitalization.\n\n“We really do need to think about the way in which we report these things, because viruses and bacteria don’t respect state lines,” said Dr. Annie Andrews, a pediatrician running as a Democrat for the U.S. Senate in South Carolina. “Public health professionals from one state to another should be comparing apples to apples and oranges to oranges.”\n\nThe most advanced pediatric care in the state is provided at the Medical University of South Carolina’s campus in Charleston, several hours away from the Upstate on the coast. So far, its children’s hospital hasn’t admitted any measles patients, doctors said.\n\nDr. Danielle Scheurer, the chief quality officer at MUSC, celebrated the state’s low hospitalization rate and said she doubted hospitals would object to required reporting of measles-related admissions if the state health agency were to change its rules.\n\n“Transparency here is going to help other states,” Scheurer said. “The more transparent we are about all of our statistics, the better off any other state is going to be in preparing.”\n\nAcross South Carolina, large health care systems have bought up local hospitals and doctors’ practices. With that control, they can exert influence over what those doctors and hospital employees say publicly, especially when it comes to potentially controversial topics like vaccines. At the same time, they face pressure from Republican lawmakers and a growing segment of vaccine-wary patients.\n\nThe result is often highly controlled information sharing, or a lack thereof.\n\n“There’s this level of caution that wasn’t there before,” Edwards said. She understands that hospitals don’t want to offend patients who are dubious of vaccines. Bragg agreed but said given that 93% of the state’s students are vaccinated, she worries the hospitals are “pandering to a small group.”\n\nApending bill, sponsored by several of Spartanburg County’s state representatives, seeks to prevent hospitals and doctors from questioning or interfering “in any manner” with a patient’s right to refuse treatments or vaccines. During COVID-19, the bill contends, federal agencies collaborated with medical organizations and others “to orchestrate a coordinated and coercive propaganda campaign” to shame people who declined COVID-19 vaccines. Doctors and hospitals argue they must balance public health risks with individuals who decline to take vaccines.\n\nThe state’s Republican governor,Henry McMaster, and majorGOP candidatesto replace him have largely framed their responses to the measles outbreak around the concept ofmedical freedom, particularly when discussing vaccine mandates.\n\nAndrews, the pediatrician running for the U.S. Senate, said she’s experienced the “chilling effect” the GOP’s “anti-science movements” have had on health care systems and individual physicians. “If you speak up, you are at risk of being censored,” Andrews said. “If you speak up, you are at risk of losing your job. So everyone is just trying to keep their head down and do what’s best for their patients.”\n\nBragg is among the declining ranks of doctors who run their own independent practices. She has the freedom to post what she wants to on social media and to wear pro-vaccine T-shirts that say things like, “Got polio? Me neither because I got the vaccine.”\n\nBut one recent day, her 10-year-old son asked why she insisted on wearing the T-shirts. “Even a 10-year-old can tell you how polarizing vaccines have become,” Bragg said. Despite that, she has continued to wear them.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.propublica.org/article/south-carolina-measles-hospital-admissions",
      "text": "ProPublica"
    },
    {
      "url": "https://www.propublica.org/newsletters/the-big-story?source=%25source%25",
      "text": "its biggest stories"
    },
    {
      "url": "https://dph.sc.gov/diseases-conditions/infectious-diseases/measles-rubeola/measles-dashboard",
      "text": "973 reported cases"
    },
    {
      "url": "https://www.cdc.gov/surv-manual/php/table-of-contents/chapter-7-measles.html?utm_source=chatgpt.com",
      "text": "about 20% of measles cases"
    },
    {
      "url": "https://www.cdc.gov/measles/vaccines/index.html",
      "text": "measles vaccine"
    },
    {
      "url": "https://www.cdc.gov/measles/data-research/index.html",
      "text": "More than 900"
    },
    {
      "url": "https://www.scstatehouse.gov/sess126_2025-2026/bills/4009.htm",
      "text": "pending bill"
    },
    {
      "url": "https://www.youtube.com/watch?v=blB35m_icGs",
      "text": "Henry McMaster"
    },
    {
      "url": "https://www.wyff4.com/article/sc-republican-governor-candidates-hit-stage-upstate/70386487?utm_source%3Dchatgpt.com&sa=D&source=docs&ust=1771605940154003&usg=AOvVaw2XLolUEAnDeFF6UmzBRw02",
      "text": "GOP candidates"
    },
    {
      "url": "https://www.nytimes.com/2025/12/13/us/measles-outbreak-south-carolina-quarantine.html",
      "text": "medical freedom"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/measles-related-admissions-propublica",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/measles-related-admissions-propublica",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a19d022e6be0693e84791abfd7424bc34b2a393eace6042fb238698ac3bcdf31",
  "scraped_at": "2026-02-22T07:10:09.449294+00:00"
}