{
  "url": "https://lite.cnn.com/2026/02/22/politics/mar-a-lago-man-shot-armed",
  "title": "Mar-a-Lago: Armed man shot and killed after entering perimeter around Trump’s Florida home | CNN Politics",
  "date": "2026-02-23T07:35:34.707654+00:00",
  "authors": [
    "Lauren Mascarenhas",
    "John Miller",
    "CNN"
  ],
  "text": "Source: CNN\n\nUS Secret Service agents and Palm Beach County law enforcement shot and killed an armed man who unlawfully entered the secure perimeter at President Donald Trump’s Mar-a-Lago estate in South Florida on Sunday morning,the Secret Servicesaid.\n\nThe president and first lady were at the White House in Washington, DC, at the time of the incident. Trump was briefed on the incident Sunday morning, a White House official told CNN.\n\nThe incident comes amid a backdrop ofheightened political violencein the US. In July 2024, Trump survived anassassination attemptwhile campaigning for his second term in Pennsylvania. Another man who planned to assassinate the president at his Florida golf course in September 2024 wassentenced this monthto life in prison.\n\nPolitical violence has targeted Republican and Democratic figures alike. Last summer, Minnesota House SpeakerMelissa Hortman, a Democrat, and her husband were shot and killed, and conservative activist Charlie Kirkwas fatally shotin September.\n\nA White man in his early 20s entered the secure perimeter at Mar-a-Lago around 1:30 a.m. ET before he was shot by agents and a deputy with the Palm Beach County Sheriff’s Office, authorities said. The man appeared to be carrying a shotgun and a fuel can, Palm Beach County Sheriff Ric Bradshaw said at a news conference Sunday.\n\nThe man entered Mar-a-Lago through the north gate as an employee was walking out. He made it about 20 or 30 yards before he was confronted by law enforcement, officials said.\n\nWhen a deputy and two Secret Service agents encountered the man, they ordered him to drop the items. The man dropped the gas can and “raised the shotgun to a shooting position,” Bradshaw said.\n\nThe deputy and agents then fired their weapons at him and he was pronounced dead at the scene, the sheriff said. He added that the officers involved were wearing body cameras.\n\nThe man is from North Carolina and was reported missing Saturday by his mother, law enforcement officials said. His name is being withheld until his family is notified of his death.\n\nThe FBI is leading the investigation, with teams collecting evidence and looking into his background and motive.\n\nNo law enforcement officials were harmed in the incident, authorities said.\n\nThe Secret Service agents involved will be placed on administrative leave during the investigation “in accordance with agency policy,” a Secret Service statement said. Secret Service Deputy Director Matthew Quinn said the agency’s director, Sean Curran, is traveling to Florida for “after-actions” and that “our teams remain fully engaged on the mission.”\n\nWhite House press secretary Karoline Leavitt praised the quick action of the Secret Service agents involved in the incident ina statement on X Sunday.\n\nAttorney General Pamela Bondisaid she has been in touch with Trump about the incident and is coordinating with federal partners on the investigation.\n\nThe agency is asking residents in the area of the shooting to check their exterior cameras and contact authorities if they notice anything suspicious.\n\nTrump spends most weekends during the winter at his Mar-a-Lago club. He is spending this weekend in Washington, where he hosted a dinner for governors at the White House on Saturday night.\n\nAs Mar-a-Lago hasincreasingly become the settingfor official presidential activity under Trump, security has been a concern for intelligence officials. While the Secret Service screens guests before they enter, it does not determine who can access the site, as paying club members may enter alongside world leaders.\n\nRecent security enhancements include snipers, bomb-sniffing dogs and boats patrolling the Intracoastal Waterway, along with miles of secure telephone and internet cables.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/AJGuglielmi/status/2025568622844707043?s=20",
      "text": "the Secret Service"
    },
    {
      "url": "https://www.cnn.com/2025/09/14/us/political-violence-cases-america-charlie-kirk",
      "text": "heightened political violence"
    },
    {
      "url": "https://www.cnn.com/2025/07/13/politics/trump-butler-assassination-maga-change",
      "text": "assassination attempt"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/ryan-routh-trump-assassination-attempt-sentencing",
      "text": "sentenced this month"
    },
    {
      "url": "https://www.cnn.com/2025/06/14/us/melissa-hortman-minnesota-assassination",
      "text": "Melissa Hortman"
    },
    {
      "url": "https://www.cnn.com/2025/09/10/politics/charlie-kirk-obituary",
      "text": "was fatally shot"
    },
    {
      "url": "https://x.com/PressSec/status/2025598078430900397?s=20",
      "text": "a statement on X Sunday"
    },
    {
      "url": "https://x.com/AGPamBondi",
      "text": "Attorney General Pamela Bondi"
    },
    {
      "url": "https://www.cnn.com/2026/01/04/politics/mar-a-lago-military-operations",
      "text": "increasingly become the setting"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/mar-a-lago-man-shot-armed",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/mar-a-lago-man-shot-armed",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a371cc26a5d1d0d5c781fb310937ba9a4f18558d0161b94d3ad8ce85b65207e1",
  "scraped_at": "2026-02-23T07:35:34.707667+00:00"
}