{
  "url": "https://lite.cnn.com/2026/02/20/science/ancient-elephant-bone-spain-scli-intl",
  "title": "Ancient bone may be first physical evidence of Hannibal’s ‘war machine’ elephants in Western Europe | CNN",
  "date": "2026-02-22T07:11:27.116105+00:00",
  "authors": [
    "Jack Guy, CNN"
  ],
  "text": "Source: CNN\n\nArchaeologists in Spain have uncovered an elephant bone from 2,200 years ago, and they believe it belonged to an animal that served as a “war machine” in an army sent toinvade the Roman Republic.\n\nAfter discovering the ankle bone at the Colina de los Quemados archaeological site in the city of Cordoba in southern Spain, researchers used radiocarbon dating to ascertain that it belonged to an elephant that lived around the early fourth to late third century BC, according to a study published in theJournal of Archaeological Science: Reports.\n\nAround this time, the city-state of Carthage, in what is now Tunisia, was battling with the Roman Republic for supremacy in the Mediterranean.\n\nThe Carthaginians were known to use elephants as “war machines” in their armies, according to the research, and classical accounts suggest the famed commander Hannibal had driven a troop of 37 elephants through modern day Spain and France, ultimately attempting to invade Italy by crossing the Alps during the Second Punic War, which took place from 218 to 201 BC.\n\nThe incredible sight of Hannibal’s elephants left its mark on the historical record, but no direct physical evidence of their presence in Western Europe had previously been discovered.\n\nIn addition to the radiocarbon dating, which roughly aligns with the timeline of the Second Punic War, researchers said clues to their Hannibal theory also include 12 spherical stone balls used in artillery that they found alongside the bone, which “probably points to a military context.”\n\nAlthough they acknowledge that the discovery of one bone in isolation does not indicate that the entire animal was at this site, as the bone could have been taken there as a curio or a souvenir, “historical and archaeological record suggest that its association with the events of the Second Punic War, whether direct or indirect, provides the most plausible explanation,” the researchers noted in the study. They citedthe presence of projectiles and arrowheads, which may have been left behind following a violent episode.\n\nBattle elephants at this time were “prestige weapons but also psychological weapons,” according to Fernando Quesada-Sanz, the study’s lead author and an archaeologist at the Autonomous University of Madrid, Spain.\n\nThe animals were “very impressive and frightening for troops not accustomed to facing them,” he told CNN in a statement Thursday.\n\n“They were also particularly useful against cavalry and to disorder enemy infantry lines,” Quesada-Sanz added. “They were even used as spearheads to lead attacks against the palisades of temporary enemy fortifications such as campaign camps.”\n\nQuesada-Sanz said that “this is the first time, as far as we know, that the actual remains of one of the elephants in the Carthaginian army has been found in European soil,” adding that it could be part of one of the 21 elephants that classical sources say Hannibal left in Iberia before he started his march to Italy.\n\n“This find might be a wake up call for the study of collections from old excavations kept in museum storerooms in Spain, southern France or even Italy that could conceivably yield more examples,” he said. “Also, bones from future excavations have to be checked carefully.”\n\nEve MacDonald, an archaeologist and senior lecturer in ancient history at the University of Cardiff, Wales, and author of “Carthage: A New History,” who was not involved in the study, told CNN that the discovery is significant because it finally provides physical evidence for the long-held belief that the Carthaginians introduced elephants to the Iberian Peninsula during the third century BC.\n\nThe context of the find, in a deposit of artillery weapons and other instruments of war, adds “a compelling layer to the interpretation” from the study’s authors, she said.\n\n“There is something deeply satisfying about moments when the archaeological record steps up and confirms what history has long suggested,” MacDonald said via email.\n\n“The legend of Hannibal crossing the Alps with 37 elephants has captured people’s imaginations for millennia, the ancient Romans were astonished by it and we remain so today,” she added.\n\n“This small bone… brings us one step closer to one of the most extraordinary military stories from the ancient world.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2016/04/05/world/hannibal-alps-route-feat",
      "text": "invade the Roman Republic"
    },
    {
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S2352409X2600012X",
      "text": "Journal of Archaeological Science: Reports"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/science/ancient-elephant-bone-spain-scli-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/science/ancient-elephant-bone-spain-scli-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a3944c1d34ea6a9176f9aba7c7abe95c0220b089bb5ff671b219db1556d36678",
  "scraped_at": "2026-02-22T07:11:27.116118+00:00"
}