{
  "url": "https://lite.cnn.com/2026/02/26/business/burger-king-new-whopper",
  "title": "Customers complained. So Burger King updated its Whopper | CNN Business",
  "date": "2026-02-27T07:16:30.126321+00:00",
  "authors": [
    "Vanessa Yurkevich"
  ],
  "text": "Source: CNN\n\nBurger King, home of the Whopper, is making the first changes to its best-selling menu item in nearly 10 years after consumers complained.\n\nThe Whopper will replace its soft bun with a more premium one, use a new creamier mayonnaise and be served in a box instead of paper, the company announced Thursday. The revamped burger rolls out in its more than 7,000 restaurants nationwide this week.\n\nThe changes come after years of complaints about smashed burgers that were falling apart.\n\n“So the Whopper being smushed, literally, I’ve heard it… and we’ve seen it,” Tom Curtis, president of Burger King US and Canada, told CNN. “(We) improved packaging that kind of holds it together. The creamier mayonnaise frankly just came from some franchisees who said they wanted to see a more premium mayonnaise. And then also upgrading and premium-izing the bun.”\n\nCurtis, who startedtaking callsdirectly from customers last week, said the restaurant chain was “careful” with its changes. The beef patty, for example, remains the same.\n\n“You don’t want to just tear up the playbook and start all over,” Curtis said. “It’s like we’re putting our famous iconic burger in a tuxedo instead of a leisure suit.”\n\nThe “enhanced” Whopper will cost Burger King franchisees an extra $4,000 a year. Burger King advised local owners not to raise prices for inflation-weary consumers and suggested the investment will drive up sales.\n\n“It’s very tricky” for franchisees, said Robert Byrne, senior director of consumer research at Technomic, a forecasting and data company for the food service industry. “(Franchisees might say that) cost of labor hasn’t gotten any cheaper, ‘so why are you asking me to spend more over here?’ Well, to improve your business, but that’s a struggle.”\n\nBurger King is the eighth largest fast-food chain in the country by sales, according to Technomic.\n\nBut it lost its way with customersaround 2023, Byrne said, with customers complaining about out-of-date stores, cold food and an overall lackluster experience.\n\nThe company had to tackle those foundational problems before updating the menu, Curtis said. Now sales are finally on the upswing – US same-store sales rose 3.2% in the most recent quarter. But menu changes could backfire among brand loyalists and potentially threaten sales.\n\n“In an environment where you have economic uncertainty, inflationary pressures, just making ends meet is tough. There’s an additional element of risk when you purchase something that you’re not familiar with. That’s a high risk (for a brand),” said Byrne.\n\nBut Burger King believes the Whopper changes are subtle enough not to offend fanatics, while luring back customers who may have soured on the brand.\n\n“‘I love a Whopper. I haven’t had one in years’ – I hear that at airports all the time,” said Curtis of talking to customers on the road. “I’m like, ‘What are you waiting for?’ And now I think we’re giving them a great reason to go back.”\n\nFor seven months, Burger King tested mayonnaise, burger buns and packaging.\n\nNo idea was discarded in the test kitchen, which even toyed with placing the burger upside down. That meant the beef patty is the first layer, with the veggies underneath.\n\nBuilding the burger upside down was “actually distracting from the objective,” said Amy Alarcon, Burger King’s head chef who joined the company in January. “Let’s just build it the way it’s meant to be done.”\n\nRedesigning for a national brand is a big undertaking. For the bread, Alarcon had to get nearly a dozen national bakeries on board. They changed the baking pan size to give the bread more lift and added a glaze.\n\n“It helps the sesame seeds stick to the bun better, and then just creates that visual appeal that makes it look a little bit more artisanal and less just this factory-produced high-speed-production-baked item,” Alarcon said.\n\nFor the mayo, the kitchen team wanted creamier notes and little bit of sweet and citrus. For the packaging, the challenge was figuring out the best way to keep the Whopper in one piece. So, they put it in a clamshell box instead of a paper wrap.\n\nThe team found that the clamshell box kept the burger fresh “while still retaining some of the heat and getting that melty cheese experience,” said Alarcon.\n\nWith these new Whopper enhancements, Burger King realized customer feedback was by far the best way to make changes. But the chain needed more reactions from everyday diners.\n\nSo, Curtis, Burger King’s president, gave out his phone number last Tuesday and is taking calls for two weeks.\n\n“I’ve spent four hours, six hours a day, including Saturday” on the phone, said Curtis. “There’s still instances where we let people down every single day, but we’ve got to be honest about that and hit that dead on. I want America to know that we’re doing that.”\n\nThese customer calls have confirmed what Curtis and his team are already working on: more menu changes.\n\n“There’s a lot of people saying, ‘Hey, can you work on your French fries?’ So when I see patterns like that over the course of 12,000 calls, you know you need to go work on this stuff,” said Curtis.\n\nBut Burger King faces stiff competition. Not only from its immediate rivals in the burger space, like McDonald’s or Five Guys, but also from other quick-service restaurants like Raising Cane’s, according to Byrne.\n\nWith so much choice, but so little wiggle room on price, consumers have looked to other brands. Technomic, the food service research firm, has calculated affordability scores from consumers for Burger King and other fast-food chains for years.\n\n“(Burger King’s) affordability scores are flat to slightly down if we go back and look at the overall average over the past 10-plus years,” Byrne said. “What that says to me is that they really don’t have that flexibility. They don’t have pricing power in this current market.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://news.bk.com/blog-posts/burger-king-r-puts-its-president-on-the-line-giving-guests-direct-access-to-share-feedback",
      "text": "taking calls"
    },
    {
      "url": "https://www.cnn.com/2023/08/08/business/burger-king-traffic",
      "text": "around 2023"
    }
  ],
  "hash": "a40d21fef1ac43e05d648871db8d9ec939babe888af4dfbb82f4a099feb131d8",
  "scraped_at": "2026-02-27T07:16:30.126337+00:00"
}