{
  "url": "https://lite.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
  "title": "Takeaways: Enforcement surge ending in Minneapolis as state and DHS officials face tough questions in Senate | CNN Politics",
  "date": "2026-02-13T07:31:18.597509+00:00",
  "authors": [],
  "text": "Source: CNN\n\nWhile White House border czar Tom Homan announced Thursday morning the federal immigration surge in Minnesotawould be ending, state officials were facing tough questions about the circumstances that led to that crackdown in the first place.\n\nThose officials, Minnesota Attorney General Keith Ellison and the state’s corrections commissioner, Paul Schnell, in turn blasted the Trump administration for the way it has conducted itself in their state.\n\nThe testimony devolved into yelling matches between Ellison and two Republican senators who accused him of contributing to the violence in Minnesota and suggested he should be jailed over its expansive fraud scandal.\n\nAnd later, top immigration officials in the Trump administration faced another round of questioning over last month’s killings ofAlex PrettiandRenee Goodand the tactics of immigration officers working in their agencies.\n\nHere are some takeaways from a busy day in Washington and Minneapolis as the deadline for theDepartment of Homeland Security’s fundingdraws closer:\n\nHoman, whom the administration placed in charge of its operations in Minneapolis after Pretti was killed last month, said during a press conference on Thursday that the surge in Minneapolis that began in early December would soon be ending.\n\n“I have proposed, and President Trump has concurred, that this surge operation conclude,” Homan said.\n\nAt its height, about 3,000 federal officers were deployed as part of Operation Metro Surge in what was the largest immigration enforcement operation in the country’s history. The surge has led to weeks of protests, tense confrontations between protesters and officers, the killings of Pretti and Good by officers and attempts from the administration to paint both as terrorists who wanted to harm law enforcement.\n\nHoman said Thursday that a small footprint of officers would remain.\n\nThe announcement was welcomed by Democratic officials, including Gov. Tim Walz, Minneapolis Mayor Jacob Frey and lawmakers both in Congress and the state legislature.\n\nWalz said the surge did serious economic damage to the state and said he would seek repayment.\n\n“The federal government needs to pay for what they broke here,” Walz said Thursday morning. “You don’t get to break things and then just leave without doing something about it.”\n\nAnd while Homan was speaking in Minneapolis, top Minnesota officials testifying in Washington said the damage had already been done.\n\nTestifying in front of the Senate Homeland Security and Governmental Affairs Committee, Ellison said the surge had “caused real harm to our state.”\n\nThe Democratic attorney general asked that members of the committee exercise their oversight powers to compel several reforms within federal law enforcement, including requiring ICE provide full documentation of arrests and detentions conducted by its agents, allow oversight access into its detention facilities, and require that state and federal investigations into the deaths of Good and Pretti be conducted in tandem.\n\nEllison accused the government of inventing different pretexts to justify the surge, but said it wasn’t really about the fraud scandal that the administration cited before sending law enforcement to the Twin Cities. Instead, it was about carrying out President Donald Trump’s stated goal of seeking retribution against the state and its Democratic leaders.\n\n“The government did not surge … forensic accountants to Minnesota,” he said. “They didn’t surge computer experts. Instead, they sent 3,000 masked, armed men who are now kicking in doors, demanding papers, killing Minnesotans – not fighting fraud.”\n\n“The surge has hurt the fight against fraud,” he added.\n\nEllison faced tough questions from Republican Sens. Ron Johnson and Josh Hawley. Johnson accused Ellison of contributing to the deaths of Good and Pretti by encouraging Minnesotans to protest the law enforcement surge instead of telling them to stay home.\n\n“You’ll never find me being against the First Amendment,” Ellison said in response.\n\nJohnson said it was no wonder that ICE officers were on “hair-trigger alert” considering the number of people who opposed them and sometimes confronted them during operations.\n\n“A tragedy was going to happen,” he said, “and you encouraged it, and you ought to feel damn guilty about it,” the senator said. Ellison described Johnson’s remarks as a “nice theatrical performance, but it was all lies.”\n\nDuring a later exchange between Ellison and Hawley, the senator slammed how Ellison’s office handled the fraud investigation and said Ellison should resign.\n\nEllison responded that he thought the same about Hawley. Hawley retorted that Ellison should be in jail.\n\nAfter last month’s fatal shootings of Good and Pretti, top Trump administration officials, including Homeland Security Secretary Kristi Noem, rushed to paint both of them asdomestic terroristswho intended to harm law enforcement.\n\nThose assessments were proven to be premature, especially in the case of Pretti, who video showed never brandished his firearm as the administration had initially claimed. Both Noem and White House aide Stephen Miller said they used that description based off what they had been told by Border Patrol officers on the ground.\n\nActing ICE Director Todd Lyons and Customs and Border Protection Commissioner Rodney Scott, who had recently testified in front of a House committee, were asked about the killings and the administration’s initial depiction of both US citizens.\n\nDuring today’s hearing, Sen. Gary Peters asked Scott, whose agency oversees Border Patrol, whether the description of Pretti as a terrorist had come from him.\n\n“No, sir,” Scott responded.\n\nAsked whether someone in his staff told Noem that, Scott responded: “Not to my knowledge.”\n\nAsked how Noem could come to that conclusion, Scott said:“I can’t speculate on what someone else would say or why, sir.”\n\nBoth Scott and Lyons largely declined to discuss the killings of Pretti and Good, citing ongoing investigations into their killings. But both did answer general questions about the rights all citizens have while interacting with their officers.\n\nThey both affirmed that people have the right to film their officers. Asked whether yelling at their officers was a form of domestic assault, both said that it was not.\n\nWhile he mostly avoided addressing the investigation into Pretti’s killing, Scott told Sen. Rand Paul that body camera video of the incident would be made public.\n\nAnd responding to claims that his officers aren’t held accountable, Lyons said that ICE has actually opened 37 investigations into complaints of excessive force by their officers since last month.\n\nHe said 19 of those investigations remain pending, while one case has been referred “for further action.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-12-26?post-id=cmljixqqh0000356pnlqyhlj7",
      "text": "would be ending"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/politics/pretti-shooting-two-officers-homeland-security-report",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/us/ice-shooting-minneapolis-renee-good",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "Department of Homeland Security’s funding"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/politics/terrorism-definition-minneapolis-pretti-ice-analysis",
      "text": "domestic terrorists"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/minnesota-immigration-surge-ending-takeaways",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a4217b536db87fa2dad71213e01b5ade651c29b5df5cc48f006eb03a002535ba",
  "scraped_at": "2026-02-13T07:31:18.597521+00:00"
}