{
  "url": "https://lite.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli",
  "title": "Bonobos are capable of pretend play, just like human children | CNN",
  "date": "2026-02-11T16:34:21.413146+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nChildren love to play pretend,holding imaginary tea parties, educating classrooms of teddies or running their own grocery stores.  Now, a new study suggests that such make-believeplayis not a uniquely human talent, but a skill thatgreat apesalso possess.\n\nThe evidence for this comes from a bonobo named Kanzi, who took part in three pretend tea party-style experiments conducted by two researchers at Johns Hopkins University in Baltimore, Maryland.\n\nPrevious observations of individual apes playing alone had raised the possibility that animals could engage in simulated play, study authors Amalia Bastos and Christopher Krupenye noted in the study,which was published Thursday in the journalScience.\n\nIn the earlier research, a young, captive chimpanzee wasseenon two occasions between 2003 and 2004 dragging what seemed to be imaginary blocks along the floor, in a similar way to when he played with real wooden blocks.\n\nFemale chimpanzees,observedin the wild in Uganda over a 14-year period, had also been seen carrying and playing with sticks as if they were dolls, just as mother chimpanzees carry infants.\n\nHowever, the anecdotal nature of the evidence had left room for doubt, the researchers said.\n\nFor example, the animals could have been imitating behavior they had observed in humans, rather than using their imagination. Or, perhaps, an ape that “picks” a blueberry from a photograph might actually think the blueberries are real. Or, if playing with wooden blocks is highly rewarding, an ape might continue to repeat the same actioneven if the blocks are not there.\n\nTo address such concerns and provide more robust evidence, in 2024 the researchers carried out controlled tests using juice and grapes when Kanzi was 43, a year before his death.\n\nFirst, Kanzi was presented with two squirt bottles, one that was empty and one that contained juice, and asked to pick which bottle had the juice. During 18 trials, he chose the correct bottle every time.\n\nThen, an experimenter presented the bonobo with two empty, transparent cups and pretended to pour juice from an empty pitcher into each cup. They then poured the imaginary juice out of one of the cups and back into the pitcher.\n\nWhen asked, “Where’s the juice?” Kanzi correctly chose the cup that still contained the imaginary juice 68% of the time, which is higher than if he were picking at random.\n\nHowever, in case Kanzi thought there was real juice in the empty cups, the researchers carried out a second task to see if he could distinguish real juice from imaginary juice. In 18 trials, Kanzi was presented with one cup containing juice and another empty cup filled with imaginary juice, and asked, “Which one do you want?”\n\nKanzi correctly chose the cup with juice 14 out of the 18 times, showing that he did know the difference between real and pretend.\n\nThe final experiment involved a similar setup to the first task but, instead of juice, a grape was used. Kanzi successfully identified which jar contained the fictitious grape 68.9% of the time, and did so even faster than during the first experiment.\n\nThe researchers concluded that their “findings suggest that the capacity for representing pretend objects is not uniquely human.”\n\n“Throughout his life, Kanzi repeatedly demonstrated skills that required us to reevaluate our understanding of ape cognition,” primate behavioural ecologist Nicholas E. Newton-Fisher, who teaches Evolutionary Anthropology at the University of Kent in England, told CNN Friday.\n\n“It seems suitable, therefore, that he has also provided experimental evidence of imagination. This is an exciting finding that lends experimental support to anecdotal reports from both captive and wild-living individuals,” added Newton-Fisher, who was not involved in the study.\n\nKanzi, who died in March, “was a particularly good subject” for the study because he was language-trained, Bastos, who is now a lecturer at the University of St. Andrews in Scotland, told CNN on Friday. Kanzi was “one of very, very few apes” who understood verbal prompts, which he responded to using a lexigram of over 300 symbols.\n\nAs part of the research centerApe Initiative, Kanziparticipated in various cognitive research projects, including a 2025 study that showed that bonobos can point out a hidden object if they notice that their human partner does not know where it is.\n\nDue to these abilities, and since Kanzi was the only bonobo tested in the study, it is not clear whether the results can be applied to other apes, the researchers said.\n\n“But, because there’s lots of these anecdotes out there, I wouldn’t be surprised to see that this extends beyond Kanzi,” Bastos added.\n\n“As the authors of this research note, generalising from Kanzi to other bonobos, and to other ape species, will require further investigation,” Newton-Fisher said.\n\nHowever, “while it is appropriate that we proceed with a degree of scepticism,” he added, “I suspect that we systematically under-appreciate the cognitive abilities of these species.”\n\nNonetheless, Newton-Fisher said we must remember that while “the mental abilities of adult apes are often compared to human children to benchmark their level of cognitive sophistication,” the apes have their own ape minds and brains. So, “how — imagination, for instance — manifests in an ape may not be a ‘cut-down’ version of the equivalent ability in humans.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/03/08/science/narwhal-tusks-play-behavior",
      "text": "play"
    },
    {
      "url": "https://www.cnn.com/2021/08/20/world/apes-social-interaction-greetings-scn",
      "text": "great apes"
    },
    {
      "url": "https://www.science.org/doi/10.1126/science.adz0743",
      "text": "Science"
    },
    {
      "url": "https://link.springer.com/article/10.1007/s10329-020-00836-z",
      "text": "seen"
    },
    {
      "url": "https://www.cell.com/current-biology/fulltext/S0960-9822(10)01449-1?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0960982210014491%3Fshowall%3Dtrue",
      "text": "observed"
    },
    {
      "url": "https://www.apeinitiative.org/",
      "text": "Ape Initiative"
    },
    {
      "url": "https://www.cnn.com/2025/02/05/science/bonobos-theory-of-mind-study-scli-intl",
      "text": "participated in various cognitive research projects"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/science/bonobo-kanzi-pretend-play-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a434590ea9b5b00794c041643bda5632c60ddd7b62328a9c81729290b51e0f3a",
  "scraped_at": "2026-02-11T16:34:21.413158+00:00"
}