{
  "url": "https://lite.cnn.com/2026/02/20/politics/military-power-buildup-us-iran-intl-vis",
  "title": "A look at the military hardware the US has positioned for potential war with Iran | CNN Politics",
  "date": "2026-02-21T07:05:37.069630+00:00",
  "authors": [
    "Avery Schmitz",
    "Annette Choi",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US military has assembled a massive collection of weapons systems in the Middle East amid diplomatic negotiations between the US and Iran, flooding ships and aircraft to nearby waters and the constellation of US bases in the region.\n\nMilitary planners have told President Donald Trump they will soon be ready to launch a strike,CNN reported Wednesday. However, sources said that Trump still hasn’t indicated a clear preference as to whether to give diplomatic talks, which included a meeting in Geneva Tuesday, more time or to pursue military action, or even what military action might be desirable. Potential strike plans presented to the White House range from quick strikes to more in-depth operations.\n\nMost of the forces ordered to the region as part of Trump’s escalating pressure campaign against Iran’s leadership have already been moved into place, though the USS Gerald Ford carrier strike group was still transiting to the region, having been spotted entering the Mediterranean on Friday.\n\nAt least 18 US F-35 Lightning II stealth fighters are now stationed at Muwaffaq Salti Air Base in northern Jordan. The fifth-generation fighters first appeared at the base on Tuesday and are seen clearly in new satellite imagery captured by Planet Labs.\n\nSatellite imagery also shows several E/A-18 Growlers arrived at the base, capable of waging electronic warfare campaigns against enemy air defenses and communications infrastructure.\n\nJust southwest of the runways, a newly-expanded air defense installation can be seen – one of several defensive positions set up to protect US assets in the event of strikes by Iranian forces. Similar sites have cropped up at key bases across the region,like Al Udeid Air Basein Qatar.\n\nNearly 850 miles southeast at Saudi Arabia’s Prince Sultan Air Base, new images confirm the arrival of additional US military aircraft. Several E-3 Sentries, critical for warning US commanders of incoming enemy forces or missiles and facilitating battlefield communications, have been positioned at the base.\n\nAn E-3 Sentry appears parked at the eastern edge of a ramp. At least four E-3s have moved into the Middle East since Wednesday, according to flight data shared with CNN by research consultant Steffan Watkins.\n\nTwo E-11 Battlefield Airborne Communications Nodes can also be seen nearby – another vital link in the US military’s tactical communications network. The modified Bombardier luxury jets enable American assets to communicate in complex environments. Flight data indicates at least two other E-11s are based out of Prince Sultan Air Base, for a total of four.\n\nThese aircraft appear alongside nearly a dozen tankers used to refuel smaller planes in midair.\n\nAmid these developments, US forces continue surveillance of the Strait of Hormuz at a near-constant pace, according to data from FlightRadar24, with P-8 Poseidon planes and MQ-4 Triton drones based in the UAE, Bahrain, and elsewhere patrolling the channel.\n\nAnother major US asset, the USS Abraham Lincoln carrier strike group, was moved from the Pacific and arrived in the Arabian Sea last month. On February 15, the aircraft carrier was spotted just 422 miles south of the Iranian coast in satellite imagery published by the European Space Agency.\n\nThe deployment was followed by the USS Gerald Ford carrier strike group which was making its way to the coast of Israel.\n\nThose carriers travel with a constellation of other ships including destroyers as well as F/A-18E and F-35C fighter jet squadrons.\n\nAs the US has collected its military hardware in the area, Iranis fortifying several of its nuclear facilities, using concrete and large amounts of soil to bury key sites, according to new satellite imagery and analysis from the Institute for Science and International Security.\n\nTrump, in his statements on Iran over the past weeks, has done little to gain buy-in from the American public or Congress for a large military operation in the country. He has hinted at a desire for regime change, and insisted Iran not obtain a nuclear weapon, but has not said what precisely his objectives would be in ordering an attack.\n\nCNN’s Natasha Bertrand, Kevin Liptak and Abigail Watts contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
      "text": "CNN reported Wednesday"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/politics/us-military-equipment-middle-east-iran",
      "text": "like Al Udeid Air Base"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/world/iran-us-military-strike-prep-latam-intl-vis",
      "text": "is fortifying several of its nuclear facilities"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/military-power-buildup-us-iran-intl-vis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/military-power-buildup-us-iran-intl-vis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a48b3fb13b89cf31642f16a7d27e61302715a7785002e0521268f8febe120fe0",
  "scraped_at": "2026-02-21T07:05:37.069644+00:00"
}