{
  "url": "https://lite.cnn.com/2026/02/25/science/stone-age-symbols-writing-precursor",
  "title": "Symbols found carved into 40,000-year-old German artifacts may be precursor to writing | CNN",
  "date": "2026-02-26T07:31:55.832237+00:00",
  "authors": [
    "Jacopo Prisco"
  ],
  "text": "Source: CNN\n\nSymbols and markings carved into tools and figurines by Stone Age humans over 40,000 years ago could be an ancient precursor to writing, according to a new analysis.\n\nThe marks, found on 260 artifacts from Germany, are very different from modern writing systems, but show the same level of complexity and density of information asproto-cuneiformscript, which arose in Mesopotamia, or modern-day Iraq, about 5,300 years ago. The script used abstract pictographic symbols and soon developed into cuneiform, which scholars consider thefirstknown writing system.\n\n“They are very similar, in fact, indistinguishable from the earliest proto-cuneiform,” said Christian Bentz, an associate professor at Saarland University in Germany and coauthor of a study on the Stone Age carvings, which published Monday in the journalPNAS. “This was really surprising to us, because we would have expected these sign sequences to not be close to either proto-writing or modern-day writing.”\n\nThe researchers used computer-assisted methods toanalyzeabout 3,000 geometric signs, including crosses, dots, notches and lines. Carved into objects made of ivory, bone and antler, the markings often represented animals that were common in the area at the time, such as woolly mammoths, lions, bears and horses. Some of the figurines, which were found to have a higher information density compared with the tools, depicted human-lion hybrids, perhaps as a form of connection to or appreciation for the land’s top predator, according to the study authors.\n\nThe objects analyzed in the study come from a relatively small area in the Swabian Alps in southwestern Germany, but they are not the only ones bearing these kinds of markings, which are commonly found on Palaeolithic, or Old Stone Age, tools and sculptures dating back between 34,000 and 45,000 years ago. “That’s more or less when anatomically modern humans entered the European continent from Africa and started living there,” said study coauthor Ewa Dutkiewicz, an archaeologist and curator at the Museum of Prehistory and Early History in Berlin.\n\n“Besides these markings, they had figurative art. They had tools. They had personal ornaments. They had musical instruments,” Dutkiewicz added. “So they were quite modern in their behavior, and now we could say that the foundation of a sign system was also present at that time.”\n\nThe signs often occur in patterns — such as line, line, line or cross, cross, cross — which is not common in spoken language, according to the researchers. Some of the artifacts were discovered almost 100 years ago, but ongoing excavations are constantly unearthing new ones. Over the years, scholars have interpreted the markings to mean many different things, including hunting tallies, moon calendars, fur patterns or simply decoration.\n\n“When I first had the result on screen, I could not believe it,” Bentz recalled about the moment he first looked at the computer analysis and saw a match between the older Stone Age markings and proto-cuneiform script found on more modern tablets from ancient Mesopotamia. “I sent a screenshot to my colleague.”\n\nThere seems to be a logic to the selection of symbols, according to Bentz. “On animal figurines, like mammoths and horses, but also on tools, we have crosses,” he said, “but we never find crosses on human figurines, so somehow there must have been a kind of taboo or convention to not put crosses onto human figurines.” Other studies have suggested that crosses could signify ritual killings, he added, so perhaps that’s why they weren’t found on sculptures of people.\n\nHowever, it’s still impossible to attach specific meaning to the signs. “These are very basic geometric figures, so even if I might be pretty sure about the meaning on a specific object, it might be completely different for another one,” said Dutkiewicz, noting that the meaning of a symbol could also have changed over the thousands of years that the artifacts span.\n\nThe findings could prompt a rethink of our concept of writing and its significance in human evolution, Dutkiewicz noted. “Usually when we talk about writing, it seems like this big, monolithic achievement that humans finally reach to become civilized,” she said. “But when we look at the archaeological evidence, we see there is much more going on beyond written language.”\n\nThe capacity to develop a written language was already there, the markings show, but a written language is not a necessity, and many cultures around the world did not develop one, Dutkiewicz added. “However, the mental capacity to transform information into codes is much older than we thought — that’s the drastic change that our study shows,” she said.\n\nThe new study contains clear evidence that the sequences of markings convey something, according to Robert Kentridge, a professor in the department of psychology at Durham University in England, who was not involved with the work. “We don’t know what they convey, but they’re conveying information,” Kentridge said. “They’re not just random. They’re not just decoration.”\n\nKentridge coauthored a previousstudyon artifacts from the same period that bear similar markings, in which researchers attempted to decipher the meaning of the signs. His team found an association between a symbol that looks like the letter Y and the time at which the animals depicted on the object gave birth, as well as a link between an X and the time of year the animals were seen mating. “If you’re a Palaeolithic hunter, those are perhaps important things to know,” he said.\n\nHowever, he added, Bentz and Dutkiewicz’s approach — to refrain from assigning meaning to the symbols — is the more sensible one. Regardless of meaning, the markings should put these Stone Age human ancestors in a different light.\n\n“Not so much in archaeology, but in the general public there’s still a tendency to view these people as cavemen who beat each other with big sticks, and that just seems completely wrong,” he concluded.\n\n“There is sophistication in the art and the sculpture that they produced,” Kentridge added. “I’m pretty sure that if we dressed them up in a suit, or jeans and a t-shirt, they’d be just like us.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.metmuseum.org/essays/the-origins-of-writing",
      "text": "proto-cuneiform"
    },
    {
      "url": "https://www.britannica.com/topic/writing/History-of-writing-systems",
      "text": "first"
    },
    {
      "url": "https://www.pnas.org/doi/10.1073/pnas.2520385123",
      "text": "PNAS"
    },
    {
      "url": "https://www.uni-saarland.de/en/news/steinzeit-zeichen-44061.html",
      "text": "analyze"
    },
    {
      "url": "https://www.cambridge.org/core/journals/cambridge-archaeological-journal/article/an-upper-palaeolithic-protowriting-system-and-phenological-calendar/6F2AD8A705888F2226FE857840B4FE19",
      "text": "study"
    }
  ],
  "hash": "a4d01b3c33a49bdd1cf76c94706e30763bde10374524836dd5dcd3de56de25b8",
  "scraped_at": "2026-02-26T07:31:55.832248+00:00"
}