{
  "url": "https://lite.cnn.com/2026/02/27/politics/iran-missiles-trump-intelligence-nuclear",
  "title": "Trump has claimed Iran is building missiles that could soon hit the US. Sources say that’s not backed up by US intelligence. | CNN Politics",
  "date": "2026-03-01T07:06:54.799373+00:00",
  "authors": [
    "Jennifer Hansler",
    "Natasha Bertrand",
    "Kylie Atwood",
    "Zachary Cohen"
  ],
  "text": "Source: CNN\n\nIn his first comments about Saturday’s US military strikes against Iran, President Donald Trump claimed in a video posted to social media that Iran has been building missiles that “could soon reach the American homeland.”\n\nIt’s an argument he also made in hisState of the Union addressTuesday night.\n\nHowever, that assertion is not backed up by US intelligence, sources told CNN.\n\nIt was one of several claims about threats from Iran made publicly by the Trump administration in the lead up to Saturday’s strikes.\n\nAnunclassified assessmentfrom the Defense Intelligence Agency (DIA) from 2025 said that Iran could develop a “militarily-viable” intercontinental ballistic missile by 2035 “should Tehran decide to pursue the capability.”\n\nAccording to two sources, the claim that Iran will soon have a missile capable of hitting the US is not backed up by intelligence — there is no intelligence to suggest that Iran is pursuing an ICBM program to hit the US at this time, the sources said.\n\nIran does, however, possess short range ballistic missilesthat could threaten US bases and personnel in the region, as the administration has warned.\n\nThree sources told CNN there has been no change in recent assessments about Iran’s intercontinental ballistic missile aspirations.\n\nWhite House spokesperson Anna Kelly responded to CNN’s reporting, saying “President Trump is absolutely right to highlight the grave concern posed by Iran, a country that chants ‘death to America,’ possessing intercontinental ballistic missiles.”\n\nThe matter of Iranian missile technology did not come up in a briefing with Secretary of State Marco Rubio, CIA Director John Ratcliffe and the “Gang of Eight” congressional leaders this week, sources familiar with the briefing said.\n\nIranian Foreign Minister Abbas Araghchi said in an interview released this week that his country was not developing long-range missiles.\n\n“We have deliberately limited the range of our missiles to 2,000 kilometers,” he told India Today TV, saying the missiles were for defense.\n\nThe State Department referred CNN to remarks Rubio made Wednesday.\n\nPressed on Trump’s claim that Iran could “soon” have missiles that could reach the US, Rubio said he would not speculate “as to how far away they are,” but said Iran is “certainly” trying to achieve intercontinental ballistic missiles.\n\n“You’ve seen them increasing the range of the missiles they have now, and clearly they are headed in the pathway to one day being able to develop weapons that could reach the continental US,” he told reporters at a press conference in St. Kitts Wednesday.\n\nHe argued that Iran’s refusal to discuss its ballistic missile program in negotiations that had been underway between the US and Iran in recent weeks is “a big problem.” The rounds of discussions between Washington and Tehran have, so far, only focused on nuclear issues.\n\nAsked about the DIA report on Iranian intercontinental ballistic missile development, Rubio said, “I won’t comment on assessments or anything that the Intelligence Community says. Suffice it to say that it’s a threat. We can see that it’s possible.”\n\n“Beyond just the nuclear program they possess these conventional weapons that are solely designed to attack America and attack Americans, if they so choose to do so. These things have to be addressed,” the top US diplomat said.\n\nOn the nuclear program, Rubio acknowledged that Iran is “not enriching right now,” but said “they’re trying to get to the point where they ultimately can.”\n\nHowever, Special Envoy Steve Witkoff – one of two main US negotiators – claimed in an interview released last Saturday that Iran was “probably a week away from having industrial-grade bombmaking material.” That claim came despite the Trump administration’s repeated assertions that the US had “obliterated” Iran’s nuclear program in military strikes last year.\n\nAccording to a source, intelligence shows that Iran is actively trying to build back its enrichment capability, including installing additional centrifuges, getting back online centrifuges that survived military strikes last year, and rebuilding facilities - many of which were damaged or destroyed - needed to weaponize the enriched uranium.\n\nHowever, sources and experts say that work would take far longer than a week. And, according to a source, the work to build back the nuclear program is happening in places that are not likely to be impacted by military strikes.\n\nCNN’s Alejandra Jaramillo contributed to this report\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/interactive/2026/02/politics/donald-trump-sotu-address-vis/",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.dia.mil/Portals/110/Documents/News/golden_dome.pdf",
      "text": "unclassified assessment"
    }
  ],
  "hash": "a4de0b1d27b314d3b7ecc085a859e666ff562c0e9ac4f413a879c04dba025835",
  "scraped_at": "2026-03-01T07:06:54.799385+00:00"
}