{
  "url": "https://lite.cnn.com/2026/02/18/style/new-york-fashion-week-fall-2026-women-designers",
  "title": "At New York Fashion Week, clothes women actually wear | CNN",
  "date": "2026-02-19T07:31:53.593102+00:00",
  "authors": [
    "Rachel Tashjian, CNN"
  ],
  "text": "Source: CNN\n\nMuch of the world is reeling from heinous realizations about men following the newly released tranche of Epstein files: that men in elite posts across government, business and academia have run the world corrupt and unchecked; that such men can pull the strings that influence everything from politics to college admissions to supermodel party guest lists.\n\nBut the American fashion scene offered a little respite: at an otherwise wan New York Fashion Week, which wrapped on Monday, a cohort of female designers stood out for making clothes that women actually want to wear. Most of these designers are not raking in the revenues of big European brands like Dior or Chanel. But unlike luxury businesses that present the runway as a fantasy to buoy handbag and perfume sales, these women are engaged in a deep relationship with their customers, who are finding pleasure in their beautifully cut tailoring, ravishing brocade coats and workaday, throw-it-on-for-that-million-bucks-feeling dresses.\n\n“They lack that theatricality on the runway,” said Kaelen Haworth, the designer turned retailer behind Canadian boutique Absolutely Fabrics, which carries Ashlyn, Diotima, Colleen Allen and Fforme. “But the payoff is that they actually make it into women’s wardrobes.”\n\nAmerican fashion is often considered the parochial commercial cousin of the grand, artistic European brands. But with many of those houses (Dior, Chanel, Louis Vuitton, Saint Laurent, Gucci – the list goes on) led creatively by men, American designers see themselves as a meaningful contrast, and their salability as a point of strength.\n\n“I really feel there’s more and more male dominant forces at the biggest brands – there’s only men dressing women. So I wanted to say, Hey,thisis sexy,” said Collina Strada designer Hillary Taymour, who showed a number of sultry but funky slip dresses – always the bestseller in her Chinatown store, according to the designer, and the kind of thing you wear so often to go out to dinner or grab a latte in the morning that it stays in a heap on your bedside chair rather than ever making it to a hanger in the closet.\n\n“The customer as the muse is how I think of it, rather than turning her into ‘my woman,’” said Daniella Kallmeyer, a South African-born, New York–based designer, who this season elevated her offering of sharp suiting with pieces intended to stand up to vintage discoveries, like jeweled cocktail trousers, sultry grandma knits and jackets cut from fine Italian milled fabrics. “She is the reason for my being, and her life, her existence, her story is what creates these puzzle pieces for me to fill in,” she said. “I think that is probably distinctly feminine.”\n\nA similar ethos was on display at Ashlyn, where designer Ashlynn Park’s nubby skirt suits and distinctive blouses are so appealingly unusual that a customer might find herself suddenly excited to get dressed for the office.\n\nWhether these are the sensual crochet gowns of Diotima, by Rachel Scott, or the more transportive whimsies of Tory Burch or Anna Sui, there’s a sense that these designers create without regard for what men might find compelling – not in a Man Repeller way, but rather flexing on your fellow women with a polished but eccentric ensemble, with an enviable secondhand find and a luxe pair of trousers. “I do find all of these designers to be good at creating what I think are incredibly sexy clothes, but there is little weight given to the male gaze,” said Haworth. “These are clothes made by women, for women to wear and women to appreciate.”\n\nThe idea isn’t to make feminist clothes per se but to cater to a world in which women can have what they want – clothes that allow women to indulge in fantasy (fringe, funny necklaces, dresses that reveal an unexpected snatch of skin) grounded in the pragmatism that a modern woman’s life demands. Burch and Sui’s ability to perfect that mix explains why both brands, in business for decades and still independent, are undergoing something of a renaissance. Burch showed rich tapestry opera coats with coordinating heels, beaded secretary sweaters with high-slit pencil skirts and grandpa’s snuggly cords and sweaters done with a more luxurious, indulgent hand. Putting women first is the heart of her brand: “I started my company because I wanted to help women,” she said. “I think women are very much the answer for what’s happening in our world today.”\n\nSui’s more fantastical collection, with fur-trimmed brocades, slips and bustles under fur wraps and little pink plaid suits, is the sort of thing women pore over for ideas – for getting dressed, going vintage shopping or even what movies or music to obsess over next. “It’s kind of mind-boggling that I’m getting maybe even more attention now than I did when I started, and throughout my career,” said Sui the day before her show.\n\nMultiple generations of women find Sui’s approach, of unearthing and sharing treasures, inspiring: “What I love about fashion is that discovery,” she said. “This is what I love about going to flea markets and finding something I’ve never seen before – being able to show it off. I think there’s that quality of me wanting everybody else to get the message.”\n\nBut there were fewer grand statements than there have been in seasons past, and perhaps for the better – too many designers seize on the runway as a political platform and merely perform positions everyone in the audience already agrees with, rather than saying something enlightening or challenging about our world. And those positions rarely feel connected to their clothes.\n\nTwo brands – one, Diotima, led by female designer Rachel Scott, and the other, Eckhaus Latta, by Mike Eckhaus and Zoe Latta – showed a subtler way to get fashion audiences thinking. The decade-and-a-half-old Eckhaus Latta reflects a larger shift in what was once called hipster culture, from what the warm, cuddly and whimsical (early Eckhaus Latta collections were filled with colorful, easy knits and denim) to something hard and even chic. In this week’s show, there were slinky fabrics and macho outerwear, and scraps of fur over jersey dresses clinging to terrific asses of all sizes.\n\nThe intelligentsia of New York City have largely forsaken utopian Brooklyn for the grittier gloss of Manhattan, where the nihilist stirrings of artists like Anne Imhoff generate weeks of discussion and swilling martinis at an old-school steakhouse is way cooler than finding a salad of newly trendy lettuce (excuse me –lettuces). Rather than drum out a blatant but comfortable message of resistance, the Eckhaus Latta show underscored that whatever alternative culture remains in America’s biggest city, it is in a mode of jaded, protective glamour, and a sensual, surly dress is your armor.\n\nAnd at Diotima, Jamaican-born Rachel Scott explored the works of Wifredo Lam, an Afro-Cuban painter who traversed Europe with Pablo Picasso and Andre Breton, finding resonance in his explorations of the art world’s exoticism of Black culture and religion. There is a fantastic Lam retrospective at the Modern Museum of Art, but Scott had the idea months before and went to great lengths to convince Lam’s estate to collaborate. Instead of merely grafting his works onto her own, as too many fashion designers do, Scott incorporated his color palette – deep burgundies, bleached grays and powdery blues on knit fringed skirts, keepsake coats and very original dresses – and his obsession with the mystical Santeria matriarch femme cheval, plus interpreted his leafy canvases in her own organza, crotchet and Gobelin tapestry fabrics. Her clothes are sexy without being overt – the rare adult statement in a fashion world too fixated on disposable clothes.\n\nScott, a Jamaican-born designer who wore an “ICE Out” pin for interviews after her show, calls Diotima an anti-imperialist brand, which is always an uphill battle in an industry of privilege and excess. Her elegant collaboration was a reminder that the world has long created the kinds of crises that threaten our stability today, and a good artist finds a way to make work that shows us a way through it, even if the answer is as simple as making something beautiful.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/style/new-york-fashion-week-fall-2026-women-designers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/style/new-york-fashion-week-fall-2026-women-designers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a51cf06d89cd20fc654125f33d9603729f3b58b4a9687580e8b74a506fbc4335",
  "scraped_at": "2026-02-19T07:31:53.593116+00:00"
}