{
  "url": "https://lite.cnn.com/2026/02/25/middleeast/us-israel-diplomatic-services-west-bank-annexation-intl",
  "title": "US offers diplomatic services in West Bank settlement for first time. Critics warn it’s ‘normalizing annexation’ | CNN",
  "date": "2026-02-27T07:18:11.001104+00:00",
  "authors": [
    "Dana Karni",
    "Oren Liebermann"
  ],
  "text": "Source: CNN\n\nThe US embassy in Israel has announced its first-ever event offering diplomatic services in a Jewishsettlement in the Israeli-occupied West Bank.\n\nTheannouncement on Tuesdaysaid consular offices would provide “routine passport services” to American citizens in the settlement of Efrat, south of Jerusalem, in a one-day event on Friday. The embassy said the outreach effort was part of the “Freedom 250” initiativeto reach all American citizens.\n\nThis move appears to signal further US legitimization of Israeli settlements in the West Bank, which is considered by much of the international community as land for a future Palestinian state.\n\nIt breaks with decades of US foreign policy, which has held that Israeli settlements in the West Bank are an obstacle to peace. But President Donald Trump is no stranger to such dramatic shifts in American policy. During his first administration, the US reversed its longstanding position on settlements when then-Secretary of State Mike Pompeo said they were not inconsistent with international law.\n\nConsular events will also be held in the Palestinian city of Ramallah and the settlement of Beitar Illit in the West Bank, as well as the cities of Jerusalem, Haifa, Netanya and Beit Shemesh, though no dates have been announced.\n\nIsrael’s foreign ministry celebrated the announcement as a “historic decision” to “extend consular services to American citizens in Judea and Samaria,” using the biblical term for the West Bank.\n\nXavier Abu Eid, a former spokesman for the Palestine Liberation Organization’s negotiations department, said on social media: “Five months after President Trump said that he is against annexation, his representatives on the ground are providing services inside Israeli settlements, effectively treating all the land as part of Israel. Normalizing annexation step by step.”\n\nJust days ago, US Ambassador to Israel Mike Huckabee told conservative commentator Tucker Carlson that it would be “fine” if Israel took over much of the Middle East. Asked if Israel should be allowed to take over land extending as far as the Euphrates River in Iraq, Huckabee said, “It would be fine if they took it all,” before adding, “I don’t think that’s what we’re talking about here today.”\n\nA group of Arab and Muslim countries denounced Huckabee’s expansionist comments as “dangerous and inflammatory,” calling them a “flagrant violation of international law.”\n\nThe Palestinian foreign ministry said Saturday that Huckabee’s remarks “contradict religious and historical facts, international law, and the position expressed by US President Donald Trump rejecting the annexation of the West Bank.”\n\nTrump has said that he will not allow Israel to annex the West Bank, but Israel’s government has pushed forward with a surge in settlement expansion andtightened the country’s gripon the territory.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://x.com/usembassyjlm/status/2026321978932519049",
      "text": "announcement on Tuesday"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/patriot-games-america-250-details",
      "text": "Freedom 250” initiative"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/middleeast/israel-netanyahu-west-bank-dc-intl",
      "text": "tightened the country’s grip"
    }
  ],
  "hash": "a5347f1023becc0748c4c0d2b2e5e8902e40ca7070f80ec903db68e8a22cd659",
  "scraped_at": "2026-02-27T07:18:11.001119+00:00"
}