{
  "url": "https://lite.cnn.com/2026/02/17/sport/tony-clark-mlbpa-baseball-future",
  "title": "Tony Clark to abruptly resign as MLBPA executive director | CNN",
  "date": "2026-02-18T07:31:59.984330+00:00",
  "authors": [
    "Hannah Keyser, CNN"
  ],
  "text": "Source: CNN\n\nTony Clarkis resigning as the executive director of the Major League Baseball Players Association, sources confirmed toCNN Sports. Clark led the union in the last two rounds of collective bargaining and was expected to lead the players in another contentious CBA negotiation following this upcoming season.\n\nThe timing of this resignation, expected to be announced later today, is surprising. Clark was scheduled to start his annual tour of spring training camps today. More critically, the current CBA expires on December 1 of this year, at which point it seems likely that the owners will lock out the players.\n\nRhetoric ahead of CBA negotiations is often heightened and heated, but owners have been building a case in the court of public opinion that a salary cap is necessary for competitive balance amid growing disparities in team spending. For players, a salary cap has long been a non-starter and the issue could lead to a protracted work stoppage.\n\nClark, 53, is a former player who ascended to the union’s executive director role in 2013 following the death of Michael Weiner. But more recently, Clark’s tenure has been marred by dissent and distractions.\n\nThere was an attempt to oust lead negotiator Bruce Meyer in 2024. Clark stood by Meyer, and the players who had fomented the failed coup were later voted off the executive subcommittee.\n\nLast year, it was revealed that Clark himself and the MLBPA are part of a federal investigation into One Team Partners, a licensing company founded by the union and the NFL Players Association. At the time, Clark and the MLBPA hired separate lawyers,according to reports. There havealso been accusations of nepotism.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/04/business/baseball-salary-cap-2027",
      "text": "Tony Clark"
    },
    {
      "url": "https://www.cnn.com/sport",
      "text": "CNN Sports"
    },
    {
      "url": "https://www.nytimes.com/athletic/6401524/2025/06/03/tony-clark-mlbpa-lawyers-federal-probe/",
      "text": "according to reports"
    },
    {
      "url": "https://www.espn.com/mlb/story/_/id/46770967/feds-probe-profit-venture-mlb-players-association-sent-millions",
      "text": "also been accusations of nepotism"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/tony-clark-mlbpa-baseball-future",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/sport/tony-clark-mlbpa-baseball-future",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a5abee95e1299844adfe255084e3220fd859901ad991c8a8e04e4b54daba927d",
  "scraped_at": "2026-02-18T07:31:59.984342+00:00"
}