{
  "url": "https://lite.cnn.com/2026/02/18/health/abortion-clinic-closures-guttmacher",
  "title": "Abortion clinics are closing, even in states that have become key access points | CNN",
  "date": "2026-02-19T07:31:41.196102+00:00",
  "authors": [
    "Deidre McPhillips, CNN"
  ],
  "text": "Source: CNN\n\nDozens of abortion clinics closed in the US after the Supreme Court Dobbs decision revoked the federal right to an abortion in June 2022 — mostly in states that enacted bans. But the churn has continued, leaving even states with some of the most protective abortion policies to do more with less.\n\nThere were 753 brick-and-mortar abortion clinics in the US at the end of 2025, according toa new reportby the Guttmacher Institute — ​54 fewer than in ​2020, including a net loss of 12 abortion clinics since March 2024.\n\n“Running a clinic in an environment like we have today is oftentimes not sustainable,” said ​Brittany Fonteno, president and CEO of the National Abortion Federation. Both financial and community support play critical roles, she said.\n\nIn New York, abortion is legal and protected; voters enshrined the right to abortion in the state’s constitution in 2024. But the state has eight fewer abortion clinics than it did at the start of 2024, Guttmacher data shows, one of the most significant decreases in that timeframe nationwide.\n\nAmong the clinics that closed last year was a Planned Parenthood in New York City, the nonprofit’s only location in Manhattan.\n\nThe closure was “a big blow,” said Chelsea Williams-Diggs, executive director of the New York Abortion Access Fund.\n\n“All clinic closures are a travesty,” she said. “But the Planned Parenthood on Bleecker Street was a powerhouse of a clinic that was able to do so much for folks.”\n\nPlanned Parenthood typically accepts a wider set of insurance coverage than smaller independent clinics can, and locations in New York could often enroll eligible patients in Medicaid on the same day as their appointment. The clinic in Manhattan was also one of a small and shrinking number that provide abortions after the first trimester, which can be particularly expensive.\n\n“That has direct impacts on abortion access and on abortion funds,” Williams-Diggs said. “If more folks don’t have health insurance, if more folks are strained economically, that means more folks will be calling NYAAF to help them pay for an essential health care service.”\n\nIn a statement about the closure, the president and CEO of Planned Parenthood of Greater New York said that “the gap between inflation and stagnant reimbursement rates has forced us to make difficult but necessary decisions.”\n\nAdditionalmoves by the Trump administrationhave further strained clinics, including a block on Medicaid reimbursement to large abortion providers. Planned Parenthood closed more than 50 health centers last year, some of which provided abortion care.\n\nClinics are left with “unsustainable financial realities,” said Angela Vasquez-Giroux, vice president of communications for the Planned Parenthood Federation of America.\n\n“When a health center is forced to close, all patients lose access to their trusted provider, and entire communities are left unable to get high-quality reproductive health care, including abortion in many places,” she said. “These are not easy decisions to make.”\n\nIt’s important to track changes to the number of brick-and-mortar abortion clinics in the US, said ​Rachel Jones, a principal research scientist with Guttmacher and lead author of the new report. But the overallchange in the number of clinics is only one measure of abortion access that can mask a lot of nuance, she said.\n\n“If it’s a place that doesn’t advertise that they provide abortion care, then it’s not really accessible to a lot of people. If it’s a place that only takes private health insurance or you have to be a pre-existing client, that’s not necessarily going to make abortion care accessible to people,” Jones said. “If you want a procedural abortion and they only offer medication abortion then you might still have to travel outside of your community or even to another state to access care.”\n\nSince the Dobbs decision, the number of people who travel out-of-state for abortion care each year has doubled — and about a quarter of those who travel go to Illinois.\n\nThe state has become a critical access point for abortion care, welcoming tens of thousands of patients from other states each year  — but there are fewer clinics to serve this surge in patients. Illinois had 31 brick-and-mortar abortion clinics at the end of 2025, two fewer than in March 2024, according to the new Guttmacher report.\n\nHowever, experts say that a strong network of support from the community and policymakers make Illinois particularly resilient. So while number of clinics in the state dropped overall, there were some important additions.\n\nHope Clinic opened a second location in Illinois last summer, offering abortions up to 34 weeks and other reproductive health care services in the uptown neighborhood of Chicago.\n\nClinic co-owner Julie Burkhart said that the team started talking about where another clinic might be needed in the country soon after the Dobbs decision, but it took nearly three full years to open their doors in Chicago. About half of that time was spent on construction after purchasing a building.\n\n“We took a look around the country to see where abortion care, specifically later in pregnancy, would be needed and essential for people in this country, and it seemed that Chicago, was the best point for us to locate a new clinic,” Burkhart said. “But these projects definitely don’t happen overnight.”\n\nTelehealth abortion — with medication abortion provided to patients through the mail — has become increasingly common since it first became an option in late 2021.\n\nIn the first half of 2025, more than a quarter of all abortions within the US health care system were provided via telehealth, up from less than 10% in the first half of 2023, according todata from #WeCount, a project sponsored by the Society of Family Planning.\n\nBut the vast majority of abortions still happen in person, sometimes because of individual preference and sometimes because it’s necessary.\n\nAnd experts say that later abortions that require in-person care are becoming more common amid post-Dobbs restrictions.\n\n“When there are abortion bans and people can’t get access to the care they need earlier in pregnancy, that doesn’t necessarily stop their need for that care,” Fonteno said. “So one of the outcomes of abortion bans is seeing people be pushed further into their pregnancy by the time they get the care that they need, so we are seeing more providers focus on sort of this specialty form of abortion care.”\n\nHope Clinics in Illinois have seen patients from 28 different states, Burkhart said.\n\n“I think that that really illustrates how critical our clinics are,” she said.\n\nThere is also concern among abortion advocates that the federal government may put new limits on access to medication abortion, which could further strain clinic resources.\n\nThe Trump administration isconducting its own reviewabout the safety and efficacy of one of the drugs used in medication abortion to investigate how it can be safely dispensed, despite clinical studies and decades of use that have established the drug’s safety and effectiveness.\n\nBut providers are already thinking through possible contingency plans, Fonteno said.\n\n“One of the things that is so incredible about abortion providers is that there’s a lot of resilience and a lot of energy to continue to innovate and think about different ways to provide care,” Fonteno said. “Brick-and-mortarclinics will always have a place in communities across the country.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.guttmacher.org/report/abortion-clinics-united-states-2024-2025",
      "text": "a new report"
    },
    {
      "url": "https://www.cnn.com/2025/09/11/politics/trump-administration-can-stop-medicaid-spending-to-planned-parenthood-for-now-appeals-court-rules",
      "text": "moves by the Trump administration"
    },
    {
      "url": "https://www.cnn.com/2025/12/09/health/abortion-trends-cdc-delay-wecount-report",
      "text": "data from #WeCount"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/health/mifepristone-review-fda-hhs-abortion",
      "text": "conducting its own review"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/health/abortion-clinic-closures-guttmacher",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/health/abortion-clinic-closures-guttmacher",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a5fb32f76ccc2776ab27af912e2d0ae3755b94af4dd0adbdaafc6d91c951793f",
  "scraped_at": "2026-02-19T07:31:41.196115+00:00"
}