{
  "url": "https://lite.cnn.com/2026/02/14/americas/canada-shooting-gun-buyback-criticism-latam-intl",
  "title": "Gun control is popular in Canada. So why is a major buyback program attracting criticism? | CNN",
  "date": "2026-02-15T07:10:44.035637+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThedeadly mass shootingat a school in British Columbia came as Canadian authorities face significant obstacles in rolling out a nationwide firearms buyback that is mired in practical and logistical complications.\n\nCanada already hasfar stronger gun lawsthan the United States, and mass shootings are extremely rare. The government broughtforward major reforms and bans on assault-style weapons after the country suffered its worst-ever shooting attack in 2020, when a man impersonating a police officer killed 22 people in northern Nova Scotia.\n\nIn January, Canada began implementing one of those reforms: a long-awaited, hotly debated program to compensate the country’s gun owners for their now-banned firearms. Yet the buyback program has suffered yearslong delays and pushback from police, provincial officials and gun owners.\n\nIn September, audio emerged of Canada’s Minister of Public Safety Gary Anandasangaree, the official responsible for implementing the legislation,questioningthe ability of police departments to enforce the buyback. Anandasangaree later said the recording was made without his knowledge, and said the comments were “misguided.”\n\nUnder a framework unveiled last month, Canadians who own any of the2,500 prohibited makes and modelsof assault-style   weapons have until March 31 to sign up to turn in their guns and possibly receive money in return.\n\nIf they sign up after that date, gun owners won’t be compensated – but they’ll still have to give up their guns or permanently decommission them by October 30, 2026, or risk criminal liability for the illegal possession of a prohibited firearm.\n\nComplicating the buyback is the fact that Canada has plenty of guns, more than the program alone can collect. The federal government estimates that it has the funds tobuy 136,000firearms, but Canada has roughly 2 million registered and 10 million unregistered guns, according to a 2017 release from the Small Arms Survey, an independent research group based in Switzerland.\n\n“Canada actually has a fairly high rate of civilian gun ownership compared to any other advanced democracy,” said Blake Brown, a gun control expert and professor at St. Mary’s University in Nova Scotia.\n\nBrown said the buyback has proceeded “very slowly,” in some cases due to opposition from gun owners, despite overall support for gun control among Canadians.\n\n“Based on polling, there’s almost always very strong support for greater gun control,” Brown said. “But it is a political issue. The Conservative Party of Canada has, in its current form, aligned itself with a lot of the positions of gun owners in the country.”\n\nOne of those gun owners is Rod Giltaca, the CEO of the Canadian Coalition for Firearms Rights, a group thatbills itselfas “Canada’s Gun Lobby.” Giltaca told CNN that while he strongly supports Canada’s strict licensing regulations, he thinks the buyback goes too far.\n\n“We are not anti-regulation,” Giltaca said. “We just want to make sure that those regulations have a demonstrable effect on public safety, and if they’re just there to punish law abiding gunowners, then they should be withdrawn.”\n\n“There’s a vibrant gun culture in Canada,” Giltaca continued. “And as long as that isn’t interrupted for frivolous political reasons, I’m in favor of regulation.”\n\nThe buyback has also been met with friction in western Canada. The province ofAlbertahas said itwon’t participatein the buyback and barredits police forces from taking part. Saskatchewan and Manitoba have also said they won’t participate.\n\n“We’ve made it clear from the beginning,” said Teri Bryant, Alberta’s Chief Firearms Officer, who spoke to CNN from the sidelines of a weekend gun show.\n\n“We weren’t gonna participate in this scheme,” Bryant said. “And they’ve had six years: if they really thought this was so important, they would have set up some kind of a mechanism.”\n\nIn a statement to CNN, the Ministry of Public Safety said that in the absence of provincial approval and police cooperation, the federal government will be sending “mobile collection units” (MCUs) to retrieve prohibited firearms from their owners.\n\n“The decision of local police forces to not administer the collection of firearms will not prevent the federal government from collecting them through these MCUs,” said spokesperson Simon Lafortune.\n\nBut Bryant said she doesn’t know how those MCUs will operate in Alberta.\n\n“Those mobile collection units would need a seizure agent license from us,” Bryant said. “They haven’t applied for one.”\n\nElsewhere in the country, some police departments are still debating whether to join the buyback or not, and some have said outright that they will not participate.\n\nFour days after the shooting in Tumbler Ridge, Kingston, Ontario’s police departmentannouncedthat the mid-sized city would not collect or store prohibited guns for the program, citing an October recommendation from the Ontario Association of Chiefs of Police (OACP).\n\nJosé Couto, the spokesperson for the OACP, told CNN police in Canada are most concerned about firearms that aren’t owned by licensed Canadian gun owners, usually guns that come over the US border illegally.\n\nThat includes some of the firearms used in the 2020 mass shooting that pushed Canada’s government to adopt the buyback.Three of the gunsused in the rampage were smuggled illegally from Maine. The shooter also illegally owned another gun he used, a model of rifle now banned and subject to the buyback law.\n\nIn a statement to CNN, Lafortune of the Ministry of Public Safety said the buyback “is only one part of our government’s wide ranging, comprehensive approach to combatting crime across Canada and ensuring the safety and security of all Canadians,” pointing to other legislation put forward by the Liberal government to eliminate gun smuggling and tighten bail laws.\n\n“Our priority is keeping communities safe by removing assault-stylefirearms from circulation, cracking down on gun smuggling at the border, and investing in the police and community programs that prevent gun crime in the first place,” Lafortune said.\n\nBut some experts on gun violence are still wary of endorsing the program. Jooyoung Lee, a sociologist at the University of Toronto, told CNN that previousbuyback schemes in other countrieshave had “minimal or no effect on violent crime rates.”\n\n“I can understand the reluctance of police to enforce this stuff,” said Lee. “It’s very evocative because people see all these guns (collected) and the assumption is, ‘okay, now there are this many fewer guns on the streets.’ So why aren’t we all safer?”\n\n“The problem is a social network problem,” Lee continued. “The people who are participating in these programs are very unlikely to be the ones who are submitting or channeling guns into underground networks and into the hands of people who are committing crimes.”\n\nStudies haveshown, however, that buybacks account for significant declines in mass shootings. That’s a point stressed by Wendy Cukier, president of the Coalition for Gun Control. Cukier has advocated for stricter gun laws in Canada since the 1989 massacre at the École Polytechnique in Montreal.\n\nShe told CNN that the buyback isn’t meant to be a cure-all for criminal gun use in Canada, but rather to deter mass shootings like the one in Tumbler Ridge.\n\n“The buyback is aimed to address a very specific issue,” Cukier said, “which is that Canadians do not feel civilians should have access to semi-automatic military-style firearms, period.”\n\nAs for the effect on legal gun owners, Cukier pointed tostatisticsthat show around half of firearms used in homicides in Canada had been obtained legally, at least initially.\n\n“Our basic position is always that no legislation can prevent all tragedies,” Cukier said. “It’s really about risk management. Countries that have stronger gun laws tend to have fewer of these incidents and lower rates of gun homicide, at least if you look at industrialized countries.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/americas/tumbler-ridge-shooting-suspect-online-posts-intl-hnk",
      "text": "deadly mass shooting"
    },
    {
      "url": "https://www.cnn.com/world/live-news/tumbler-ridge-canada-shooting-02-11-26?post-id=cmlhvdy2i00053d5tlvdvug9z",
      "text": "far stronger gun laws"
    },
    {
      "url": "https://www.cnn.com/2021/04/18/americas/canada-worst-mass-shooting-anniversary",
      "text": "uffered its worst-ever shooting attack in 2020"
    },
    {
      "url": "https://www.cbc.ca/news/politics/gun-buyback-enforcement-minister-1.7640536",
      "text": "questioning"
    },
    {
      "url": "https://www.canada.ca/en/public-safety-canada/campaigns/firearms-buyback/individual-lists-firearms-lower-upper-receivers/list-firearms-individuals.html#wb-auto-4",
      "text": "2,500 prohibited makes and models"
    },
    {
      "url": "https://www.cbc.ca/news/politics/liberal-gun-buyback-federal-government-9.7050046#:~:text=At%20a%20news%20conference%20on%20Saturday%20outlining%20the%20next%20steps,program%20funds%20at%20that%20time.",
      "text": "buy 136,000"
    },
    {
      "url": "https://firearmrights.ca/who-we-are/",
      "text": "bills itself"
    },
    {
      "url": "https://www.cbc.ca/news/canada/calgary/alberta-gun-buyback-program-9.7053027",
      "text": "Alberta"
    },
    {
      "url": "https://open.alberta.ca/dataset/e63cc34c-bbef-4027-800a-0d67b7057e7b/resource/80c9f5c0-f3ca-42d8-b7f8-697623d89288/download/jsg-ministerial-letters-to-minister-of-public-safety-of-canada-firearm-confiscation-final.pdf",
      "text": "won’t participate"
    },
    {
      "url": "https://www.kingstonpolice.ca/news/posts/kingston-police-will-not-be-participating-in-the-federal-assault-style-firearm-compensation-program-asfcp/",
      "text": "announced"
    },
    {
      "url": "https://masscasualtycommission.ca/files/documents/Turning-the-Tide-Together-Volume-3-Violence.pdf",
      "text": "Three of the guns"
    },
    {
      "url": "https://www.cnn.com/2021/03/24/world/mass-shootings-international-response-intl",
      "text": "buyback schemes in other countries"
    },
    {
      "url": "https://www.rand.org/research/gun-policy/analysis/essays/1996-national-firearms-agreement.html",
      "text": "shown"
    },
    {
      "url": "https://www150.statcan.gc.ca/n1/pub/85-002-x/2024001/article/00001-eng.htm#:~:text=had%20initially%20been%20obtained%20legally%20in%20half%20of%20cases",
      "text": "statistics"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/americas/canada-shooting-gun-buyback-criticism-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/americas/canada-shooting-gun-buyback-criticism-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a6262e828f75c704f93e90c78f6e66586998ce7f0473b1b0071cc38002115581",
  "scraped_at": "2026-02-15T07:10:44.035651+00:00"
}