{
  "url": "https://lite.cnn.com/2026/02/18/us/5-things-to-know-for-feb-18-social-media-trial-epsteins-zorro-ranch-nancy-guthrie-boat-strikes-nuclear-talks",
  "title": "5 things to know for Feb. 18: Social media trial, Epstein’s Zorro Ranch, Nancy Guthrie, Boat strikes, Nuclear talks | CNN",
  "date": "2026-02-19T07:31:55.660727+00:00",
  "authors": [
    "Alexandra Banner, CNN"
  ],
  "text": "Air Force One will be repainted in President Donald Trump’spreferred red, white, gold and dark blue color scheme— a design proposed during his first term in office but later reversed by the Biden administration. The change will replace the baby blue and white livery that has defined the presidential aircraft for more than 60 years.\n\nHere’s what else you need to know to get up to speed and on with your day.\n\nMeta CEO Mark Zuckerberg will face grieving families today when he takes the stand in alandmark social media addiction trialin Los Angeles. He will testify for the first time before a jury on claims that his Facebook and Instagram platforms have harmed young users by making the apps intentionally addictive. In the courtroom will be parents and families from across the US who say their children were harmed — or even died — as a result of social media. The case could set a precedent for holding social media companies responsible for dangerous design decisions, after years of tech giants fending off lawsuits under Section 230, the law that shields them from liability for user content.\n\nNew Mexico’s House of Representatives has approved creating a bipartisan special committee to investigate the ranch that the late sex offender Jeffrey Epstein owned in the state. The measure directs the committee, known as the Truth Commission, to examine “allegations of criminal activity” at theproperty known as Zorro Ranchand determine whether further “legislative action” is required. The committee’s creation is the latest call for transparency and further investigation in the aftermath of the Justice Department’s release of a trove of Epstein files, which has sent shockwaves through several industries after revelations about the late financier’sties to prominent figures.\n\nThe search for 84-year-old Nancy Guthrie, mother of “Today” show host Savannah Guthrie, remains heightened, with authoritiescanvassing neighborhoods in Arizonaand reviewing thousands of tips in hopes of locating her safely. On Tuesday, the Pima County Sheriff’s Office reported that DNA recovered from gloves found about two miles from Guthrie’s home did not match any profiles in the FBI’s offender database and showed no connection to DNA collected at her residence. Guthrie was last seen on January 31 and is believed to have been abducted from her secluded home without her phone or critical medications.\n\nThe US military has struck three more suspected drug-trafficking boats in the eastern Pacific and Caribbean, killing 11 people, US Southern Command said Tuesday. The latest operation brings the death toll from theUS campaign against international drug trafficking— launched in September — to at least 135. Prior to September, alleged cartel members and drug smugglers were treated as criminals with due process rights. Democrats and legal experts argue the strikes amount to murdering civilians since the US is not in a declared, congressionally authorized war with drug cartels.\n\nIran and the US walked away from Tuesday’s nuclear negotiations with “guiding principles” for future talks, according to Iran’s foreign minister. This comes as the US military continues tobuild up its assets in the Middle Eastand as President Trump has warned Iran of a “very traumatic” outcome if they don’t agree to a deal in the coming weeks. US officials also said “progress was made” during the discussions and that the US expects to receive detailed proposals from the Iranian government in the next two weeks to address gaps between their positions.\n\nRescuers are braving a brutal winter storm in a search for at least nine skiers missing after a California avalanche. So far,six have been pulled to safety.\n\nDefinitely not your typical patient.\n\nIn 25 years, dozens of places may betoo warm to host the Winter Olympics.\n\nBite-sized shifts in thinking canhelp you achieve your goals, says Dr. Michele Kehrer, author of the new book “Brave Shift.”\n\nWith budgets under strain, some state lawmakers and advocates arepushing to raise taxeson two groups: millionaires and billionaires.\n\nCuba is facing thedeepest economic uncertaintyits residents have seen in decades — or perhaps in their lifetimes.\n\n🌤️Check your local forecastto see what you can expect.\n\nAn insult from President Trump directed at CNN’s Kaitlan Collins recently made headlines.See her reaction.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/new-af1-paint-job",
      "text": "preferred red, white, gold and dark blue color scheme"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/tech/meta-mark-zuckerberg-testifies-social-media-addiction-trial",
      "text": "landmark social media addiction trial"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/epstein-ranch-new-mexico-house-committee",
      "text": "property known as Zorro Ranch"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/doj-epstein-files-prominent-people",
      "text": "ties to prominent figures"
    },
    {
      "url": "https://www.cnn.com/us/timeline-nancy-guthrie-search",
      "text": "canvassing neighborhoods in Arizona"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/us-military-strike-alleged-drug-boats-kill-11",
      "text": "US campaign against international drug trafficking"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy",
      "text": "build up its assets in the Middle East"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "six have been pulled to safety"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/world/video/injured-bird-cormorant-hospital-digvid-vrtc",
      "text": "Definitely not your typical patient"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/milan-winter-olympics-results-highlights-medals-02-18-26?post-id=cmlr84v1q00053b6p8qmbrd15",
      "text": "too warm to host the Winter Olympics"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/health/new-year-resolution-michele-kehrer-wellness",
      "text": "help you achieve your goals"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/business/tax-rich-state-budgets",
      "text": "pushing to raise taxes"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/americas/cuba-us-trump-oil-tourism-intl-latam",
      "text": "deepest economic uncertainty"
    },
    {
      "url": "https://www.cnn.com/weather",
      "text": "Check your local forecast"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/video/kaitlan-collins-reacts-to-trumps-smile-remark-vrtc",
      "text": "See her reaction"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/us/5-things-to-know-for-feb-18-social-media-trial-epsteins-zorro-ranch-nancy-guthrie-boat-strikes-nuclear-talks",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/us/5-things-to-know-for-feb-18-social-media-trial-epsteins-zorro-ranch-nancy-guthrie-boat-strikes-nuclear-talks",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a6296ef514bfe6107938449ea2d9f172003bcc24bb7d50c4e37fc481068e9971",
  "scraped_at": "2026-02-19T07:31:55.660739+00:00"
}