{
  "url": "https://lite.cnn.com/2026/02/27/middleeast/us-embassy-israel-non-essential-staff-intl",
  "title": "US ambassador to Israel tells embassy staff if they want to leave they ‘should do so TODAY’ | CNN",
  "date": "2026-03-01T07:07:59.071072+00:00",
  "authors": [
    "Jeremy Diamond",
    "Oren Liebermann"
  ],
  "text": "Source: CNN\n\nUS Ambassador to Israel Mike Huckabee told embassy staff in an email on Friday that if they want to leave the country amid the possibility of a strike on Iran they “should do so TODAY,” according to a source familiar with the message.\n\nHuckabee told embassy staff there was “no reason to panic” and said the decision came out of “an abundance of caution.” He noted the likely high demand for flights out of Israel on Friday and urged staff to buy tickets to any destination from which they could subsequently fly to Washington.\n\nEarlier Friday, the embassy authorized non-essential personnel to leave the country amid the possibility of astrike on Iran.\n\nThe US embassy announced on its website that the State Department had authorized non-emergency staff and family members to leave “due to safety risks.”\n\nThe embassy went on to say, “Persons may wish to consider leaving Israel while commercial flights are available.”\n\nCNN has reached out to the State Department for more details.\n\nThe UK announced that it had temporarily withdrawn its staff from Iran and that the embassy would operate remotely.\n\nMeanwhile France urged its nationals not to travel to Israel or the occupied West Bank due to the situation in Iran.\n\nThe warnings come the day theUSS Gerald Ford carrier strike groupis expected to arrive in northern Israel as part of the buildup of US forces in the Middle East ahead of a potential strike on Iran.\n\nThe US also has a dozen stealth F-22 fighter jets at a base in southern Israel or en route, CNN previously reported, as well as at least nine aerial tankers on the tarmac at Tel Aviv’s Ben Gurion International Airport.\n\nThe US and Iran have engaged in a series of high-stakes talks to try to reach a new nuclear agreement, including the most recent meeting in Geneva on Thursday. But it’s unclear if a deal is possible in light of the significant gaps between Washington and Tehran.\n\nUS envoys Steve Witkoff and Jared Kushner demanded the complete dismantlement of Iran’s primary nuclear facilities – Fordow, Natanz, and Isfahan – as part of any agreement and that restrictions on nuclear enrichment last in perpetuity. Iran, meanwhile, was expected to offer a proposal that would merely suspend enrichment for three to five years until after President Donald Trump leaves office.\n\nOn Friday, Omani Foreign Minister Badr Al Busaidi, who has been a key mediator during the talks, briefed Vice President JD Vance in Washington on the latest efforts to reach an agreement.\n\nAl Busaidi told Vance the talks “achieved major, important and unprecedented progress, which could form the basis for the desired agreement,” according to the Omani foreign ministry.\n\nBut even with the diplomatic effort ostensibly ongoing, the commander of US Central Command, Adm. Brad Cooper briefed Trump on potential military options in Iran.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
      "text": "strike on Iran"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/military-power-buildup-us-iran-intl-vis",
      "text": "USS Gerald Ford carrier strike group"
    }
  ],
  "hash": "a65d4249c6b2fa67c008e78be219320afca7575a4684a006b7189fc45e15df6a",
  "scraped_at": "2026-03-01T07:07:59.071083+00:00"
}