{
  "url": "https://lite.cnn.com/2026/02/09/politics/justice-department-dismiss-steve-bannon-capitol-riot-contempt",
  "title": "Justice Department seeks to dismiss Steve Bannon’s Capitol riot contempt case | CNN Politics",
  "date": "2026-02-11T16:33:52.481364+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFederal prosecutors on Monday moved to drop a criminal case brought during the Biden administration againstSteve Bannon, a former adviser to President Donald Trump who was convicted years ago for thumbing his nose at lawmakers investigating the January 6, 2021, Capitol riot.\n\nIn a request to the federal judge in Washington, DC, who oversaw Bannon’s trial, US Attorney Jeanine Pirro said “the government has determined in its prosecutorial discretion that dismissal of this criminal case is in the interests of justice.”\n\nPirro asked US District Judge Carl Nichols, a Trump appointee, to dismiss the matter with prejudice, which, if granted, would mean prosecutors are barred from refiling the case.\n\nThe request appears to be the Justice Department’s latest effort to undo criminal cases stemming from the riot, which Trump and his allies have gone to great lengths to downplay since he returned to the White House.\n\nJust after taking office again last year, Trump pardoned over 1,000 rioters and he has pushed Republicans in Congress to re-scrutinize the work of the committee that sought information from Bannon.\n\nCNN has reached out to Bannon’s attorneys for comment on prosecutors’ request.\n\nBannon already completed a four-month prison sentence in 2024, but he had continued to challenge his conviction, including by appealing to the Supreme Court, which hadn’t yet decided whether to review the case.\n\nA jury in DC convicted Bannon of contempt of Congress in 2022 after he failed to provide documents and testimony to the House select committee that investigated the Capitol attack. A federal appeals court later upheld the conviction.\n\nThe Department of Justice on Monday also asked the high court to wipe away the appeals court’s judgement.\n\n“Under the leadership of Attorney General Bondi, this Department will continue to undo the prior administration’s weaponization of the justice system,” Deputy Attorney General Todd Blanchesaid on Xas he highlighted the new filing.\n\nBannon is one of two former members of Trump’s inner circle who were prosecuted for not participating in the House January 6 probe. The second, former Trump White House aidePeter Navarro, also served prison time for his 2023 conviction.\n\nBannon, a leading voice for the American alt-right, has returned to the spotlight in recent weeks after a new trove of documents related to the late sex offender Jeffrey Epstein included texts the two men exchanged.The records, released by the Justice Department and House Oversight Committee, reveal a close personal relationship — and show Epstein’s deep involvement in Bannon’s ambitions on the world stage.\n\nBannon was indicted by a federal grand jury in November 2021 after he blew off deadlines from the previous month for producing documents and testimony the January 6 committee had subpoenaed.\n\nIn demanding his cooperation, the panel pointed to Bannon’s contacts with Trump in the lead up to the Capitol assault, his presence in the so-called war room of Trump allies at the Willard Hotel in Washington the day before the riot, and a prediction he made on his podcast before the riot that “all hell” was going to “break loose.”\n\n“In short, Mr. Bannon appears to have played a multi-faceted role in the events of January 6th, and the American people are entitled to hear his first-hand testimony regarding his actions,” the House committee report recommending a contempt resolution against him said.\n\nBannon’s team did not mount a defense during the brief trial, and he did not take the stand.\n\nBannon’s appeal of his conviction has largely centered around his argument that he was relying on advice from his attorney when he ignored the congressional subpoenas. Nichols ruled that the advice-of-counsel argument could not be used during the trial, and the DC Circuit Court of Appealsaffirmed that decision in 2024.\n\nThis story has been updated with additional details.\n\nCNN’s Steve Contorno, Tierney Sneed, Katelyn Polantz and Holmes Lybrand contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/steve-bannon-jeffrey-epstein-global-populism",
      "text": "Steve Bannon"
    },
    {
      "url": "https://x.com/DAGToddBlanche/status/2020996125440815478?s=20",
      "text": "said on X"
    },
    {
      "url": "https://www.cnn.com/2024/03/19/politics/peter-navarro-jail-contempt-of-congress/index.html",
      "text": "Peter Navarro"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "The records"
    },
    {
      "url": "https://www.cnn.com/2024/05/10/politics/steve-bannon-appeal-denied",
      "text": "affirmed that decision in 2024."
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/justice-department-dismiss-steve-bannon-capitol-riot-contempt",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/justice-department-dismiss-steve-bannon-capitol-riot-contempt",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a6dfeb1fda38cc8ee28cdd46b54c9283698281c8262d6c974f0bab46148224ed",
  "scraped_at": "2026-02-11T16:33:52.481376+00:00"
}