{
  "url": "https://lite.cnn.com/2026/02/25/style/london-fashion-week-freak-and-geek-fall-winter-2026",
  "title": "At London Fashion Week, brands cater to their unique type of freak and geek | CNN",
  "date": "2026-02-26T07:32:16.498876+00:00",
  "authors": [
    "Kati Chitrakorn",
    "Leah Dolan"
  ],
  "text": "Source: CNN\n\nThis season at London Fashion Week, designers made it clear that a runway is no longer the only way to go about staging a show. For every high-octane catwalk across the five-day schedule, there were a number of relaxed presentations and informal gatherings as some brands looked to save money, slow things down and connect with their communitybeyond the rigidity of assigned seating.\n\nIn her second season as CEO of the British Fashion Council, Laura Weir summarized it best during her opening speech on Friday morning. “This week is not only a schedule of shows,” she said, reeling off the numerous presentations, dinners and events taking place. London’s strength, she continued, is in the fact that the city doesn’t “follow a formula” but sets “the cultural temperature.”\n\nIndeed, long viewed as the scrappy sibling on the fashion calendar, London’s brands are unlike the more commercially viable labels atNew York Fashion Week, which earlier this month demonstrated their prowess in knowing how to sell clothes, often with wider appeal. That’s not to say that London designers don’t know how to sell, but their approach is more targeted.\n\nWhether it’s Chet Lo’s recreation of a Hong Kong night market, Chopova Lowena’s folklore mashup for quirky girls, or Tolu Coker’s exploration of diasporic black identity, London’s indie brands tend to spotlight and cater to the underserved – from LGBTQ+ community individuals to people of color. In doing so, several designers have amassed a devoted following. And it was these communities that they sought to engage – not only through the clothes, but this time through moments that encouraged guests to mingle with the designers as well as each other.\n\nLaura Ingham, deputy director of Vogue’s global fashion network, recalled to CNN a conversation the past week with a colleague, in which they discussed “the power that fashion has to tell stories from different cultures, and the importance of community.” Fashion, she said, can play a role in “unifying all communities, whilst also shining a light” on the city’s most promising designers, many of which were “doubling down on their unique points of view.”\n\nAs designer Emma Chopova, one half of the brand Chopova Lowena, known for its fashionably unfashionable aesthetic, said: “Our community is everything to us.” Since 2022, Chopova and co-founder Laura Lowena-Irons have shown their designs via a catwalk only once a year, typically releasing a digital lookbook instead. For the first time, they held a presentation, complete with AstroTurf for guests to play mini-golf andgarden-themed cupcakes to nibble on. “We want to keep feeding our people,” Chopova said – seemingly both figuratively and literally.\n\nAmong the designers who also eschewed the catwalk this season was Talia Byre, who instead hosted an intimate gathering to celebrate a limited-edition zine that documented the process of making her latest collection. Meanwhile, designer Kazna Asker offered iftar, a meal for those in observation of Ramadan, as she presented textiles collected from her recent trips to the Middle East. And Knwls co-founders Alex Arsenault and Charlotte Knowles opened a pop-up store decorated with paintings by artists they had known since school. One morning, the duo, who have had a partnership with Nike since 2025, hosted a Pilates session in the space. Arsenault hoped such activities would appeal to fans. “That’s what people want these days, they’re craving something physical,” he said.\n\nElsewhere, Talia Loubaton presented her sought-after brand, Liberowe, at London Fashion Week for the first time. While many of her peers at Central Saint Martins (Loubaton graduated from the MA Fashion course) tend to make more challenging, avant-garde clothes, Liberowe simply offers wearable jackets for working women, albeit with a mannish spin. “I was always the more commercial student,” she said with a laugh. Fittings with early clients in her home taught Loubaton who she was making clothes for. “That was my resistance. It was tough to keep that vision sometimes. I like to explore, but I like to celebrate women. That’s what fashion is to me,” she said.\n\nBigger, more established brands seemed to seek greater connection, too. Jonathan Anderson, now based in Paris as the artistic director of Dior, returned to London to fete the opening of his eponymous label’s new store in the capital’s central district of Pimlico. On the same night, namesake designer Roksanda Illincic organized a dinner for “friends of the house,” who came dressed in the brand’s vibrant, flowing designs. Meanwhile, Erdem Moralioglu marked the 20th anniversary of his brand with a show attended by the likes of Keira Knightley, Helen Mirren and Glenn Close – though the evening before, he hosted a cocktail for friends and close collaborators at multi-brand store Dover Street Market.\n\nSome brands still proceeded with a traditional runway show. Simone Rocha returned to north London’s Alexandra Palace Theatre to present her collection filled with rosettes, spliced tailoring and sportswear (via a new collaboration with Adidas). Though, the designer retained a sense of familial warmth, in part thanks to her mother Odette who personally welcomed guests and friends finding their seats. It was also a family affair at Conner Ives, the American darling of London Fashion Week, who last year went viral for a “Protect the Dolls” T-shirt that has since raised over $600,000 for the US-based Trans Life charity. His latest show cast friends as models, including his boyfriend who made his runway debut carrying Ives’ 7-month-old dog, Rex.\n\nInstead of looking for inspiration further afield, London’s designers are often thinking of the people around and closest to them. So, while their shows may not be the grandest or always have the greatest appeal, they’re certainly among the most personal. And after years of navigating homogeneity (as a consequence of social media trends and corporate consolidation), perhaps there’s something here the wider fashion industry can learn from.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/18/style/new-york-fashion-week-fall-2026-women-designers",
      "text": "New York Fashion Week"
    }
  ],
  "hash": "a783dee5cf300196205bc7a7e8cd9b8655cd873f904090fb8d2e9cc650c9ca24",
  "scraped_at": "2026-02-26T07:32:16.498887+00:00"
}