{
  "url": "https://lite.cnn.com/2026/02/23/politics/tariffs-supreme-court-trump-analysis",
  "title": "Analysis: Trump won’t blink on tariffs — because he can’t | CNN Politics",
  "date": "2026-02-23T07:35:30.444009+00:00",
  "authors": [
    "Analysis by Stephen Collinson, CNN"
  ],
  "text": "Source: CNN\n\nNo, President Donald Trump isn’t looking for a new “most beautiful word” in the dictionary to replace his beloved tariffs.\n\nTrue to his philosophy of never accepting a defeat, he’s already battling back after the Supreme Court declared his exercise of emergency trade war powers unlawful.\n\nAhead of his State of the Union address on Tuesday, Trump is vowing to avenge the most damaging loss of his second term by promisingeven higher duties on imports. Many Republicans, however, would prefer a course correction as midterm elections loom.\n\nThe president’s defiance bringsgreat political risks for him and his party, and new uncertainties for an uneven economy. It is also already opening a new lane for Democratic attacks.\n\nBut he’s still convinced tariffs will unlock booming prosperity, even if a likelier outcome is aheavier affordability burdenon millions of American voters.\n\n“What the Supreme Court said is that the president cannot use the IEEPA, the Emergency Economic Powers Act, to do this,” Treasury Secretary Scott Bessent told CNN’s Dana Bash on Sunday. “The president does have other authorities.”\n\nBessent said on “State of the Union” that Trump will shore up his tariffs by using other laws as a five-month “bridge” to a more permanent regime.\n\nBut Democratic Sen. Andy Kim told CNN’s Manu Raju on “Inside Politics” that his party was already working on legislation to force Trump to repay consumers for higher costs inflicted by tariffs — the first of a string of likely measures aimed at embarrassing the president and making life difficult forRepublican lawmakers.\n\nTrump will press on for two main reasons.\n\nFirst, he believes in tariffs with evangelical intensity. His faith in them is so intense it blanks out any evidence they are a tax on consumers or that they don’t work. He regards globalization’s gutting of industrial heartlands where he won millions of votes as vindication of protectionist views he’s held since the 1980s.\n\n“I have very effectively utilized tariffs over the past year to make America great again,” the president said Friday, ignoring new data that shows anunmoving annual trade deficitand declining manufacturing jobs.\n\nThe second reason for Trump’s refusal to bend is that tariffs are a means to his ultimate ends of unfettered presidential authority and rejection of a constitutional system that by design shares power across government.\n\nThis was highlighted by the most revealing comment from Trump’s fulminating press conference Friday following the court’s decision, when he was asked why he didn’t just work with Congress to pass new tariffs.\n\n“I don’t have to. I have the right to do tariffs,” he said.\n\nTrump has used tariffs more expansively than any modern president, in a way that stretches far beyond economic policy. If a foreign nation angers him, it’s punished — as with Brazil, which got a50% tariff slapfor investigating his friend former President Jair Bolsonaro over alleged election-meddling. If a world leader shows insufficient deference, their nation pays the price. Trump has explained, for example, that he hiked tariffs on Switzerland after taking exception to how its leader “talked to us” — apparently referring to former President Karin Keller-Sutter.\n\nBut showing such muscle will be harder going forward.\n\nAlternative powers Trump now plans to use to maintain tariffs contain compliance requirements and more limited authorities that may mean he can’t use levies as a personal thermostat to crank up heat according to his whim.\n\nTrump has a blunt, transactional worldview. He sees curbs on his tariff leverage as weakening the US against rivals he perceives as endlessly exploiting the world’s most powerful economy. The Supreme Court ruling may undermine his trade war ahead of expected summits with Chinese leader Xi Jinping this year.\n\n“Foreign countries that have been ripping us off for years are ecstatic, they’re so happy, and they’re dancing in the streets, but they won’t be dancing for long — that, I can assure you,” the president said Friday.\n\nBessent explained on CNN that the administration would respond to the loss of emergency powers withother legal instruments. This includes duties justified by national security known as Section 232 tariffs and those that target foreign countries over unfair trade practices called Section 301 tariffs.\n\nBut Bessent dodged on whether the government should refund corporations and consumers hit by higher tariffs — which are effectively a tax. He said this was “not up to the administration, it is up to the lower court.”\n\nThis may be a legally tenable position for now. But it’s politically perilous.\n\n“This administration took money out of the pockets of American families, upwards of $1,700 per family. They should give it back,” Kim told CNN. “We’re working on legislation that would be able to have this refund back to the American people.”\n\nTrump wasted no time after the Supreme Court decision to impose a 10% global tariff on all goods, which he later raised to 15%, using Section 122 of the Trade Act of 1974. But congressional approval would be required to prolong such action beyond 150 days. Few Republican lawmakers would relish a mid-July vote on an issue polls show is deeply unpopular.\n\nOne long-term option available to the administration is to use Smoot-Hawley legislation of 1930 to enact new tariffs. But this would invite legal legal challenges from parties who believe subsequent acts of Congress superseded such powers.\n\nAnd it might not be politically smart to invoke a notorious law blamed for worsening the Great Depression when voters are already sour on Trump’s economy.\n\nAlready, Trump has faced several Republican revolts on tariffs. Now, each vote on the issue will matter even more. Once primary season ends, Trump will have less leverage to pressure Republican rebels. More lawmakers may follow the example of Colorado Rep. Jeff Hurd, who joined Democrats in voting against Canada tariffs, saying that they hurt voters and industry in his district.\n\nCritics say the tariffs are doing a lot of damage and creating few benefits. But US Trade Representative Jamieson Greer told “Fox News Sunday” that Trump inherited an emergency and had already transformed global trade.\n\n“Immediately, all of our trade partners around the world came to the table to negotiate market opening deals with us. And we protected our industries right away. So, it’s exactly the right thing to do,” Greer said.\n\nDemocrats are relishing the president’s discomfort.\n\nCalifornia Gov. Gavin Newsom, a potential 2028 presidential candidate, has a dual argument targeting voters’ economic concerns and Trump’s temperament.\n\n“It’s a wrecking-ball presidency. He’s wrecking this economy. His entire economic paradigm is mass deportations, tax cuts for billionaires, and tariffs. And he’s been exposed. He’s a fraud,” Newsom said on “State of the Union.”\n\n“I talk about petulance. It was 10% two days ago, maybe 20% tomorrow. I mean, this is madness. He’s flailing. He’s a punch-drunk boxer. He’s just trying to hit anything, a shadow. And he’s a shadow of himself. He’s lost a step or two.”\n\nBut Trump won’t change. He can’t. To do so would require him to reject everything he believes about power, the presidency and himself.\n\n“Frankly, this should have been done by presidents many years ago. They allowed our country to be eaten alive,” Trump said Friday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "even higher duties on imports"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/business/tariff-prices-supreme-court-ruling",
      "text": "heavier affordability burden"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/economy-gdp-trade-deficit-trump-tariffs",
      "text": "unmoving annual trade deficit"
    },
    {
      "url": "https://www.cnn.com/2025/07/30/politics/brazil-tariff-trump-executive-order",
      "text": "50% tariff slap"
    },
    {
      "url": "https://www.cnn.com/2025/05/31/economy/trump-tariff-alternatives",
      "text": "other legal instruments"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/tariffs-supreme-court-trump-analysis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/politics/tariffs-supreme-court-trump-analysis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a7ccb17a1ffe233c604e9811767a500fe14679bc6ae764221c74357530d2ac7c",
  "scraped_at": "2026-02-23T07:35:30.444023+00:00"
}
