{
  "url": "https://lite.cnn.com/2026/02/16/politics/democrat-munich-conference-attendees-speech",
  "title": "Analysis: Following the Munich Security Conference, Democrats – and Europe – are struggling to define what’s next | CNN Politics",
  "date": "2026-02-16T07:34:07.647615+00:00",
  "authors": [],
  "text": "Source: CNN\n\nMany of the Democrats who came to the Munich Security Conference this weekendwant to be president. But even if one of them can win the White House in 2028, they may find they can no longer claim the title every American president since the 1940s has borne: leader of the free world.\n\nCalifornia Gov. Gavin Newsom went on stage to insist his state is more permanent than President Donald Trump. But he acknowledged in aninterviewwith CNN that the leaders he met with believe the damage to the transatlantic alliance is irrevocable.\n\nProgressive star Rep. Alexandria Ocasio-Cortez of New York came to pitch a left-wing populist foreign policy but made headlines for a massive stumble instead.\n\nA number of Democratic senators hoping to burnish their foreign policy credentials ahead of possible presidential bids found themselves in a painfully awkward moment with the Danish prime minister, as some Democrats tried to smooth over pugnacious remarks Republican Sen. Lindsey Graham made at the start of the meeting that suggested Trump has not given up his designs onGreenland– a semiautonomous territory of Denmark.\n\nAnd most members of the House of Representatives who planned to attend didn’t come at all after Republican Speaker Mike Johnson pulled the plug on the congressional delegation.\n\nEuropean thought leaders were reduced to offering a brief standing ovation to Secretary of StateMarco Rubio, whose speech was far more conciliatory than the one Vice President JD Vancedeliveredat the same gathering last year. But Rubio had kicked off his trip telling American reporters: “The old world is gone.” He also left the conference to fly onward to Slovakia and Hungary, two countries led by strongmen sympathetic to Trump.\n\nThe conference’s opening remarks fromGerman Chancellor Friedrich Merzcrystallized Europe’s new reality in what seems to be rapidly becoming a post-American century.\n\n“A divide has opened up between Europe and the United States,” Merz said Friday. “The United States’ claim to leadership has been challenged, and possibly lost.”\n\nIt’s more than just words. Merz has said he held “confidential talks” with France on European nuclear deterrence. It’s a stunning admission there’s no longer unconditional trust that the US will do what needs to be done for its transatlantic allies.\n\n“What I’m hearing now is, even if we are able to repair these relationships, it’s going to take generations before they feel comfortable,” said Democratic Sen. Mark Kelly, of Arizona, a possible presidential hopeful who traveled to Munich not long after learning the Trump administration had tried and failed to indict him over a video he made telling troops not to obey illegal orders.\n\nThe scene in Munich was a far cry from the heyday of the late Republican Sen. John McCain, who was central to making the conference a critical stop for anyone hoping to play a role in leading the free world.\n\nThere’s still a dinner named for him on the first night of the conference – his son Jimmy McCain represented the family there this year – and his photo and quote hang on the wall on the ground level of the historic Bayerischer Hof hotel. “I refuse to accept the demise of our world order,” the 2017 quote reads. “I am a proud, unapologetic believer in the West. I believe we must always, always stand up for it. For if we do not, who will?”\n\nTrying to carry the torch was Democratic Sen. Chris Coons of Delaware, who closed down the basement Trader Vic’s tiki bar Friday night with shots of peach schnapps, as McCain used to.\n\nBut there was no one named McCain speaking on the main stage this year, and relatively few members of Congress attended a reception for the delegation hosted by the German chancellor.\n\nThe usually jocular Graham, McCain’s old friend turned staunch Trump ally, seemed instead in a dark mood, telling reporters he was urging Trump to take action in Iran or risk emboldening Russian President Vladimir Putin and Chinese leader Xi Jinping.\n\nIf America doesn’t take down the Iranian regime “it will be a disaster,” Graham said in an interview with Politico. “It means you can’t rely on America. … It means the Western world is full of crap. All they do is talk, and when rubber meets the road, they don’t do a damn thing.”\n\nA significant percentage of the US Democratic elected officials who were in Munich are likely hoping to replace Trump in 2028: Newsom, Ocasio-Cortez and Kelly, along with former Commerce Secretary Gina Raimondo, Michigan Gov. Gretchen Whitmer, and Sens. Chris Murphy, Elissa Slotkin and Ruben Gallego.\n\nNewsom towered figuratively and literally above the field, his height making him easy to spot even in the narrow, packed halls of the old hotel.\n\nEuropean leaders “see us as a wrecking ball,” Newsom said in an interview on the sidelines of the conference. “They see us as unreliable, and a lot of them think it’s irrevocable. They don’t think we’ll ever come back to our original form.”\n\nNewsom insisted he believes the US relationship with Europe can still be repaired. And while he acknowledged he was in Munich to learn, saying, “I’m not trying to give foreign policy advice, I need it,” he also had a message for both Europe and his fellow Democrats.\n\n“I’m saying what works in the United States is strength begets strength,” Newsom said. He also quoted former President Bill Clinton, adding: “Given the choice, the American people will always support strong and wrong versus weak and right. And I think there’s a lesson to that.”\n\nFar from her own strengths, the progressive star and arguable heiress to Bernie Sanders’ movement, Alexandria Ocasio-Cortez, struggled in her first major test on the world stage.\n\nShe and her team had billed her appearance in Munich as something of a global debut for the famous but US-focused New Yorker. A piece in The New York Times previewing her trip was headlined, “Alexandria Ocasio-Cortez Steps Onto a Wider Stage.”\n\nShe participated in a forgettable roundtable on populist politics Friday afternoon. But a late-night appearance turned the headlines sour (Saturday’s New York Times story read: “Ocasio-Cortez Offers a Working-Class Vision in Munich, With Some Stumbles”) and led her team to curtail her public and media schedule at the conference.\n\nThe issue: Taiwan, a fulcrum of US foreign policy that’s definitional for the relationship between the world’s two largest economies and superpowers. The question, from the moderator: Would she support sending US troops to defend the self-governing island were China to invade?\n\n“Um, you know, I think that this is such a, you know, I think that this is a um — this is, of course, a, um, very long-standing, um, policy of the United States,” she responded.\n\n“And I think what we are hoping for is that we want to make sure that we never get to that point,” she said.\n\nThe moment generated some criticism on social media. But it also showed she was unprepared to answer what is likely to become one of the central foreign policy challenges that will define the next century in geopolitics.\n\nEven when Ocasio-Cortez was on the message she wanted to deliver, it was one skeptical of the elites who now sit atop the world order created in the wake of World War II.\n\nOcasio-Cortez’s foreign policy adviser on the trip, who also previously advised Sanders, was still in Munich on Sunday night while Ocasio-Cortez was long gone.\n\nBack home, of course, Democrats’ prospects have been improving fast. Trump’s approval rating has dropped, and Democrats have an opportunity to win back control of the House in this year’s midterm elections.\n\n“Trump’s going to get shellacked in the midterms. He knows that. The world is becoming, I think, more and more familiar with that reality,” Newsom told CNN in Munich.\n\nA handful of Democratic House members made the effort to travel to the conference independently after the delegation was canceled, including Rep. Jason Crow of Colorado. The Army veteran and key voice on national security issues is also leading recruitment for Democrats trying to take back the House this fall.\n\nIn the conference halls, he was trying to reassure European leaders Democrats are poised to wrest at least some power in Washington back from Trump. But he also stood with Ocasio-Cortez to warn the post-World War II rules-based order was leaving average people behind.\n\n“While many of those institutions and rules created peace, we now stand in a moment where many of them have failed to deliver for the working-class people in most of our communities and countries,” Crow told reporters at a press conference Saturday.\n\nAnd Europe’s leaders have endured the same whiplash as the American public, spending the first Trump term willing to believe his election was an aberration. Trump’s reelection and his emboldened attitude on the world stage in his second term has Europe convinced this isn’t a strange departure from normal.\n\n“The international order based on rights and rules is in the process of being destroyed,” Merz said in his speech. “This order – imperfect even its best times – no longer exists in this form.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/munich-2028-democrats-aoc-newsom",
      "text": "want to be president"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/video/newsom-wrecking-ball-vrtc-digvid",
      "text": "interview"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/us-greenland-framework-1951-deal",
      "text": "Greenland"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/europe/rubio-speech-us-europe-relations-latam-intl",
      "text": "Marco Rubio"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl",
      "text": "delivered"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/europe/munich-security-conference-merz-rubio-intl",
      "text": "German Chancellor Friedrich Merz"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/democrat-munich-conference-attendees-speech",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/politics/democrat-munich-conference-attendees-speech",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a82a15710540747ec52f74a8019fb53a6a77e5ad5510680313edd59d4bcc2f60",
  "scraped_at": "2026-02-16T07:34:07.647650+00:00"
}