{
  "url": "https://lite.cnn.com/2026/02/27/us/jesse-jackson-cnn-show-tribute",
  "title": "The Jesse Jackson that I knew | CNN",
  "date": "2026-03-01T07:08:17.668701+00:00",
  "authors": [
    "Rick Davis"
  ],
  "text": "Source: CNN\n\n“Rick, how would you like to get another show?” he asked.\n\nAt the time I was the executive producer of CNN’s Washington-based public affairs shows, including “Crossfire,” “Evans & Novak,” “Capital Gang” and “Reliable Sources.”\n\nEd told me CNN wanted me to oversee a weekly show with Jesse Jackson out of the DC bureau. That sounded like a bad idea, and I told Ed that Jesse was not a journalist.  We shouldn’t do that.\n\nWell, Ed said firmly, it is not up for debate.  The decision has been made.  Meet with Jesse and make it work.\n\nI couldn’t imagine it at the time, but that conversation would begin a 35-year professional and personal relationship with the charismatic civil rights leader, whodiedat 84 last week in Chicago.\n\nI can’t add much to the many beautiful and insightful words written about Jesse on his passing.  Others can better explain his remarkable journey to make America better for the disenfranchised, and his zeal to help create a true rainbow of inclusion.\n\nBut I can tell you about the man I got to know behind the scenes.\n\nLet’s start with the show, which aired weekly on Saturdays.  I named it “Both Sides with Jesse Jackson” to signal it wouldn’t be dominated by Jesse’s point of view. I felt the format had to be somewhat of a debate since Jesse was just a few years from his two history-making runs for the Democratic presidential nomination.  And I decided that for the show to be taken seriously, we’d need to book guests from across the political spectrum to have civil conversations about the issues he cared about.\n\nWe had our challenges. While my work on these CNN shows was my only job, it certainly wasn’t Jesse’s. It may have been one of his last priorities.  That led to eight-plus years of weekly frustration with Jesse’s schedule, which usually meant he arrived less than an hour or two before the Friday taping.\n\nBut that was the only negative part of the relationship. Most weeks we produced a smart program that dealt with the most important issues of the moment – domestic and international – with guests who wanted to come debate the great Jesse Jackson.\n\nThe show’s staff and I soon got to know Jesse and his many good qualities: His commanding presence, his good humor, how he lit up a room and how he greeted so many with big bear hugs.  And maybe most importantly, how he pushed us to focus on issues that didn’t always get attention on the rest of the network or elsewhere.\n\nBy then I had learned how to manage on-air pundits’ unique personalities and, yes, egos. But I soon learned that Jesse was way more than just a civil rights icon and political heavyweight. For me, it eventually became personal.\n\nEarly on I saw up close what a big heart he had.  The first year of the show, 1992, was a devastating one for my family.  In February my wife Linda lost her sister Frankie to melanoma in her early thirties.  Two months later I lost my beloved brother Alan to lung cancer.  In both cases Jesse took the time to call our parents to console them and to send them flowers.\n\nJesse called me all the time, either because he wanted me to get him on CNN to discuss an important issue or to complain about something on CNN that he didn’t like.  But he never started a conversation without asking, “How’s your family?” And he meant it. He always wanted to hear how my parents were doing.\n\nHere are a few personal memories of Jesse that I will never forget.\n\nA few weeks after my brother died, Jesse walked into my office before a taping and said, “What’s the matter? You look down.”  I told him I had just spoken to my mother and she was depressed about the loss and didn’t want to do anything.  He told me to call her back and put her on speaker. And for the next 10 minutes Jesse had me stand, took my hand and prayed with me and my mother — in ways I don’t think anybody else could have consoled her.  I will forever be grateful for how he ministered to that Jewish woman, the daughter of parents who had fled the pogroms of Eastern Europe during World War II.\n\nIn the summer of 1992 we were broadcasting live from the Houston Astrodome, site of the Republican National Convention. Jackson’s plane was delayed and he arrived just a half hour before air. He didn’t have time to read the questions in advance and didn’t know the Republican guests very well. I walked him to CNN’s sky box as GOP delegates stared, wondering what he was doing here, and then ran back to the control truck and produced the show from there – in a way I had never done before.\n\nNearly every question he asked, in every segment, I had just relayed into his earpiece. Somehow it worked. Afterwards he gave me a big hug and said, “Rick, you saved my ass.” I’m glad we were able to pull that off, but it was not something I ever did again with Jesse or any other CNN host or anchor.\n\nIn January of 1993, my office beeped me on my pager. When I called, they gave me a message from Jesse that said: “Can you and your wife come to my house? We’re having a very special guest.” It was South African leader Nelson Mandela, who was in Washington for Bill Clinton’s inauguration. Mandela had been freed from prison three years earlier and was arguably the most famous person in the world at that time. So of course, we went. To be in Mandela’s presence felt spiritual. I can remember standing on a staircase in the crowded house, watching him speak. Afterwards, Jesse invited me into the sitting room for my introduction to the great man. Our handshake was brief but memorable.\n\nOne time I was walking with Jesse from the make-up room to the CNN studio when we passed a glass conference room. He looked inside and said, “Rick, what’s going on in there?” I told him it was a planning meeting for next week’s editorial coverage. He responded, “How can that be an editorial meeting? There are all White people in there.” And that began my commitment to help diversify newsrooms at CNN and beyond. I’ve been fortunate to be able to establish scholarships for journalism students at American University and the University of Maryland. And it’s all because of Jesse’s response after seeing that news meeting.\n\nIn 1993, thanks to Jackson’s relationship with the Libyan Ambassador to the UN, he and I traveled to Tripoli for an exclusive interview with Libyan leader Moammar Gadhafi. It was some four years after Libya’s suspected involvement in the bombing of Pan Am Flight 103 over Lockerbie, Scotland, which killed 270 people, and no major Western airlines flew to Tripoli. So we flew to Tunisa and made a four-hour drive across the Libyan desert.\n\nIt was a colorful visit. As we entered Gadhafi’s compound a group of men greeted us, shouting Jesse’s name over and over, and slit the throat of a goat as a sacrifice. We toured the ruins of Gadhafi’s home, where he claimed his daughter had died in a 1986 US bombing raid. We also visited a war cemetery, where at the request of the Libyans, Jackson laid flowers at the grave of an unknown soldier – an image that was published in Libyan newspapers and transmitted around the world. My CNN boss was furious that Jackson had been caught up in Libyan propaganda.\n\nBut we got the interview with Gadhafi. Jesse and I had spent days prepping questions, and I wrote them on blue cards for Jesse to hold during the interview. I’m glad I did, because once we were ready to tape, my communications to Jesse via his earpiece didn’t work. I suspect the Libyan government at the time did that intentionally.\n\nIn 1995, when my daughter Sarah was about 8 years old, her school assigned the students a report on a civil rights leader for Black History Month. Of course, Jesse agreed to talk to her. While other students in her class were likely turning to their encyclopedias, she sat down with him for an in-person interview at CNN’s Washington bureau, where he shared his memories of Martin Luther King Jr.\n\nI don’t recall what grade she got on the report. But he was very generous with his time, and it is a memory she values to this day.\n\nOne afternoon in the mid-1990s Jesse asked me to join him on one of his countless visits to an urban school: Theodore Roosevelt High School on 13th Street in Washington. The students looked mesmerized as Jesse led them in saying “Up with Hope, Down with Dope” and then through the many repeated cadences of his famous “I Am Somebody” chant. I had never seen anything like it. As I watched him, I thought, “My god, this friend of mine is single-handedly taking it, as they say, directly to the consumer — trying to fight the war on drugs and empower young people to be all they can be.” There were no cameras or reporters there that day. It was a brief window into something he did all the time. I am so lucky to have been with him.\n\nIn 2001, Jesse faced a scandal for having an affair that resulted in him fathering a child. CNN suspended his show.I still had the deepest personal relationship with Jesse of anyone at CNN, so the task fell to me to tell him once a final decision was made months later to end the show.  I waited until he had an upcoming trip to Atlanta and met him in his hotel room. We talked about his initiatives and the news of the day while he dressed for a formal event. And then I broke it to him: “I am sorry Jesse, we have to end our relationship.” He understood but lobbied for another chance, saying the salary from CNN was the majority of his income. That was so revealing to me. This prominent man, revered by generations of Americans, had never fully cashed in on his fame like so many others did. His work was his life.\n\nIn December 2002 I had a serious surgery that had to be done in New York. Linda and I flew up from Atlanta, and I spent a week in a hospital there. Jesse found out about this and came to visit. OMG. Linda brought him upstairs to my floor, and it was a helluva scene among the nurses, most of whom were African American. I tell this not to showcase me but to demonstrate Jesse’s big heart. His relationship with CNN was over, but he still took the time while in New York to come brighten my day.\n\nAround the time that Jackson was diagnosed with Parkinson’s disease, in 2017, he called me to complain that CNN wasn’t inviting him to be on air as much. Was CNN boycotting him? “What was the problem?” he asked. Friends need to be honest with each other, and I told him the reason he wasn’t being booked anymore was because his speech had become too difficult to understand. It was better than misleading him to think I was working to get him on TV. But it pained me to say it.\n\nLinda and I were in Chicago for a wedding in October 2021, and we took an afternoon to go down to the Rainbow PUSH Coalition offices to see Jesse. The Parkinson’s had taken hold and he needed assistance from several aides to stand and walk, but his mind was clear. He welcomed us both like family, with that big Jesse Jackson hug and smile. We spent at least an hour with him in his office adorned with magazine covers and remembrances of his amazing life. He reminded me of the Muhammad Ali I saw on TV in his later years: Whip-smart and funny, but sometimes staring into space. Linda and I are so glad we had that visit.\n\nI saw Jesse for the last time a month later in Washington, when I ran into him and some of his aides at the famous Ben’s Chili Bowl restaurant. And we spoke one more time after that, when Linda attended a meeting at Rainbow PUSH in Chicago and put me on the phone with him. His voice was low and he was hard to understand, but I felt his love and I hope he felt mine.\n\nNow my friend is gone. Countless words have been written and spoken about what Jesse meant to Black America.  His most cherished cause, in my opinion, was voting rights. He was relentless about it. I remember debating him about Voter ID laws, and he let me know I just didn’t understand how someone could be disenfranchised because of them. He knew the people who didn’t have an ID. I didn’t.\n\nIt pains me to think that America now faces the greatest threat to voting rights since the mid-‘60s.  I think about Jesse when I follow this current debate, and I am sure that if he was alive and healthy he’d convince some rich benefactor to bankroll a project to get documents to voters without IDs.\n\nThere’s something else I haven’t seen mentioned in all the Jesse Jackson tributes and obits. In all the years I knew Jesse — especially when he was working with us at CNN — I never saw him take a vacation. And unless I’m wrong, he never used his influence and power to enrich himself. Sure, his Rainbow PUSH Coalition paid him, but it was not the kind of money that most people with his fame earned.\n\nJesse worked nonstop — a true indicator of how his life’s focus was to raise up those who needed the power of his pressure and persuasion. Day in and day out. Year after year. I am so fortunate to have had an intimate view of what made the man a giant in our lifetimes.\n\nRick Davis retired in 2021 after 23 years as CNN’s vice president of news standards and practices. His 40-year career with CNN dates to the day the network was founded in 1980, when he oversaw the second hour of CNN as the network’s first senior sports producer.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/politics/jesse-jackson-civil-rights-legacy",
      "text": "died"
    }
  ],
  "hash": "a90e33db191088e06278247cd6c12ca27f8df51349f73591f21e9ac17df2ba21",
  "scraped_at": "2026-03-01T07:08:17.668713+00:00"
}