{
  "url": "https://lite.cnn.com/2026/02/19/europe/austria-climber-accused-left-girlfriend-die-latam-intl",
  "title": "Climber accused of leaving girlfriend to die on Austria’s tallest mountain goes on trial | CNN",
  "date": "2026-02-20T07:29:20.346083+00:00",
  "authors": [
    "Sophie Tanno, CNN"
  ],
  "text": "Source: CNN\n\nA man accused of leaving his girlfriend to freeze to death on Austria’s tallest mountain went on trial on Thursday in a case that could have major implications for mountain climbers and how liable they are for the safety of companions.\n\nThe 36-year-old man, named in local media as Thomas P., is accused of havingleft his 33-year-old girlfriend, Kerstin G., alone as he went to seek help on Austria’s Grossglockner mountain in the early hours of January 19, 2025 after the pair ran into difficulties while trying to reach the summit.\n\nThe trial, at Innsbruck Regional Court, is expected to last just one day, with a possible verdict by Thursday evening, court officials told CNN.\n\nThe man is facing a charge of grossly negligent homicide, with state prosecutors in Innsbruck accusing him of making multiple errors, including seeking help too late and not carrying suitable equipment. Prosecutors say he was the “responsible guide for the tour” as, unlike his girlfriend, he was “already very experienced in high-altitude Alpine tours and had planned the tour.”\n\nThomas P. denies wrongdoing and believes his girlfriend’s death was a “tragic accident,” his lawyer, Kurt Jelinek, said.\n\nJelinek said his client is “deeply saddened by the death of his partner” and described the situation on the mountain, which reaches to 3,798 metres (around 12,460 feet), as “hopeless.”\n\nThe couple were climbing the Studlgrat route, which is rated “fairly difficult” on the International Climbing and Mountaineering Federation (UIAA) scale and requires “very good physical shape” and “some rock climbing experience,” according to one tour company.\n\nThey set out at 6:45 a.m. and reached the final point of the tour before the summit, called Frühstücksplatzl or “breakfast spot,” at 1:30 p.m. on January 18, 2025, according to the lawyer.\n\nThe defendant, in a statement written to prosecutors and shared by his lawyer, maintains that both were aware that this was the “point of no return” before reaching the summit and agreed to continue.\n\nHowever, as weather conditions deteriorated and Kerstin G. reached a point where she could no longer continue the climb, Thomas P. left his girlfriend “unprotected, exhausted, hypothermic,” about 50 meters (164 feet) below the summit at around 2 a.m. on January 19, where she froze to death, prosecutors say.\n\nThere are conflicting accounts between the two partiesregarding the defendant’s call for help.\n\nProsecutors say that, despite being “effectively stranded” on the mountain from around 8:50 p.m., Thomas P. failed to notify emergency services until 3:30 a.m on January 19. He also failed to send any distress signals to a police helicopter that flew overhead at around 10:50 p.m., they say.\n\nRescue services made several unsuccessful attempts to contact the defendant before receiving a first phone call from him at 12:35 a.m. on January 19, prosecutors say. Whether he raised the alarm during this phone call is unclear.\n\nAccording to the defendant’s lawyer, he did not immediately notice the missed calls as his mobile only vibrated “slightly.” He noticed them when he took out his phone to arrange for a helicopter rescue after his girlfriend’s condition had worsened, Jelinek said, citing the defendant’s statement to the Innsbruck public prosecutor’s office.\n\nAccording to the lawyer, his client said during the 12:35 a.m. phone call they were in need of help as soon as possible.\n\nBut prosecutors say the contents of the conversation remain “unclear,” and that the defendant did not take any further calls from Alpine police as he had put his phone on silent.\n\nProsecutors say that before leaving his girlfriend at around 2 a.m., the defendant failed to protect her from further heat loss by finding a sheltered spot. He also did not set up her bivouac – a lightweight camp used by climbers – or emergency blankets, they say.\n\nHer body was found by alpine rescuers  around 10 a.m. on January 19, according to the defendant’s lawyer.\n\nProsecutors say the defendant failed to take into account his girlfriend’s inexperience in mountain climbing as well as the harsh winter conditions.\n\nStrong winds, which had reached speeds of up to 74km/h (45.9 mph) meant the temperature of –8°C (17.6°F) would have felt more like –20°C (-4°F), meaning they should have turned back sooner – at the latest when they reached the “breakfast spot,” prosecutors said.\n\nThe defendant maintains that he and his girlfriend planned the trip together and considered themselves sufficiently experienced and well-equipped.\n\nSpeaking to German newspaper Die Zeit earlier this month, the deceased woman’s mother said she didn’t want to place blame on her daughter’s boyfriend and spoke out against what she described as the “witch hunt” against him in the media and online. She also said her daughter had often gone hiking after dark and the pair of them were equipped for the nighttime.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/europe/austria-climber-accused-left-girlfriend-die-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/europe/austria-climber-accused-left-girlfriend-die-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a917d0557c7111d3e0d13cf386d4e2383dc7c6fb33556a7dca273e028d05b139",
  "scraped_at": "2026-02-20T07:29:20.346096+00:00"
}