{
  "url": "https://lite.cnn.com/2026/02/10/business/howard-lutnick-jeffrey-epstein-island",
  "title": "Lutnick confirms an island lunch with Epstein while insisting they ‘did not have any relationship’ | CNN Business",
  "date": "2026-02-11T16:39:29.200361+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nCommerce Secretary Howard Lutnick confirmed on Tuesday that he and his family had lunch with Jeffrey Epstein on the disgraced financier and convicted sex offender’s Caribbean island in 2012, even as he insisted the two did not have a relationship.\n\n“I did have lunch with him, as I was on a boat going across on a family vacation. My wife was with me, as were my four children and nannies,” Lutnick told a congressional committee Tuesday. “We had lunch on the island, that is true, for an hour, and we left with all of my children with my nannies and my wife… I don’t recall why we did it.”\n\nBut Lutnick denied that he andEpstein, who met when they lived in neighboring houses in New York, had deeper ties.\n\n“Of these millions and millions of documents, there may be 10 emails connecting me with him… over a 14 year period,” Lutnick told senators. “I did not have any relationship with him. I barely had anything to do with that person.”\n\nThe comments raise new questions about the extent of Lutnick’s ties to Epstein and his characterization of their interactions in the past. Republican Rep. Thomas Massie, a co-author of the law that compelled the release of the Epsteinfiles, had previously called on Lutnick to resign over his links to the late sex offender. And even before the commerce secretary’s remarks on Tuesday, the files had undercut Lutnick’s description of having cut ties with Epstein in 2005.\n\nThe questions at the hearing – ostensibly about broadband funding deployment – also underscored how the latest release of Epstein files has shaken government and business figures around the world.\n\nIn the UK,Prime Minister Keir Starmer’s leadershipis in question after key aides have resigned in Epstein fallout. In Norway,Crown Princess Mette-Maritis facing questions about her fitness to someday serve as queen as her apparently friendly relationship has come to light.\n\nAt Tuesday’s hearing, Democratic senators questioning Lutnick acknowledged he was not accused of wrongdoing. But they said his previous statements onJeffrey Epsteinhad misled them.\n\nLutnick claimed inan interview last yearwith the New York Post’s “Pod Force One” that after a 2005 encounter at Epstein’s home, he grew uncomfortable and vowed that he would “never be in the room with that disgusting person ever again.” Lutnick said he saw a massage table in the middle of the home and that Epstein told him he got a massage “every day.”\n\n“And then he like gets, like, weirdly, close to me and he says, ‘And the right kind of massage,’” Lutnick said.\n\nLutnick said that after that interaction, “I was never in the room with him socially for business or even philanthropy. If that guy was there, I wasn’t going, because he’s gross.”\n\n“The issue here is that he totally misled the American public, the survivors, the Congress,” said Sen. Chris Van Hollen, a Maryland Democrat, of Lutnick’s previous claim that a 2005 encounter left him thinking Epstein was a “disgusting guy” and “clearly left the country with the impression that he had no further contact with Jeffrey Epstein.”\n\n“That just turns out not to be true, which completely undermines his credibility,” Van Hollen told CNN’s Manu Raju, adding that Lutnick’s admission after the release of the files that he had visited Epstein’s island with his family is “extremely bad judgment.”\n\n“The credibility is at the core of this issue, because he again suggested that he had had no further contact with this guy who he called disgusting. And then years later, he’s on the private island with the guy he called disgusting, and bringing kids and nannies. So I think, I think the secretary still has a lot of explaining to do,” he said.\n\nSens. Chris Coons and Jeff Merkley, Democrats on the committee, suggested to reporters that Lutnick should resign if he couldn’t provide a deeper explanation of his interactions with Epstein.\n\nThe White House, though, has shown no indication President Donald Trump is ready to move on from Lutnick.\n\n“Secretary Lutnick remains a very important member of President Trump’s team, and the president fully supports the secretary,” White House press secretary Karoline Leavitt told reporters during Tuesday’s press briefing.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-epstein-files-02-10-26",
      "text": "Epstein"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/jeffrey-epstein-files-release-doj",
      "text": "files"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "Prime Minister Keir Starmer’s leadership"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/europe/norway-royal-family-scandals-intl",
      "text": "Crown Princess Mette-Marit"
    },
    {
      "url": "https://www.cnn.com/2020/01/15/us/jeffrey-epstein-virgin-islands-lawsuit",
      "text": "Jeffrey Epstein"
    },
    {
      "url": "https://www.youtube.com/watch?v=x8_s4Z2TQAE&list=PLHY8kGYAi5RLEf4OwozbCSlyF3wJoqcOB",
      "text": "an interview last year"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/howard-lutnick-jeffrey-epstein-island",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/business/howard-lutnick-jeffrey-epstein-island",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a9196bef016bfc6ef9bb034ca092135739aa0072bacb1ff4a8b813b89eb87608",
  "scraped_at": "2026-02-11T16:39:29.200373+00:00"
}