{
  "url": "https://lite.cnn.com/2026/02/10/us/alex-murdaugh-murders-appeal-trial",
  "title": "Alex Murdaugh’s attorneys take the appeal of his murder convictions to South Carolina’s highest court | CNN",
  "date": "2026-02-11T16:33:02.881614+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nSouth Carolina’s “trial of the century” returns to the courtroom Wednesday, asAlex Murdaugh’s appealof his double-murder conviction goes before the state’s fiveSupreme Court justices.\n\nOral arguments are scheduled for Wednesday morning at the South Carolina Supreme Court, where Murdaugh’s attorneys will argue their client deserves a new trial based on alleged jury tampering, prejudicial evidence and failures at trial and during the investigation.\n\nThe state maintains Murdaugh was convicted because the evidence against him was overwhelming, arguing in court records he was “obviously guilty” and the jury’s decision was not influenced by anything that Murdaugh’s attorneys allege.\n\nWednesday’s oral arguments will not feature any witnesses or new testimony but will focus on the legal process of Murdaugh’s case. Regardless, it will mark yet another major moment in a saga that for years hascaptivated the public, spawning multiple documentaries, miniseries, podcasts and books.\n\nHere’s what you should know:\n\nMurdaugh, a once prominent heir to a Lowcountry legal dynasty, is now a disbarred attorney serving two consecutive life sentences for shooting and killing his wife, Maggie, and 22-year-old son, Paul, at the family’s hunting property in June 2021.\n\nA Colleton County, South Carolina, jury found himguilty of their murdersin March 2023 after a highly publicized six-week trial, which also featuredextensive testimony about Murdaugh stealing millions of dollars from vulnerable clients and his own law firm.\n\nMurdaugh later pleaded guilty to dozens of federal and state charges forfinancial crimes related to a yearslong, wide-ranging scheme to bilk his law firm, clients and the government out of about $9 million. He is serving concurrent state and federal sentences of 27 and40 years, respectively, for those financial crimes in addition to his life sentences.\n\nWhile Murdaugh admitted to the financial crimes, he has consistently maintained he did not kill his wife and son, and he is seeking a new trial to prove his innocence.\n\nTo that end, his attorneys’ arguments before the South CarolinaSupreme Court willcombine two separate appeals – one stemming from a 2024 denial of his motion for a new trial, and another stemming from the trial itself.\n\nIn the first, Murdaugh’s attorneys argue former Colleton County Clerk of Court Rebecca “Becky” Hill improperly influenced jurors during the original trial by making comments implying Murdaugh’s guilt to jurors.\n\nIn January 2024, after a one-day evidentiary hearing, retiredSouth Carolina Chief Justice Jean Toaldetermined those comments did not influence the jury’s verdict and denied Murdaugh’s request for a new trial. Still, Toal found Hill was “attracted by the siren call of celebrity,” not credible and made improper comments to the jury.\n\nHill has never been charged with jury tampering, an accusation she has denied. However, she wascharged with other crimes, including perjury related to statements made under oath at the evidentiary hearing. In December 2025, she pleaded guilty to perjury, obstruction of justice and misconduct in office.\n\nLast month, the state Supreme Court agreed to include documents related to Hill’s charges and guilty plea as part of the record in Murdaugh’s appeal. Murdaugh’s attorneys have indicated they plan to use those documents to argue the former clerk’s “denials of jury tampering cannot be credited over the sworn testimony of the disinterested jurors who witnessed it,” according to one motion.\n\nSecond,Murdaugh’s attorneys have argued in legal briefs already submitted in the appeal that the wide-ranging testimony about and evidence ofMurdaugh’s financial crimeswas prejudicial and should have been limited or completely excluded from his 2023 murder trial.\n\nThe state has consistently said the financial crimes were properly allowed in court, because they explain Murdaugh’s alleged motivation: Prosecutors argued at trialthat he killed Maggie and Paul to prevent the schemes and millions of dollarsin stolen settlements from being discovered.\n\nMurdaugh’s attorneys have also alleged there were multiple issues with the investigation into Maggie and Paul Murdaugh’s killings, including investigative “failures” and “prosecutorial misconduct.”\n\n“Alex Murdaugh’s conviction represents a fundamental breakdown of the American criminal justice system’s most basic protections,” Murdaugh‘s attorneys wrote in a November 2025 filing.\n\n“This case was not built on the ‘overwhelming evidence of guilt’ the State claims,” they said, “but on a foundation of investigative malpractice, prosecutorial misconduct, and corruption by an elected court official that denied Murdaugh his constitutional right to a fair trial.”\n\nThe South Carolina Supreme Court will hear oral arguments in Alex Murdaugh’s appeal starting around 9:30 a.m.in Columbia.\n\nThe Court has issued time limits for the oral arguments.\n\nAccording to a court order, attorneys for Murdaugh and the South Carolina Attorney General’s Office will each have a total of 40 minutes to present their cases. That time will be divided, with each side given 20 minutes for arguments on the alleged jury tampering issue and 20 minutes each for arguments on alleged errors in the 2023 trial.\n\nMurdaugh’s attorneys will then have 10 minutes for a combined reply to the state’s arguments.\n\nJustices will likely interject throughout Wednesday’s hearing to ask questions or seek clarification as they review the legal arguments made in court and the many court filings already submitted by both sides.\n\nMurdaugh will not attend the oral arguments, a spokesperson for his legal team told CNN. Attorneys Dick Harpootlian, Jim Griffin and Phillip Barber will all return to argue for Murdaugh.\n\nSenior Assistant Deputy Attorney General Creighton Waters, who led the prosecution, will once again make the state’s argument. Attorney General Alan Wilson – who is running for governor in the Republican primary – will be seated with Waters at the counsel table,court filings show.\n\nWednesday’s hearing will be open to the public on a “first come, first served” basis. It will also belivestreamed.\n\nThere will be no decision from the court on Wednesday. The South Carolina Supreme Court does not rule from the bench. The justices will insteadprivately deliberate as they continue to review hundreds of pages of court records along with the arguments presented in Wednesday’s hearing.\n\nThe South Carolina Supreme Court publishes its opinions and rulings in writing,and it could be months before one is published in this case. There is no deadline.\n\nThere are three possible outcomes once the justices come to a decision.\n\nThe Court could decide to uphold the convictions, meaning Murdaugh’s convictions and life sentences for the murders would stand.\n\nThe Court could also choose to remand the case for further proceedings, sending it back to a lower court to address any possiblelegal or factual errors.\n\nFinally, the Court could decide to reverse the convictions and order a new trial. If that happens, prosecutors would then have to decidehow to approach a retrial.\n\nNo matter what the state’s highest court decides, Murdaugh will remain in prison: He still has decades left on his sentences for the financial crimes.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/08/14/us/alex-murdaugh-south-carolina-supreme-court",
      "text": "Alex Murdaugh’s appeal"
    },
    {
      "url": "https://www.cnn.com/2025/11/22/us/murdaugh-murders-hulu-show",
      "text": "captivated the public"
    },
    {
      "url": "https://www.cnn.com/2023/03/02/us/alex-murdaugh-trial-defense-closings-thursday/index.html",
      "text": "guilty of their murders"
    },
    {
      "url": "https://www.cnn.com/2024/04/01/us/alex-murdaugh-federal-sentencing",
      "text": "40 years"
    },
    {
      "url": "https://www.cnn.com/2024/01/29/us/alex-murdaugh-murder-trial-hearing",
      "text": "South Carolina Chief Justice Jean Toal"
    },
    {
      "url": "https://www.cnn.com/2025/05/14/us/alex-murdaugh-trial-court-clerk-becky-hill-charges",
      "text": "charged with other crimes"
    },
    {
      "url": "https://www.cnn.com/2023/02/06/us/alex-murdaugh-trial-monday",
      "text": "Murdaugh’s financial crimes"
    },
    {
      "url": "https://www.scetv.org/live/supreme-court-south-carolina",
      "text": "livestreamed"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/alex-murdaugh-murders-appeal-trial",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/us/alex-murdaugh-murders-appeal-trial",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a91b3d9713a28724e692c20c3228a0f12cc1f235d8beff752717b3683459852b",
  "scraped_at": "2026-02-11T16:33:02.881627+00:00"
}