{
  "url": "https://lite.cnn.com/2026/02/10/europe/telegram-ban-russia-web-block-latam-intl",
  "title": "Russia is restricting access to Telegram, one of its most popular social media apps. Here’s what we know | CNN",
  "date": "2026-02-11T16:31:29.864478+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nRussian authorities have begun restricting access to Telegram, one of the country’s most popular social media apps, as the government continues to push everyday Russians towardits own tightly controlled alternativesto foreign tech platforms.\n\nOn Tuesday, the government said it was restricting access to Telegram for the “protection of Russian citizens,” accusing the app of refusing to block content authorities consider “criminal and terrorist.”\n\nRussia’s telecommunications regulator Roskomnadzor said in a statement that it would continue to restrict the operation of the Telegram messenger “until violations of Russian law are eliminated.”\n\n“Personal data is not protected, and there are no effective measures to counter fraud or the use of the messaging service for criminal and terrorist purposes,” Roskomnadzor said. Telegram rejects that claim, saying it actively combats the harmful use of its platform.\n\nThe Russian state news agency TASS reported that Telegram faces fines of 64 million rubles ($828,000) for allegedly refusing to remove prohibited content from the messenger platform and failing to self-regulate.\n\nAs the measures against Telegram came into force on Tuesday, users across Russia reported widespread disruptions, with thousands complaining that the messaging app was not working or was running slower than usual, according to the digital service tracking site Downdetector, which reported more than 11,000 complaints in the past 24 hours.\n\nTelegram is a remarkable target for Russian censorship: the app is used by millions of people in Russia, including the military, top level public officials, state media services and government bodies including the Kremlin and Roskomnadzor itself.\n\nThe app’s Russian-born founderPavel Durovsaid in a statement Tuesday that Russia’s attempt to restrict Telegram would fail, writing that “Telegram stands for freedom of speech and privacy, no matter the pressure.”\n\n“Russia is restricting access to Telegram in an attempt to force its citizens to switch to a state-controlled app built for surveillance and political censorship,” Durov wrote. “Eight years ago, Iran tried the same strategy – and failed. It banned Telegram on made-up pretexts, trying to force people onto a state-run alternative.”\n\nIn Russia’s case, the state-endorsed alternative is Max, an app the Russian government now requires to be pre-installed on all new smartphones and tablets sold in the country. Users on Max can message each other, send money and make audio and video calls.\n\nIn a strange twist, the Max app was developed byVKontakte(VK), which Durov co-founded before selling his shares and leaving Russia in 2014, after Durov said the Kremlin had asked the site to hand over Ukrainian users’ data. VK is now state-owned.\n\nThis is not the first time Russia has gone after Telegram. Adam Segal, the director of the Digital and Cyberspace Policy program at the Council on Foreign Relations, told CNN that Russia’s quest to cordon off its citizens from outside apps goes back nearly a decade. The Russian government has tried to block Telegram before, including in 2018.\n\nMore recently, in August, Roskomnadzor announced it would partially restrict calls on Telegram and WhatsApp messaging services, saying the services were used in fraud, extortion, and sabotage and terrorist activities.\n\nThe next month, Russia began pre-installing its Max app on smartphones.\n\nSegal pointed out that the move to restrict Telegram has not been without criticism in Russia, including from some of the most prominent cheerleaders for the country’s military aims in Ukraine: military bloggers, many of whom report from the front lines of the war.\n\nOne Russian military blogger said Roskomnadzor was helping “the enemy” and forcing Russian troops to rely on “carrier pigeons” by restricting use of Telegram.\n\nSegal guesses that the Russian government has decided that the pushback is “worth it,” given Russia’s internal security desires.\n\nIn recent years, Russia has studied China’s infamous Great Firewall,a sophisticated systemof controlling and surveilling its citizens’ internet use, and bought technology from the country, Segal said. However, he doesn’t “think the Russians are there yet” in terms of China-level surveillance.\n\n“I think it’s going to be kind of two steps forward, one step back, or one step forward, two steps back,” Segal said of its efforts to block apps like Telegram. Russia will “still have to deal with some of their own technical limitations, as well as domestic pressure to continue using global apps.”\n\n“You’ll see certainly see technological savvy elite Russians continue to use it through VPNs and other workarounds,” Segal said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/21/tech/max-messenger-app-russia-smartphones-intl",
      "text": "its own tightly controlled alternatives"
    },
    {
      "url": "https://www.cnn.com/2024/08/27/tech/pavel-durov-telegram-kremlin-intl",
      "text": "Pavel Durov"
    },
    {
      "url": "https://www.cnn.com/2022/09/28/tech/apple-removes-russian-vk",
      "text": "VKontakte"
    },
    {
      "url": "https://www.cnn.com/2018/11/01/asia/internet-freedom-china-censorship-intl/index.html",
      "text": "a sophisticated system"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/europe/telegram-ban-russia-web-block-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/europe/telegram-ban-russia-web-block-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a94093372f8b81265621d069ab8e80b25b2d48ac10faf607327e00aa39acbadf",
  "scraped_at": "2026-02-11T16:31:29.864490+00:00"
}