{
  "url": "https://lite.cnn.com/2026/02/20/us/texas-ruben-ray-martinez-shooting",
  "title": "Ruben Ray Martinez: Texas man was fatally shot by a federal immigration agent last year, new records show | CNN",
  "date": "2026-02-22T07:10:11.488431+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nNewly released records show a US citizen was shot and killed in Texas by a federal immigration agent last year during a late-night traffic encounter that was not publicly disclosed by the Department of Homeland Security.\n\nThe death of Ruben Ray Martinez, 23, would mark the earliest of at least six deadly shootings by federal officers since the start of anationwide immigration crackdownin President Donald Trump’s second term. On Friday, DHS said the shooting on South Padre Island last March occurred after the driver intentionally struck an agent.\n\nThe shooting involved a Homeland Security Investigations team that was conducting an immigration enforcement operation in conjunction with local police, according to documents obtained by American Oversight, a nonprofit watchdog group based in Washington.\n\nThe records are part of a tranche of heavily redacted internal documents from Immigration and Customs Enforcement that the nonprofit obtained as part of a Freedom of Information Act lawsuit.\n\nThough Martinez’s death on March 15, 2025, was reported by local media outlets at the time, federal and state authorities did not disclose that the shooting involved the team from HSI. In a statement Friday, DHS said the driver who was killed “intentionally ran over a Homeland Security Investigation special agent,” resulting in another agent firing “defensive shots to protect himself, his fellow agents, and the general public.”\n\nThe department did not respond to questions about why it had made no media release or other public notification of the officer-involved shooting over the last 11 months.\n\nMartinez’s mother, Rachel Reyes, said her son was just days past his 23rd birthday when he and his best friend drove from San Antonio down to the beach for the weekend to celebrate. South Padre Island, located on the Gulf Coast just north of the US-Mexico border, is a renowned spring break destination that attracts tens of thousands of college-aged partiers each March.\n\nMartinez worked at an Amazon warehouse, liked to play video games and hang out with friends. His mother said he had never had any prior run-ins with law enforcement.\n\n“He was a typical young guy,” Reyes told The Associated Press. “He never really got a chance to go out and experience things. It was his first time getting to go out of town. He was a nice guy, humble guy. And he wasn’t a violent person at all.”\n\nAccording to an internal two-page ICE incident report included in the newly disclosed documents, shortly after midnight, HSI officers were assisting South Padre Island police by redirecting traffic through a busy intersection after a vehicle accident with several injuries.\n\nA blue, four-door Ford with a driver and passenger approached the officers, who ordered the driver to stop. The report does not say why. Initially, the driver didn’t respond to commands but did eventually come to a stop, according to the report.\n\nAgents then surrounded the vehicle, telling those inside to get out, but the driver “accelerated forward” and struck an HSI special agent “who wound up on the hood of the vehicle,” the report said. An HSI supervisory special agent standing by the side of the car then fired his weapon multiple times through the open driver’s side window, and the vehicle stopped.\n\nParamedics already on the scene of the accident quickly provided medical aid and the driver was taken by ambulance to a regional hospital in Brownsville, where he was pronounced dead, according to the report. The passenger, also a US citizen, was taken into custody.\n\nThe HSI officer who the report says was struck by the vehicle was treated for an unspecified knee injury at a nearby hospital and released.\n\nThe names of the two HSI agents involved in the shooting and the names of the two men in the car were all redacted from the ICE report, but Reyes confirmed the dead driver was her son. She said he was shot three times.\n\nThe report says the Texas Rangers responded to the shooting scene and took the lead as the primary agency investigating the shooting.\n\nReyes said she first learned her son had been shot by a federal agent, rather than a local police officer, about a week after he was killed. She was contacted by an investigator from the Rangers who she said told her there were videos of the shooting that contradicted the account provided by federal agents. DHS did not immediately respond to an email Friday about the claim that there is video showing a different account.\n\nShe said she was told by the investigator that the state report into the shooting was completed in October and that the case would be presented to a grand jury for potential criminal charges.\n\nThe Texas Department of Public Safety, which includes the Rangers, said in a statement Friday that the investigation into the shooting is still “active” and declined to offer more information.\n\nMessages left with the office of Cameron County District Attorney Luis V. Saenz, an elected Democrat whose jurisdiction includes South Padre Island, received no response Friday. South Padre Island Police Chief Claudine O’Carroll also did not respond to requests for comment.\n\nAttorneys for the family said Friday they have spent the past year pursuing accountability and transparency.\n\n“It is critical that there is a full and fair investigation into why HSI was present at the scene of a traffic collision and why a federal officer shot and killed a U.S. citizen as he was trying to comply with instructions from the local law enforcement officers directing traffic,” attorneys Charles M. Stam and Alex Stamm said in a statement.\n\nAccording to the ICE report, the HSI agents involved in the shooting were part of a maritime border enforcement security task force typically focused on combating transnational criminal organizations at seaports. Over the last year, however, officers from across multiple federal agencies have been reassigned to prioritize immigration enforcement.\n\nIn January,Renee Good, a 37-year-old mother in Minneapolis, was killed in the driver’s seat of her SUV by ICE officer Jonathan Ross. Trump administration officials initially attempted to paint Good as a “domestic terrorist” who tried to ram officers with her vehicle beforemultiple videos emergedof the incident that cast doubt on the government’s narrative.\n\nAs in the Good case, experts in police training and tactics questioned why afederal officer apparently positioned himselfin front of Martinez’s vehicle.\n\n“You don’t stand in front of the car, you don’t put yourself in harm’s way,” said Geoffrey Alpert, a police use-of-force expert at the University of South Carolina. He added that there’s never a scenario where it’s justified, “because you don’t know whether this person is going to flee, and if he flees, you could be dead.”\n\nAlpert said investigators will likely review any available body camera video or other footage to examine how swiftly Martinez moved the car forward, if he merely took his foot off the break or pressed down hard on the accelerator.\n\nMartinez’s mother said she didn’t believe he would ever intentionally assault a law enforcement officer.\n\n“They didn’t give him a chance,” Reyes said. “It’s so excessive. They could have done anything else besides that. It’s like they shoot first and ask questions later.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/trump-immigration-strategy-homan-bovino",
      "text": "nationwide immigration crackdown"
    },
    {
      "url": "https://www.cnn.com/2026/01/10/us/ice-shooting-minneapolis-renee-good",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/us/ice-shooting-minneapolis-renee-good-cell-phone-invs",
      "text": "multiple videos emerged"
    },
    {
      "url": "https://apnews.com/article/ice-minneapolis-police-rules-shooting-moving-vehicle-e8af318ca5253b43a893b4c76e6f6a03",
      "text": "federal officer apparently positioned himself"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/texas-ruben-ray-martinez-shooting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/us/texas-ruben-ray-martinez-shooting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "a9dc3e05b7fba54fe5cd0633ced3315ac1eed38d6ee8dcc55555e23036ae838a",
  "scraped_at": "2026-02-22T07:10:11.488446+00:00"
}