{
  "url": "https://lite.cnn.com/2026/02/27/us/ellie-aghayeva-columbia-student-ice-detention-wwk-hnk",
  "title": "Ellie Aghayeva: What we know about the Columbia student’s detention by ICE agents | CNN",
  "date": "2026-03-01T07:06:36.122094+00:00",
  "authors": [
    "Emma Tucker",
    "Alaa Elassar",
    "Holly Yan"
  ],
  "text": "Source: CNN\n\nEllie Aghayevaspent Wednesday night buried in books at a Columbia University library, documenting an intense 10-hour study session for her social media following — a window into the discipline and determination of student life.\n\nLittle did she know at the time, she would spend roughly the same number of hours in federal immigration detention the next day.\n\nAghayeva, a senior at the university, was taken into custody by agents from the Department of Homeland Security at a Columbia-owned residential building in New York City at about 6:30 a.m. Thursday, university officials said. About nine hours later, she posted on her Instagram account she had been released.\n\nUniversity officials claimed the agents misrepresented their purpose in order to access the building, entering “without any kind of warrant” and using the false pretense of searching for a missing child. DHS said it was targeting Aghayeva because she is an undocumented immigrant “whose student visa was terminated in 2016 under the Obama administration for failing to attend classes.”\n\nNew York Mayor Zohran Mamdani raised Aghayeva’s detention with President Donald Trump during a meeting at the White House Thursday, saying shortly after that Trump had informed him she would be released.\n\nAghayeva sued federal officials while she was detained on Thursday, according to court records.\n\nIn response to the federal habeas corpus petition, a judge set a hearing for next Friday at the Thurgood Marshall United States Courthouse in New York.\n\nHabeas corpusis a legal principlethat allows someone who believes they are being held unlawfully to ask a court to review their detention and order their release if warranted.\n\nUS District Court Judge Katherine Polk Failla ordered Aghayeva to not be removed from the country or transferred to a detention facility outside New York or New Jersey without a court order.\n\nFailla’s order was filed around the same time as Aghayeva was released, after Mamdani discussed her case with Trump.\n\nA spokesperson for the Manhattan US Attorney’s office declined to comment on the lawsuit, which was filed against DHS and officials including Immigration and Customs Enforcement Acting Director Todd Lyons, DHS Secretary Kristi Noem, Attorney General Pam Bondi and New York ICE Enforcement and Removal Operations field office director Kenneth Genalo.\n\nAs uncertainty shrouds the circumstances of her detainment, here’s what we do and don’t know about the case:\n\nAghayeva is an international student from Azerbaijan, double majoring in neuroscience and political science, according to the American Association of University Professors.\n\nAghayeva has more than 200,000 followers combined on her Instagram and TikTok accounts, where she consistently posts on a variety of topics from marathon library study sessions to her daily routines and productivity tips.\n\nAghayeva shared news of her detention on Instagram Thursday, showing a photo of just her legs with the caption: “DHS illegally arrested me. Please help.” The post was deleted after her release.\n\nAghayeva later shared on Instagram she had been released, saying she was “safe and okay” and on her way home. “I am in complete shock over what happened … I need a little bit of time to process everything I will come back soon. But please don’t worry,” she wrote.\n\nA friend of Aghayeva, Sabah Bari, described her as a “highly motivated” and “extremely intelligent” person who is involved in student organizations, academically accomplished and “very funny.”\n\nAghayeva is on track to graduate in May, said Bari, a student at Columbia’s Mailman School of Public Health.\n\nOn social media, Aghayeva offers a glimpse into her world, blending library study sessions with motivational messages and hints of her immigrant journey. “As long as I am alive, I can begin again … There is no end. No finish line,” she wrote on one video.\n\nOther posts honor her family: “Studying is hard but my parents sacrificed everything across the ocean for me to be here,” she wrote. “They deserve a successful daughter.”\n\nThe university alleges the federal agents who detained Aghayeva made “misrepresentations to gain entry to the building to search for a ‘missing person,’” according to Columbia University’s Acting President Claire Shipman ina letterto the campus community.\n\nThe agents entered the residential building “without any kind of warrant” and security cameras “captured the agents in the hallway showing pictures of the alleged missing child,” Shipman said in a latervideo statement.\n\nA public safety officer arrived as “it became clear” the agents had misrepresented themselves. The officer “asked multiple times for a warrant, which was not produced, and asked for time to call his boss, which was not given,” she said.\n\nShipman emphasized law enforcement officers must present a judicial warrant or judicial subpoena to access non-public areas of the university, including residence halls, classrooms and buildings requiring Columbia University ID card access. An administrative warrant, she wrote, is not sufficient.\n\n“All law enforcement agencies – including DHS and ICE – are obligated to follow established legal and ethical standards. And we expect those standards to be respected,” she said in a statement following Aghayeva’s release.\n\n“This was a frightening and fast-moving situation and utterly unacceptable for our students and staff,” she said.\n\nDHS confirmed to CNN that ICE arrested Aghayeva, “whose student visa was terminated in 2016 under the Obama administration for failing to attend classes.”\n\n“The building manager and her roommate let officers into the apartment. She has no pending appeals or applications with DHS,” the DHS statement read.\n\nWhen asked whether the agents misrepresented themselves as searching for a missing person, the agency replied, “Homeland Security Investigators verbally identified themselves and visibly wore badges around their necks. They did NOT and would not identify themselves as NYPD.”\n\n“ICE placed her in removal proceedings and she’s been released while she waits for her hearing,” a DHS official told CNN.\n\nCNN has reached out Aghayeva’s lawyer for further information.\n\nAghayeva was detained hours beforeMamdani met with Trumpin Washington to discuss housing availability, infrastructure and other topics.\n\n“We spoke about the detention of the Columbia student that morning, and I shared my concerns as part of my longstanding belief that ICE raids are not only cruel – they also do nothing to advance the cause of public safety,” Mamdani told reporters Friday.\n\n“I shared directly with the president a list of names of Columbia students and those who’ve also been detained because of their activity on Columbia campus – and that (detainments) do nothing to advance the cause of public safety. And I asked that these cases be dropped,” the mayor said.\n\n“The president said that he would look into it. Soon after the meeting, I received a phone call from the president saying he would imminently release (Aghayeva).”\n\nOfficials in New York expressed fury over the detention, branding the ICE agents’ actions as a terrifying misuse of authority that leaves students fearing for their safety.\n\n“Let’s be clear about what happened: ICE agents didn’t have the proper warrant, so they lied to gain access to a student’s private residence,” New York Gov. Kathy Hochul said ina statement on X.\n\nThe Democratic governor previously proposed legislation that would bar ICE from entering sensitive locations such as schools and dormitories.\n\n“Entering a student dorm under false pretenses is a gross abuse of power,” the governorposted on X. “New York will act to ensure it never happens again.”\n\nDemocratic Rep. Jerry Nadler, the dean of the New York congressional delegation, and Assemblymember Micah Lasher said in a joint statement they were “disgusted and outraged” and labeled the ICE agents’ actions as dangerous and fear-inducing.\n\nRep. Adriano Espaillat, a former undocumented immigrant, said students and faculty “should not fear for their safety in their dorm rooms, the classroom, or anywhere else on campus,” and described the incident as part of what he called the Trump administration’s “lawless actions.”\n\nAghayeva’s arrest is the latest in a series of high-profile detentions by DHS at the Ivy League school. Like her, Palestinian activist and Columbia studentMahmoud Khalilwas also taken into custody by federal agents at his campus apartment nearly a year ago.\n\nKhalil spent more than 100 days detained, missing the birth of his first child, and now faces thelooming possibility of rearrest and deportationto Algeria or Syria.\n\nKhalil, who was born in a Palestinian refugee camp in Syria before going on to graduate from Columbia, had played a prominent role negotiating on behalf of pro-Palestinian protesters at the university.\n\nAnother Columbia University student, Ranjani Srinivasan, was also detained in March 2025 amid pro-Palestinian protests at Hamilton Hall, even though she maintainsshe did not participate in the protest.\n\nSrinivasan, then 37, an Indian national and Fulbright Scholarship recipient, said she was targeted for exercising her right to free speech, and the experience forced her to leave the country out of fear of being taken into custody.\n\nDHS officials identified her as one of several Columbia students targeted for immigration action under the Trump administration’s crackdown on international students involved in protests related to the Israel-Hamas conflict.\n\n“While details are still emerging, reporting suggests ICE agents have again flouted the law to rip yet another Columbia University student from campus as part of the Trump administration’s continued attack on universities and immigrants,” the American Civil Liberties Union in New York said in a statement to CNN.\n\nWithout a warrant, federal agents can only enter campus areasof Columbia University that are open to the public such as outdoor walkways, according to CNN legal analyst Joey Jackson.\n\nThey have no legal right to enter residences or restricted university buildings without “specific legal authorization,” which would be a judicial warrant signed by an independent judge or magistrate but not an immigration official, Jackson said.\n\nImmigration officials, he added, typically sign administrative warrants that may note immigration violations and authorize detention but “do not allow searches and seizures on private property.”\n\nColumbia’s president has specified that an administrative warrant is “not sufficient” to access the university’s non-public areas, and that federal agents must have a judicial warrant or judicial subpoena.\n\nFurthermore, tactics that include misrepresentation to gain access would be illegal and against the Constitution, said Jackson.\n\nIn the case of Aghayeva, it appears the law was “flagrantly violated,” which he says has parallels to the cases of 5-year-oldLiam Conejo Ramos,Kilmar Abrego Garciaand Khalil.\n\nIn a scathing opinion last month, the federal judge who ordered the release of Liam – an Ecuadorian preschooler who was held in a Texas ICE facility – admonished “the government’s ignorance of an American historical document called the Declaration of Independence.”\n\n“The courts can ultimately provide justice, but is a long, hard road — and one that would not need to be taken — if the Trump Administration had a modicum of respect for the law,” Jackson argued.\n\nThis story has been updated with additional information.\n\nCNN’s Kristen Holmes contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/us/columbia-university-student-detained-ice",
      "text": "Ellie Aghayeva"
    },
    {
      "url": "https://www.cnn.com/2025/05/10/politics/habeas-corpus-explained",
      "text": "is a legal principle"
    },
    {
      "url": "https://president.columbia.edu/news/important-update-columbia-university",
      "text": "a letter"
    },
    {
      "url": "https://president.columbia.edu/news/message-acting-president-claire-shipman-0",
      "text": "video statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/politics/trump-mamdani-meet-washington-white-house",
      "text": "Mamdani met with Trump"
    },
    {
      "url": "https://x.com/GovKathyHochul/status/2027066938640183657",
      "text": "a statement on X."
    },
    {
      "url": "https://x.com/GovKathyHochul/status/2027148151077925341",
      "text": "posted on X"
    },
    {
      "url": "https://www.cnn.com/2025/06/20/us/mahmoud-khalil-ordered-released-by-judge",
      "text": "Mahmoud Khalil"
    },
    {
      "url": "https://www.cnn.com/2025/09/17/us/mahmoud-khalil-deportation-ruling",
      "text": "looming possibility of rearrest and deportation"
    },
    {
      "url": "https://www.cnn.com/2025/03/16/us/ranjani-srinivasan-columbia-university",
      "text": "she did not participate in the protest."
    },
    {
      "url": "https://www.cnn.com/2026/01/23/us/liam-conejo-ramos-ice-wwk",
      "text": "Liam Conejo Ramos"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/politics/kilmar-abrego-garcia-nashville-hearing",
      "text": "Kilmar Abrego Garcia"
    }
  ],
  "hash": "a9f386ea3b32d36187cfdd4cbf7f422d0b17108fba0db1408ce5b1fead0539f4",
  "scraped_at": "2026-03-01T07:06:36.122107+00:00"
}