{
  "url": "https://lite.cnn.com/2026/02/24/business/spirit-airlines-to-survive",
  "title": "Spirit Airlines reaches deal to emerge from bankruptcy, avoiding closure threat | CNN Business",
  "date": "2026-02-25T07:32:29.258819+00:00",
  "authors": [
    "Chris Isidore"
  ],
  "text": "Source: CNN\n\nSpirit Airlines, which had been in danger of going out of business due to ongoing losses and two bankruptcy filings, has reached a deal that will allow it to survive, albeit as a smaller company.\n\nThe budget airline announced Tuesday that it made an agreement with creditors that will allow it to emerge from bankruptcy later this spring or early summer.\n\n“Spirit will emerge as a strong, leaner competitor that is positioned to profitably deliver the value American consumers expect at a price they want to pay,” CEO Dave Davissaid in a statement.\n\nSpirit,a no-frills carrier that charges very low base fares and fees for extras, filed its second bankruptcylast year. The airline has struggled to stem losses that started during the pandemic as demand shifted away from low-fare offerings toward more comfortable, experience-driven travel.\n\nCompanies often emerge from bankruptcy with lower debt and operating costs. But Spirit repeatedly warned investors in recent years that there was “substantial doubt” it would be able to stay in business.\n\nThe airline’s presence in the US market is important even to passengers who never fly its planes. Spirit’s low-fare model has forced larger legacy carriers like Delta or United to offer a certain number of no-frill seats in order to compete. Thus, its closure would have likelyled to higher faresacross the industry.\n\nSpirit Airlines will emerge a much smaller company than the one that firstwent intobankruptcyin November 2024. The airline has sold aircrafts and gates to raise cash and reduce debt, and has significantly cut staff.\n\nThis upcoming summer travel season, Spirit will offer nearly 40% fewer flights and seats than during the same period in 2024, ahead of its bankruptcy, according to data from aviation analytics firm Cirium.\n\nSpirit will also remain an independent carrier under the terms of the deal. In the past, US airlines have been purchased out of bankruptcy and merged into other carriers. Spirit has twice agreed to be bought only for both deals to fall through.\n\nIn February 2022, Spirit agreed to merge withFrontier Airlines, another ultra-low cost carrier. But that deal fell apart whenJetBlue Airwayscame in with a higher bid preferred by Spirit shareholders.\n\nHowever, the JetBlue deal ended up beingblocked by a federal judgein January 2024. The court ruled such a combination would violate federal antitrust laws and hurt airline passengers by driving up fares.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/29/business/spirit-airlines-bankruptcy",
      "text": "last year"
    },
    {
      "url": "https://www.cnn.com/2025/08/12/business/spirit-airlines-going-concern",
      "text": "substantial doubt"
    },
    {
      "url": "https://www.cnn.com/2025/08/17/business/spirit-airlines-air-fare-impact",
      "text": "led to higher fares"
    },
    {
      "url": "https://www.cnn.com/2024/11/18/business/spirit-airlines-bankruptcy",
      "text": "bankruptcy"
    },
    {
      "url": "https://www.cnn.com/2022/02/07/investing/spirit-frontier-airlines-merger",
      "text": "Frontier Airlines"
    },
    {
      "url": "https://www.cnn.com/2022/07/27/business/spirit-kills-frontier-deal-jetblue-next",
      "text": "JetBlue Airways"
    },
    {
      "url": "https://www.cnn.com/2024/01/16/investing/spirit-airlines-jetblue-deal-stock",
      "text": "blocked by a federal judge"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/business/spirit-airlines-to-survive",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/business/spirit-airlines-to-survive",
      "text": "Cookie Settings"
    }
  ],
  "hash": "aa1e36374680015d0a607e5a73d62ec135d2c2fd0e7a9f80e29addcf2ce74424",
  "scraped_at": "2026-02-25T07:32:29.258829+00:00"
}