{
  "url": "https://lite.cnn.com/2026/02/25/sport/hilary-knight-president-trump-distasteful-joke",
  "title": "Hilary Knight calls President Trump’s White House invite a ‘distasteful joke’ | CNN",
  "date": "2026-02-27T07:17:01.318401+00:00",
  "authors": [
    "Mia Fishman"
  ],
  "text": "Source: CNN\n\nUnited States Olympic women’s hockey team captain Hilary Knight called President Trump’s invitation to the White House “a distasteful joke” on Wednesday during an appearance on ESPN’s SportsCenter.\n\nThe invitecame after Trump extended a welcome to the men’s team via a phone call on Sunday, as celebration ensued in the locker room following their 2-1 gold medalovertime winagainst Canada.\n\n“I must tell you, we’re gonna have to bring the women’s team — you do know that,” Trump said over a speakerphoneheld by FBI Director Kash Patel, who was videoed celebrating with the team.\n\nTrump said that if the women’s team wasn’t invited, he “probably would be impeached.” His response was then echoed by laughter from those in the locker room.\n\nThe women’s team earned their third all-time Olympic gold medal afterdefeating Canada 2-1 in overtimeat the Milan Cortina Winter Games on Thursday, with Knight scoring the late game-tying goal.\n\nThe women’s teamdeclined their invitationto Trump’s State of the Union address due to prior academic and professional commitments.\n\nIn theESPN interview, Knight, a five-time Olympic medalist, said the controversy surrounding Trump’s invite “is overshadowing a lot of the success, the success of just women at the Olympics carrying for Team USA and having amazing gold-medal feats.”\n\nIn Sunday’s viral locker room video, several members of the men’s team can be heard laughing at the suggestion that the President could be impeached for not inviting the gold-medal-winning women’s squad.\n\nThe exchange between the men’s players, Trump and Patel, drew significant backlash as the video circulated on social media.\n\n“We should’ve reacted differently,” Team USA and Boston Bruins goalie Jeremy Swayman said on Wednesday. “We are so excited for the women’s team and we have so much respect for the women’s team – to share that gold medal with them is something that we will forever be grateful for.”\n\nWhen asked about how the men’s players reacted to the women’s offer visit the White House this week, Knight described the laughter in the locker room as a “quick lapse” in judgment.\n\nDespite the friction, Knight emphasized her pride in the men’s gold-medal victory, noting that both teams should be celebrating a historic week for American hockey rather than navigating political fallout.\n\n“I think the guys were in a tough spot, so I think it’s a shame this storyline and narrative has kind of blown up and is overshadowing that connection and genuine interest in one another and cheering each other on,” Knight said.\n\nRapper Flavor Flav, who served as Team USA’s hypeman in Italy, extended his own invitation to the women’s teamvia social mediaon Monday, calling for “a real celebration” in Las Vegas.\n\nKnight said she hoped to celebrate the accomplishments of the team in Las Vegas with the Public Enemy star but commitments for players in the PWHL and college teams were preventing an immediate party.\n\nA contingent of the men’s team, who flew to Washington on a military plane, receivedsix minutes of accoladesfrom Trump during the State of the Union address Tuesday night.\n\n“Our country is winning again. In fact, we’re winning so much that we really don’t know what to do about it,” Trump said. “To prove that point, to prove that perfect here with us tonight is a group of winners who just made the entire nation proud: the men’s gold medal Olympic hockey team.”\n\nTrump ensured that the women’s team would “soon” be making a trip to Washington during his address to the nation, but Team USA has yet to confirm an upcoming visit\n\nJack Hughes, who scored the game-winning goal in overtime to secure the gold for the men’s US hockey team, made his highly anticipated return to the New Jersey Devils on Wednesday night, playing against Olympic teammate Tage Thompson and the Buffalo Sabres.\n\nBoth received a rousing ovation from the Prudential Center crowd. Hughes addressed the fans, thanking them for their love and support.\n\nFollowing the Devils’ 2-1 loss, Hughes addressed the fallout from the last few days, saying he wasn’t surprised at the conversation surrounding the team’s celebrations.\n\n“Obviously, there’s so many different people in the country with so many different views. So, no matter what’s going on - someone’s going like it, someone’s not going to like it,” Hughes told reporters.\n\n“For us, it was about the celebration. Celebrating USA hockey, celebrating our teammates, our group of guys. Like I said, we just had so much fun fun being together and enjoying the moment together.”\n\nThe 24-year-old described the moment when President Trump called in the locker room when asked if he agreed with the discourse from the women’s team and Swayman earlier in the day.\n\n“It is what it is now but we have so much respect for the women’s team. They have so much for us and we’re all just proud Americans and we’re happy that we both swept the Olympics,” Hughes said\n\nEarlier in the week, Hughes pushed back on the growing political discourse around the events, reiterating that the team are just “hockey players” when asked about attending the White House and the State of the Union on Tuesday.\n\n“We’re just hockey players, right? So, we did our job. We went over to the Olympics to win a gold medal and that’s what we did. I’ve had the best time of my life celebrating with my teammates that we accomplished our goal and like I said, I’m a hockey player,” Hughes said. “We’re just so proud to be back in the US and celebrating our gold medal and to do it with our teammates that’s the best part.”\n\nKnight characterized the recent controversy as a “really good learning point, to really focus on how we talk about women, not only in sport but in the industry. Women aren’t less than and their achievements shouldn’t be overshadowed by anything else other than how great they are.”\n\nWith Knight’s last-gasp equalizer in the Olympic final in Milan, the veteran wrote herself into US hockey history, becoming the women’s all-time Olympic goals and points leader.\n\nShe is set to be back on the ice with her professional team, the PWHL’s Seattle Torrent, on Friday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/22/sport/team-usa-johnny-gaudreau-hockey-gold-medal",
      "text": "overtime win"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
      "text": "held by FBI Director Kash Patel"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/sport/video/usa-womens-hockey-gold-medal-interview-vrtc",
      "text": "defeating Canada 2-1 in overtime"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/womens-hockey-usa-trump-sotu",
      "text": "declined their invitation"
    },
    {
      "url": "https://www.youtube.com/watch?v=ifGmael6zhM",
      "text": "ESPN interview"
    },
    {
      "url": "https://x.com/FlavorFlav/status/2026061939127001221?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
      "text": "via social media"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/team-usa-hockey-olympics-trump-state-of-the-union",
      "text": "six minutes of accolades"
    },
    {
      "url": "https://us.cnn.com/sport/live-news/milan-winter-olympics-results-highlights-medals-02-22-26?post-id=cmlxxtgkt0000356sepiwh3si",
      "text": "Jack Hughes"
    }
  ],
  "hash": "aa372cb59574415a879ea54e28ba52de517680996a73f29bd7e1f4d923620873",
  "scraped_at": "2026-02-27T07:17:01.318417+00:00"
}