{
  "url": "https://lite.cnn.com/2026/02/12/politics/dhs-shutdown-ice-congress",
  "title": "Department of Homeland Security on track to shut down with lawmakers leaving Washington and an unresolved ICE fight | CNN Politics",
  "date": "2026-02-12T21:29:13.348489+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA bitterly divided Washington is headed for its third government funding lapse of PresidentDonald Trump’s second term — this time, a shutdown of the Department of Homeland Security over the issue of federal immigration enforcement.\n\nWith lawmakers leaving town Thursday, funding for the department is set to expire Friday at midnight. GOP leaders sent their members home after the two parties made no concrete progress toward a deal that Democrats are demanding must rein in US Immigration and Customs Enforcement operations after last month’s fatal shootings by federal agents of Alex Pretti and Renee Nicole Good in Minnesota.\n\nThe next steps are uncertain. With talks ongoing between the White House and Democrats, the two chambers aren’t scheduled to return to Washington for 11 days, though GOP leaders could still call members back if a deal is reached.\n\nDemocrats have demanded that Trump administration end its “roving” patrols, require independent oversight of ICE, bar the deportation of US citizens and forbid ICE agents from wearing masks. Another major sticking point: Democrats want immigration warrants to be signed by a judge, not by an ICE agency official. But Republicans are firmly opposed.\n\n“We will find out, I think, very quickly, whether or not the Democrats are serious,” Senate Majority Leader John Thune told reporters just after the chamber’s final vote Thursday. He said he hoped Democrats would soon show the GOP that they, too, are willing to compromise after the White House’s latest proposal, though he declined to say what new policies are being discussed.\n\n“I think the White House has given more and more ground on some of these key issues,” Thune said.\n\nOne senior White House official, who declined to speak publicly, was even more blunt: “At this point it seems clear the Democrats are going to walk away from that bipartisan conversation. They’re going to shut the department down.”\n\n“We will not be held hostage on an issue the president was elected on,” the official said.\n\nBut top Democrats insist the White House needs to come closer to the party’s demands or risk national backlash.\n\nSen. Brian Schatz of Hawaii, a top Senate Democrat, criticized Republicans for not understanding “the depth of the anger” across the country over Trump’s aggressive deportation efforts.\n\n“Maybe this break will allow [Republicans] to go home and get yelled at — not just by people who are progressive, but everybody who thinks this agency is out of control,” Schatz said. “It’s gonna take them maybe another week to figure out how pissed off their own voters are about the idea of a masked police force terrorizing communities.”\n\nBehind the scenes, top Democrats and the White House have been negotiating, but Democrats have criticized the White House for being unserious in those talks, refusing to yield to the party’s biggest demands to overhaul federal immigration enforcement.\n\nRepublicans, meanwhile, have argued that the White House demonstrated its commitment to the talks by sending a full legislative proposal to Democrats the night before — as well as announcing a formal end to its ICE operation in Minnesota.\n\nSpeaker Mike Johnson called the White House proposal in the negotiations for DHS funding “eminently reasonable” and criticized some Democrats for wanting “to impose pain.”\n\n“I saw the last proposal sent over from the White House. It is eminently reasonable,” he told CNN, adding: “It seems to me, the appearance here is that some Democrats, House and Senate, want a government shutdown. They want to impose more pain on the American people. For what? I have no idea.”\n\nUnlike in last fall’s full shutdown government, Democrats have so far offered a clear display of unity against the GOP’s latest ICE offer. The party roundly rejected the White House’s latest proposal in the ongoing negotiations over how to rein in ICE. Only Pennsylvania Sen. John Fetterman, who has repeatedly voted against any shutdowns, sided with Republicans on the Thursday votes.\n\nBoth parties are refusing to discuss the White House’s specific proposal. But it is clear the two sides are far apart.\n\nJohnson maintained his hardline stance against requiring judicial warrants, saying it would “shut down the deportation of virtually all illegal immigrants.”\n\n“You can’t do that. You can’t have an Immigration and Customs Enforcement program if you have to get a judicial warrant every time you go to arrest someone. That’s not how it works. It’s not how it can work. It’s not workable,” he said.\n\nDemocrats, including House Minority Leader Hakeem Jeffries, have been clear that judicial reform is one of their red lines.\n\nJeffries said earlier Thursday that Democrats need to see policy changes to ICE’s immigration enforcement that are “bold, meaningful, and transformational” — and that the White House’s latest offer did not meet that bar.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.google.com/search?q=donald+trump+cnn&rlz=1C5GCCM_en&oq=donald&gs_lcrp=EgZjaHJvbWUqBggAEEUYOzIGCAAQRRg7Mg0IARAuGIMBGLEDGIAEMgYIAhBFGDkyCggDEC4YsQMYgAQyCggEEC4YsQMYgAQyBggFEEUYPDIGCAYQRRg8MgYIBxBFGDzSAQc3NDNqMGo0qAIAsAIA&sourceid=chrome&ie=UTF-8",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/dhs-shutdown-ice-congress",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/dhs-shutdown-ice-congress",
      "text": "Cookie Settings"
    }
  ],
  "hash": "aa8758e3628a1f7f738e25f53f328a17990e320650667c15fd728e2b6982af69",
  "scraped_at": "2026-02-12T21:29:13.348503+00:00"
}