{
  "url": "https://lite.cnn.com/2026/02/16/politics/philadelphia-slavery-exhibits-judge-orders-return-orwell",
  "title": "Citing Orwell’s ‘1984,’ judge orders Trump administration to return slavery exhibits removed from Philadelphia museum | CNN Politics",
  "date": "2026-02-18T07:31:39.198804+00:00",
  "authors": [
    "Piper Hudspeth Blackburn, CNN"
  ],
  "text": "Source: CNN\n\nA federal judge, evoking the dystopian world of George Orwell’s novel “1984,” ordered the Trump administration on Monday to return along-standing exhibit on slaveryit removed from a popular historical museum in Philadelphia.\n\nUS District Judge Cynthia Rufe, an appointee of former President George W. Bush, included multiple references to Orwell in her ruling granting the City of Philadelphia’s request to restore the exhibit panels to Independence National Historical Park while litigation over their removal continues.\n\n“As if the Ministry of Truth in George Orwell’s 1984 now existed, with its motto ‘Ignorance is Strength,’ this Court is now asked to determine whether the federal government has the power it claims—to dissemble and disassemble historical truths when it has some domain over historical facts. It does not,” Rufe said, referring to the famous novel, which deals with themes of oppression and rigid governmental control.\n\nLast month, work crews took down large display panels at the President’s House Site, where Presidents George Washington and John Adams once lived. Soon after, the city sued the administration in federal court, claiming the government was required to consult with Philadelphia before making any changes.\n\nSiding with the city, Rufe noted that Congress passed legislation that “specifically limited” the authority of the Interior Department to “unilaterally alter or control” the park.\n\n“The government can convey a different message without restraint elsewhere if it so pleases, but it cannot do so to the President’s House until it follows the law and consults with the City,” Rufe wrote.\n\nThe Interior Department told CNN in a statement Tuesday that it disagreed with the court ruling and that it was planning to file an appeal.\n\n“The National Park Service routinely updates exhibits across the park system to ensure historical accuracy and completeness,” the department said. “If not for this unnecessary judicial intervention, updated interpretive materials providing a fuller account of the history of slavery at Independence Hall would have been installed in the coming days.”\n\nCNN has reached out to the White House and and Philadelphia Mayor Cherelle Parker for comment.\n\nThe dispute is playing out as the Trump administration has ramped up its effort topurge cultural institutionsof materials that conflict with the president’s views ahead of thenation’s 250th anniversaryin July.\n\nPhiladelphia City Council President Kenyatta Johnson celebrated the ruling, saying in apost on X, “Black history is American history, and we won’t let Trump erase our story.”\n\nDemocratic Pennsylvania Gov. Josh Shapiro previously criticized the removal of the slavery exhibit, saying the White﻿ House was“whitewashing” history.\n\nIn anexecutive ordersigned last March, President Donald Trump accused the Biden administration of advancing “corrosive ideology,” specifically citing Independence Park, and called upon the Interior secretary to remove contents that “inappropriately disparage Americans past or living.”\n\nSince then, the White House has also launched a review of Smithsonian museums and exhibits to get rid of what it considers anti-American propaganda.\n\n“The American people will have no patience for any museum that is diffident about America’s founding or otherwise uncomfortable conveying a positive view of American history, one which is justifiably proud of our country’s accomplishments and record,” White House officials wrote to the Smithsonian in December.\n\nLast year, the American Battle Monuments Commission, a small, little-known federal agency, also tookdown a cemetery displayin the Netherlands that commemorated the contributions of Black WWII soldiers and highlighted the discrimination they faced.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/philadelphia-sues-nps-removal-slavery-exhibit",
      "text": "long-standing exhibit on slavery"
    },
    {
      "url": "https://www.cnn.com/2025/08/19/politics/trump-slavery-museum-smithsonian",
      "text": "purge cultural institutions"
    },
    {
      "url": "https://www.cnn.com/2025/09/06/politics/trump-250-america-birthday-celebration",
      "text": "nation’s 250th anniversary"
    },
    {
      "url": "https://x.com/CouncilmemberJG/status/2023483869651927452?s=20",
      "text": "post on X"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-01-28-26#cmky6bwn300003b6pymncqusi",
      "text": "“whitewashing” history."
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/",
      "text": "executive order"
    },
    {
      "url": "https://www.cnn.com/2025/11/13/politics/black-soldiers-world-war-ii-cemetery",
      "text": "down a cemetery display"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/philadelphia-slavery-exhibits-judge-orders-return-orwell",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/politics/philadelphia-slavery-exhibits-judge-orders-return-orwell",
      "text": "Cookie Settings"
    }
  ],
  "hash": "aaa60b7a08d1691bc36b8cc4d91a6d844b631fe736a21009ab30a8cc921030d5",
  "scraped_at": "2026-02-18T07:31:39.198818+00:00"
}
