{
  "url": "https://lite.cnn.com/2026/02/18/politics/trump-airport-trademark-profit-name",
  "title": "Trump Organization trademark raises suspicions that family could profit from Florida airport name change | CNN Politics",
  "date": "2026-02-19T07:31:28.807059+00:00",
  "authors": [
    "Kit Maher, CNN"
  ],
  "text": "Source: CNN\n\nAs the Florida Legislature ramps up efforts to rename the Palm Beach International Airport after President Donald Trump, a recent trademark filing has some state lawmakers wondering if the Trump family is looking to profit.\n\nTheHouse billto rename the south Florida hub the President Donald J. Trump International Airport passed the state’s House of Representatives 81-30 on Tuesday. But some Democrats raised concerns about related trademark applications that were filed last week by the private entity that handles licenses and trademarks for the Trump Organization.\n\nDemocratic Florida state Rep. Shevrin Jones was initially on board with the name change and supported it in a committee vote, saying he would have done the same for a Democratic president. But he said the trademark application was one of the two things that changed his mind (the other being the racist video recently posted and deleted on Trump’s Truth Social account, which depicted former President Barack Obama and former first lady Michelle Obama as apes).\n\n“No president, Democrat or Republican should be able to benefit” from an airport trademark license, Jones said.\n\nJones quickly filed an amendment to explicitly prevent the Trump Organization from profiting off the trademark, but it failed. The companion Florida Senate bill has passed the required committees and is set to be considered by the full chamber soon before heading to Republican Gov. Ron DeSantis’ desk.\n\nA spokesperson for the Trump Organization said that Trump and his family would not receive royalties or licensing fees from the renaming of the Palm Beach airport, and the House bill’s text specifies that the branding would come at no cost.\n\n“To be clear, the President and his family will not receive any royalty, licensing fee, or financial consideration whatsoever from the proposed airport renaming,” said Kimberly Benza, Trump Organization director of executive operations. She stressed that the Florida bill requires a license agreement from The Trump Organization but that they are “willing to provide this right to his hometown county at no charge.”\n\nStill, the trademark applications for “DONALD J. TRUMP INTERNATIONAL AIRPORT,” “PRESIDENT DONALD J. TRUMP INTERNATIONAL AIRPORT” and “DJT” raised eyebrows, givenTrump’s known interestin renaming buildings, train stations or airports after himself, the broad scope of the applications and the potential for his family to profit.\n\nThe trademark application is unusual — hubs named for leaders like Ronald Reagan, John F. Kennedy or Bill and Hillary Clinton were not protected with trademark filings by the former presidents or their families, trademark attorney Josh Gerben told CNN. For example, the trademark for Reagan National Airport is owned by the Metropolitan Washington Airports Authority.\n\n“Normally, the private individual who’s being honored isn’t protecting his or her name as a trademark,” Gerben said.\n\nPlus, the trademark includes a lengthy list of goods and services that would fall under its purview. It includes watches, clocks, jewelry, clothing, collectible coins, tie clips, belts, restaurants, airport baggage check-in, airport construction and “plastic slippers used in the airport environment when going through security to keep feet and socks clean.”\n\n“From a legal perspective, the attorney that drafted these did a really good job,” Gerben said. “There could be a whole market at the airport, or even off the airport premises. And again, Trump Org would own the trademark and be able to license that name to anybody that was making and selling that merchandise.”\n\nBenza did not respond when asked to clarify whether the Trump Organization would collect any royalties or licensing fees related to merchandise specifically.\n\nOther reasons exist for trademarking a name other than the potential to profit from licensing fees, Gerben noted. That includes preventing infringement on third-party platforms and setting quality standards in connection with the brand.\n\nBenza said the trademark would keep “bad actors from infringing upon or misusing the name.”\n\nTrump has also specifically pitched renaming Washington’s Dulles International Airport after himself, as well as New York’s Penn Station,CNN previously reported. And the Kennedy Center now bears his name, after a board stacked with Trump allies voted to change the institution’s name to the “Trump Kennedy Center.”\n\nNorth Carolina GOP Rep. Addison McDowell introduced legislation to rename Dulles after Trump, which was cosponsored by a handful of Republicans and is still under discussion, according to a staffer of a member on the House Transportation and Infrastructure Committee. But those efforts could be complicated by the Palm Beach airport renaming, since two airports named after Trump could cause significant confusion.\n\nMcDowell told CNN she understands why the Trump Organization would want to protect the president’s name, adding that Trump has a “different level of branding” than presidents like Reagan.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://flsenate.gov/Session/Bill/2026/919",
      "text": "House bill"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/schumer-trump-ny-funding-rename",
      "text": "Trump’s known interest"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/schumer-trump-ny-funding-rename",
      "text": "CNN previously reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/trump-airport-trademark-profit-name",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/politics/trump-airport-trademark-profit-name",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ac37efb09d49588dacf86ac77f2992828f037f9980d36bc65e9fc5fb8ae583d7",
  "scraped_at": "2026-02-19T07:31:28.807072+00:00"
}