{
  "url": "https://lite.cnn.com/2026/02/25/politics/trump-vance-minnesota-medicaid",
  "title": "Trump admin halts Medicaid payments to Minnesota over fraud claims | CNN Politics",
  "date": "2026-02-27T07:16:09.007193+00:00",
  "authors": [
    "Adam Cancryn",
    "Tami Luhby"
  ],
  "text": "Source: CNN\n\nThe Trump administration is withholding more than $250 million in Medicaid funds from Minnesota, claiming widespread fraud as it escalates a pressure campaign on the state’s Democratic leadership.\n\nVice President JD Vance announced the extraordinary move on Wednesday, blaming Minnesota Gov. Tim Walz for failing to adequately police the safety-net program and warning the pause would continue until the state submitted an acceptable plan for targeting its misuse.\n\n“We are stopping the federal payments that will go to the state government until the state government takes its obligations seriously to stop the fraud that’s being perpetrated against the American taxpayer,” Vance said.\n\nThe administration’s crackdown comes a day after President Donald Trump vowed during his State of the Union address to take a hard line on fraud, claiming without offering specifics that it has grown rampant across several states.\n\nVance, who Trump put in charge of a new anti-fraud task force, said Wednesday that Minnesota was the first of several anticipated states that would be targeted as part of the effort. The administration is also putting a nationwide freeze on new companies’ abilities to seek Medicare payments for durable medical equipment, such as canes and walkers, while it investigates suspected fraud in the program.\n\n“Across the board, these crimes are becoming a major source of fraudulent activity,” Centers for Medicare & Medicaid Services Administrator Mehmet Oz said.\n\nThe halt to Medicaid payments for Minnesota represents just the latest effort to pressure the state over the last several months, after conservatives surfaced a widespread social services fraud scheme that caught the attention of Trump and his aides.\n\nThe scandal prompted the administration to surge immigration forces into the state, a weekslong offensive that led to the fatal shootings of two US citizens.\n\nWalz said Wednesday evening that the move “has nothing to do with fraud.”\n\n“This is a campaign of retribution. Trump is weapon the entirety of the federal government to punish blue states like Minnesota,” Walz posted on X. “These cuts will be devastating for veterans, families with young kids, folks with disabilities, and working people across our state.”\n\nThe governor introduced a legislative package on Thursday aimed at improving oversight of programs and detection of fraud, as well as ramping up enforcement and penalties. It would expand audits and internal controls and harness technology to identify suspicious billing earlier.\n\nTrump officials had previously warned that they were considering deferring payments over fraud concerns, but Wednesday’s announcement marks their first effort to unilaterally halt federal funding that is due to the state’s Medicaid program.\n\nVance dismissed questions about the administration’s legal authority, saying he was “quite confident” about their ability to withhold the money, but declined to offer details.\n\nThe vice president was also vague about the criteria that Walz would need to meet to secure the release of the funding, or how quickly the administration was prepared to resume its payments. Oz indicated that in order to restore funds, Minnesota needs to verify that service providers are indeed tending to people with a genuine need for the programs.\n\n“We need to know that the providers actually are the real providers. Oftentimes, there’s no person that you can associate with the treatment itself,” Oz said, adding states also need to ensure the providers aren’t “already in trouble for doing bad stuff.”\n\n“There’s a whole slew of tools that we can use, including checking before you pay the bill, that the bill is legitimate,” he added. “That prepayment review is incredibly important.”\n\nOz said they’ve imposed a 60-day deadline on the Walz administration to respond.\n\nWednesday’s announcement is Oz’s latest effort to highlight fraud in the federal health programs he oversees — which has been one of his primary focuses since he became CMS administrator last year.\n\nIn recent months, he has alleged that the Armenian community in Los Angeles has engaged in large-scale fraud in hospice and home care; raised red flags about Medicaid-funded treatment programs for children with autism in Maine; and pointed to Medicare fraud involving durable medical equipment among Cubans in South Florida.\n\nOz, a longtime TV talk show host, typically films videos discussing the fraud, including going to the sites where he claims it is taking place.\n\nThis story has been updated with additional details.\n\nKit Maher contributed to this report.\n\nSee Full Web Article",
  "links": [],
  "hash": "ac9731d9e6df484923f8572a274fc6dd1403d6a7142346cff14f694c16da33ca",
  "scraped_at": "2026-02-27T07:16:09.007208+00:00"
}