{
  "url": "https://lite.cnn.com/2026/02/15/politics/trump-religious-liberty-commission-church-state-separation",
  "title": "Trump has chipped away at the long-standing wall between church and state. It’s just the beginning | CNN Politics",
  "date": "2026-02-16T07:34:34.232923+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAt first glance, the December meeting of a little-known government panel looked like ordinary bureaucratic business.\n\nBut then, the Consumer Financial Protection Bureau’s advisory board opened its proceedings in an unusual way: with a Christianprayer.\n\nThe benediction wasdelivered by a White House official. “Thank you for your son, Jesus, who died for our sins,” the official said at one point, according to two sources who attended the meeting.\n\nUnder President Donald Trump, moments like this, rare in recent administrations, are becoming commonplace. A series of faith initiatives championed by the White House have led to a systematic religious revival within the government’s operations, culture and policy.\n\nAmericans have been encouraged topray for an hour each week. Some government agencies have opened their meetings with prayer or hosted regular faith services.Bible versesand Christian imagery now appear onofficial governmentsocialmedia accounts.\n\nThe changes — predominately Christian in character — have been welcomed by conservative organizations that have fought for decades against an increasingly secular government, while alarming longtime defenders of a separation between church and state.\n\nBoth supporters and critics alike say this religious turn has little modern precedent — and it may be just the beginning.\n\nSince last year, interfaith leaders, religious legal activists and close political allies of the president have been laying the groundwork for a broader expansion of the role of religion in public life.\n\nBy thissummer, the group — Trump’s Religious Liberty Commission — is expected to produce a blueprint for policy changes that could redefinethe boundaries between government and religion in American life.\n\n“We have to bring back religion in America,” Trump told the commission last year. “Bring it back stronger than ever before.”\n\nDiscussions by the commission on how to fulfil Trump’s mandate have included aggressively pursuing legal action against state and local governments accused of blocking religious expression and withholding federal funding for K-12 schools viewed as hostile to faith. The lattermirrors pressure Trump has applied to colleges accused of failing to protect Jewish students from discrimination.\n\nThey have also considered ways to encourage the Supreme Court to revisit decades-old precedent governing the First Amendment’s establishment clause, which prohibits the US government from establishing a state religion or favoring one religion over others.\n\nThough the commission has representatives from various faiths, and Jewish and Muslim communities are involved, its strongest threads skew toward conservative views within Christianity.\n\nSome participants — including Trump — have lamented the Bible’s diminished presence in schools.\n\nOne member,television psychologist Phil McGraw, known as “Dr. Phil” hasframed the commission’s work in starker terms.\n\n“We are in a religious and cultural war right now, and every single one of us is a combatant,” said McGraw, a close Trump friend, during a September meeting. “Nobody can afford to sit on the sidelines.”\n\nPast presidents have overseen periods of religious revival in government, such as when Dwight Eisenhower signed provisions adding “under God” to the Pledge of Allegiance and “In God We Trust” to paper currency.\n\nBut Randall Balmer, a professor of American religious history at Dartmouth College, said he cannot recall any administration that has pursued such a broad and deliberate effort to inject religion into government and daily life.\n\nBalmer said he finds it troubling for a political majority to “dictate to everyone else how they behave and even how they believe.”\n\nIn a statement to CNN, White House spokeswoman Taylor Rogers contended that former President Joe Biden “weaponized the full weight of the federal government against people of faith.” She said Trump’s efforts would “safeguard religious freedom and eliminate the anti-religious bias that was embedded in the federal government.”\n\nThe Religious Liberty Commission is a significantstep in that effort. Trump established the panel last year to identify “threats” to religious liberty across faiths. It is led by Texas Lt. Gov. Dan Patrick and includes former Housing and Urban Development Secretary Ben Carson, longtime Trump faith adviser Paula White, and orthodox rabbi and writer Meir Soloveichik, among others.\n\nCommission meetings have featured Americans of different faiths testifying that government institutions infringed on their religious practices, including challenges faced by Muslims, Jews, Sikhs and Hindus.\n\nSupporters hope the commission’s changes will result in lasting impacts that can’t be easily undone by future administrations.\n\n“We had just gotten into a bad habit” of using the First Amendment to “stamp out all religious expressions in the public sphere,” said Mark Rienzi, president of the Becket Fund for Religious Liberty, a law firm that specializes in litigating faith causes.\n\nCritics counter that the administration’s actions go beyond protecting constitutionally protected speech and risk endorsing religion.  Brian Kaylor, a Baptist minister and author of books on religious communication, said the administration appears to be emphasizing Christianity above all others.\n\nHe noted that two Labor Department interfaith services that took place last year included biblical readings and songs, but not from other religions, for example.\n\n“I’m greatly concerned about uniting church and state because it’s never gone well for the church,” he said. “It turns faith into just a political tool and ultimately drives people away.”\n\nCommission members have routinely described the US as a Christian nation.  In its first meeting, Patrick, the commission chair, asserted that the country’s founders “based a government built on the Bible.”\n\nSome have spoken more explicitly about the role they believe Christianity should play in American civic life.\n\n“You cannot have America, you cannot have a self-governing nation, without a robust expression of Christian faith among its citizenry,” said commission memberEric Metaxas, a conservative author and podcaster. “That is not possible.”\n\nUntil last week, the commission’s meetings attracted little public attention. But on Monday, a hearing on antisemitism grew heated after one commissioner, former beauty pageant contestant Carrie Prejean Boller, challenged Jewish speakers about their beliefs and Israel’s war against Hamas.\n\nBoller’s remarks quickly drew condemnation online, and Patrick announced her dismissal on Wednesday.\n\n“No member of the commission has the right to hijack a hearing for their personal and political agenda on any issue,” Patrick wrote on X.\n\nThe next day, Boller said she stood by her remarks and asserted only Trump had the authority to remove her. She vowed to show up at the Marchhearingand said the attempt to remove her “contradicts the mission” of the commission to protect religious liberty, “including that of devout Catholics like myself who reject Zionism.”\n\nThe White House did not respond to questions from CNN about Boller’s status on the commission, but a person familiar with the matter confirmed she was officially given a termination notice.\n\nRecommendations from the commission, which is housed in the Department of Justice, are not binding, and it’s likely that some proposals would require approval from Congress. Still, its influence already seems to be visible.\n\nEarlier this month, the Department of Education warned schools they could lose funding if they have policies that block students, teachers and staff from praying, according tonew guidance issued by the agency and obtained by CNN.\n\nA nearly identical approach to punishing schools was proposed during the commission’s September hearing.\n\nIn December, the commission debated how to reinfuse faith into the US military. Some memberssuggested expanding authority for chaplains and the return of prayer.\n\nA week later, Defense Secretary Pete Hegseth held a Christmas worship service and announced plans to “restore the esteemed chaplains as moral anchors of our fighting force.”\n\nKelly Shackelford, a commission member, told CNN he believes the group’s discussions are driving change.\n\n“We are finding problems in every area — in schools, in universities, in government agencies, in the private sector, in health care, in the military and more,” said Shackelford, president of the First Liberty Institute, a legal group focused on religious cases.\n\nThe commission and its work echobroader changes between faith and the federal government that the Trump administration is putting into place. Besides the commission, the administration has reshaped faith-based offices at agencies, which traditionally worked to link up with religious charities. Under Trump, they are now tasked with emphasizing the free exercise of religion, including introducing monthly prayer meetings in some agencies.\n\nIn July, the White House personnel office issued new guidance encouraging federal workers to talk about faith and display religious symbols at work. The memo also allows doctors at Veteran Affairs hospitals to pray with or over patients. Separately, the Internal Revenue Service has said it will not enforce a decades-old provision barring houses of worship from endorsing political candidates as a condition of maintaining their tax-exempt status.\n\nSome federal workers told CNN they are increasingly uneasy with the infusion of faith already appearing in their work. The employees who attended the Consumer Financial Protection Bureau meeting noted the opening prayer was listed as part of the meeting agenda, making participation feel compulsory. One of the employees said they found the Christian messaging out of place in a government setting. “Prayer is part of my life, nevertheless I felt extremely uncomfortable,” the person said. They asked not to be named for fear of reprisal.\n\nOpponents are clear-eyed about what may be coming.\n\n“We are in the early stages,” said Rachel Laser, president and CEO of Americans United for Separation of Church and State, “but this is a policy-making effort.”\n\nEven some who support the commission’s work say they hope its final report does not privilege one faith over others.\n\n“The report needs to be one that addresses protecting religious freedom of all faiths,” said Kim Colby, a lawyer for the Center for Law and Religious Freedom at the Christian Legal Society.\n\n“Even most conservative Christians recognize that if there’s one faith that doesn’t have protection, then in reality no faiths have protections.”\n\nAs Trump’s faith initiatives are taking hold, the legal ground on religion in government is shifting.\n\nOver the past decade, the Supreme Court, led by the conservative majority, hasmade it easier for religious groupsto seek government grants and faith-based schools to receive public funding. It has signaled support for more public expressions of faith, such as bysiding with a high school football coachfired for praying on the field with players andby blocking the removal of a large crossin a Maryland veterans memorial park.\n\nAlong the way, the court has moved away from long-standing tests used to determine whether government acts violate the First Amendment’s Establishment Clause (that “Congress shall make no law respecting an establishment of religion”), placing greater emphasis on accommodating religious causes.\n\nAt a meeting last year well before her dismissal, Boller took stock of the court’s evolution and declared: “Now is the time that we have more rights as Christians than we’ve ever had.”\n\nAgainst this backdrop, commission meetings have regularly turned to how the Trump administration should take advantage of this new landscape.\n\nNicole Garnett, a Notre Dame law professor, testified in September that the Trump administration should “take immediate action” against existing state and federal laws that run afoul of the Supreme Court’s new standards.\n\nOthers want to push further.\n\n“To put it bluntly, I think it’s time to kick in the rotten door that’s barring religion from the public square,” said Gerard Bradley, the co-director of the conservative legal training organization James Wilson Institute.\n\nBradley asserted that the Supreme Court has effectively “prepared the way” for the government to promote religion as a “common good.”\n\nThat framing alarms critics.\n\nKaylor, the Baptist minister and scholar, warned: “Such state establishment of religion is a threat to democratic ideals, a pluralistic workforce and nation, and the sanctity of Christian worship.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.whitehouse.gov/america250/america-prays/",
      "text": "pray for an hour each week"
    },
    {
      "url": "https://www.facebook.com/homelandsecurity/videos/here-am-i-send-me-/573034619213993/",
      "text": "Bible verses"
    },
    {
      "url": "https://x.com/DOWResponse/status/1964681120483864908",
      "text": "official government"
    },
    {
      "url": "https://x.com/DOWResponse/status/1954535471125569913",
      "text": "media accounts"
    },
    {
      "url": "https://www.cnn.com/2025/05/01/politics/john-roberts-church-state-catholic-charter-school",
      "text": "made it easier for religious groups"
    },
    {
      "url": "https://www.cnn.com/2022/06/27/politics/football-coach-prayer-high-school-supreme-court-kennedy/index.html",
      "text": "siding with a high school football coach"
    },
    {
      "url": "https://www.cnn.com/2019/06/20/politics/supreme-court-maryland-world-war-i-memorial-cross",
      "text": "by blocking the removal of a large cross"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/trump-religious-liberty-commission-church-state-separation",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/politics/trump-religious-liberty-commission-church-state-separation",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ad3a34375bf300367577e80457cce68ebc4a87e5e3282245b61ed1579197b3e9",
  "scraped_at": "2026-02-16T07:34:34.232940+00:00"
}