{
  "url": "https://lite.cnn.com/2026/02/21/us/avalanche-california-lake-tahoe-victims",
  "title": "California avalanche: A group of mothers embarked on a Sierra Nevada backcountry ski trip but only 2 of them survived | CNN",
  "date": "2026-02-22T07:09:12.236893+00:00",
  "authors": [
    "Ray Sanchez, CNN"
  ],
  "text": "Source: CNN\n\nThe eight friends found joy in the mountains, skiing together across the untracked powder of the hushed, pristine wilderness of California’s Sierra Nevada – their close friendship standing out against a rugged, unforgiving terrain.\n\nThe trip had been planned well in advance: A three-day expedition that began at Frog Lake Backcountry Huts – a hard-to-reach but cozy oasis 7,600 feet high in the Tahoe National Forest area, accessible only by ski, snowboard or snowshoe.\n\nThe group – mothers, wives and skilled skiers – came from different parts of the country for a professionally guided backcountry tour over President’s Day weekend. With four guides and three other people accompanying them, they glided on skis near the frozen lake and snow-capped cliffs, under the shadow of a ridge dotted with red firs and Jeffrey pines.\n\nThe biggest winter storm of the new year loomed over the picturesque mountains, meanwhile, as dire warnings from forecasters echoed on social media.\n\nIt was the last day of a perilous backcountry odyssey. And, as predicted, the blizzard arrived, delivering blankets of unstable powder. They were headed home when the fresh snow, light and soft, suddenly descended from the slopes as one of the most ferocious forces of nature.\n\n“Avalanche!” one of them yelled.\n\nWithin seconds, a tsunami of ice, snow and debris the size of a football field careened downhill around them, thick enough to nearly bury a house, authorities said, citing the accounts of survivors.\n\n“It overtook them rather quickly,” Nevada County Sheriff’s Capt. Rusty Greene later told reporters.\n\nThe first call for help was a silent text message from an emergency beacon, mobilizing a small army of rescuers dispatched from different directions.\n\n“Medical for avalanche in the area of Castle Peak,” a voice on a fire department dispatch channel said at 10:45 a.m. Tuesday.\n\n“Nine to 10 people buried, three others attempting to dig them out,” someone said in the audio as emergency responders were heard coordinating search and rescue efforts, noting no air support was available because of the storm.\n\nAn hourslong fight for survival was beginning. Some members of the group dug desperately into the snow for friends and partners as the powder began to turn into a freezing, concrete-like crust.\n\nSix of the close friends and three guides are among the nine people killed in theavalanche near California’s Lake Tahoe– the nation’s deadliest in 45 years. Six skiers survived and were rescued.\n\nThree guides from Blackbird Mountain Guides — Andrew Alissandratos, Nicole Choo and Michael Henry — were among those killed, the Nevada County Sheriff’s Office said Saturday.\n\nHenry devoted his seasons to guiding and teaching splitboarding, according to his guideprofile, blending a laid-back demeanor with a deep respect for avalanche education forged in demanding backcountry conditions.\n\nFor Alissandratos, the Sierra was home and the place he felt most fully himself, hisprofilesays, and he guided with a passion for steep routes and passing along the hard-earned lessons of climbing and skiing.\n\nSisters Liz Clabaugh and Caroline Sekar were also among the dead. The others were identified by their families as Carrie Atkin, Danielle Keatley, Kate Morse and Kate Vitt. A spouse of a Tahoe Nordic Search and Rescue team member – who responded to the disaster – was also among those killed.\n\nThe families of six of the women who perished said in a statement that they still have “many unanswered questions.” The sheriff’s office said it is investigating whether criminal negligence contributed to the incident.\n\n“We are devastated beyond words,” the families said. “Our focus right now is supporting our children through this incredible tragedy and honoring the lives of these extraordinary women.”\n\nThe families asked for privacy as they grieve a “sudden and profound loss.” The friends – from Idaho, the Bay Area and the nearby Truckee-Tahoe region – were “passionate, skilled skiers who cherished time together in the mountains.” They had trained for the backcountry, trusted their guides and carried and were familiar with avalanche safety equipment, according to the statement.\n\n“We are heartbroken and are doing our best to care for one another and our families in the way we know these women would have wanted,” the families said.\n\nOnly two members of the friends’ group and one of the guides are among the six who survived.\n\nThe bodies of the nine avalanche victims were recovered Saturday, authorities announced. “While we wish we could have saved them all, we are grateful that we can bring them home,” Nevada County Sheriff Shannan Moon said.\n\nIn the end, one man and five women made it out, taking cover for hours under a tarp – “doing everything they can” until rescuers onsnowcatsand skies could reach them, according to Greene.\n\nRescuers trudged through the heavy snow, combatting gale force winds under white-out conditions and mindful that another avalanche could potentially barrel down from above, Moon said.\n\nRescuers were 2 miles from the skiers when their machinery got stuck, forcing them to ski the rest of the way until they reached the avalanche site around 5:30 p.m. Tuesday, the sheriff said. The survivors used avalanche beacons and iPhone Emergency SOS via satellite to text emergency services.\n\nAn emergency official communicated with a guide for more than four hours, relaying critical information to sheriff’s deputies, according to Don O’Keefe, chief of law enforcement at California’s Office of Emergency Services.\n\nBuried in an avalanche, few people are able to dig themselves out, according to experts. Within minutes, breathing creates an ice mask around the face. The snow eventually hardens like a concrete entombment.\n\nIf pulled out within 15 minutes, theUtah Avalanche Centersays, 93% of avalanche victims live. After 45 minutes, only 20% to 30% survive. Few make it after two hours under the snow.\n\nSurvivors assemble tent-pole-like probes and stick them into the snow in hopes of striking buried skiers, according to experts.\n\nThat Tuesday morning, they frantically poked through the hardening snow for their ski partners and friends. Eventually they dug out three people who were no longer alive, the sheriff said.\n\n“Uncovering people who are deceased, that they know and probably cared about, is just horrible,” Nevada County Undersheriff Sam Browntold CBS News.\n\n“I don’t know anybody in the avalanche community or in the backcountry skiing and snowmobile community that hasn’t lost somebody they knew or loved,” Sara Boilen, a clinical psychologist and backcountry skier in Montana who specializes in human factors in avalanche terrain, told CNN.\n\n“We don’t do this because we love grief. We do this because we love the mountains and we love spending time there with people we love, and we love who we are in the mountains.”\n\nShe added, “You can call that crazy. You can judge that and be like, ‘But it’s so dangerous.’ And maybe that’s true. We know it’s true, but we’re still going to live our lives.”\n\nKurt Gensheimer was on a three-night trip at Frog Lake Backcountry Huts and left Sunday, just hours before the moms and the other skiers arrived. They never crossed paths.\n\nHe had been there four times in the last four years and understood the pull of the dangerous yet beautiful surroundings.\n\n“It’s a magical place,” Gensheimer told CNN affiliate KCRA. “It’s one of the best places to backcountry ski in the country and Frog Lake Huts are the nicest amenities, possibly in North America, for backcountry skiing.”\n\nHe considered the huts a safe place to ride out a storm but his group decided to leave before the blizzard.\n\n“The discussion in the huts was, this is a big storm coming… It’s going to be falling blizzard conditions. You either should get out by Monday or plan to be there till Thursday, Friday,” Gensheimer said.\n\nThe tour company that organized the ill-fated trip, Blackbird Mountain Guides, said the tour leaderswere highly trainedand certified in avalanche education.\n\nIt was also aware of the avalanche danger.\n\nOn Sunday morning, the same day the group embarked on their journey, the company warned on Facebook of a big snow storm approaching and urged skiers to monitor to the Sierra Avalanche Center and “use extra caution this week!”\n\nThat morning, the Sierra Avalanche Center issued anavalanche watchthat was elevated to awarning at 5 a.m. on Tuesday: “HIGH avalanche danger exists in the backcountry.\n\nThe most dangerous time for avalanches is after a rapid snowfall, according to experts. Tuesday’s avalanche wasclassifiedas a D2.5 on a five-level scale that measures the destructive potential of moving debris, according to Moon.\n\nOn Saturday, Moon and other officials confirmed at a news conference that nine victims were recovered by California Highway Patrol and National Guard helicopters following avalanche mitigation efforts involving water drops.\n\nFive victims were hoisted by helicopter from the site on Friday and four on Saturday, according to Nevada County Sheriff Lt. Dennis Haack. The body of a ninth victim, who was missing and presumed dead, was found near the other victims.\n\n“I’m not going to say our recovery mission is complete until all of our responders … (are) home back at the office,” Moon said Saturday.\n\nThe allure of backcountry skiing endures despite the risks.\n\nNate Greenberg, who lives in the Eastern Sierra Mountains and said he survived an avalanche in 2021, advised against rushing to judgment. Backcountry skiing, he said, involves multiple “micro decisions.”\n\nIan McCammon, an engineer and avalanche researcher, also stressed the difficult decision making process on the slopes.\n\n“There’s usually a lot more than meets the eye to those accidents,” McCammon told CNN. “Once you start getting into the specifics, you start understanding. It’s easy to say that the people are foolish, or it’s easy to say that people have taken a lot of risks, but sometimes they’re in situations where it’s not obvious to see how they came to the decision that they did.”\n\nBoilen, the clinical psychologist, said: “We’re all desperate to understand what happened.”\n\n“As a researcher, I want to understand so that we can deepen our sense of what is hard about decision making in the backcountry,” she told CNN. “As an educator, I want to understand so I can help others learn. As a backcountry user, I want to strengthen my own decision making by learning from others. And as a human I want answers - how could something like this happen? And we may never get all of the answers. That’s the thing about a wicked learning environment.”\n\nShe added, “Imagine losing somebody you love and simultaneously losing the relationship you have to the place you go to feel better. So, when you lose somebody in an avalanche and the mountains are the place that you feel most whole, most alive, it’s where you go for healing, what do you do?”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "avalanche near California’s Lake Tahoe"
    },
    {
      "url": "https://blackbirdguides.com/pages/guides#:~:text=AMGA%20SKI%20GUIDE-,MIKE%20HENRY,-GUIDE",
      "text": "profile"
    },
    {
      "url": "https://blackbirdguides.com/pages/guides#:~:text=ANDREW%20ALISSANDRATOS",
      "text": "profile"
    },
    {
      "url": "https://www.cnn.com/2017/03/17/sport/snowcat-skiing-snowboarding-snow-aspen#:~:text=Snowcat%20drivers%20spend%20two%20ensuring%20the%20piste,prepare%20over%20350%20acres%20of%20skiing%20area.",
      "text": "snowcats"
    },
    {
      "url": "https://utahavalanchecenter.org/education/faq",
      "text": "Utah Avalanche Center"
    },
    {
      "url": "https://www.cbsnews.com/news/california-avalanche-survivors-tried-to-unbury-their-friends-near-lake-tahoe/",
      "text": "told CBS News"
    },
    {
      "url": "https://blackbirdguides.com/pages/live-incident-updates",
      "text": "were highly trained"
    },
    {
      "url": "https://www.sierraavalanchecenter.org/forecasts/avalanche/central-sierra-nevada#/forecast/1/180503",
      "text": "avalanche watch"
    },
    {
      "url": "https://www.sierraavalanchecenter.org/forecasts/avalanche/central-sierra-nevada#/forecast/1/180664",
      "text": "warning at 5 a.m. on Tuesday"
    },
    {
      "url": "https://avalanche.org/avalanche-accidents/#/report/4187d5a2-dbbc-437d-8ac8-8c5dd4d0b1f9",
      "text": "classified"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/us/avalanche-california-lake-tahoe-victims",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/us/avalanche-california-lake-tahoe-victims",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ad986d56cec6a127a42e79f4901b3f8bb27fe8bdecb255b9660b8be0e90f5502",
  "scraped_at": "2026-02-22T07:09:12.236909+00:00"
}