{
  "url": "https://lite.cnn.com/2026/02/23/business/tariffs-prices-trump",
  "title": "Tariffs and prices: The Supreme Court just gave Trump an off ramp. He’s not taking it | CNN Business",
  "date": "2026-02-24T07:32:31.242022+00:00",
  "authors": [
    "Analysis by Matt Egan, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump’s unprecedented use of tariffs has injected enormous uncertainty into the global economy, depressing US job growth and raising prices along the way.\n\nThe Supreme Court on Fridaygave Trump an off rampfrom his tariff adventure. But Trump almost immediately made clear he’s not taking it.\n\nThejusticesruled in a 6-3 decision that many (though not all) of Trump’s tariffs are illegal, giving the White House a way to exit the most aggressive of his import levies and potentially lower the cost of living.\n\nTrump, however, is not backing down from his favorite economic weapon.\n\nTrump suggested the Supreme Court gave him permission to escalate his global trade war by using different tariff authorities to potentially boost tariffs even higher than they were before the historic ruling.\n\n“While I am sure that they did not mean to do so, the Supreme Court’s decision today made a president’s ability to both regulate trade and impose tariffs more powerful and more crystal clear rather than less,” Trump said in a press briefing at the White House Friday.\n\nAll of this suggests the cloud of uncertainty over tariffs is not going away – and could get even thicker.\n\n“Unfortunately, we’re going to have another year of uncertainty and chaos. Trump loves tariffs and he will use whatever laws are available to keep them,” Scott Lincicome, vice president of general economics and trade at the Cato Institute, told CNN in a phone interview.\n\nHours after the Supreme Court handed down its tariff ruling, Trump announced that he willslap a 10% global tariffon imports under Section 122 of the 1974 Trade Act, a different authority that was not struck down by the high court. Trump over the weekend raised that tariff to 15% – the maximum level allowed for Section 122 tariffs, which also require Congressional approval beyond 150 days, although Trump seemed to brush off that limitation.\n\nTrump added that his administration is already exploring using other laws that can be used to impose tariffs.\n\nOneoptionTrump mentioned is Section 301 of the 1974 Trade Act, which requires investigations to be conducted by the US Trade Representative into burdensome trade actions by foreign countries – but contains no limit to the level or duration of tariffs imposed as a result of those investigations.\n\nAnother option Trump discussed Friday was Section 338 of the Tariff Act of 1930, which could allow the president to impose tariffs of up to 50%on countries’ imports if he believes they’re engaging in discriminatory trade practices. Section 338 stems from the infamous Smoot-Hawley act that is widely attributed for exacerbating the effects of the Great Depression.\n\nTrump also claimed the Supreme Court decision permitted him to levy a total embargo on foreign countries’ goods. Treasury Secretary Scott Bessent on Fox News Friday reiterated that claim and called on countries to honor prior trade agreements struck with the administration.\n\nAsked if at the end of implementing new levies the tariff rate will ultimately be higher than currently, Trump said: “Potentially higher. It depends. Whatever we want them to be. But we want them to be fair for other countries.”\n\nThe effective tariff rate was roughly 10% before the Supreme Court’s ruling and currently sits at around 4.5%, said Erica York, vice president of federal tax policy at the conservative-leaning Tax Foundation. That could rise back above 10% if Trump appliesSection 122 tariffs at 15% globallywithout exemptions for the 150-day limit.\n\nMichael Feroli, chief economist at JPMorgan Chase, told clients Friday that a “reasonable” scenario is that the administration uses various legal authorities to keep the average effective tariff rate unchanged.\n\n“Even this outcome would entail a significant realignment of tariffs placed on different products from different countries, thereby creating winners and losers,” Feroli wrote in a report. “This would also mean a material increase in trade policy uncertainty, creating a new wind to” capital spending.\n\nHe also noted that outside of technology, business investment last year contracted, “a very rare occurrence outside of a recession.”\n\nLast year was the worst year for job growth, outside of a recession, since 2003. Many economists suspect that the chaos and uncertainty caused by tariffs paralyzed some businesses, causing them to hold off on hiring. Employment in manufacturing – the sector that Trump’s tariffs are designed to boost –was particularly weak,losing more than 80,000 jobs last year.\n\nHowever, Trump officials have largely dismissed these concerns, focusing instead on the vast amounts of revenue the tariffs have generated and promises of a manufacturing boom on the horizon.\n\n“They don’t believe the economic data. They think these tariffs are amazing,” Cato’s Lincicome said.\n\nEconomists don’t expect the Supreme Court decision will be a gamechanger forconsumer prices– especially because Trump made clear he’s not retreating.\n\n“Companies are always reluctant to lower prices. Now Trump has given them a perfect excuse not to,” Lincicome said.\n\nStephanie Roth, chief economist at Wolfe Research, was blunt when asked what the Supreme Court ruling would mean for consumer prices.\n\n“Nothing,” she said.\n\nThe Supreme Court didn’t weigh in on whether the administration will be required torefund companies the $134 billionthey were charged in tariffs that were overturned. A lower court will take that up. But even if those refunds start coming in, that doesn’t mean consumers will get any relief in the form of discounts or lower prices.\n\n“Companies are highly unlikely to start trimming their prices as a result,” Roth said. “Walmart is not going to give you a check for the 15% tariff on sneakers you bought from them four months ago.”\n\nTrump’s tariffs added $1,000 in tax expenses for the average US household in 2025, according to the Tax Foundation. That number was expected to rise to $1,300 this year before the Supreme Court ruling.\n\nBut the future remains unclear. Trump officials haven’t decided yet how they plan to rebuild his tariff agenda. They could implement other tariffs under different authorities, and, in theory, the administration could extend the Section 122 tariffs beyond the 150-day limit by restarting the clock.\n\nThe irony is that voters have made clear they don’t like tariffs, which have gotten less popular the more Americans are exposed to them.\n\nVoters are also deeply frustrated by the level of prices, which in some cases have been raised by Trump’s tariffs.\n\nAlthough the Supreme Court delivered a blow to the president’s tariff agenda, this historic decision is unlikely to be the gamechanger manyvoters are hoping for.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "gave Trump an off ramp"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/business/video/trump-justices-tariffs-ruling-digvid",
      "text": "justices"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26",
      "text": "slap a 10% global tariff"
    },
    {
      "url": "https://www.cnn.com/2025/05/31/economy/trump-tariff-alternatives",
      "text": "option"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/business/trump-global-tariffs-increase-supreme-court",
      "text": "Section 122 tariffs at 15% globally"
    },
    {
      "url": "https://www.cnn.com/2025/12/17/economy/jobs-trump-manufacturing-trade",
      "text": "was particularly weak,"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26?post-id=cmlv4xvew0000356u9qn5bi69",
      "text": "consumer prices"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/the-usd130-billion-question-who-will-get-a-tariff-refund",
      "text": "refund companies the $134 billion"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/business/tariffs-prices-trump",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/business/tariffs-prices-trump",
      "text": "Cookie Settings"
    }
  ],
  "hash": "adda5d8694610a01b4ff1fe129a8b0cb906d2148bb828a7800088ed403af1954",
  "scraped_at": "2026-02-24T07:32:31.242035+00:00"
}