{
  "url": "https://lite.cnn.com/2026/02/27/politics/lutnick-epstein-island-photo-congress-testify",
  "title": "Emergence of Epstein island photo leads to new calls for Lutnick to testify | CNN Politics",
  "date": "2026-03-01T07:07:48.554804+00:00",
  "authors": [
    "Andrew Kaczynski"
  ],
  "text": "Source: CNN\n\nMembers of Congress are raising questions after a photograph they say shows Commerce Secretary Howard Lutnick alongsideJeffrey Epsteinon the late sex offender’s private island was briefly removed from the Justice Department’s website.\n\nThe image had been hosted in the department’s online repository of Epstein-related files uploaded in late January under the Epstein Files Transparency Act.\n\nAt one point, the original page containing the photograph   on Justice.gov returned an error message, though a version captured by the Internet Archive’s Wayback Machine on January 31, 2026,remained accessible onlineand included the photograph.\n\nThe page hassince been restoredand a Justice Department spokesperson told CNN, “This image was part of a batch of files that were flagged for nudity. The batch of thousands of images was pulled for review and is being uploaded with necessary redactions on a rolling basis. No files are being deleted.”\n\nLutnick has not commented on the image. The Commerce Department and Lutnick did not return repeated requests for comment from CNN. The White House did not respond to a CNN request for comment on Friday.\n\nBut several members of Congress — including at least one Republican on the House Oversight Committee — are pressing for answers about the temporary removal of the image.\n\nOn Xon Thursday,Rep. Nancy Mace, a Republican member of the House Oversight Committee, wrote of the photo, “Howard Lutnick should take questions from the Oversight committee.”\n\nOn Friday, President Donald Trump told reporters today that Lutnick would testify to Congress about his relationship with Epstein.\n\n“Howard would go in and say whatever he has to say,” Trump told CNN’s Kristen Holmes. “He’s a very innocent guy, he’s doing a good job.”\n\nEarlier this month, Lutnicktestifiedbefore a Senate Appropriations subcommittee, during which he was pressed about his interactions with Epstein. Communications revealed in the latest release by the Justice DepartmentundercutLutnick’s previous claims of cutting off ties with Epstein in 2005, before Epstein was under investigation for and later convicted of soliciting prostitution from a minor.\n\nDuring his testimony, Lutnick said he had in fact visited Epstein’s private island for lunch with his family while on vacation in 2012.\n\nNumerous othermembersof Congress have also raised questions about the recently-surfaced photo.\n\nDemocratic Rep. Ted Lieusaidthe initial removal of the photo implied the Justice Department is involved in the “stupidest cover up in history.” Republican Rep. Thomas Massie, who co-authored the Epstein Files Transparency Act, said the Justice Departmentshould explainthe decision-making behind the removal.\n\n“I’m sure there’s a good reason for this. DOJ needs to tell Congress who pulled this file down so we can ask them,” Massie said.\n\nA day earlier — following the House Oversight Committee’s deposition of former Secretary of State Hillary Clinton — the panel’s chairman, Rep. James Comer, said it is “very possible” that he could bring in Lutnick for questioning. It was not immediately clear whether Comer had seen the photograph at the time he made those remarks.\n\nRep. James Walkinshaw, a Democrat on the committee, also said Thursday Lutnick has been “lying to the country” about his relationship with Epstein and said the Commerce secretary should answer further questions about his past contact with Epstein.\n\nOn Friday morning, Rep. Robert Garcia, the ranking Democrat on the House Oversight Committee, accused Lutnick of “blatantly lying to the American people,” and said there was bipartisan support to bring Lutnick in for questioning.\n\n“Quite frankly, he should resign or should be removed from office,” Garcia said during an appearance on “CNN Newsroom.”\n\nDuring his previous testimony before the Senate committee, Lutnick was asked about messages suggesting he’d visited Epstein’s private Caribbean island, Little Saint James.\n\n“I did have lunch with him, as I was on a boat going across on a family vacation. My wife was with me, as were my four children and nannies,” Lutnick told a congressional committee. “We had lunch on the island, that is true, for an hour, and we left with all of my children with my nannies and my wife… I don’t recall why we did it.”\n\nBut Lutnick denied that he andEpstein, who met when they lived in neighboring houses in New York, had deeper ties.\n\n“Of these millions and millions of documents, there may be 10 emails connecting me with him… over a 14-year period,” Lutnick told senators. “I did not have any relationship with him. I barely had anything to do with that person.”\n\nInan interview last yearwith the New York Post’s “Pod Force One”, Lutnick said that after a 2005 encounter at Epstein’s home, he grew uncomfortable and vowed that he would “never be in the room with that disgusting person ever again.”\n\nLutnick said he saw a massage table in the middle of the home and that Epstein told him he got a massage “every day.”\n\n“And then he like gets, like, weirdly, close to me and he says, ‘And the right kind of massage,’” Lutnick said.\n\nLutnick said that after that interaction, “I was never in the room with him socially for business or even philanthropy. If that guy was there, I wasn’t going, because he’s gross.”\n\nAprevious CNNreview of the Epstein documents show numerous interactions between the two men, including an invitation from Lutnick to attend a Hillary Clinton fundraiser in 2015, a $50,000 donation from Epstein for a 2017 dinner honoring Lutnick, a 2013 business venture both invested in, and multiple emails in which Lutnick set up a 2012 visit to Epstein’s infamous Caribbean island with his wife, nannies and children.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Jeffrey Epstein"
    },
    {
      "url": "https://web.archive.org/web/20260131143511/https:/www.justice.gov/epstein/files/DataSet%209/EFTA01230639.pdf",
      "text": "remained accessible online"
    },
    {
      "url": "https://www.justice.gov/age-verify?destination=/epstein/files/DataSet%209/EFTA01230639.pdf",
      "text": "since been restored"
    },
    {
      "url": "https://x.com/RepNancyMace/status/2027354498201509958",
      "text": "on Thursday,"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/trump-epstein-files-lutnick-bondi-hearings-analysis",
      "text": "testified"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/howard-lutnick-jeffrey-epstein-island",
      "text": "undercut"
    },
    {
      "url": "https://x.com/RepJimmyGomez/status/2027174014305607760",
      "text": "members"
    },
    {
      "url": "https://x.com/tedlieu/status/2027242949210169418",
      "text": "said"
    },
    {
      "url": "https://x.com/RepThomasMassie/status/2027138232761074014",
      "text": "should explain"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-epstein-files-02-10-26",
      "text": "Epstein"
    },
    {
      "url": "https://www.youtube.com/watch?v=x8_s4Z2TQAE&list=PLHY8kGYAi5RLEf4OwozbCSlyF3wJoqcOB",
      "text": "an interview last year"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/howard-lutnick-epstein-ties-trump",
      "text": "previous CNN"
    }
  ],
  "hash": "ade73ff37a57653aa0c20471e3859552a08265577a3b389276c1be041f664249",
  "scraped_at": "2026-03-01T07:07:48.554816+00:00"
}