{
  "url": "https://lite.cnn.com/2026/02/11/africa/us-troops-military-training-nigeria-intl",
  "title": "US troops to Nigeria will avoid combat, focus on training, military says | CNN",
  "date": "2026-02-12T21:31:26.099523+00:00",
  "author": "Unknown",
  "text": "Source: Reuters\n\nNigeria’s military said on Wednesday that about 200 UStroopsdue to arrive in the coming weeks would not take part in combat action and that Nigerian forces would retain full control over all security decisions.\n\nThis followed comments from a US official on Tuesday that the Pentagon planned to deploy the troops to train Nigerian forces fighting Islamist militants, weeks after PresidentDonald Trumpordered against what he described as Islamic State targets.\n\nLast week, the US military confirmed it had sent asmall teamto Nigeria, without giving details, marking Washington’s first acknowledgment of personnel on the ground since the Christmas Day strikes.\n\nMajor General Samaila Uba, spokesperson for Nigeria’s Defense Headquarters, told Reuters that Abuja requested the US presence to provide technical training and advisory work at several locations.\n\n“These personnel do not serve in a combat capacity and will not assume a direct operational role,” Uba said. “Nigerian forces retain full command authority, make all operational decisions and will lead all missions on Nigerian sovereign territory.”\n\nHe declined to say when the troops would arrive, but said the deployment formed part of ongoing cooperation under the US-Nigeria Joint Working Group.\n\nWashington has stepped up pressure on Nigeria after Trump accused the West African nation of failing to protect Christians from Islamist militants in the northwest. Nigeria rejects allegations of religious persecution, saying its security forces target armed groups that attack both Christians and Muslims.\n\nUS Republican lawmakers on Tuesday introduced a bill requiring the Secretary of State to submit a report to Congress on US efforts to address what they called “ongoing religious persecution and mass atrocities against Christians in Nigeria.”\n\nThe Nigeria Religious Freedom and Accountability Act of 2026 is sponsored by Riley Moore, who led a congressional delegation to Nigeria in December and has criticized the government for not doing enough to protect Christian communities.\n\nNigeria faces overlapping security crises, including a long-running Islamist insurgency in the northeast, armed kidnapping gangs in the northwest and deadly clashes between farmers and herders in the central region, often driven by ethnic and religious tensions.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.reuters.com/world/africa/us-send-200-troops-nigeria-train-african-nations-military-2026-02-10/",
      "text": "troops"
    },
    {
      "url": "https://www.reuters.com/world/us/donald-trump/",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.reuters.com/world/africa/us-military-says-some-forces-have-been-dispatched-nigeria-2026-02-03/",
      "text": "small team"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/africa/us-troops-military-training-nigeria-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/africa/us-troops-military-training-nigeria-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "adf63a555737f804ee3aa95a5219da1581a7ff2ca9e0fb012130da8c85eea215",
  "scraped_at": "2026-02-12T21:31:26.099537+00:00"
}