{
  "url": "https://lite.cnn.com/2026/02/21/politics/child-care-affordability-midterms-pennsylvania",
  "title": "How child care costs could swing a key US House district | CNN Politics",
  "date": "2026-02-22T07:09:42.937371+00:00",
  "authors": [
    "Arit John, CNN"
  ],
  "text": "Source: CNN\n\nDana Eldridge and Paul Miller opened their first day care center in 2005 after nearly a decade of running a popular martial arts school and summer camp. Over the next 15 years, they opened four more locations and expanded from school-aged children to including infants and toddlers. At its peak, Active Learning Centers enrolled about 1,000 kids.\n\nThen came the pandemic.\n\nThe school says it spent thousands on renovations for virtual learning. Eldridge raised teacher pay to try to stem the flow of professionals leaving the industry for higher-paying jobs in other fields. Inflation increased the cost of everything from cleaning supplies to the bananas and grapes served at snack time. The center raised its prices in late 2020 for the first time in five years. Enrollment is still down about 30%.\n\n“It’s this crazy, double-edged sword,” she said. “Because if parents can’t find child care, or they can’t afford child care, the entire community suffers.”\n\nAffordability concerns are at the center of this year’s midterm elections, when control of Congress will likely come down to which party voters trust more to help alleviate the high cost of everything from health care to housing. For families with young children and the people who watch them, child care costs are often at the top of the list.\n\nThe battle for control of the US House will run through places like Pennsylvania’s 7th District, a battleground with a history of ticket-splitting and the highest concentration of independent voters in the state. A crowded Democratic field has formed to take on first-term Republican Rep. Ryan Mackenzie, who is also campaigning on affordability issues, including proposals to help offset child care costs in last year’s sweeping domestic policy and tax law.\n\nTo win, the candidates need to persuade voters like Eldridge. Though she’s a Republican, she said she wished former Democratic Rep. Susan Wild – a child care reform advocate who lost to Mackenzie in 2024 – was running again.\n\n“If the Democratic candidate is going to be really taking up this fight and following in the shoes of Susan Wild, then, yes,” she said. “If the Republican is the one who’s going to pick up the mantle and really push for change and really fight for child care, then most likely that’s who I’m going to vote for.”\n\nNational child care costs rose an average of 29% between 2020 and 2024, outpacing inflation,according to a 2025 report fromChild Care Aware of America, an early education advocacy group. AJuly 2025 AP-NORC pollfound that 76% of adults view the cost of child care as a major problem.\n\nThere’s bipartisan agreement that solving the issue requires state and federal spending.\n\n“It’s a broken market, so we know we need public investment in the system to fix it,” said Jen DeBell, the executive director of the Pennsylvania Association for the Education of Young Children. “Both for kids and families, but also the teachers and the programs that are offering the care.”\n\nBoth parties have sought to address the issue in recent years. Democrats, including Wild, back legislation that would cap child care costs for many families at 7% of their household income and boost payments for child care workers. Former President Joe Biden’s failed Build Back Better plan would have capped child care payments for families making up to 250% of the state median income and implemented universal pre-kindergarten for 3- and 4-year-olds.\n\nLosing that fight was “brutal,” Wild said. But she insisted that Democrats need to introduce “a bold piece of childcare legislation” when they next have the power to do so.\n\n“Anybody who’s ever had child care woes, even if it was years ago, as it was for me, they remember what it was like,” said Wild, whose kids are now in their 30s. “Your average person really, really, really wants us to do something serious about child care.”\n\nRepublicans have had better success passing modest improvements. Last year’s “One Big Beautiful Bill,” President Donald Trump’s domestic policy and tax law, permanently increased the amounts parents can save pre-tax for child care and expanded the child and dependent care tax credit.\n\n“Just saying you have a proposal isn’t going to really sway the minds of constituents,” said Sarah Rittling, the executive director of the First Five Years Fund. “You have to do something.”\n\nMackenzie, the Republican incumbent, is in the midst of his own child care considerations. He now has two young children under two, including a newborn, and his wife is currently on maternity leave.\n\n“We are going to have to make that decision as a family, just like everybody else,” Mackenzie told CNN. “You’re trying to make a decision that’s best for your family, but also a rational economic decision on, for the 40 hours that I’m going to be working, my take-home pay minus the child care for two kids – is that worth it?”\n\nThe freshman lawmaker has made child care part of his first-term agenda, as part of a broader push to support working families. Soon after he was sworn in, he introduced a package of bills to increase several tax credits for working parents and businesses to help subsidize the cost of child care. Last year’s domestic policy law included versions of his proposals. It raised the child tax credit to $2,200 and indexed it to inflation and increased the amount employees can save pre-tax for childcare to $7,500, up from $5,000.\n\nOver the last year, Mackenzie has visited five Head Start programs and day care centers. During a recent visit to the Watch Us Grow Child Care Learning Center in Allentown, he toured the classrooms and read “Edmund the Elephant Who Forgot” and “Ruby’s School Walk” to a class of 5-, 6- and 7-year-olds. After the tour, the center’s chief executive, Jerresky Martinez, and his team laid out the history of the school over plates of traditional Dominican breakfast foods – mangú, sausage, eggs and empanadas – and fresh fruit.\n\nInitially, Martinez wanted to open an outpatient clinic, but it soon became clear that a day care center would be a better fit. Watch Us Grow opened in 2016 and eventually grew to an enrollment of about 350 students, 90%  of whom have their fees subsidized through a state program for low-income families. Since the pandemic, Martinez said, the school’s enrollment dropped by 150 students and 20 employees left the company. There’s now a 50-family waitlist as the center searches for new teachers.\n\n“We actually often hear the challenge is warehouses and stuff like that,” Mackenzie said. “They’re paying $27, $28 an hour.”\n\n“That’s why I lost so many staff,” Martinez replied.\n\nThe field of candidates running to unseat Mackenzie includes firefighter union leader Bob Brooks, energy systems engineer Carol Obando-Derstine, and former federal prosecutor Ryan Crosswell.\n\nCrosswell, a former Republican who resigned from the Justice Department  after the agencydropped corruption chargesagainst former New York City Mayor Eric Adams, has led in fundraising and is leaning into a message of defending democracy. Brooks has amassed the most high-profile endorsements, including from Gov. Josh Shapiro, and pointed to his background as a working-class Democrat. Obando-Derstine, who was recruited by Wild, has trailed in fundraising.\n\nOther candidates in the race include former Northampton County Executive Lamont McClure and Lehigh County Controller Mark Pinsley.\n\nThe Democratic candidates share similar proposals for tackling child care costs, including increasing tax credits and subsidies and expanding access to free pre-K.\n\n“I’m tired of getting kicked in the teeth, watching my kids get kicked in the teeth every day,” Brooks told CNN. “At the end of the day, people can’t afford anything anymore, child care being one of them.”\n\nBrooks said he helps babysit his granddaughters – a 1-year-old and a 3-year-old – once a week to help his son and daughter-in-law save on day care costs.\n\nObando-Derstine pointed to her personal experience as a mother. At one point, she said, she and her husband paid more for child care than their mortgage.\n\n“I have made child care a central part of my platform when I talk about affordability, because I get it,” she said. “I’m someone that’s raising kids and also caring for aging parents, and I remember what it was like when my kids were little.”\n\nCrosswell made an economic argument, arguing that increased access would help parents work and improve outcomes for children.\n\n“I think child care is unique in the sense that not only is it an extra expense, but it’s limiting their professional mobility,” he said.\n\nCrosswell held a house party at the home of Peter Krajsa, the chief executive of the National Energy Improvement Fund, which offers loans for energy efficiency projects. Krajsa, 69, described himself as an independent and said Crosswell came across as a moderate, similar to former Reps. Charlie Dent and Wild. He said he worries Democrats will nominate someone too liberal for voters in the district who are seeking centrists.\n\n“They’re looking for somebody who is rational and intelligent and understands that their job is for the common good and not as partisan,” Krajsa said. “There’s a bigger swath of middle people here than there are extremists on both sides.”\n\nThough his kids are adults, he said he sees the impact of child care costs – on the parents who work for his firm, on the families he gives loans to for heat pumps who are grappling with day care costs, and within the next generation of his own family.\n\nHis nephew, John Krajsa, a 37-year-old lawyer, said he and his wife Sarah were shocked by the price of child care when they started exploring options for their first child.\n\n“It’s difficult because you want to put your child in a place where they’re going to excel, where you think that they feel safe, and where you are just confident that they’re going to be given great care,” he said. “But at the same time, you’re also looking at costs.”\n\nActive Learning Centers is still dealing with the cost shifts from the pandemic. Eldridge said the average pay for an entry-level teacher has increased from $10 to $15 an hour, and the company’s liability insurance has skyrocketed from $57,000 to $445,000 a year over the last five years.\n\nEldridge started advertising online and through mail to boost enrollment. Another staffer shops for deals on the bulk food purchases for the company.\n\n“It was tough for a while,” said Ciara Manning, the director of the Emmaus branch. “Enrollment was down, morale was down. I mean, things were scary.”\n\nManning started with the company 10 years ago, when she left a better paying job teaching math and science to 4th-8thgraders at a local public school district. The school district, she said, focused too much on testing.\n\n“We really focus on learning and exploring through fun and leadership and core values and all those fundamentals that children need – especially early children need – to help them be successful,” Manning said.\n\nFor many parents, daycare is one of several difficult, but necessary, costs they must manage.  “It’s just what we knew we had to do. My husband has to work. I have to work. We can’t survive off of one income,” said Danielle Sanchez, a 27-year-old teacher who sends her daughter to an Active Learning Centers location. “There was a conversation of ‘Can I stay home from work?’ But it was a very short conversation, as we looked at finances and said there’s no way.”\n\nAndrea Castilow, a 37-year-old marketing professional, and her husband bought a home in the Lehigh Valley right before the pandemic started. Soon after, she found out they were expecting their first child. She now sends her 5- and 3-year-olds to the school.\n\n“Every month it’s, ‘OK, we have this big childcare bill.’ It’s just been there for five years,” she said. “It does play into financial decisions, for sure.”\n\nTheir child care costs were higher than their mortgage until last year, when they moved into a new home to accommodate their larger family. Even then, Castilow said, they considered delaying moving until their oldest started attending public school.\n\nCastilow, an independent who leans left, said it was her concern over school shootings and gun violence that pushed her to start getting more engaged politically. As this year’s election approaches, her key issues are child care, early childhood education and support for families, such as parental leave.\n\n“Having child care is not really a luxury,” she said. “I feel like it’s become more and more of an essential infrastructure in our society.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.childcareaware.org/price-landscape24/#PriceofCare",
      "text": "according to a 2025 report from"
    },
    {
      "url": "https://apnorc.org/projects/few-concerned-with-declining-birthrates-but-many-worry-about-the-costs-of-child-care-and-favor-paid-family-leave/",
      "text": "July 2025 AP-NORC poll"
    },
    {
      "url": "https://www.cnn.com/2025/07/19/politics/democrats-federal-employees-midterms",
      "text": "dropped corruption charges"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/child-care-affordability-midterms-pennsylvania",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/politics/child-care-affordability-midterms-pennsylvania",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ae8ac7549cd31660f2e64ed94cde76ad4b0a473a810a21261756e1d65d1b30f3",
  "scraped_at": "2026-02-22T07:09:42.937384+00:00"
}