{
  "url": "https://lite.cnn.com/2026/02/19/africa/un-experts-el-fasher-genocide-intl",
  "title": "UN experts say destruction by Sudan’s rebels in El Fasher in October bears ‘hallmarks of genocide’ | CNN",
  "date": "2026-02-20T07:29:18.328717+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nA “campaign of destruction” in October by Sudanese rebels against non-Arab communities in and neara city in Sudan’s western region of Darfurshows “hallmarks of genocide,” UN-backed human rights experts reported Thursday, a dramatic finding in the country’s devastating war.\n\nThe Rapid Support Forces carried out mass killings and other atrocities in El Fasher after an 18-month siege during which they imposed conditions “calculated to bring about the physical destruction” of non-Arab communities, in particular the Zaghawa and the Fur communities, the independent fact-finding mission on Sudan reported.\n\nUN officials say several thousand civilians were killed in the RSF takeover of El Fasher, the Sudanese army’s only remaining stronghold in the Darfur.Only 40% of the city’s 260,000 residents managed to fleethe onslaught alive, thousands of whom were wounded, the officials said. The fate of the rest remains unknown.\n\nSudanplunged into conflict in mid-April 2023, when long-simmering tensions between its military and paramilitary leaders broke out in the capital Khartoum and spread to other regions including Darfur.\n\nThe devastating warhas killed more than 40,000 people, according to UN figures, but aid groups say that is an undercount and the true number could be many times higher.\n\nThe RSF and their allied Arab militias, known as Janjaweed, overran El Fasher on Oct. 26 and rampaged through the city. The offensive was marked by widespread atrocities that included mass killings and summary executions, sexual violence, torture, and abductions for ransom, according to the UN Human Rights Office.\n\nThey killed more than 6,000 peoplebetween Oct. 25 and Oct. 27 in the city, the office said. Ahead of the attack, the rebels ran riot in the Abu Shouk displacement camp, just outside of the city, and killed at least 300 people in two days, it said.\n\nThe RSF did not respond to an e-mailed request for comment. The group’s commander, Gen. Mohammed Hamdan Dagalo, has previously acknowledged abuses by his fighters, but disputed the scale of atrocities.\n\nAn international convention known colloquially as the “Genocide Convention” — adopted in 1948, three years after the end of World War II and the Holocaust — sets out five criteria to assess whether genocide has taken place.\n\nThey are: killing members of a group; causing its members serious bodily or mental harm; imposing measures aimed to prevent births in the group; deliberately inflicting conditions calculated to bring about the “physical destruction” of the group; and forcibly transferring its children to another group.\n\nThe fact-finding team, which doesn’t have final say on the matter, said it found at least three of those five were met in the actions of the RSF. Under the convention, a genocide determination could be made even if only one of the five were met.\n\nThe RSF acts in El Fasher included killing members of a protected ethnic group; causing serious bodily and mental harm; and deliberately inflicting conditions of life calculated to bring about the group’s physical destruction in whole or in part — all core elements of the crime of genocide under international law, according to the fact-finding team.\n\nThe report cited a systematic pattern of ethnically targeted killings, sexual violence and destruction and public statements explicitly calling for the elimination of non-Arab communities.\n\nTeam chair Mohamed Chande Othman, a former chief justice of Tanzania, said the RSF operations were not “random excesses of war” but pointed to a planned and organized operation that bore the characteristics of genocide.\n\nEl Fasher’s residents were “physically exhausted, malnourished, and in part unable to flee, leaving them defenseless against the extreme violence that followed,” the team’s report said. “Thousands of persons, particularly the Zaghawa, were killed, raped or disappeared during three days of absolute horror.”\n\nThe fact-finding mission pointed to mass killings, widespread rape, sexual violence, torture and cruel treatment, arbitrary detention, extortion, and enforced disappearances during RSF’s takeover of El Fasher in late October.\n\nThe report documented cases of survivors quoting its fighters as saying things like: “Is there anyone Zaghawa among you? If we find Zaghawa, we will kill them all” and “We want to eliminate anything black from Darfur.”\n\nThe report pointed to “selective targeting” of Zaghawa and Fur women and girls, “while women perceived as Arab were often spared.”\n\nThe fact-finding team was created in 2023 by the Geneva-based Human Rights Council, the UN’s leading human rights body, which has 47 member countries drawn from membership in the world body.\n\nThe team called for accountability for perpetrators and warned that protection of civilians is needed “more than ever” because the conflict is expanding to other regions in Sudan.\n\nOver the course of the conflict, the warring parties were accused of violating international law. But most of the atrocities were blamed on the RSF: The Biden administration, in one of its last decisions, said it committedgenocidein Darfur.\n\nThe RSF has been supported bythe United Arab Emiratesover the course of the war, according to UN experts and rights groups. The UAE has denied the allegations.\n\nThe RSF grew out of the Janjaweed militias, who became notorious for atrocities in the early 2000s in a ruthless campaign against people identifying as East or Central African in Darfur. That campaign killed some 300,000 people and drove 2.7 million from their homes.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/sudan-elfasher-rsf-war-darfur-f91bfe006211fbf3af21b12271710eed",
      "text": "a city in Sudan’s western region of Darfur"
    },
    {
      "url": "https://apnews.com/article/sudan-war-rsf-captures-fasher-f0332fcd6828ebe9cd3a47cb3c42b005",
      "text": "Only 40% of the city’s 260,000 residents managed to flee"
    },
    {
      "url": "https://apnews.com/hub/sudan",
      "text": "Sudan"
    },
    {
      "url": "https://apnews.com/article/sudan-famine-rsf-kordofan-darfur-war-hunger-9b16a0419f8d7cc67c7e95939a8a954d",
      "text": "The devastating war"
    },
    {
      "url": "https://apnews.com/article/sudan-rsf-darfur-fasher-un-report-6399bc86352cecd459dd5dd77e5e11f2",
      "text": "They killed more than 6,000 people"
    },
    {
      "url": "https://apnews.com/article/biden-sudan-genocide-7a0d20f857af3fd428750cf2dfd231ae",
      "text": "genocide"
    },
    {
      "url": "https://apnews.com/article/sudan-war-uae-egypt-f1cb024e79c9b35aa10db7dd348ede4f",
      "text": "the United Arab Emirates"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/africa/un-experts-el-fasher-genocide-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/africa/un-experts-el-fasher-genocide-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "aeaece9305b0a578fc4424bdb8c904159886301a26966eeaf68d833cbc305a8f",
  "scraped_at": "2026-02-20T07:29:18.328732+00:00"
}