{
  "url": "https://lite.cnn.com/2026/02/26/entertainment/wu-tang-oliver-power-grant-dead-scli-intl",
  "title": "Wu-Tang Clan collaborator Oliver ‘Power’ Grant dead at 52 | CNN",
  "date": "2026-02-28T07:01:35.790347+00:00",
  "authors": [
    "Lianne Kolirin"
  ],
  "text": "Source: CNN\n\nOliver “Power” Grant, a music producer who closely collaborated with the Wu-Tang Clan, has died aged 52.\n\nHis passing was announced by the legendary hip-hop group on social media, although no further details of his death were given. The group’sInstagrampost on Wednesday simply stated: “Rest in Power, Power,” accompanied by several photos.\n\nA host of musical tributes and pictures were posted on the band’s Instagram Stories in memory of Grant, who is credited as being the band’s executive producer and co-founder of Wu-Tang Productions. He also acted in several movies, including “Belly” (1998) and “Black and White” (1999) and “Coalition” (2004).\n\nThe group, which hails from Staten Island, New York, includes original members RZA, GZA, Ol’ Dirty Bastard, Method Man, Raekwon, Ghostface Killah, Inspectah Deck, U-God and Masta Killa.\n\nRza (Robert Diggs) founded the group in the early 1990s after deciding he wanted a life in music and not on the streets. Their 1993 debut album “Enter the Wu-Tang (36 Chambers)” is often listed as one of the top hip-hop albums of all time.\n\nMembers of the group also paid separate tributes to Grant on their own social media.\n\n“Paradise my Brother safe Travels!!” wrote Method Man, adding two heartbreak emojis. “Bruh I am not ok,” he added.\n\nGZA posted: “We couldn’t have done it without him. Wu wouldn’t have come to fruition without Power. His passing is a profound loss to us all. My deepest condolences to the fam.”\n\nRaekwon shared a photo of Grant with the group on Instagram, with the caption: “POWER we been everywhere …. now you everywhere ! the most high is merciful love you”\n\nGrant was the driving force behind clothing line Wu Wear, which was later renamed Wu-Tang Brand. It was later relaunched as Wu Wear.\n\nRepresentatives for the Wu-Tang Clan have been contacted by CNN for further comment.\n\nCNN’s Marianne Garvey contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.instagram.com/p/DVMrOQykh87/?hl=en&img_index=1",
      "text": "Instagram"
    }
  ],
  "hash": "aec31544ddb1d369cb2f9720125fbb88877bdf9af16fcccbef8aa9417f635fb0",
  "scraped_at": "2026-02-28T07:01:35.790361+00:00"
}