{
  "url": "https://lite.cnn.com/2026/02/13/americas/victims-tumbler-ridge-shooting-intl",
  "title": "Tumbler Ridge: What we know about the victims killed in one of Canada’s worst ever school shootings | CNN",
  "date": "2026-02-14T07:07:53.190379+00:00",
  "authors": [],
  "text": "Source: CNN\n\nTumbler Ridgeis the type of town where everyone knows everyone. And as the tiny mountain community reels from one of Canada’s worst school shootings in decades, it is the type of place where “everybody’s going to be grieving,” as its mayor Darryl Krakowka said.\n\nAt least eight people died and dozens more were wounded on Tuesday when an18-year-old suspectkilled her mother and step-brother before going to the town’s secondary school and killing at least five children and a teacher. Police named the alleged shooter as Jesse Van Rootselaar, who was transgender and transitioned about six years ago.\n\nIn the days since, the Royal Canadian Mounted Police (RCMP) have named the victims while parents, family members and friends have paid tribute to their deceased loved ones.\n\nHere’s everything we know about them:\n\nJust a few weeks ago, Abel Mwansa’s father captured a short video of his son playing on his phone at a restaurant, before looking up and grinning widely for the camera.\n\nAbel was 12 years old, about to turn 13 next month, and loved school so much that he cried when his father suggested home schooling.\n\nAbel, who moved to Canada from Zambia in 2023 alongside his family, loved doing experiments and had a “bright future,” perhaps as “a leader, an engineer (or) a scientist,” his father Abel Mwansa, Sr. Said in a series of Facebook posts.\n\n“It happened that we had a boy and I was just so excited,” Mwansa, Sr. told CBC. “I ended up giving him my name.”\n\nEzekiel Schofield was 13 years old when he was killed. For his grandfather, Peter, “everything feels so surreal.”\n\n“The tears just keep flowing,” he posted on Facebook. “So many young lives were ended so needlessly. Our hearts are broken not only for Eziekiel, but for every family affected by this tragedy.”\n\nKylie Smith was a talented artist and dreamed of going to art school in Toronto, her family said in a statement released by the RCMP.\n\n“She was just a beautiful soul. She loves art and anime. She wanted to go to school in Toronto, and we just loved her so much. She was thriving in high school,” her dad, Lance Younge, told CTV News. “She never hurt a soul.”\n\nKylie’s 15-year-old brother, Ethan, hid in a utility closet during the shooting and survived, Younge said.\n\n“I soaked in that moment watching them walk in the door together, for whatever reason,” he added. “I didn’t know it would be the last time.”\n\nZoey Benoit was “resilient, vibrant, smart, caring and the strongest little girl you could meet,” her family said in a statement released by the RCMP.\n\nShe loved spending time with her family, they added, and “brought so much laughter and smiles in her presence.”\n\nTicaria Lampert was nicknamed “Tiki-torch,” a play on her name and a reference to her tendency to be “always out on adventure to brighten someone’s day,” her mother Sarah told reporters on Thursday.\n\nOne of eight, she was the “glue” in her family, capable of being “mature” like her older siblings or “like a Tarzan” with her younger siblings, her mother added tearfully.\n\nShe was the “dork of all dorks,” armed with a “Santa’s sack of every bad dad joke you could ever think of,” Lampert said.\n\n“She was in no hurry to grow up,” Lampert added. “She is forever my baby.”\n\nShannda Aviugana-Durand, who worked at the school, was among those who died. She belonged to the BC General Employees’ Union, which represents thousands of workers in British Colombia and who confirmed her death.\n\n“Out of respect for her family, we will share further information when appropriate,” they added.\n\n“We extend our deepest condolences to the family, friends, coworkers, and all those whose lives she touched.”\n\nJennifer Jacobs, who police said was the suspected shooter’s mother, was found dead at a house in Tumbler Ridge.\n\nShe went by a different name, Jennifer Strang, on social media, a review by CNN found.\n\nAlongside her children, she led “an almost nomadic life” between 2010 and 2015, moving multiple times between Newfoundland, Grand Cache and Powell River, British Colombia, a judge said when ruling on a family dispute in 2015.\n\nEmmett Jacobs, 11, was also found dead at the residence. He was the alleged shooter’s step-brother, police said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/americas/canada-mass-shooting-school-latam-intl",
      "text": "Tumbler Ridge"
    },
    {
      "url": "https://cnn.com/2026/02/12/americas/tumbler-ridge-shooting-suspect-online-posts-intl-hnk",
      "text": "18-year-old suspect"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/americas/victims-tumbler-ridge-shooting-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/americas/victims-tumbler-ridge-shooting-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "af26d6df3320468377036e7a4a7c356926fbdf3c15ff2666432f1b3b9e3603cf",
  "scraped_at": "2026-02-14T07:07:53.190393+00:00"
}