{
  "url": "https://lite.cnn.com/2026/02/26/us/pentagon-shoots-down-cbp-drone",
  "title": "Pentagon shoots down US Customs and Border Protection drone with laser system, lawmakers say | CNN",
  "date": "2026-03-01T07:08:15.600597+00:00",
  "authors": [
    "Pete Muntean",
    "Alexandra Skores",
    "Katherine Dautrich"
  ],
  "text": "Source: CNN\n\nThe US military used an anti-drone laser system to shoot down a unmanned aircraft operated by US Customs and Border Protection in Texas, according to congressional representatives.\n\nThe incident comes just weeks after use of a laser system near El Paso led to confusion and exposed communication lapses among several US agencies.\n\n“Our heads are exploding over the news that DoD reportedly shot down a Customs and Border Protection drone using a high risk counter-unmanned aircraft system,” three Democrats on the House Committee on Transportation and Infrastructure said in a statement.\n\nIt’s not clear when the shoot-down happened.\n\nThe Department of Defense, CBP and the Federal Aviation Administration confirmed in a joint statement to CNN on Friday that an “engagement occurred.”\n\n“This reported engagement occurred when the Department of War employed counter-unmanned aircraft system authorities to mitigate a seemingly threatening unmanned aerial system operating within military airspace,” the statement said.\n\n“The engagement took place far away from populated areas and there were no commercial aircraft in the vicinity,” the agencies added. “These agencies will continue to work on increased cooperation and communication to prevent such incidents in the future.”\n\nAs a result of the incident, the FAAimplemented a temporary flight restriction starting Thursday evening above the town of Fort Hancock, Texas, to “ensure safety.”\n\nThe small town is about 50 miles south of El Paso, along the Mexican border.\n\nThe top Democrat on the House committee Rick Larsen, along with Reps. André Carson and Bennie Thompson were notified of the shoot down Thursday through official channels, a congressional source tells CNN.\n\n“We said MONTHS ago that the White House’s decision to sidestep a bipartisan, tri-committee bill to appropriately train C-UAS (counter unmanned aerial system) operators and address the lack of coordination between the Pentagon, DHS and the FAA was a short-sighted idea. Now, we’re seeing the result of its incompetence,” the statement said.\n\nThe shoot-down comes about two weeks after the use of a military laser system by CBP designed to disrupt drones near El Paso prompted the FAA to abruptly shut down a large swath of airspace up to 18,000 feet over the city for 10 days. The move effectively shut down El Paso airport, but was reversed after about eight hours.\n\nThe use of the system near the city came before the FAA and Pentagon met to review potential impacts and mitigation measures. But the Defense Department sought to use the system sooner around El Paso, prompting the FAA to impose the temporary flight restriction. That decision was made without telling the White House first, according to people familiar with the matter.\n\nBecause of the location of the new restrictions implemented Thursday they are not expected to have any impact on commercial flights.\n\nThe top Democrat on the Senate Aviation Subcommittee, Tammy Duckworth called for an investigation into the “dysfunction” endangering the nation’s aviation system.\n\n“The situation is alarming and demands a thorough, independent investigation,” the senator said in a statement. “I will be calling on the Inspectors General of the Departments of Defense, Transportation and Homeland Security to launch a joint investigation into the recent scandals in El Paso and now Fort Hancock.”\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [],
  "hash": "af935f5e724697e0b80d270000413bf0c147e94f87a43239705834fc103493be",
  "scraped_at": "2026-03-01T07:08:15.600608+00:00"
}