{
  "url": "https://lite.cnn.com/2026/02/13/travel/us-ski-resorts-canadian-skiers",
  "title": "Strange US ski season: Missing Canadians, ‘white gold’ and a snow drought | CNN",
  "date": "2026-02-14T07:08:06.028683+00:00",
  "authors": [],
  "text": "Source: CNN\n\nSteven Wright knew he had a problem long before the first snowflake fell.\n\nWright, who runs the Jay Peak ski resort in northern Vermont, realized something was wrong last summer while talking to Canadian season pass holders who had decided they wouldn’t be coming to the US — or his property — for the 2025-2026 winter ski season.\n\nThe political enmity between the US and Canada had reached a fever pitch, especially once President Trump began referring to Canada as “the 51st state,” and Jay Peak, located just 9 miles south of the Canadian border, was going to pay the price.\n\n“I called hundreds of season pass holders, and to a house, they mentioned the ’51st state’ thing,” Wright said in an interview with CNN.\n\nHe testified last year about the conversations to a US Senate committee, and he said many of the customers “were choking up over the fact that they just couldn’t, in good conscience, come to the States.”\n\nBeyond rhetoric about the 51st state, Trump had also ignited a trade war, with the threat and reality of stiff tariffs.\n\nJay Peak is arguably unique; 50% of its business comes from Canada, which feels more like a neighboring town than a foreign country.\n\nMany US ski resorts don’t rely as much on Canadian traffic. And as the season has progressed, the exodus of Canadian visitors has slowed significantly while the snowfall in the East has ramped up.\n\nBut Wright’s experience illuminates what he calls the current plight of “the border economies,” encompassing many business owners who live and work near the US-Canada frontier.\n\nIt also humanizes the repercussions of recent trade policy: many Canadian residents are abandoning or severely curtailing their years-long tradition of visiting the US.\n\n“We have a hockey arena — millions of dollars in hockey tournament business each year. We have a dozen restaurants on-site, conference space, wedding facilities. It all relies on Canadians to make it go,” he said.\n\nThe blow to Wright’s business and to other ski resorts in the Northeast and out West that depend on Canadian travelers comes at an unusual moment. Snowfall in the eastern US this year has reached blockbuster levels. And much of the West has been suffering from asnow drought.\n\nWhile the number of Canadian tourists continues to lag in the US, many American ski resorts on the East Coast are heaving a sigh of relief. The massive amount of snow falling on mountains this season is luring many American skiers, offsetting the Maple Leaf hiatus.\n\nFor Wright at Jay Peak, which has 81 trails, business is now only off 10% to 15%. But while he said he’s pleased after the season began with a much steeper decline, he has no illusions.\n\n“Heavy snow has insulated us from the potential big downside of Canadian visitation. It has done so much to mitigate the situation with Canada,” he said. “What happens when that snow melts?”\n\nThe number of Canadians re-entering Canada by car from the US was down every month last year, compared to 2024, according to Statistics Canada, the national statistical office. In December alone, there was a 30% drop in traffic from December 2024.\n\nUS National Travel and Tourism Office figures show anearly 22% dropin visitor arrivals to the US from Canada last year through November, compared with 2024. Overall, international travel to the US during that period dipped by 5.4%. (Full 2025 figures are still being compiled).\n\nThe importance of Canada as a source of tourists — and tourism dollars — cannot be overestimated.\n\nCanada is the largest source of international visitors to the US. More than 20 million Canadians visited the country in 2024, according to the U.S. Travel Association, generating $20.5 billion in spending, as CNNreportedlast year.\n\nBut the snapshot out West is a more complicated one to decipher. Unlike the  East, ski resorts in the West are starved for snow so there are fewer visitors from anywhere.\n\nVail Resorts, which operates about three dozen ski resorts in North America, including Breckenridge in Colorado, Hunter Mountain in New York and Mount Sunapee in New Hampshire, reported a 20% decline in visits from skiers so far this season. The company’s CEO, Rob Katz told investors last month that it was “one of the worst early season snowfalls in the western US in over 30 years,” according to a news release.\n\nThe company said snowfall at its Western resorts was 50% below its 30-year historical average in November and December.\n\nIt’s not surprising then that bookings by Canadian travelers at ski resorts out West weredown 41%last month, according to the data firm Inntopia.\n\nTo be sure, ski resorts have diversified in recent decades so many offer a host of other recreational activities — some tied to other winter sports, others completely snow-agnostic. For example, some ski resorts have built indoor water parks.\n\nSnow-making operations have also long augmented what Mother Nature provides.\n\nAnd some US ski resorts rely much less on Canadian visitors in general. For example, the drop in Canadian visitation hasn’t hurt Smugglers’ Notch Resort in Jeffersonville, Vermont, much.\n\n“We are definitely off on our bookings of Canadian travelers as compared to other years — they come mostly from Ontario — but we don’t have to bank on there being a ton of Canadian travelers,” said Matt McCawley, a spokesperson for the resort. “I think we are seeing more people traveling to Vermont, and I would assume it’s the same for New York and New Hampshire and Maine, just because of all that snow.”\n\nBy all accounts, the snow has been epic. McCawley says 200 inches have already fallen at his Vermont resort and he thinks a season record of over 400 inches might be broken.\n\n“It’s like white gold,” he said.\n\nOther resorts are located near Canadian provinces less vexed by the new political messages coming from the US. For example, Whitefish Mountain Resort in Montana draws visitors primarily from Alberta, where alocal separatist movementhas found common cause with theconservative MAGA movement in the US.\n\n“Canadian visitation has always been a sizeable part of our business,” said Chad Sokol, adding there hasn’t been “a drastic drop.”\n\nBut beyond the ski resort, the town of Whitefish is seeing a sharp drop in Canadian visitors.\n\nAccording to data collected by Explore Whitefish, the local tourism board, Canadian visitation fell nearly 25% in 2025. The town is near Glacier National Park.\n\nIn a written statement, Explore Whitefish’s executive director, Zak Anderson, noted visits from Canadian tourists have long been “a cornerstone of Whitefish’s winter economy.”\n\nIn the case of Montana and other places, domestic tourists have stepped in to shore up some of the declines. What’s more, political tension isn’t the only factor keeping Canadians at home; the weak Canadian dollar is also partly to blame.\n\nBut property owners are already looking ahead anxiously to the summer when many resorts market themselves to Canadian mountain bikers, golfers and other outdoor enthusiasts.\n\nAt Killington in central Vermont, for example, the number of Canadian visitors who come to the resort for mountain biking was down double digits last summer, spokesperson Josh Reed said.\n\n“It’s a huge piece of our summer business,” he said. “Folks from Quebec are big into mountain biking.”\n\nReed spoke to many mountain bikers who skipped their summer visits to the US last year, and he said they were “extremely angry” over the political tensions.\n\nKillington offered discounts and there were other incentives, including a campaign from the Vermont Mountain Bike Association, which hosted “Canadians Ride Free Day” in August, so the resort was able to lure back some of the customers from Canada who had stayed away.\n\n“By the end of the summer, we were hearing more French,” Reed said, adding it’s an anecdotal measure of one slice of Canadian tourism.\n\nThat offered a respite for Killington and other tourism businesses in Vermont. But it underscores the year-round nature of the problem even for ski resorts. They aren’t just in the ski business — they are in the tourism business.\n\n“The entire state of Vermont is suffering,” Wright said.\n\nBorder crossings by car between Vermont and Canadadeclined 27%in 2025, according to statistics from the state of Vermont, which derives nearly 10% of its gross domestic product from tourism.\n\nIt’s unclear how things will play out this year because as many have pointed out, the Canadian exodus resulted from far more than simply the discussion of tariffs. The rhetoric around annexing Canada and crowning it the 51st state rankled many Canadians, unearthing long-simmering tensions whichhave not abated. Just this week, President Trump threatened to block the opening of a new bridge between the US and Ontario.\n\nOnce the snow melts at Jay Peak, hockey tournaments dominate the summer schedule, and the most compelling matchups are between hockey-loving Canadians and their American counterparts.\n\n“If Canadians don’t show up, it hurts our American market, too, because the American teams want to play the Canadians,” he said. “We don’t have a business then.”\n\nThat echoes a comment from an official with North Country Chamber of Commerce in Plattsburgh, New York.\n\n“Our leisure travel market is about 70% Canadians — it’s a very large part of what we do,” Kristy Kennedy, vice president of marketing and business development for the North Country Chamber of Commerce in New York state,told CNNlast year.\n\nTourism operators continue to roll out incentives aimed at Canadian tourists, which could eventually stem the tide. For example, Minot, North Dakota, is one of a growing number of towns where some businesses will accept Canadian dollars “at par,” even though the currency is weaker against the American dollar right now. (Even some casinos inLas Vegashave taken this extraordinary step of accepting Canadian loonies.)\n\nThe friendship between the two nations is a storied one and has endured many setbacks, observers say. The question is, how long will the two friends remain estranged?\n\n“This will roll back,” said Wright at Jay Peak of the Canadian travel boycott. “But it will have a long tail for some Canadians.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/climate/snow-drought-west-water-colorado-river",
      "text": "snow drought"
    },
    {
      "url": "https://www.trade.gov/i-94-arrivals-program?anchor=content-node-t14-field-lp-region-2-1",
      "text": "nearly 22% drop"
    },
    {
      "url": "https://www.cnn.com/travel/candians-boycotting-travel-to-united-states",
      "text": "reported"
    },
    {
      "url": "https://corp.inntopia.com/a-slow-opening-across-most-western-mountain-destinations-despite-easing-rates-and-last-minute-snow/",
      "text": "down 41%"
    },
    {
      "url": "https://www.cnn.com/2025/06/23/americas/alberta-independence-trump-canada-latam-intl",
      "text": "local separatist movement"
    },
    {
      "url": "https://accd.vermont.gov/canada-border-crossings",
      "text": "declined 27%"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/gordie-howe-bridge-canada-trump-threat-intl-hnk",
      "text": "have not abated"
    },
    {
      "url": "https://www.cnn.com/2025/06/16/travel/canadian-travelers-us-cross-border-deals",
      "text": "told CNN"
    },
    {
      "url": "https://www.visitlasvegas.com/experience/post/downtown-hotels-offering-at-par-exchange-rate-for-canadians/",
      "text": "Las Vegas"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/travel/us-ski-resorts-canadian-skiers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/travel/us-ski-resorts-canadian-skiers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b166f1432f3961557dcc7c47d0f8d7b7277c3c52a49f885f0ca93398dc78eb88",
  "scraped_at": "2026-02-14T07:08:06.028695+00:00"
}