{
  "url": "https://lite.cnn.com/2026/02/17/us/subu-vedam-case-ice-pennsylvania",
  "title": "Subramanyam ‘Subu’ Vedam denied bond after spending over 40 years in prison before murder conviction was overturned | CNN",
  "date": "2026-02-18T07:31:55.848886+00:00",
  "authors": [
    "Elizabeth Wolfe",
    "Lauren Mascarenhas",
    "CNN"
  ],
  "text": "Source: CNN\n\nAfter losing four decades of his life serving time for a murder he maintains he did not commit, a gray-haired Subramanyam “Subu” Vedam prepared to step out of a Pennsylvania prison last October as a free man.\n\nInstead, a day after his charges were dropped,Vedam was swept up by ICE on a decades-old deportation order, his attorney said. The 64-year-old, who came to the US from India when he was an infant, was suddenly thrown into another painstaking legal battle.\n\nA federal immigration judge denied Vedam’s request for bond Tuesday morning, as he fights his deportation.\n\nAmong those who attended the hearing were the assistant district attorney of Centre County, Pennsylvania, who was prepared to answer the court’s questions about the decision not to retry Vedam, his attorney, Ava Benach, said. A number of Vedam’s family members and supporters, including State College Mayor Ezra Nanes, were also present for the hearing, according to Benach.\n\nVedam has until March 19 to appeal the judge’s bond decision.\n\n“We are disappointed in the judge’s ruling and believe that the decision contains several errors of facts and law. We will appeal and continue to work to see that Subu gets the full measure of justice he deserves,” Benach told CNN after the hearing.\n\nThe hearing follows a ruling last week by the US Board of Immigration Appeals – the highest administrative body for interpreting and applying immigration laws – which determined Vedam’s case is an “exceptional situation” that warrants re-opening his immigration case, Benach said.\n\nThe original deportation order, which was thrown out by the Board of Immigration Appeals, was based on Vedam’s now-vacated murder conviction and a related drug charge, according to Benach.\n\nAfter decades of maintaining his innocence, Vedam’s conviction was thrown out by a judge in August after it was revealed that prosecutors had withheld potentially critical ballistics evidence during his two trials.\n\nThe Department of Homeland Security is continuing to fight Vedam’s release, saying in a statement Monday that the vacation of his conviction will not deter its efforts. Though DHS called Vedam a “criminal illegal alien,” his attorney said he is a permanent legal resident.\n\n“Having a single conviction vacated will not stop ICE’s enforcement of the federal immigration law,” a DHS spokesperson said. “Under President Trump and Secretary Noem, if you break the law, you will face the consequences.”\n\nAfter two trials in the 1980s, Vedam was sentenced to life without parole for the murder of his friend and former roommate, 19-year-old college student Thomas Kinser.\n\nThough Vedam fought the conviction for decades, almost 40 years passed before a team of attorneys discovered prosecutors may have withheld evidence that could have impacted the jury’s decision in his case.\n\nOn the day of Kinser’s disappearance in December 1980, Vedam had asked him for a ride to a nearby town to buy drugs, according toThe Associated Press.\n\nNine months later, Kinser’s remains were found in a sinkhole with a bullet hole in his skull, according to court documents. Though no weapon was found, a .25-caliber bullet was found inside Kinser’s shirt.\n\nVedam’ssupporters believeinvestigators fixated on him as the lone suspect at the expense of other legitimate leads, arguing that his ethnicity played a role in how authorities homed in on him in the early days of the case and at trial.\n\nVedam was initially detained on drug charges while police investigated and was eventually charged with Kinser’s murder. In the drug case, he pleaded no contest to four counts of selling LSD and a theft charge, the AP reported.\n\nProsecutors argued to jurors that Vedam shot his friend with a .25-caliber gun that he had purchased before Kinser’s disappearance.\n\nVedam’s defense attorneysrepeatedly questioned ballistics evidence during the trial, casting doubt on the size of the hole in Kinser’s skull compared to a .25 caliber bullet and whether the bullet that killed Kinser could have been shot from Vedam’s gun.\n\nWhile the jury heard testimony that Vedam bought a .25-caliber gun, they were never shown an FBI report that suggested Kinser’s bullet wound was too small to have been inflicted by that gun. Though prosecutors knew of the specific measurements of the wound, they excluded them from the report given to Vedam’s defense attorneys, court records show.\n\nIn August 2025, a judge concluded that Vedam had not been given a fair trial due to prosecutors’ efforts to suppress evidence. The judgevacated his convictionand ruled Vedam was entitled to a new trial.\n\nThe Centre County District Attorney’s Office announced on October 2 it would not seek a new trial and would drop the charges against Vedam.\n\nThe next day, Vedam was transferred to ICE custody, beginning a new phase of his tangled legal saga.\n\nHis sister, Saraswathi Vedam, told the AP in October that she was saddened by the latest delay, but said her brother remains patient.\n\n“He, more than anybody else, knows that sometimes things don’t make sense,” she said. “You have to just stay the course and keep hoping that truth and justice and compassion and kindness will win.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/exoneration-india-penn-state-murder-immigration-9bf5f64cac770e82866501e013fce2f1",
      "text": "The Associated Press"
    },
    {
      "url": "https://freesubu.org/case-details/",
      "text": "supporters believe"
    },
    {
      "url": "https://freesubu.org/wp-content/uploads/2025/08/Court-Voids-Subus-Wrongful-Conviction-.pdf",
      "text": "vacated his conviction"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/subu-vedam-case-ice-pennsylvania",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/subu-vedam-case-ice-pennsylvania",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b1ece53a878bfd9521c1551ee4b3085118ea217399df11f57ce2ad3b9f2734ea",
  "scraped_at": "2026-02-18T07:31:55.848913+00:00"
}
