{
  "url": "https://lite.cnn.com/2026/02/26/politics/donald-trump-mental-fitness-polls",
  "title": "Polls show increasing concerns about Trump’s mental acuity | CNN Politics",
  "date": "2026-02-28T07:01:50.061526+00:00",
  "authors": [
    "Analysis by Aaron Blake"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump won the 2024 presidential race after his initial opponent, then-President Joe Biden, withdrew over worries about his age and mental sharpness.\n\nBut a year-plus into Trump’s four-year term, polls suggest the American people aren’t just increasingly unhappy with his job performance; they’re increasingly concerned about his mental capacity as well.\n\nThe unease is not at the levels it was with Biden, who was 81 when he dropped out of the race, but it’s growing as an issue for the 79-year-old Trump.\n\nIn fact, multiple recent polls show a majority of Americans questioning it in one way or another. And even many Republicans seem to have concerns.\n\nPerhaps the most striking poll came Tuesday, ahead of Trump’s firstState of the Union addressof his second term, which beat his own record forthe longest speech to Congress.\n\nTheReuters-Ipsos pollshowed 61% of Americans agreed that Trump has “become erratic with age.” Even 30% of Republicans agreed with that sentiment.\n\nThe survey harks back to some surveys in Trump’s first term, when many Americans grew toquestion his mental acuity. But while the percentage of registered voters saying he wasn’t “mentally stable” approached 50% in Quinnipiac University polling following the attack on the US Capitol in 2021, it never crested a majority — much less hitting 61%. (“Erratic” is, of course, not the same as “unstable.” But they are along the same lines.)\n\nThe Reuters-Ipsos poll also showed a decrease in the percentage of Americans who say Trump is “mentally sharp and able to deal with challenges.” That number has dropped from54% in September 2023to 45% today.\n\nBut Trump — who often boasts about acing cognitive tests and who spoke for an hour and 47 minutes on Tuesday night — is still nowhere close to where Biden was; only around one-quarter of Americans said Biden was mentally sharp and able to deal with challenges inJuly 2024, the month he dropped out of the race.\n\nOther polls echo these findings, including one from CNN  last month.\n\nThat survey showed the percentage saying Trump has the “stamina and sharpness to serve effectively as president”declining from 53% in late 2023 to 46% today.\n\nThat 46% is still well clear of where Biden was in 2023 (between 25% and 32%).\n\nAWashington Post-ABC News-Ipsos polllast week showed majorities said Trump didn’t have the mental sharpness (56%) or physical health (51%) it takes to serve effectively.\n\nThe former is up 13 points from May 2023, while the latter is up even more – by 23 points.\n\nThose numbers aren’t where Biden was late in his presidency, when he was in the 60s on both measures. But the percentage who doubts Trump’s mental sharpness (56%) is actually similar to where Biden was at this point in his term. InFebruary 2022, Biden was at 54% on this question.\n\nAnd, finally, is aPew Research Center surveyconducted last month.\n\nIt showed the percentage of Americans who are at least “very confident” that Trump has the mental fitness to do the job dropping from 39% a year ago to 32% today.\n\nThe percentage who are at least “very confident” that he has the physical fitness has dropped from 35% to 28%.\n\nAnd similar to the Reuters-Ipsos poll, the numbersamong Republicans and Republican-leaning independentsshould raise some eyebrows. The percentage of them who are “very confident” in Trump’s mental fitness has dropped from 75% to 66%. On physical fitness, he’s dropped from 65% to 55%.\n\nSo in both the Reuters and Pew polls, we’re seeing 3 in 10 people (or more) in Trump’s own base express some concern about this issue.\n\nAgain, Biden had worse numbers overall. ByApril 2024, the percentage of voters saying they were “very confident” was only 21% for mental fitness and 15% for physical fitness.CNN pollingshowed as much as half of his base said Biden didn’t have the requisite stamina and sharpness.\n\nBut why might Trump’s numbers on these measures be worsening?\n\nOne explanation is that they’re simply falling alongside his popularity. As people sour on Trump overall, perhaps they’re more likely to view his often-strange public performances in a more negative light.\n\nBut we’re also seeing these concerns register even with some Americans who are more inclined to view Trump favorably. It’s certainly possible that his verbal stumbles — things like repeatedly mixing up Iceland and Greenland — are registering. It’s also possible that scrutiny of bruises on Trump’s hands and whether he’s fallen asleep during public events — as well as theWhite House’sslow disclosuresabout his medical testing and hismore limitedpublic schedule— are leading some people to raise more questions than they otherwise might.\n\nRegardless, what’s clear is that the oldest president ever elected is now having to deal with this issue, just like the previous holder of that title did a few years ago.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/politics/what-to-watch-sotu-time",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/speech-time-length-trump-sotu-vis",
      "text": "the longest speech to Congress"
    },
    {
      "url": "https://www.reuters.com/world/us/most-americans-say-trump-is-growing-erratic-with-age-reutersipsos-poll-finds-2026-02-24/",
      "text": "Reuters-Ipsos poll"
    },
    {
      "url": "https://www.washingtonpost.com/politics/2024/10/15/how-big-problem-is-mental-acuity-trump/",
      "text": "question his mental acuity"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2023-09/Reuters%20Ipsos%20Large%20Sample%20Poll%20%235%20Topline%2009%2020%202023.pdf",
      "text": "54% in September 2023"
    },
    {
      "url": "https://www.ipsos.com/en-us/only-michelle-obama-bests-trump-alternative-biden-2024",
      "text": "July 2024"
    },
    {
      "url": "https://s3.documentcloud.org/documents/26490187/cnn-poll-on-trump-at-one-year.pdf",
      "text": "declining from 53% in late 2023 to 46% today"
    },
    {
      "url": "https://www.ipsos.com/sites/default/files/ct/news/documents/2026-02/2026-02-22%20ABC-Post-Ipsos%20Topline.pdf",
      "text": "Washington Post-ABC News-Ipsos poll"
    },
    {
      "url": "https://abcnews.com/Politics/economic-concerns-hurt-bidens-approval-democrats-peril-ahead/story?id=83128327",
      "text": "February 2022"
    },
    {
      "url": "https://www.pewresearch.org/short-reads/2026/01/29/few-americans-support-trumps-proposed-takeover-of-greenland/",
      "text": "Pew Research Center survey"
    },
    {
      "url": "https://www.pewresearch.org/politics/2026/01/29/views-of-trump-2026-appendix-additional-charts/",
      "text": "among Republicans and Republican-leaning independents"
    },
    {
      "url": "https://www.pewresearch.org/politics/2024/04/24/voters-views-of-biden-and-trump/",
      "text": "April 2024"
    },
    {
      "url": "https://s3.documentcloud.org/documents/24131320/cnn-poll-on-2024.pdf",
      "text": "CNN polling"
    },
    {
      "url": "https://www.cnn.com/2025/12/31/politics/health-trump-bruises-left-hand",
      "text": "White House’s"
    },
    {
      "url": "https://www.cnn.com/2026/01/03/politics/trump-health-disclosures-questions",
      "text": "slow disclosures"
    },
    {
      "url": "https://www.nytimes.com/2025/11/25/us/politics/trump-age-health.html",
      "text": "more limited"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/politics/public-schedule-trump-health-stamina",
      "text": "public schedule"
    }
  ],
  "hash": "b2158d2e675e1a82f9857e0b444dd0f9a8d0832a4310b3fee65421a5922c9281",
  "scraped_at": "2026-02-28T07:01:50.061538+00:00"
}