{
  "url": "https://lite.cnn.com/2026/02/16/business/us-stocks-dow-howard-silverblatt",
  "title": "He worked on Wall Street for nearly 50 years. Here’s what he learned about your finances | CNN Business",
  "date": "2026-02-17T07:30:41.386651+00:00",
  "authors": [
    "John Towfighi, CNN"
  ],
  "text": "Source: CNN\n\nWhen Howard Silverblatt first started working on Wall Street, the S&P 500 was at 99.77 points. The week before he retired, the benchmark index was up by 70 times that, to 7,000.\n\nThat’s an eye-popping increase — but maybe not surprising, considering Silverblatt started his career on May 17, 1977.\n\nThis January Silverblatt hung up his hat after a nearly 49-year run at Standard & Poor’s — now S&P Dow Jones Indices. He’s a legend on Wall Street as a markets analyst, a trusted source for journalists, and a well-documented data wizard.\n\nIt’s all left him uniquely positioned to share the lessons he’s learned from a career stretching across booms, busts, and a transformation in investing. As for the Dow, the blue-chip index traded in the 900s when Silverblatt began his career, and crossed 50,000 points one week after his retirement.\n\nSilverblatt, a native of Brooklyn, New York, spoke with CNN by phone from Florida.\n\nKnow what you’re buying — and know the risks.\n\nThere are fewer publicly traded companies on the stock market now than when Silverblatt began his career in the ’70s. But there are endless offerings of exchange-traded funds, derivatives and other securities that investors can buy and sell in an instant. That has made it all the more critical for investors to remain vigilant about where they’re putting their money, he said.\n\nRecord highs in the stock market — which the Dow and S&P recently hit — are great opportunities to review your portfolio and ensure it is well-diversified.\n\n“Am I still on track with what I want, and all my allocations? Or did the market change it? And do I want to change it back?” he said. “You really need to know your risk tolerance and liquidity.”\n\nSilverblatt said he was always good with numbers, stemming from his father’s job as a tax accountant.\n\n“I remember, literally, my first job was at home when I’m seven, eight years old, putting physical checks in order,” he said.\n\nAfter graduating from Syracuse University, Silverblatt entered a training program at S&P  in downtown Manhattan in the late 1970s.\n\nSilverblatt stayed at the company for the entirety of his career. He said developments in communications, information and technology were the most notable shifts across his career, and it is reflected in the US market: There are 10 American companies worth more than $1 trillion, and eight of those are tech companies.\n\nThe Dow reaching 50,000 is an amazing milestone, Silverblatt said. But he noted a key fact of the math — a 1,000-point increase from 49,000 to 50,000 is a change of 2%. It’s much less significant than, say, the Dow going from 1,000 to 2,000, which is a 100% increase. It’s a reminder to keep your eye on percent changes in the market instead of points.\n\nOver time, as the Dow hitting 50,000 exemplifies, the market tends to climb higher. As for market exuberance, Silverblatt emphasized the need for investors to be cautious and well-informed.\n\nSilverblatt said Black Monday — the biggest single-day stock market drop in history on October 19, 1987 — still stands out as one of the most eye-opening and memorable moments of his career. The S&P 500 plunged 20.47% in one day.\n\nHe remembers it as an analyst — and as a personal investor. He didn’t lose anything that fateful Monday, he joked, because he‘d already sold everything by Friday.\n\nAfter Black Monday, two memorable Wall Street moments for Silverblatt were Lehman Brothers and Bear Sterns going under amid the 2008 financial crisis, and the advent and development of brokerage houses and how they changed access to the stock market.\n\n“It’s not so much about making money in the good times,” he said. “It’s holding on to it in the bad times.”\n\nJust look at retirement assets, Silverblatt said. He is retiring with a pension, or direct benefit plan, in addition to his 401(k). The rise of 401(k)s and individual retirement accounts means most Americans these days only have their invested retirement plan, and not a defined pension.\n\nThat’s great for bolstering your retirement savings but brings with it more responsibility to manage their risk.\n\nDirect and indirect stock holdings, including mutual funds or retirement plans, accounted for an all-time high of 45% of households’ financial assets in the second quarter of 2025, according to Federal Reserve data.\n\n“Risk is one of the major items I think people sometimes ignore,” he said. “We all want to go up, but how are we going to do when we go down?”\n\nSilverblatt said he is looking forward to reading more, including the works of William Shakespeare. He also said he is eager to play more chess, read  more books, attend talks at his local economics club and perhaps pick up new hobbies like golf.\n\nMath was always his best subject through school, he said. “I was a geek from the beginning,” he said. “And worse than just a number geek… I was captain of my chess team, so I was a double geek.”\n\n“I do not play golf, but I may take it up,” he said. “I will definitely play more chess. I got a couple of projects to help some friends out as far as the market goes… and then I have to figure out what I’m doing, that’s true, but definitely not 60-hour weeks.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/us-stocks-dow-howard-silverblatt",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/business/us-stocks-dow-howard-silverblatt",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b251ef2c435fa94f5b33ce82b6be34372d869f2b9f868f450498fecc2d72d268",
  "scraped_at": "2026-02-17T07:30:41.386663+00:00"
}