{
  "url": "https://lite.cnn.com/2026/02/27/us/shah-alam-death-new-york-border-patrol-wwk-hnk",
  "title": "Nurul Amin Shah Alam: What we know about the Rohingya refugee’s death in New York | CNN",
  "date": "2026-02-28T06:58:48.356011+00:00",
  "authors": [
    "Hanna Park",
    "Alisha Ebrahimji",
    "Elise Hammond"
  ],
  "text": "Source: CNN\n\nThe death of aRohingya refugeein Buffalo, New York, has raised pressing questions about how federal immigration agents handled his release from their custody — and what happened in the five days he was missing before his body was found.\n\nNurul Amin Shah Alam, 56, who spoke little English and was nearly blind, was released from the Erie County Holding Center on February 19. Border Patrol agents briefly took custody of him on an immigration detainer before determining he shouldn’t be deported and, later that night, dropped him at a closed coffee house alone in near freezing temperatures. His body was found on February 24, about four miles away.\n\nUS Customs and Border Protection has defended the agents’ actions, but local and state leaders are calling for investigations.\n\nMeanwhile, Shah Alam’s friends and family gathered at a mosque Thursday for his funeral, offering prayers before accompanying him to a cemetery for burial.\n\n“We do not want his death to just go to waste,” Khaleda Shah, a spokesperson for the family, told theAssociated Press. “We want his death to bring awareness to his community, his family, his community at large. We want his name, his story to be a voice for those who are still suffering.”\n\nThe case comes amid growing concerns about the constitutional protections andtreatmentof people who come into contact with federal immigration authorities, regardless of their immigration status, under the Trump administration’smass deportationefforts.\n\nHere’s what we know — and don’t know — about his death:\n\nShah Alam entered the US as a refugee on December 24, 2024, according to US Customs and Border Protection. He and his family areArakan Rohingya, a persecuted Muslim minority from Myanmar that the US government has said was subjected to genocide.\n\nShah Alam previously worked in construction in Malaysia and came to the US with his wife and two children, searching for opportunity, Imran Fazal, who knows the family, toldCNN affiliate Spectrum News Buffalo.\n\nShah Alam’s son, Mohamad Faisal, told CNN he last saw his father on February 19, before he was released from jail.\n\nFaisal toldReutersthat Shah Alam did not read, write or use electronic devices.\n\nWhat we don’t know:\n\nShah Alam was arrested in February 2025 when a homeowner called police because they saw him in their backyard. Shah Alam’s son told Reuters the arrest was the result of a misunderstanding with police officers.\n\nHe had gone for a walk using a curtain rod as a walking stick, became lost and wandered onto private property, Faisal told Reuters. While on the property, the police report said, he damaged a shed door and “allowed the homeowner’s dog to escape through an open gate.”\n\nWhen officers arrived and ordered Shah Alam to drop the rod, he did not comply because he did not understand them, his son said.\n\nBody camera video obtained by CNN shows Shah Alam holding what appears to be two long black sticks in the backyard of a home when two female officers approach him and one yells, “Hey, what are you doing?”\n\nShah Alam doesn’t immediately say anything and one officer gets closer to him, yelling “drop it” three times. Shah Alam, then walking slowly toward the officers, says “OK sorry” several times as the officers continue to command he put the sticks down and warn they’ll use their stun guns if he doesn’t comply.\n\nAbout a minute passes before the officers fire their stun guns, Shah Alam is seen waving the sticks in the air while speaking another language, and the officers tackle him.\n\nTwo officers suffered minor injuries, according to the police report, which also said Shah Alam bit one officer on the arm and another on the hand while they took him into custody. The video doesn’t clearly depict that moment, but it shows the officers struggling for some time with Shah Alam and punching him on the head multiple times as they attempt to restrain him.\n\nHe was later indicted on felony assault, burglary and criminal mischief charges, the Erie County District Attorney’s Office said.\n\nEarlier this month, he pleaded guilty to two misdemeanor charges: criminal possession of a weapon in the fourth degree and criminal trespass in the third degree. Sentencing was scheduled for March 24.\n\nErie County District Attorney Michael Keane said his office reduced the charges after considering Shah Alam’s medical condition, time served and the “significant collateral consequences that would result from a felony conviction — including mandatory deportation.”\n\nWhat we don’t know:\n\nShah Alam’s bond had been set at $5,000. His family initially declined to post bail, fearing a federal immigration detainer would result in his transfer to immigration custody, according to theLegal Aid Bureau of Buffalo, which represented Shah Alam.\n\nFollowing the plea deal, an immigration lawyer was consulted and the family posted bond after being advised it would not place Shah Alam at risk of deportation, the legal aid statement said.\n\nAs Shah Alam’s release was being processed on February 19, Erie County deputies notified Border Patrol because of the detainer, the Erie County Sheriff’s Office said.\n\nBorder Patrol agents arrived as Shah Alam’s release was being processed and took him into their custody.\n\nWhat we don’t know:\n\nLater that day, immigration authorities determined Shah Alam, as a legal refugee, “was not amenable to removal,” Customs and Border Protection said in a statement.\n\nUsing a translation program, agents attempted to communicate with Shah Alam, according to a federal law enforcement official. Shah Alam was offered the opportunity to make a phone call, but declined, and asked to be taken to the location where he was eventually dropped off, the official said.\n\n“Border Patrol agents offered him a courtesy ride, which he chose to accept to a coffee shop, determined to be a warm, safe location near his last known address, rather than be released directly from the Border Patrol station. He showed no signs of distress, mobility issues, or disabilities requiring special assistance,” the CBP statement said.\n\nAccording to legal aid, Shah Alam was dropped off at a Tim Hortons near his last known address sometime after 8 p.m., though that location had already closed at 7 p.m. His family no longer lived at the prior address, and neither relatives nor his attorney were told he had been released by CBP or where was taken, the organization said.\n\n“Mr. Alam was extremely vulnerable. He spoke almost no English and could not communicate without the aid of an interpreter. He suffered from severely impaired vision and had other health issues,” the legal aid statement said.\n\n“He had only been in the US for a few months prior to his arrest. He would not have known where he was or had the wherewithal to contact his family or avail himself of other resources or services that could have assisted him,” the statement continued.\n\nBuffalo Mayor Sean Ryan criticized Shah Alam’s release by Border Patrol, saying agents could have contacted family members or returned him to the county holding center. There, they could have obtained phone numbers for his son or lawyer, who had both been active visitors while he was in custody, according to Ryan.\n\nThe Department of Homeland Security pushed back Friday in apost on Xsaying, “It is ridiculous to blame Border Patrol for an individual’s death a week after their last interaction with them.”\n\nThe agency emphasized Shah Alam accepted a courtesy ride from federal agents, which “did not have to be provided.”\n\nOne immigration attorney told CNN affiliateWGRZcourtesy rides are not uncommon. Agents are supposed to make sure the drop-off location is safe and determine if the person needs any accommodations, according to Rosanna Berardi, managing partner of Berardi Immigration Law.\n\nWhat we don’t know:\n\nShah Alam’s attorney reported him missing to police three days after he was released, on February 22, telling officers he couldn’t “confirm his client’s location despite contacting federal authorities,” police said.\n\nPolice briefly closed the case after determining Shah Alam had been transferred to federal custody then reopened it when they learned he had been released.\n\nAfter his missing person case was reopened and police issued a public notice about his disappearance, someone called 911 around 8:30 p.m. on February 24 to report a man on a downtown street who appeared not to be breathing.\n\nThe man, later identified as Shah Alam, was wearing a dark parka and khaki pants, a police statement said. A woman told responding officers she’d seen the man about three hours earlier at the same location and he was moving at that time.\n\nFirst responders attempted life-saving measures, but he was pronounced dead at the scene.\n\nHis cause of death is unknown.\n\nA city spokesperson said Wednesday the death appeared health-related and exposure and homicide had been ruled out. But on Thursday, Ryan, the mayor, said the medical examiner had not yet released its full findings.\n\nThe Erie County Health Department told CNN medical examiner records are treated as confidential medical records and would only be shared with law enforcement and others legally entitled to them.\n\nShah Alam did not have shoes on, just orange booties from the detention center, when he was dropped off by agents, said Ryan, citing preliminary information.\n\nThe day Shah Alam was dropped off at the coffee shop, the area saw light freezing rain with temperatures in the low 30s. There was snow and fog over the next two days, with temperatures hovering around freezing for at least 24 consecutive hours.\n\nThe police cameras in the area had been offline since that day “due to prior criminal mischief to infrastructure” supporting the camera network, police said in a Thursday statement.\n\nWhat we don’t know:\n\nRyan has sharply criticized Border Patrol’s actions in the case, calling it “an inhumane thing to do,” and insisted that CBP must “answer for how and why this happened.”\n\nMark Riccobono, president of theNational Federation of the Blind, called Shah Alam’s death “a somber reminder of why accessible, disability‑aware practices are essential across all stages of custody and release” and urged authorities to investigate what accommodations were provided to Shah Alam.\n\nThe organizationsaidthe incident highlights an urgent need to review procedures in place for blind people as they interact with law enforcement, immigration authorities or detention facilities.\n\nThe Buffalo Police Department said its homicide detectives are looking into the timeline and circumstances leading to Shah Alam’s death.\n\n“The death of Nurul Amin Shah Alam is a horrific and heartbreaking tragedy,” US Rep. Tim Kennedy, whose district includes Buffalo, said Thursday, calling for a “full and transparent investigation at the local, state, and federal levels.”\n\nNew York Attorney General Letitia James said her office “is reviewing our legal options,” according to a statement.\n\nCNN has reached out to CBP for more information.\n\nWhat we don’t know:\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/us/shah-alam-blind-refugee-border-patrol-hnk",
      "text": "Rohingya refugee"
    },
    {
      "url": "https://apnews.com/article/buffalo-new-york-refugee-death-b2d29a7bdfaa0ffd99d4c6ba7e85e8a6",
      "text": "Associated Press"
    },
    {
      "url": "https://www.cnn.com/2026/02/27/us/ice-deportation-officers-training-agents-invs",
      "text": "treatment"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/trump-immigration-strategy-homan-bovino",
      "text": "mass deportation"
    },
    {
      "url": "https://www.cnn.com/specials/asia/rohingya",
      "text": "Arakan Rohingya"
    },
    {
      "url": "https://spectrumlocalnews.com/nys/buffalo/news/2026/02/26/mayor-ryan-sounds-off-after-disabled-refugee-is-found-dead-in-buffalo",
      "text": "CNN affiliate Spectrum News Buffalo"
    },
    {
      "url": "https://www.reuters.com/world/us/near-blind-refugee-found-dead-buffalo-after-release-by-us-border-patrol-2026-02-26/",
      "text": "Reuters"
    },
    {
      "url": "https://www.facebook.com/photo/?fbid=1497037545758474&set=pcb.1497038885758340",
      "text": "Legal Aid Bureau of Buffalo"
    },
    {
      "url": "https://x.com/DHSgov/status/2027453843538399655?s=20",
      "text": "post on X"
    },
    {
      "url": "https://www.wgrz.com/article/news/local/refugees-death-raises-questions-border-patrol-release/71-88b611e0-664b-4b3b-835a-b39cb7f28e91",
      "text": "WGRZ"
    },
    {
      "url": "https://nfb.org/about-us/press-room/statement-regarding-death-nurul-amin-shah-alam",
      "text": "National Federation of the Blind"
    },
    {
      "url": "https://nfb.org/about-us/press-room/statement-regarding-death-nurul-amin-shah-alam?fbclid=IwY2xjawQOzuBleHRuA2FlbQIxMQBicmlkETFWMDN0empqdGRlaTh4c3Rac3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHlLmWI9Ui9Fsv-FdCwbtnu-qLyZUZg2YUQ5Qhq3lWETKgGAgmXZckcELY632_aem_rRZyGQP74oVmGUZn9m0wmw",
      "text": "said"
    }
  ],
  "hash": "b2c240b48a28c03a72668ad1a96876e09d0a20400ea2f89e84fdbfd21969c449",
  "scraped_at": "2026-02-28T06:58:48.356022+00:00"
}