{
  "url": "https://lite.cnn.com/2026/02/25/economy/minneapolis-housing-industry-ice-immigration-impact",
  "title": "‘This is misery for us:’ New home construction stalls after immigration crackdown in Minnesota | CNN Business",
  "date": "2026-02-26T07:32:14.434972+00:00",
  "authors": [
    "Samantha Delouya"
  ],
  "text": "Source: CNN\n\nRoofers are turning down jobs. Painters are locking themselves inside the homes they’re finishing. Concrete crews have monthslong waiting lists.\n\nIn the Twin Cities and surrounding suburbs, the Trump administration’s immigration crackdown has slowed home construction to a crawl – at a time when Minnesota, like much of the country, faces a steep housing shortage.\n\nThe White House has begun scaling back its monthslong enforcement surge in the state. But across the housing market, the aftershocks are still unfolding.\n\n“I think most of us would probably take Covid over this,” said one large homebuilder in the Minneapolis area who asked for his name not to be shared since some of his job sites have been targeted by immigration officers over the last few weeks. “This is misery for us in the housing industry.”\n\nPresident Donald Trump has made housing affordability a central pillar of his domestic agenda, and the US House of Representatives passed legislation this month intended to encourage more homebuilding. But the president’sstepped-up immigration enforcementthreatens to undercut that effort, sidelining the workers needed to build new homes.\n\nAs in many other states, the construction industry in Minnesota is heavily reliant on immigrant labor.\n\nThe homebuilder, who oversees hundreds of residential projects across the Midwest, said many of his jobs are now facing monthslong delays as dozens of construction crews hesitate to return. He said US Immigration and Customs Enforcement officers were stationed at the site of one of his large apartment construction projects for weeks, waiting to make arrests. More than nine crews walked off the job after seeing the officers, he said. At one point this month, only six of the 80 roofers he had contracted were still showing up, regardless of their immigration status.\n\nEven in the days after the White House announced that the immigration operation in Minnesota would wind down, the builder said there were still interactions with ICE around his job sites.\n\n“In real dollars, we’re seeing a decline in revenues of somewhere between 25% and 30% – and that’s directly attributed to the fact that we can’t put work in place,” he said.\n\nAt its height, about 3,000 federal officers were deployed as part of Operation Metro Surge, the large-scale immigration operation primarily carried out by ICE and Customs and Border Protection.\n\nWhat began in December in Minneapolis and St. Paul quickly spread to the rest of the state and led to confrontations between federal agents and protesters, including thefatal shootings of two US citizensby federal agents and the detention of thousands of individuals.\n\nAcross the US, immigrants play an outsized role in the construction industry: According to a recentreportfrom the National Association of Home Builders, immigrant workers account for more than 25% of the construction workforce, a historic high. It is unclear how many of those workers are undocumented.\n\nBuilders in Minnesota told CNN they estimate thousands of construction workers, both documented and undocumented, are avoiding work for fear of harassment, detainment, or violent confrontations.\n\nTenants’ rights groups say eviction filings could rise if renters who fear going to work fall behind on rent payments. Last week, the Minneapolis Park and Recreation Board voted to temporarily suspend evictions for its rental properties in response to Operation Metro Surge,accordingto the Minnesota Star Tribune.\n\nMark Williams, a custom-home builder in Minneapolis, said skilled construction workers have been harder to come by lately – and he has struggled to break ground on some construction projects.\n\n“We work with three concrete masons, and two of them pushed us out by two months because they couldn’t get any of their crews to show up on any of our jobs,” Williams said. “They often sub-contract out to other masons, and none of those masons would show up, either.”\n\nWilliams typically signs a contract with a roofing company about 30 days before he needs them to start the work. But recently, the siding and roofing company he normally works with told him they’ll need at least four to five months’ noticein order to guarantee they’ll have the crew necessary to complete the work. He has had to tell clients that their projects will be delayed.\n\nWilliams said that, to his knowledge, everyone who works on his homes is legally allowed to work in the country. But his company, like many other homebuilders, contracts out tasks it can’t perform itself, so he doesn’t directly hire all the laborers on site.\n\nBarak Steenlage, the co-owner of another Minnesota homebuilder, said that he has also fielded calls since the start of this year from his company’s project manager, informing him that certain subcontractors or suppliers don’t want to work on projects in Minneapolis, for fear of being harassed, regardless of their immigration status.\n\nFor teams of painters and other construction work that is done primarily indoors, Steenlage said he has given crews permission to lock themselves inside the homes they are working on, so they aren’t visible to agents outside.\n\nSteenlage, who has worked as a homebuilder for more than 20 years, said that without immigrants in construction, there wouldn’t be enough people to handle the work.\n\nA fall 2025reportfrom the NAHB on the current state of the nation’s construction labor market estimated a $2.7 billion annual impact on the national economy due to longer construction times caused by the industry’s skilled labor shortage.\n\n“There’s a lot of important skill and work being done by the people that are currently feeling under attack and unsafe,” Steenlage said.\n\nWilliams said that recent ICE activity could make homebuilding even more expensive in Minnesota, a state that is already relatively more expensive to build in, due to the need for specialized construction to handle the area’s extreme temperature fluctuations.\n\n“If everyone wants their roof sided and no one is going to do it, anyone that can do it will charge whatever they want,” Williams said. “Building is already unaffordable. Now it could be astronomically unaffordable.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/20/politics/trump-immigration-strategy-homan-bovino",
      "text": "stepped-up immigration enforcement"
    },
    {
      "url": "https://www.cnn.com/2026/01/29/us/immigration-agents-shooting-alex-pretti-invs",
      "text": "fatal shootings of two US citizens"
    },
    {
      "url": "https://www.nahb.org/blog/2025/10/hbi-labor-market-report?utm_source=chatgpt.com",
      "text": "report"
    },
    {
      "url": "https://www.startribune.com/minneapolis-park-board-ice-eviction-moratorium/601585085",
      "text": "according"
    },
    {
      "url": "https://hbi.org/wp-content/uploads/2025/10/Fall-2025-Final-Construction-Labor-Market-Report-Update.pdf?fbclid=IwY2xjawNUoxJleHRuA2FlbQIxMABicmlkETFqbm9EaU5tMDdnMFNNTjVUAR4Da_nAomm_0xxl93AaN9rEVampUOG6JyDK6o_cJNXZ1iHWuX6hAsDn0XKPOA_aem_XaQXyNtVGheh9eQ_-SepGw",
      "text": "report"
    }
  ],
  "hash": "b2f6599882db2085825fb22bf77e938699c26f0729e87bae12e64fa46d877e88",
  "scraped_at": "2026-02-26T07:32:14.434984+00:00"
}