{
  "url": "https://lite.cnn.com/2026/02/24/us/justice-department-ucla-lawsuit-antisemitism",
  "title": "Justice Department suit accuses UCLA of failing to protect Jewish employees from campus hostility | CNN",
  "date": "2026-02-25T07:31:50.222818+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nThe Justice Department is suing the University of California over allegations that UCLA failed to protect Jewish employees from antisemitic harassment amid pro-Palestinian protests that roiled the campus in 2023 and 2024.\n\nThe lawsuit, filed Tuesday in California, is the latest escalation in the Trump administration’s campaign to punish top universities that it says have been soft on antisemitism. The suit accuses the University of California, Los Angeles of failing to discipline those who were involved in protests, including dozens who were arrested in 2024 for failing to leave a campus encampment.\n\nA UC spokesperson referred a request for comment to UCLA, which did not immediately respond to messages seeking comment.\n\nTrump officials previously determined UCLA failed to protect Jewish students, and last year UCLA reached a $6 millionsettlementwith three Jewish students and a Jewish professor who sued the university. The new lawsuit alleges the harm to Jewish and Israeli employees “goes much deeper” than that settlement addressed.\n\n“The United States will now do what UC has thus far failed to do: protect Jewish and Israeli employees” from antisemitic harassment, the suit said.\n\n“UCLA’s administration turned a blind eye to — and at times facilitated — grossly antisemitic acts and systematically ignored cries for help from its own terrified Jewish and Israeli employees,” the Justice Department alleges in its 81-page lawsuit.\n\nMuch of the complaint focuses on the2024 protest encampmentthat federal officials say blocked Jewish employees and students from parts of campus and included antisemitic signs and chants. One night, counterprotesters attacked the encampment, throwing traffic cones and firing pepper spray, with fighting that continued for hours, injuring more than a dozen people, before police stepped in. The next day, after hundredsdefied ordersto leave,more than 200 people were arrested.\n\nThe lawsuit alleges UCLA violated its own policies by tolerating the encampment and accuses the university of failing to discipline any students, faculty or staff over antisemitic behavior.\n\nThe suit asks a judge to force UCLA to enforce its own anti-discrimination policies and to “award damages,” without specifying an amount, to Jewish employees at UCLA who faced a hostile work environment.\n\nThe Trump administration has primarily focused on elite private universities in its campaign to win obedience from campuses it accuses of liberal and antisemitic bias. UCLA is one of the few public universities targeted in that effort.\n\nLast summer the Trump administration said it was seeking$1 billionfrom UCLA as part of a settlement to end federal scrutiny. Trump officials had cuthundreds of millions of dollarsin federal funding from the university, though a federal judge ordered the money to be restored in September.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/ucla-settlement-jewish-students-professor-protest-suit-216b78e0ea29e529668aecf5d1019b47",
      "text": "settlement"
    },
    {
      "url": "https://apnews.com/article/ucla-palestine-gaza-protests-783ea2f4ba88a8cfa2fa15c5ae5ba611",
      "text": "2024 protest encampment"
    },
    {
      "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-c6e5549532c85f13493daa22d0d143ac",
      "text": "defied orders"
    },
    {
      "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-ec3f62c51c08599f8fcecd99f7cf9e33",
      "text": "more than 200 people were arrested"
    },
    {
      "url": "https://apnews.com/article/trump-administration-ucla-ec848b4bee5c184f29dba9d7181904a1",
      "text": "$1 billion"
    },
    {
      "url": "https://apnews.com/article/ucla-trump-funding-cuts-research-antisemitism-0c95177d6fb64695f9f707079fee4e8e",
      "text": "hundreds of millions of dollars"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/justice-department-ucla-lawsuit-antisemitism",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/us/justice-department-ucla-lawsuit-antisemitism",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b346c220b7dce378edca8d8a42ecfe1f49e0c7a84da86cdf5bc1cd4fe7994b23",
  "scraped_at": "2026-02-25T07:31:50.222830+00:00"
}