{
  "url": "https://lite.cnn.com/2026/02/16/us/lac-la-belle-wreck-lake-michigan",
  "title": "Searchers find wreck of luxury steamer lost in Lake Michigan more than 150 years ago | CNN",
  "date": "2026-02-17T07:30:55.908853+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nSearchers have discovered the wreck of a luxury steamer that sank in a Lake Michigan gale in the late 19th century, completing a quest that began almost 60 years ago.\n\nShipwreck World, a group that works to locate shipwrecks around the globe, announced Friday that a team led by Illinois shipwreck hunter Paul Ehorn found theLac La Belleabout 20 miles (32 kilometers) offshore between Racine and Kenosha, Wisconsin, in October 2022.\n\nEhorn told The Associated Press in a phone interview on Sunday that the announcement was delayed because his team wanted to include a three-dimensional video model of the ship with it, but poor weather and other commitments kept his dive team from going back down to the wreck until last summer.\n\nEhorn, 80, has been searching for shipwrecks since he was 15 years old. He said that he’s been trying to pinpoint the Lac La Belle’s location since 1965. He used a clue from fellow wreck hunter and author Ross Richardson in 2022 to narrow down his search grid and found the ship using side-scan sonar after just two hours on the lake, he said.\n\n“It’s kind of a game, like solve the puzzle. Sometimes you don’t have many pieces to put the puzzle together but this one worked out and we found it right away,” he said. The finding left him “super elated.”\n\nEhorn declined to discuss the clue that led to the discovery. Richardson said in a short telephone interview Sunday that he learned that a commercial fisherman at a “certain location” had snagged what Richardson called an item specific to steam ships from the 1800s. He declined to elaborate further how competitive shipwreck hunting has become and said the information could alert searchers to another way to conduct research.\n\nAccording to an account on Shipwreck World, the Lac La Belle was built in 1864, in Cleveland, Ohio. The 217-foot (66-meter) steamer ran between Cleveland and Lake Superior but sank in the St. Clair River in 1866 after a collision. The ship was raised in 1869, and reconditioned.\n\nThe ship left Milwaukee for Grand Haven, Michigan, in a gale on the night of October, 13, 1872, with 53 passengers and crew and a cargo of barley, pork, flour and whiskey. About two hours into the trip, the ship began to take on water uncontrollably. The captain turned the Lac La Belle back toward Milwaukee but huge waves came crashing over her, extinguishing her boilers. The storm drove the ship south. Around 5 a.m., the captain ordered lifeboats lowered and the ship went down stern-first.\n\nOne of the lifeboats capsized on the way to shore, killing eight people. The other lifeboats made landfall along the Wisconsin coast between Racine and Kenosha.\n\nThe wreck’s exterior is covered with quagga mussels and the upper cabins are gone, Ehorn said, but the hull looks intact and the oak interiors are still in good shape.\n\nThe Great Lakes are home to anywhere from6,000 to 10,000 shipwrecks, most of which remain undiscovered, according to the University of Wisconsin-Madison’s Wisconsin Water Library. Shipwreck hunters have been searching the lakes with more urgency in recent years out of concerns that invasive quagga mussels are slowly destroying wrecks.\n\nThe Lac La Belle is the 15th shipwreck Ehorn has located. “It was one more to put a check mark by,” he said. “Now it’s on to the next one. It’s getting harder and harder. The easier ones have been found.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.shipwreckworld.com/articles/pioneer-wreckhunter-finds-lake-michigan-passenger-steamer-lost-for-130-years",
      "text": "Lac La Belle"
    },
    {
      "url": "https://waterlibrary.aqua.wisc.edu/the-recently-discovered-shipwrecks-of-the-great-lakes/",
      "text": "6,000 to 10,000 shipwrecks"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/lac-la-belle-wreck-lake-michigan",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/us/lac-la-belle-wreck-lake-michigan",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b3a039c8b485352cc81cf36de82e2bc6e25ddf550aaeed5ab68a2d0c187f2e53",
  "scraped_at": "2026-02-17T07:30:55.908866+00:00"
}