{
  "url": "https://lite.cnn.com/2026/02/09/sport/serena-williams-eligible-for-tennis-comeback",
  "title": "Serena Williams is eligible to return to tennis later this month. It’s not clear if she will | CNN",
  "date": "2026-02-11T16:34:11.070130+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nSerena Williams passed another stage on the path to a possible comeback to professional tennis, being listed Monday by the sport’s drug-testing organization as eligible to return to competition on February 22.\n\nThat is six months after the 23-time grand slam singles champion initially registered with the International Tennis Integrity Agency.\n\nWilliams, who is 44, was listed on the ITIA website’s reinstatement page Monday, a development first reported by Bounces.\n\nWhat was not immediately known was when or where – or, truly, whether – Williams actually will play again.\n\nWhen it was revealed last year that Williams had signed up with ITIA to return to the drug-testing pool, she wrote on social media: “Omg yall I’m NOT coming back. This wildfire is crazy.”\n\nHer agent did not immediately return a request for comment Monday. Neither did a spokesperson for the WTA Tour.\n\nLast year, when word emerged that Williams had made an initial move required for a return, US Tennis Association spokesman Brendan McIntyre said: “If Serena decides to return and compete at the professional level, together with her fans, we will enthusiastically welcome the return of one of the greatest champions in the history of our sport.”\n\nWilliams, one of the greats of the game, has not competed since bidding farewell at the 2022 US Open. At the time, Williams said she didn’t want to use the word “retiring” and instead declared that she was “evolving” away from tennis.\n\nAthletes returning to testing need to provide information on their whereabouts – details on their location when they are not at an official event and times when they are available to give samples. Someone who retires while they are on the list and later comes back needs to be available for testing for six months before they are allowed to return to competition.\n\nWilliams’ older sister, Venus, returned to competition last July at age 45 after nearly 1 1/2 years away from the tour; she never had announced her retirement. At the US Open, Venus became the oldest player to play singles at the American grand slam tournament since 1981.\n\nWhen Venus, a seven-time major singles champion, came back at the DC Open, she spoke about wishing Serena would join her back on tour. They claimed 14 grand slam doubles titles as a pair.\n\n“I keep saying to my team: The only thing that would make this better is if she was here. Like, we always did everything together, so of course I miss her,” Venus said at the time when asked about a video on social media that showed Serena swinging a racket. “But if she comes back, I’m sure she’ll let y’all know.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/sport/serena-williams-eligible-for-tennis-comeback",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/sport/serena-williams-eligible-for-tennis-comeback",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b3e45d5f81edf4aaa3b023bdf0a1b619f5b2b8d7c12b69c4358d8f6a5f1b58e2",
  "scraped_at": "2026-02-11T16:34:11.070143+00:00"
}