{
  "url": "https://lite.cnn.com/2026/02/16/business/ai-disruption-fears-us-stocks",
  "title": "Why the ‘AI scare trade’ might not be done | CNN Business",
  "date": "2026-02-17T07:31:00.047206+00:00",
  "authors": [
    "John Towfighi, CNN"
  ],
  "text": "Source: CNN\n\nA sell-off rippled through software, real estate and trucking stocks this past week as investors worried artificial intelligence could upend some industries — and analysts say the white-knuckle drops might not be over yet.\n\nSoftware stocks bore the initial brunt of AI disruption nerves. But those fears soon spread to insurance companies, brokerage firms, real estate services — even logistics and trucking.\n\n“Market is in shoot first, ask questions later mode, with any names/sectors that could be impacted by AI disruption taking a hit,” Mohit Kumar, a strategist at Jefferies, said in a note.\n\nThe slump in shares points out a major change for investors going forward: AI, which had been powering big rallies in tech and other stocks for months, could now actually drag on some parts of the market.\n\nShares of major insurance brokers fell on February 9 after Madrid-based startup Tuio unveiled a new insurance app built with ChatGPT, according to UBS.\n\nThat sparked fears that AI tools could eat into existing companies’ business models and customer bases. Shares of professional services and insurance companies sank. Marsh shares (MRSH) tumbled 7.5%. Arthur J. Gallagher shares (AJG) dropped 9.85%.\n\nBut Brian Meredith, an analyst at UBS, said in a note that he thinks the sell-off was “meaningfully overdone,” noting that insurance brokers remain “essential intermediaries” for household financial decisions, and it is unlikely AI will ultimately upend the industry.\n\nOn Tuesday, tech startup Altruistannounceda new tax planning feature for Hazel, the company’s AI tool. That stoked fears that the specialized client services offered by brokerage and wealth management firms could face increased competition.\n\nCharles Schwab (SCHW) shares dropped 7.42% Tuesday. Shares of financial services company LPL Financial (LPLA) and Raymond James (RJF) slumped 8.75% and 8.31%, respectively.\n\nReal estate services found themselves in the barrel on Wednesday and Thursday.\n\nCushman & Wakefield shares (CWK) tumbled 13.8% Wednesday and 11.5% Thursday. Shares of real estate service companies CBRE Group (CBRE) dropped 12.2% and 8.8% across the two days. Jones Lang LaSalle (JLL) fell 12.5% and 7.6%.\n\n“We believe investors are scrutinizing high-fee, labor-intensive business models viewed as potentially vulnerable to AI-driven disruption,” Jade Rahmani, an analyst at Keefe, Bruette & Woods, said in a note.\n\nAnd AI has the potential not just to compete with traditional real estate brokerages and agents, but to slash demand for office space in general, as AI executives predict their technology will eliminate swaths of the economy.\n\n“If there are less office workers in the long run as a result of AI, there will be less demand for office space,” CBRE Group chief executive Bob Sulentic said on the company’s earnings call on Thursday morning. “That would be a long-term trend to unfold.”\n\nThe Dow Jones Transportation Average — an index of 20 companies in the transportation industry — sank 4% Thursday and had its worst day since April.\n\nThe culprit was Algorhythm Holdings, whichannounceda new tool that could improve efficiency and better optimize the trucking business.\n\nThe reaction was swift: Shares of RXO (RXO), a freight company, plummeted 20.45% on Thursday. Shares of logistics company C.H. Robinson Worldwide (CHRW) dropped 14.54%.\n\n“While perceptions of artificial intelligence are influencing recent market activity, C.H. Robinson has been a leader in AI for more than a decade and we believe AI will only continue to strengthen our performance and widen our competitive moat,” C.H. Robinson said in astatement.\n\nAlgorhym’s announcement was all the more surprising considering the company once specialized in selling karaoke machines before pivoting to become an AI and logistics company.\n\n“It’s perhaps indicative of the state of markets at the moment that a $6 million market cap company that until recently specialized in karaoke helped wipe tens of billions off logistics stocks to add to the weakness,” Jim Reid, global head of macro research at Deutsche Bank, said in a note.\n\nAlgorhythm shares (RIME) rose almost 30% last week.\n\nAngelo Kourkafas, senior global strategist at Edward Jones, told CNN that “fear of AI disruption” has been a dominant theme in markets over the past two weeks. But the ripples permeating the stock market right now are themselves based on hypothetical scenarios, he said.\n\nKourkafas said the fears are more “speculative in nature” rather than based on immediate, fundamental changes to companies’ revenue streams.\n\n“Yes, in the near term there could be fears of disruption across many different industries, but we know these companies are actively investigating ways to evolve and offer better platforms, products and services as a result of that,” Kourkafas said.\n\nBut Jonathan Krinsky, chief market technician at BTIG, said in a Thursday note that single-stock moves based on AI nerves are “getting more and more extreme.”\n\n“At a certain point … we begin getting concerned that the weakness supersedes the strength and the broad market becomes vulnerable,” Krinsky wrote.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/investing/us-stocks-anthropic-software",
      "text": "Software stocks bore the initial brunt of AI disruption nerves"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/MRSH",
      "text": "MRSH"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/AJG",
      "text": "AJG"
    },
    {
      "url": "http://businesswire.com/news/home/20260210142841/en/Altruist-Introduces-AI-Powered-Tax-Planning-in-Hazel-Helping-Advisors-Deliver-Tax-Strategies-in-Minutes",
      "text": "announced"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/SCHW",
      "text": "SCHW"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/LPLA",
      "text": "LPLA"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/RJF",
      "text": "RJF"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/CWK",
      "text": "CWK"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/CBRE",
      "text": "CBRE"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/JLL",
      "text": "JLL"
    },
    {
      "url": "https://algoholdings.com/press-release-details?newsId=3234643",
      "text": "announced"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/RXO",
      "text": "RXO"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/CHRW",
      "text": "CHRW"
    },
    {
      "url": "https://www.chrobinson.com/en-sg/about-us/newsroom/news/2026/ch-robinson-leads-in-ai-strategy-and-execution/",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/markets/stocks/RIME",
      "text": "RIME"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/ai-disruption-fears-us-stocks",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/business/ai-disruption-fears-us-stocks",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b46d35cdaf82d4729d305ce214e81c74aced18a4f32bc08f5aec8703aa4060f7",
  "scraped_at": "2026-02-17T07:31:00.047219+00:00"
}