{
  "url": "https://lite.cnn.com/2026/02/23/us/ice-agent-requirements-training-whistleblower",
  "title": "Ryan Schwank: ICE officer training is ‘deficient’ and ‘broken,’ whistleblower testifies at congressional forum | CNN",
  "date": "2026-02-24T07:31:27.985317+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: AP\n\nA former US Immigration and Customs Enforcement lawyer who was responsible for training new deportation officers warned Monday that theagency’s training programfor new recruits is “deficient, defective and broken.”\n\nRyan Schwank’s comments during a forum held by congressional Democrats come at a time of intense scrutiny of the officers tasked with carrying out President Donald Trump’s mass deportation agenda. Critics, including rights groups and Democratic politicians, haveaccused deportation officersof using excessive force when arresting immigrants, attacking bystanders who record their conduct andfailing to follow constitutional protectionsof people’s rights.\n\nThe Department of Homeland Securityis rapidly scaling upthe number of deportation officers, raising concerns that it will sacrifice proper screening and training of applicants in a rush to get them into the field. The department denied it was cutting corners, saying new officers get trained on firearms, use-of-force policies and how to safely arrest people.\n\nSchwank testified during a hearing hosted by Democratic Sen. Richard Blumenthal of Connecticut and Rep. Robert Garcia of California. Blumenthal’s office said Schwank resigned from the agency on Feb. 13.\n\n“I am here because I am duty-bound to report the legally required training program at the ICE academy is deficient, defective and broken,” Schwank said.\n\nHe also accused the department of dismantling the training program for new deportation officers and lying about what they were doing.\n\n“DHS told the public the new cadets receive all the training they need to perform their duties, that no critical material or standards have been cut,” he said. “This is a lie. ICE made the program shorter, and they removed so many essential parts that what remains is a dangerous husk.”\n\nMonday’s was the third public forum held by the two Democrats to examine how ICE is training thousands of new officers and the conduct of those officers once they’re on the streets. Both have been vocal critics of how ICE officers conduct themselves. At the beginning of the hearing, Blumenthal thanked the witnesses, including Schwank, for their “courage and strength.”\n\nBlumenthal’s office said Schwank was one of two anonymous whistleblowers who came forward earlier to disclose anew ICE policy authorizingdeportation officers to forcibly enter an immigrant’s home to remove them from the country even if they didn’t have a warrant signed by a judge.\n\nHis officealso released dozens of pagesof documents related to the training of new deportation officers, noting the disclosure came from whistleblowers.\n\nBlumenthal’s office said the documents demonstrated “drastic cuts” to how new deportation officers are trained and tested. That includes changes to the number of exams new officers have to pass, the classes they have to take and the hours they train.\n\n“The training has been truncated and reduced, both in numbers of courses and substantive policy,” the senator said at the start of the hearing.\n\nHomeland Security strongly denied that it has removed any training requirements or lessened requirements for officers. ICE recruits receive 56 days of training and 28 days on average of on-the-job training, the department said Monday in response to an inquiry about the allegations made during the forum.\n\n“Despite false claims from the media and sanctuary politicians, no training hours have been cut. Our officers receive extensive firearm training, are taught de-escalation tactics, and receive Fourth and Fifth Amendment comprehensive instruction,” department spokeswoman Lauren Bis said in an e-mailed statement.\n\nShe also said ICE recruits are monitored on the job after graduating from the academy.\n\nThe department has “streamlined training to cut redundancy and incorporate technology advancements, without sacrificing basic subject matter content,” Bis said.\n\nThe documents show that ICE is eliminating over a dozen “practical exams” that used to be necessary for deportation officers to pass, according to an analysis by Democratic Senate staff. ICE also appears to have cut a number of classes from the training, including “Use of Force Simulation Training.”\n\nDeportation officers appear to be getting fewer hours of training overall, according to the documents.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/border-immigration-mass-deportation-ice-trump-722e82dbd288e7af4afe69192d8c8cfb",
      "text": "agency’s training program"
    },
    {
      "url": "https://apnews.com/article/immigration-trump-detention-bond-judge-50a5da122aa51eed77cace0830548df3",
      "text": "accused deportation officers"
    },
    {
      "url": "https://apnews.com/photo-gallery/immigration-renee-good-minneapolis-minnesota-ice-642884ea20d991de1efc4172fff1a9bb",
      "text": "failing to follow constitutional protections"
    },
    {
      "url": "https://apnews.com/article/immigration-hiring-trump-border-mass-deportations-ed1580c3f5c0c2a2b5c1ebd621574365",
      "text": "is rapidly scaling up"
    },
    {
      "url": "https://apnews.com/article/ice-arrests-warrants-minneapolis-trump-00d0ab0338e82341fd91b160758aeb2d",
      "text": "new ICE policy authorizing"
    },
    {
      "url": "https://www.hsgac.senate.gov/wp-content/uploads/2026-02-23-DHS-Spotlight-Forum-3-Memorandum-RE-Summary-of-Documents-Newly-Received-from-DHS-Whistleblowers.pdf",
      "text": "also released dozens of pages"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/ice-agent-requirements-training-whistleblower",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/us/ice-agent-requirements-training-whistleblower",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b4dc76bb8ebd6ec2b966295e3983b21f13edfb968ca866e046d3d8a96e1c1c65",
  "scraped_at": "2026-02-24T07:31:27.985332+00:00"
}