{
  "url": "https://lite.cnn.com/2026/02/17/us/new-af1-paint-job",
  "title": "Air Force One will sport Trump’s preferred paint job, after Air Force again reverses course | CNN",
  "date": "2026-02-18T07:31:12.010834+00:00",
  "authors": [
    "Alexandra Skores, CNN"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump’s preferred paint colors will be applied to the new planes which will serve as Air Force One, an Air Force official tells CNN.\n\nThe new heavily modified Boeing 747s, which the military designates VC-25B, will be painted red, white, gold and dark blue, a color scheme proposed during Trump’s first term in office but reversed by the Biden administration.\n\n“Air Force One is going to be incredible,” Trump said in 2018. “It’s going to be the top of the line, the top in the world. And it’s going to be red, white and blue, which I think is appropriate.”\n\nThe planes which serve as Air Force One have been painted a baby blue and white livery sincethe Kennedy administration, and Trump’s proposed change sparked speculation that he intended to replicate the colors of his personal Boeing 757.\n\nIn 2022, during the Biden administration,the livery was rejectedby the Air Force citing cost and technical reasons.\n\n“Further analysis concluded darker colors, among other factors, on the underside of the VC-25B aircraft might contribute to temperatures exceeding the current qualification limits of a small number of components,” a spokesperson said at the time.\n\nThe military proposednew renderings in 2023 of a design selected by Bidenwhich looked very similar to the baby blue livery in use for more than 60 years, with a slightly darker tint.\n\nWhen Trump was reelected his Air Force One paint scheme was again front and center, displayed on the evening of his inauguration on top of a cake at the Commander In Chief Ball. Now, it is often seen in a model on the coffee table in the Oval Office.A Department of Homeland Security Boeing 737also started flying with a similar paint job last year.\n\nNow, the Air Force says the livery will be applied to two new Boeing 747s being modified by Boeing and a 747 donated to the military by Qatar, which Trump has ordered be retrofitted for use as Air Force One.  The Qatari jet could be flyingas early as this summer.\n\nThe colors will also be applied during scheduled maintenance to four of the smaller C-32 aircraft, a military version of the Boeing 757, currently in the fleet.\n\n“The first C-32 has been painted and is expected to be delivered to the Air Force in the next few months,” an Air Force spokesperson confirmed to CNN.\n\nCNN’s Arlette Saenz, Jamie Ehrlich Priscilla Alvarez, Pete Muntean Aaron Cooper contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nationalmuseum.af.mil/Visit/Museum-Exhibits/Fact-Sheets/Display/Article/195807/boeing-vc-137c-sam-26000/",
      "text": "the Kennedy administration"
    },
    {
      "url": "https://www.cnn.com/2022/06/10/politics/air-force-one-paint-job-scrapped/index.html",
      "text": "the livery was rejected"
    },
    {
      "url": "https://www.cnn.com/2023/03/10/politics/air-force-one-color-scheme",
      "text": "new renderings in 2023 of a design selected by Biden"
    },
    {
      "url": "https://www.cnn.com/2025/12/18/politics/dhs-plane-trump-air-force-one",
      "text": "A Department of Homeland Security Boeing 737"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/politics/qatari-jet-turned-air-force-one-expected-to-be-delivered-this-summer-air-force-says",
      "text": "as early as this summer"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/new-af1-paint-job",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/new-af1-paint-job",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b4e3407ef76aaa4639d7f6a9c34eefb6133a3a8f0ee5a492bc097663728f2df3",
  "scraped_at": "2026-02-18T07:31:12.010847+00:00"
}