{
  "url": "https://lite.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
  "title": "US military prepared to strike Iran as early as this weekend, but Trump has yet to make a final call, sources say | CNN Politics",
  "date": "2026-02-19T07:30:55.741473+00:00",
  "authors": [
    "Kristen Holmes",
    "Kevin Liptak",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US military is prepared to strike Iran as early as this weekend, though President Donald Trump has yet to make a final decision on whether he’ll authorize such actions, sources familiar with the matter tell CNN.\n\nThe White House has been briefed that the military could be ready for an attack by the weekend, after a significant buildup in recent days of air and naval assets in the Middle East, the sources said. But one source cautioned that Trump has privately argued both for and against military action and polled advisers and allies on what the best course of action is.\n\nTop administration national security officials met Wednesday in the White House Situation Room to discuss the situation in Iran, a person familiar with the meeting said. Trump was also briefed Wednesday by special envoy Steve Witkoff and Jared Kushner, Trump’s son-in-law, about their indirect talks with Iran that occurred a day earlier. It was not clear if Trump would make a decision by the weekend.\n\n“He is spending a lot of time thinking about this,” one source said.\n\nThe US’s readiness to strike by the weekend wasfirst reported by CBS News.\n\nIranian and US negotiators passed notes for three-and-a-half hours Tuesday during indirect talks in Geneva, though they departed with no clear resolution. Iran’s top negotiator said both sides had agreed upon a “set of guiding principles,” though an American official said “there are still a lot of details to discuss.”\n\nWhite House press secretary Karoline Leavitt said Wednesday that Iran was expected to provide more details on its negotiating position “in the next couple of weeks,” but she wouldn’t say whether Trump would hold off on military action within that timespan. US Secretary of State Marco Rubio is expected to travel to Israel on February 28 to meet with Israeli Prime Minister Benjamin Netanyahu and update him on the Iran talks, a State Department official told CNN Wednesday.\n\n“I’m not going to set deadlines on behalf of the president of the United States,” Leavitt said.\n\nShe added that while “diplomacy is always his first option,” military action remains on the table.\n\n“There’s many reasons and arguments that one could make for a strike against Iran,” she said, adding Trump was relying on counsel from his national security team “first and foremost.”\n\nThe opaque statements have fueled increasing fears of military conflict between the two nations — even as officials ostensibly hold out hope for diplomacy. TheUSS Gerald Ford— the most advanced carrier group in the US arsenal — could arrive in the region as soon as this weekend, after aflurry of other military buildup. US Air Force assets based in the United Kingdom, including refueling tankers and fighter jets, are being repositioned closer to the Middle East, according to sources familiar with the movements.\n\nFor its part, Iranis fortifying several of its nuclear facilities, using concrete and large amounts of soil to bury key sites amid US military pressure, according to new satellite imagery and analysis from the Institute for Science and International Security.\n\nA number of calendar events could play a role in the timing of an attack. The Winter Olympics — traditionally a moment of global unity — conclude on Sunday; some European officials said they believed no strike would occur before then. Meanwhile, Ramadan began Wednesday; some officials from US allies in the Middle East — which have lobbied against an attack, fearing regional destabilization — said an attack during the Muslim holy month would convey American disrespect. And Trump is delivering his annual State of the Union address on Tuesday; aides have said it was likely to act as a kickoff for Trump’s midterm year message on domestic issues. It wasn’t clear whether the president was taking any of those events into account as he weighs his options.\n\nTrump, in his statements on Iran over the past weeks, has done little to gain buy-in from the American public or Congress for a large military operation in the country. He has hinted at a desire for regime change, and insisted Iran not obtain a nuclear weapon, but has not said what precisely his objectives would be in ordering an attack.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cbsnews.com/news/trump-possible-timeline-iran-strikes/",
      "text": "first reported by CBS News"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/us-iran-aircraft-carrier",
      "text": "USS Gerald Ford"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
      "text": "flurry of other military buildup"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-18-26?post-id=cmlsfu48v00003b6riskhsvg2",
      "text": "is fortifying several of its nuclear facilities"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/politics/military-strike-trump-us-iran",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b5317b907f33958e3b4faebdae95e268106e00db238fa416c3c3aa1ac03b656f",
  "scraped_at": "2026-02-19T07:30:55.741486+00:00"
}