{
  "url": "https://lite.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
  "title": "A partial government shutdown is about to hit DHS. Here’s what that means | CNN Politics",
  "date": "2026-02-14T07:06:38.810648+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Department of Homeland Security has been ensnared by a partial government shutdown as Congress did not act to fund the agency by the end of Friday. But nearly all DHS workers will remain on the job — even if many won’t get paid until the lapse ends — and the public probably won’t notice much of a change.\n\nDHS is the last federal agency lacking funding for the remainder of fiscal year 2026, which runs through September 30. Since therecord-long shutdownended in mid-November, lawmakers have passed a series of spending bills for the rest of the government.\n\nThe most recent package, approved at the end of January, only funded DHS for two weeks to give Congress more time to negotiate reforms in the agency’s immigration enforcement operations — a demand by Senate Democrats after federal immigration agentsfatally shottwo US citizens in Minneapolis in January.\n\nBut lawmakers left town Thursdaywithout any agreementon how to fund DHS, and the next steps are uncertain. With talks ongoing between the White House and Democrats, the two chambers aren’t scheduled to return to Washington until February 23, though GOP leaders could still call members back if a deal is reached.\n\nPresident Donald Trump is no stranger to government shutdowns. He also presided over one inhis first term, which lasted 35 days and had been thelongest on recorduntil last year’s 43-day impasse.\n\nHere’s what we know about a partial government shutdown affecting DHS:\n\nThe shooting deaths ofAlex PrettiandRenee Nicole Goodby DHS immigration agents during protests in Minneapolis last month sparked widespread public outcry and prompted Senate Democrats to demand reforms in exchange for their support of a package to fund other federal departments.\n\nThe Democrats have said they want to restrict roving patrols, tighten parameters around warrants for searches and arrests, toughen use-of-force policies and require US Immigration and Customs Enforcement agents to wear body cameras and remove their masks. Republicans have resisted nearly all of those changes, and some have pushed for concessions from Democrats, like cracking down on so-called sanctuary cities.\n\nTypically, a major pain point during a shutdown is thesnarling of flightsdue to staffing issues among air traffic controllers. That won’t be an issue in this case, because controllers are part of the Department of Transportation’s Federal Aviation Administration, which has already received funding for the rest of the fiscal year.\n\nHowever, depending on the length of the shutdown, Americans may notice longer lines at airport security checkpoints since Transportation Security Administration workers, who fall under DHS, would have to work without pay. This has happened during prior impasses as employee absences increase as shutdowns drag on.\n\nDemocrats do not have much power to actually restrict ICE and US Customs and Border Protection activities in this shutdown. ICE will still continue to operate its main functions, multiple congressional aides have contended.\n\nOverall, more than 90% of DHS’ 272,000 employees will continue working during a lapse, according to the agency’s September shutdown plan covering the first five days of an impasse. More than 93% of ICE and CBP workers will remain on the job.\n\nOnly about 44,500 staffers will continue to be paid through other appropriations, according to the shutdown plan. However, DHS Secretary Kristi Noem said last fall that 70,000 law enforcement personnel, including in CBP, ICE and other divisions, would receive their paychecks.\n\nDHS has other resources to draw on, including a $165 billion infusion from last summer’s One Big Beautiful Bill Act, which funneled $75 billion to ICE, alone, and $64 billion to CBP.\n\nThe president’s signature policy bill gives Noem wide-ranging power to move money around to carry out the agency’s operations.\n\nDHS is a sprawling agency that includes not only ICE, CBP and TSA, but also the Federal Emergency Management Agency, Coast Guard, Secret Service and other divisions.\n\nMuch of the agency’s workforce is focused on activities that protect life and property and is therefore considered essential. Activities that will continue include law enforcement operations, including those related to immigration and drug trafficking; passenger processing and cargo inspections at ports of entry; Disaster Relief Fund activities; and Secret Service functions.\n\n“Because we know that the majority of staff right now would be required to work, it’s likely that the impacts would be minimally felt,” said Rachel Snyderman, managing director of the economic policy program at the Bipartisan Policy Center. “But as the duration of the shutdown continues, that’s where you start to see some issues with staff attrition.”\n\nFEMA’s Disaster Relief Fund also appears to be well-funded, though monthly reports are still lagging because of the fall shutdown, according to the center. It estimates that the fund contained nearly $31 billion at the start of the year, and the agency typically spends $500 million to $1 billion a month — barring a major disaster.\n\nAll other areas of the federal government, including national parks and the Internal Revenue Service, will remain open since they have been funded for the rest of the fiscal year.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/12/politics/government-shutdown-funding-bill-house-vote",
      "text": "record-long shutdown"
    },
    {
      "url": "https://www.cnn.com/2026/01/25/us/video/minneapolis-ice-shooting-alex-pretti-visual-analysis-digvid",
      "text": "fatally shot"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/dhs-shutdown-ice-congress",
      "text": "without any agreement"
    },
    {
      "url": "https://www.cnn.com/2019/01/25/politics/donald-trump-shutdown-border",
      "text": "his first term"
    },
    {
      "url": "https://www.cnn.com/politics/longest-government-shutdown-vis",
      "text": "longest on record"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/us/cbp-pretti-investigation-evidence-fbi-dhs",
      "text": "Alex Pretti"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/us/ice-shooting-minneapolis-renee-good",
      "text": "Renee Nicole Good"
    },
    {
      "url": "https://www.cnn.com/2025/11/05/us/airport-traffic-cuts-government-shutdown",
      "text": "snarling of flights"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b562c8dc7ce7e16b3ffaca700844cba0d8212ade25337873fcb33bfff3c3fff4",
  "scraped_at": "2026-02-14T07:06:38.810662+00:00"
}