{
  "url": "https://lite.cnn.com/2026/02/26/us/columbia-university-student-detained-ice",
  "title": "Ellie Aghayeva: Columbia student released after university says federal agents used false pretenses to detain her | CNN",
  "date": "2026-02-27T07:15:02.064570+00:00",
  "authors": [
    "Alaa Elassar"
  ],
  "text": "Source: CNN\n\nA Columbia University student detained by federal immigration agents, who the university alleges used false pretenses to enter a residential building, has been released, after New York City’s mayor raised her case with President Donald Trump.\n\nAt about 6:30 a.m. Thursday, agents from the Department of Homeland Security entered a university-owned residence and took Ellie Aghayeva into custody, Columbia University’s Acting President Claire Shipman saidin a letter.\n\n“Our understanding at this time is that the federal agents made misrepresentations to gain entry to the building to search for a ‘missing person,’” the university president said.\n\nThe agents entered “without any kind of warrant,” Shipman said inanother statementlater in the day, calling it a “frightening and fast-moving” situation and “utterly unacceptable.”\n\n“They made their way to the apartment of the student they were targeting with the same story,” and security cameras “captured the agents in the hallway showing pictures of the alleged missing child,” Shipman said.\n\nThe Department of Homeland Security confirmed to CNN that ICE arrested Aghayeva, who is from Azerbaijan and “whose student visa was terminated in 2016 under the Obama administration for failing to attend classes.”\n\n“The building manager and her roommate let officers into the apartment. She has no pending appeals or applications with DHS,” the agency’s statement said.\n\nWhen asked by CNN whether the agents misrepresented themselves as searching for a missing person, the agency replied, “Homeland Security Investigators verbally identified themselves and visibly wore badges around their necks. They did NOT and would not identify themselves as NYPD.”\n\nA spokesperson for DHS, Tricia McLaughlin, said Aghayeva had been placed in removal proceedings and “released while she waits for her hearing,” according to the Associated Press.\n\nCNN has reached out to DHS and Aghayeva’s lawyer for further information.\n\nAghayeva, who has a sizeable social media following, initially shared a story on Instagram Thursday, showing a photo of just her legs with the caption: “DHS illegally arrested me. Please help.” The story was later deleted after her release.\n\nShortly after news of her arrest, New York officials, including Gov. Kathy Hochul and New York City Mayor Zohran Mamdani, expressed widespread criticism of the incident.\n\n“Let’s be clear about what happened: ICE agents didn’t have the proper warrant, so they lied to gain access to a student’s private residence,” Hochul said ina statement on X. Hochul has proposed legislation that would bar ICE from entering sensitive locations such as schools and dormitories.\n\nDemocratic Rep. Jerry Nadler, the dean of the New York congressional delegation, and Assemblymember Micah Lasher said in a statement they were “disgusted and outraged,” calling the action dangerous and fear-inducing.\n\nMamdani, who was in Washington to discuss his housing initiativeswith Trump, raised Aghayeva’s detention with the president and urged she be released, the mayor’s press secretary told CNN.\n\n“I shared my concerns about Columbia student Elmina Aghayeva, who was detained by ICE this morning,” Mamdani wroteon X, shortly after their meeting.\n\nMamdani said Trump called him, writing: “He has just informed me that she will be released imminently.”\n\nAghayeva later shared on Instagram she had been released, saying she was “safe and okay,” and on her way home. “I am in complete shock over what happened … I need a little bit of time to process everything I will come back soon. But please don’t worry,” she wrote.\n\nColumbia saidin a post on Xthat it was “relieved and thrilled” that Aghayeva was released. It said it is working to contact Aghayeva’s family and ensure the student has access to legal support.\n\nAghayeva is an international student and senior double majoring in neuroscience and political science, according to the American Association of University Professors.\n\nShe has amassed more than 100,000 followers on social media, regularly posting about her library study sessions, as well as her lifestyle and productivity habits.\n\nIn her statement, Columbia’s president reiterated that law enforcement agencies must have a judicial warrant or judicial subpoena to gain access to non-public areas of the university, including housing, classrooms, and areas requiring key card access.\n\n“All law enforcement agencies—including DHS and ICE—are obligated to follow established legal and ethical standards,” Shipman wrote in her letter following Aghayeva’s release. “And we expect those standards to be respected.”\n\nAghayeva’s arrest comes nearly a year after Palestinian activist and Columbia studentMahmoud Khalilwas taken into ICE custody on March 8, 2025. Khalil spent more than 100 days detained, missing the birth of his first child, and now faces the possibility of deportation.\n\nAghayeva’s arrest marks the first time DHS has detained a Columbia student at a university-owned residence since the arrest of Khalil, a 2024 School of International and Public Affairs student.\n\nKhalil, who was taken from his apartment andspent more than 100 days without charge in ICE custody, now faces thelooming possibility of rearrest and deportationto Algeria or Syria.\n\nKhalil’s legal team suffered a setback in January when a three-judge panel of the 3rd US Circuit Court of Appeals in Philadelphia reversed a lower court decision that had secured his release from an immigration detention facility.\n\nKhalil, who was born in a Palestinian refugee camp in Syria before going on to graduate from Columbia, had played a prominent role negotiating on behalf of pro-Palestinian protesters at the university.\n\nAnother Columbia University student, Ranjani Srinivasan, was also detained in March 2025 amid pro-Palestinian protests at Hamilton Hall, even though she maintainsshe did not participate in the protest.\n\nSrinivasan, then 37, an Indian national and Fulbright Scholarship recipient, said she was targeted for exercising her right to free speech, and the experience forced her to leave the country out of fear of being taken into custody.\n\nDHS officials identified her as one of several Columbia students targeted for immigration action under the Trump administration’s crackdown on international students involved in protests related to the Israel-Hamas conflict.\n\nIn his meeting with Trump, Mamdani also shared a list of four students other than Aghayeva who are detained in New York City, asking him to consider dismissing their cases, according to the mayor’s press secretary, who did not say which students were on the list.\n\nRep. Adriano Espaillat, a former undocumented immigrant, said in a poston Xstudents and faculty “should not fear for their safety in their dorm rooms, the classroom, or anywhere else on campus,” and urged the university to bolster protections.\n\n“This exhibit of the Trump Administration’s lawless actions — which are rarely supported by legitimate warrants or subpoenas — is yet another reminder that Columbia University and other institutions must enhance the protections and policies they utilize to create a safe environment for those they serve and employ,” Espaillatwrote.\n\nIn a statement, Columbia Universityannouncedit is taking additional steps to protect students and staff from similar incidents, with extra public safety patrols being deployed to residential buildings.\n\nThis story has been updated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://president.columbia.edu/news/important-update-columbia-university",
      "text": "in a letter"
    },
    {
      "url": "https://president.columbia.edu/news/message-acting-president-claire-shipman-0",
      "text": "another statement"
    },
    {
      "url": "https://x.com/GovKathyHochul/status/2027066938640183657",
      "text": "a statement on X"
    },
    {
      "url": "https://x.com/NYCMayor/status/2027129042432913711?s=20",
      "text": "on X"
    },
    {
      "url": "https://x.com/Columbia/status/2027130847782977981",
      "text": "in a post on X"
    },
    {
      "url": "https://www.cnn.com/2025/06/20/us/mahmoud-khalil-ordered-released-by-judge",
      "text": "Mahmoud Khalil"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/politics/trump-mamdani-meet-washington-white-house",
      "text": "spent more than 100 days without charge in ICE custody"
    },
    {
      "url": "https://www.cnn.com/2025/09/17/us/mahmoud-khalil-deportation-ruling",
      "text": "looming possibility of rearrest and deportation"
    },
    {
      "url": "https://www.cnn.com/2025/03/16/us/ranjani-srinivasan-columbia-university",
      "text": "she did not participate in the protest."
    },
    {
      "url": "https://x.com/repespaillat/status/2027060032995549665?s=46",
      "text": "on X"
    },
    {
      "url": "https://x.com/repespaillat/status/2027060032995549665?s=46",
      "text": "wrote."
    },
    {
      "url": "https://communications.news.columbia.edu/news/important-additional-updates-columbia-university",
      "text": "announced"
    }
  ],
  "hash": "b5fd0136b3405f472228bf6d65ee1a237857e77255efaf23e28c84565d5c50fc",
  "scraped_at": "2026-02-27T07:15:02.064583+00:00"
}