{
  "url": "https://lite.cnn.com/2026/02/24/australia/australia-trump-tower-gold-coast-intl-hnk",
  "title": "There are plans to build a Trump Tower in Australia – not everyone is thrilled | CNN",
  "date": "2026-02-25T07:33:11.143824+00:00",
  "authors": [
    "Hilary Whiteman"
  ],
  "text": "Source: CNN\n\nA vacant block near the center of the Gold Coast’s once glitzy tourist strip is set to become the site of Australia’s tallest tower – and the first with the surname Trump emblazoned across the top.\n\nAustralia’s Altus Property Group plans to build a 91-story tower, featuring a 285-room luxury 6-star hotel, high-end retail plaza, Michelin-starred restaurants and residential apartments finished to Trump specifications.\n\nPlans for Trump International Hotel & Tower Gold Coast are yet to be submitted to Gold Coast City Council for approval, but it’s already the talk of the seaside strip – and not everyone is on board.\n\nA petition calling for the plan’s rejection had more than 26,000 signatures as of Tuesday afternoon, with many saying they did not want to be associated with the Trump brand.\n\n“Why would we want anything to do with Trump coming to our country. He is poisonand needs to stay out of Australia in every single way,” said one person who signed the online petition, while another commented: “This is the worst idea ever and we cannot allow it to happen!”\n\nCK, who started the petition under an alias to avoid backlash from Trump supporters, told CNN she felt powerless while watching scenes of “anti-immigrant violence and the social division” in the US on social media, and looked for a way to express her opposition.\n\n“People believe that I am against job creation, but that’s not true at all,”she said. “I’m just against the Trump brand.”\n\n“Our goal is to go to the Gold Coast Council and present this proposal in hopes to stop it,” she added.\n\nLongtime Gold Coast Mayor Tom Tate is an enthusiastic supporter of the plan – and told Australian radio Tuesday that he’d recently had dinner with Trump at his Mar-a-Lago resort in Florida and found him to be “very, very likable.”\n\nTate is in the US for “G’Day USA,” an economic and diplomacy program that gives Australian and US dealmakers a chance to meet potential partners to build new relationships.\n\nOf the planned Trump Tower, Tate said: “It’s quite incredible, actually, and it’s all about quality.”\n\nFor the council, anything that promises an injection of funds into the tourist strip is welcome as it rebuilds the industry after difficult years during the Covid pandemic\n\nThe proposed site is currently empty and has been since 2013, when concrete cancer forced the demolition of a much-loved hotel.\n\n“If we don’t get this Trump Tower landmark there, we’ll be empty for next 20 years again,” said cafe worker Jordan Nguyen, who started his own petition to back the construction.\n\n“This proposal should be assessed on its planning merits and the benefits it can deliver to the community – not political opinions.”\n\nApartments in the Gold Coast’s Trump Tower are expected to sell for at 5 million Australian dollars ($3.5 million) – offering views over the Pacific Ocean and Surfers Paradise, a beach that’s packed with tourists during the summer months.\n\nMartin Hall from the Gold Coast Central Chamber of Commerce, praised the development as a “gold option” for buyers in a growing market.\n\n“There’s certainly no shortage of cranes around the Gold Coast at the moment. You’ve just got to look at the skyline,” he said.\n\n“Given that we’ve got the Olympics coming to South East Queensland and the whole of Queensland in 2032… having extra room spaces is welcomed.”\n\nAustralia property developer David Young said he laid the groundwork for the Trump Tower back in 2007 with a “cold-call to Ivanka Trump,” according to a blog post on the property group’s website.\n\nYoung, the founder and CEO of the Altus Property Group, recalled introducing himself to Trump’s daughter as a property developer from Australia, who was intent on building “Australia’s finest tourist property at Surfers Paradise.”\n\nAlmost 20 years later, the deal was signed with her younger brother Eric at Mar-a-Lago on February 14, and so began the arduous work of drawing designs and engineering plans to meet terms of the Trump licensing deal.\n\n“It will be an Australian, not American, project. It won’t have a Four Seasons or Ritz Carlton brand above the front door, but it will say ‘Trump,’” Young said, according to comments published in The Australian newspaper.\n\nWhile it’s unclear when the development application will be lodged – or if it’ll be approved –  Young anticipates the building to be finished before Brisbane hosts the Summer Olympics in 2032.\n\n“It will be an iconic landmark property on Surfers Paradise Beach, the natural home to the well-heeled, and it will be finished before the Olympics start, creating a tourism adjunct to the Games themselves,” Young told the Australian Financial Review.\n\nIf approved, the 335-meter (1,099 feet) Gold Coast Trump Tower may not hold the title of Australia’s tallest building for very long – if at all. That accolade will likely go to the nearby “One Park Lane” which will be roughly 60 meters (195 feet) taller.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/australia/australia-trump-tower-gold-coast-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/australia/australia-trump-tower-gold-coast-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b638f8bd68f2007eda37283bef64759da9593cd9982fc0e274d9bc7d4cfd6060",
  "scraped_at": "2026-02-25T07:33:11.143835+00:00"
}