{
  "url": "https://lite.cnn.com/2026/02/19/style/king-charles-london-fashion-week-tolu-coker",
  "title": "King Charles makes unexpected appearance at Tolu Coker show at London Fashion Week | CNN",
  "date": "2026-02-20T07:28:27.882637+00:00",
  "authors": [
    "Leah Dolan, CNN"
  ],
  "text": "Source: CNN\n\nLondon Fashion Week was given a royal christening of sorts on Thursday afternoon when King Charles sat front row on a gold cushion at British Nigerian designerTolu Coker’s Fall-Winter 2026 show.\n\nCharles, whose brotherAndrew Mountbatten-Windsor was arrestedon suspicion of misconduct in public office on Thursday morning, appeared calm as he walked into the rising star’s runway show — albeit 25 minutes late. In a statement issued earlier in the day, he said he learned “with the deepest concern” of the arrest of his younger sibling, and stressed that “the law must take its course.”\n\nWearing a gray single-breasted suit paired with a white collared shirt, printed tie and smart dress shoes, Charles sat next to British fashion stalwart Stella McCartney and the British Fashion Council’s CEO Laura Weir, who escorted the monarch into the venue. Attendees, including British rappers Skepta and Lil Simz, were asked to stand on the arrival of the monarch.\n\nThe show’s set design, featuring a London Underground tube sign, street lamps, tufts of grass and dustbins, was in part an homage to the area Coker grew up in: Mozart Street in Westminster. Or as she affectionately called it, her “block.”\n\n“It was looking at my block in the ‘90s, when I was born,” she told CNN backstage. The collection, which included cropped double-breasted jackets, sailor hats and crisp frock coats in pastel hues, was about “improperness,” according to the designer. Pieces were tailored, pleated and structured in the style of pressed school uniforms, but with a twist — a neckline designed to fold over like it was being shrugged off, for example. “It’s like, you get to your block and you lose that bit of properness and it becomes fun and playful,” Coker said.\n\nA 2025 semifinalist of the prestigious LVMH Prize and one of the few Black female designers with their own label, Coker’s latest collection, titled “Survivor’s Remorse,” was a look at Britishness through the lens of the African diaspora. “This collection was one about grief, aspiration, assimilation and then coming back to one’s self,” she said. In one outfit, an eye-popping blue and pink tartan mini-skirt set, Coker combined the striking colors of her Yoruba heritage with a reference to “Clueless,” a film from her childhood.\n\nThe designer told CNN she had to keep her VIP guest a secret. Over the years, there have been a handful of royal appearances at the city’s fashion events, from Catherine, Princess of Wales, who presented the Queen Elizabeth II Award for British Design to designer Patrick McDowell in May 2025, to the late Queen Elizabeth II, who attended Richard Quinn’s show in 2018.\n\nCoker, a former beneficiary of the King’s Trust — a mentorship initiative that supports young people looking to start a career in fashion — said seeing him sat in the front row was a “full circle moment.”\n\n“It was really special to have him on our block and to experience what that is like,” she said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/style/video/one-look-with-tolu-coker-london-fashion-week-vrtc",
      "text": "Tolu Coker’s Fall-Winter 2026 show"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "Andrew Mountbatten-Windsor was arrested"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/style/king-charles-london-fashion-week-tolu-coker",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/style/king-charles-london-fashion-week-tolu-coker",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b74308b41d5e98f85130720e5d54da13070b957022832987c595b09e18afacd0",
  "scraped_at": "2026-02-20T07:28:27.882650+00:00"
}