{
  "url": "https://lite.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy",
  "title": "As Iran talks drag on, questions emerge over how long Trump will indulge diplomacy | CNN Politics",
  "date": "2026-02-18T07:31:16.331403+00:00",
  "authors": [
    "Kevin Liptak, CNN"
  ],
  "text": "Source: CNN\n\nAfter passing notes for three-and-a-half hours Tuesday, Iranian and American negotiators departed their indirect talks in Geneva with an agreement to keep talking. What they’re talking about, exactly, remains an open question.\n\nIt’s unclear if the two sides are focused just on Iran’s nuclear program or other issues like the country’s ballistic missiles. Iran’s top negotiator said only that they’d arrived at a “set of guiding principles.” An American official was more circumspect, acknowledging “there are still a lot of details to discuss.”\n\nThe readout hardly eased growing fears of an impending regional war. Some officials have started to wonder how long President Donald Trump will allow diplomatic efforts to proceed. Adding to the sense of malaise, Iran conducted military exercises with cruise missiles and boats as the talks were underway, briefly closing the Strait of Hormuz.\n\nTrump “reserves the ability to say when he thinks that diplomacy has reached its natural end,” Vice President JD Vance said in a Fox News interview, hours after the talks concluded Tuesday. He added that the two sides “agreed to meet afterwards” but that the Iranians have not acknowledged certain “red lines.”\n\nSo far, Trump has authorized the incremental back-and-forth that often defines high-stakes international dealmaking, dispatching his envoys Steve Witkoff and son-in-law Jared Kushner to foreign compounds to exchange papers with Iranian diplomats through an Omani intermediary.\n\nBut Trump is also wary of being “tapped along” by an Iranian regime looking to play for time, according to people familiar with his thinking. His allies have warned him that could be Iran’s intent, and Israeli Prime Minister Benjamin Netanyahu emphasized that argument in an urgently scheduled meeting last week.\n\nTrump is also acutely aware that every passing day without US military action is another day further from his initial promise — now nearly two months old — that he was coming to the assistance of Iranian protesters.\n\nAs the talks proceed, Trump has offered only loose deadlines.\n\n“I guess over the next month, something like that,” he said when asked last Thursday if he envisioned a timeline. “Yeah, it shouldn’t take, I mean, it should happen quickly.”\n\nQuickly, in diplomatic terms, can be relative. That is especially true when discussing the highly technical particulars of uranium enrichment, which in previous negotiations required the participation of nuclear physicists.\n\nThe Joint Comprehensive Plan of Action — the Obama-era deal that Trump harshly criticized as too weak on Iran and ultimately withdrew from — took more than two years of painstaking negotiations to finalize. Trump’s own grinding negotiations with the Iranians early last year lasted months before eventually falling apart, resulting in US military strikes on Iran’s uranium enrichment sites over the summer.\n\nAdministration officials believe Iran is now more motivated to agree to a deal than in the past because of the dire state of its economy, strangled by western sanctions. The major US military buildup Trump has ordered around Iran is also intended to apply pressure.\n\nYet so far, the Iranians do not seem willing to immediately accede.\n\n“This does not mean that we can reach an agreement quickly, but at least the path has begun,” Iran Foreign Minister Abbas Araghchi said Tuesday after noting the two sides agreed in their indirect talks to “move toward drafting the text of a possible agreement.”\n\nAraghchi, who led Iran’s delegation in Geneva, said that no date had been set for future conversations. The American official, speaking on the condition of anonymity to discuss the sensitive negotiations, said the Iranians indicated they would “come back in the next two weeks with detailed proposals” to address the gaps in their negotiating positions.\n\nThat timeframe would loosely align with the time it will take the USS Gerald R. Ford — the world’s largest aircraft carrier — to sail from the Caribbean Sea to the Middle East, where it will join the massive buildup of US military assets Trump has ordered to be ready for potential confrontation.\n\nMeanwhile, the two sides have struggled to even agree on what is up for discussion.\n\nHeading into Tuesday’s discussions, Tehran had insisted it would only discuss its nuclear program as part of a deal that would lift sanctions and avoid a war with the United States. But some Trump administration officials, and Israel, say any deal must be more expansive, to include Iran’s ballistic missiles and its support for regional militant groups.\n\nVance, in the Fox interview, suggested it was the nuclear file that took precedence.\n\n“There are a lot of ways in which they endanger America’s national security, but the most important way they could is if they acquired a nuclear weapon,” he said.\n\nSome regional diplomats have floated a broader agreement that pairs concessions on the nuclear program and commitments on nonaggression with possible business deals, including granting the US privileged access to developing Iran’s oil, gas and rare earths resources, one source said.\n\nSuch an agreement would align with Trump’s interests in brokering grand deals that contain an economic upside for the United States. Still, if past negotiations with Iran are any guide, it is the technicalities of the nuclear concessions that will still prove to be the major hurdle.\n\nIran has signaled some willingness to make compromises on its nuclear program, which it has always insisted is intended for peaceful purposes. That includes offers to dilute its 60%-enriched uranium, which is a short technical step away from becoming weapons-grade, or temporarily suspend enrichment for up to three years, according to people familiar with the discussions.\n\nAnother possibility would be shipping its highly-enriched material to a third country, potentially Russia, as it did in the 2015 Obama-era deal.\n\nTrump, however, continued to insist over the weekend that the US “doesn’t want any enrichment,” suggesting the US will not settle for a deal that allows even low-level uranium enrichment by Iran. That would seem to be a stubborn sticking point, given Iran’s longstanding position that enrichment is their right. But hardline positions going into negotiations can always change.\n\nLingering uncertainties around what the US might hope to achieve through military action in Iran may also motivate Trump to allow extended negotiations.\n\n“The question (is) what happens to Iran the day after. If they had a clear answer to that, I think we already would have seen a military strike,” said Amos Hochstein, a special US envoy under President Joe Biden. “But all these talks and sending more military equipment is to gain time to figure that question out.”\n\n“They’re going to have enough military equipment there, and personnel, very soon to be able to do whatever they feel they need to do,” Hochstein said. “The question is, is it wise to do it or not?”\n\nUltimately, whatever Iran agrees to will have to be approved by the country’s supreme leader, Ayatollah Ali Khamenei, who has both maintained a hardline on the nuclear issue and issued threats against the United States amid the military buildup.\n\n“More dangerous than the American warship is the weapon that can send it to the bottom of the sea,” he said, ominously, ahead of Tuesday’s talks.\n\nAmerican officials say getting Khamenei’s sign-off would be the most difficult part of any negotiation, and that dealing with lower-level envoys that lack his authority has the effect of prolonging talks.\n\nTrump, meanwhile, said last week that regime change in Iran — presumably including Khamenei’s ouster — would be the “best thing that could happen.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/trump-iran-negotiation-war-diplomacy",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b803fd4491681dc761d59271215f3761c1602b62c61458c4cc4eec5cc6f7e4fd",
  "scraped_at": "2026-02-18T07:31:16.331415+00:00"
}
