{
  "url": "https://lite.cnn.com/2026/02/16/business/hungary-russia-oil-orban-intl",
  "title": "By buying Russia’s oil, Hungary is fueling the Kremlin’s war machine – and enriching foundations linked to Orban | CNN Business",
  "date": "2026-02-16T07:34:03.592227+00:00",
  "authors": [],
  "text": "Source: CNN\n\nHungaryis buying Russian oil despite alternative supplies being available, according to a report that accuses Budapest of failing to pass down to consumers the savings it makes from buying cheap Russian fuels.\n\nInstead, the savings become profits for Hungary’s largest oil company, which is part-owned by foundations linked to Prime Minister Viktor Orbán, according to thereportfrom the Center for the Study of Democracy (CSD), a European-based public policy institute, which shared an advance copy of its analysis with CNN.\n\nThe CSD analysis found that domestic fuel prices in Hungary were on average 18% higher than in the neighboring Czech Republicin 2025, even though Budapest still buys cheaper Russian oil, while Prague buys costlier non-Russian alternatives.\n\nThe research undercuts Orbán’s claims that continuing to buy Russian oil, despite European Union-wide efforts to phase out Russian fossil fuels, makes fuel cheaper for Hungarians. Instead, the report found, the savings are accruing mostly to MOL, Hungary’s oil giant, which has seen its operating income soar 30% since Russia’s 2022 full-scale invasion of Ukraine.\n\n“The dependence on discounted Russian oil has not trickled down to consumers,” Martin Vladimirov, director of CSD’s energy and climate program, told CNN. “Instead the profit from reselling cheap oil goes in the pocket of the monopoly supplier MOL in the form of excess profit, which indirectly funds Orbán’s state capture networks.”\n\nCNN has asked the Hungarian government and MOL for comment.\n\nAfter Russia launched its all-out invasion of Ukraine nearly four years ago, EU members moved to end their dependence on Russian oil and gas. The EU gave Hungary, Slovakia and the Czech Republic – three Central European countries especially dependent on Russia for their energy – an exemption in 2022 and were told to reduce their reliance as soon as possible.\n\nThe Czech Republic has since stopped buying Russian oil, but Hungary and Slovakia used the EU’s exemption to deepen their dependence. Last year, Russia accounted for over 92% of Hungary’s crude oil imports, up from 61% pre-invasion, the report said. When the United States announcedsanctionson two Russian oil giants in October, Orbán traveled to the White House to ask forone-year exemption.\n\nUS President Donald Trump granted his ally’s request, saying it had been “difficult” for Hungary to wean itself off Russian fossil fuels, since it is landlocked.\n\nBut the CSD researchers said Hungary’s continued purchases ofRussian oilare a political choice, not a commercial or logistical necessity.\n\n“Despite full access to alternative supply routes… Hungary has deepened its dependence on Russian oil, turning a temporary EU exemption into a permanent loophole in the sanctions regime,” the report said.\n\nHungary receives Russian crude oil through the Druzhba pipeline, which runs through Ukraine, but it is also connected to the Adria pipeline, which runs through Croatia and pumps non-Russian crude oil from the Adriatic coast.\n\nThe CSD researchers said the Adria pipeline “has sufficient capacity” to meet Hungarian and Slovak demand, and that its transit fees are 1.7 times lower than those for the Druzhba pipeline, which runs through an active war zone.\n\nRussian crude oil is, however, significantly cheaper than non-Russian alternatives. The report found that, between January 2024 and August 2025, Russian crude oil was on average roughly 20% cheaper than non-Russian alternatives.\n\nBut that discount has not translated into lower prices for Hungarian consumers, according to the report.\n\nLast year, average weekly pre-tax fuel prices were 18% higher in Hungary than in the Czech Republic and 10% higher for diesel, the CSD said. Even though MOL bought Russian crude at a steep discount, the researchers said the company has still sold its products at prices similar to other regional markets, causing its profits to soar.\n\n“The company’s operating income rose 30% above pre-invasion levels, while three foundations linked to Prime Minister Viktor Orbán control 30.49% of MOL, enabling surplus profits to flow into some of Hungary’s most influential state-capture networks,” it said. Those foundations include the Mathias Corvinus Collegium, Hungary’s largest educational institution, which has close ties to Orbán’s government.\n\nThe CSD report comes as Hungary gears up for parliamentary elections in April, in which Orbán will face Péter Magyar, his first credible opponent in years. Orbán hascampaignedheavily on how his government has kept energy costs down, which the report calls into question.\n\nThe report also undermines Orbán’s claims that Hungary has no option but to purchase Russian oil. It found that Hungary’s refineries are technically capable of processing non-Russian crude and have done so in the past without disruptions. The CSD also pointed to how Bulgaria and the Czech Republic, which have stopped buying Russian oil since the invasion of Ukraine, “experienced no supply shocks and maintained some of the lowest fuel prices in the EU.”\n\nThe researchers recommended that the EU pass legislation proposed by the European Commission to ban Hungary and Slovakia’s imports of Russian crude oil as soon as possible.\n\n“The final stage of Europe’s energy decoupling from Russia is within reach. What remains is the political will to close the loopholes that continue to finance the Kremlin’s war machine,” the researchers said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/01/16/europe/orban-hungary-right-wing-campaign-election-intl",
      "text": "Hungary"
    },
    {
      "url": "https://csd.eu/publications/publication/cutting-the-cord/",
      "text": "report"
    },
    {
      "url": "https://cnn.com/2025/10/24/europe/hungary-orban-russia-oil-sanctions-intl",
      "text": "sanctions"
    },
    {
      "url": "https://cnn.com/2025/11/07/europe/orban-trump-oil-sanctions-hungary-latam-intl",
      "text": "one-year exemption"
    },
    {
      "url": "https://cnn.com/2025/11/28/energy/orban-putin-moscow-hungary-energy-oil-intl",
      "text": "Russian oil"
    },
    {
      "url": "https://x.com/PM_ViktorOrban/status/2021668419817398599?s=20",
      "text": "campaigned"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hungary-russia-oil-orban-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/business/hungary-russia-oil-orban-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b82eac001996c47e7362bddd3d5a2075ef51b2227142c1fc2862eeca90c6afbc",
  "scraped_at": "2026-02-16T07:34:03.592251+00:00"
}