{
  "url": "https://lite.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
  "title": "Takeaways: Supreme Court stands up to Donald Trump on emergency tariffs | CNN Politics",
  "date": "2026-02-23T07:38:00.179265+00:00",
  "authors": [
    "John Fritze",
    "Devan Cole",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Supreme Court struck down PresidentDonald Trump’s sweeping emergency tariffson Friday, a significant decision that couldredirect the course of the administration’s economic and foreign policy agenda.\n\nThe6-3 decision, which included both conservative and liberal justices in the majority, had the potential to reset the relationship between a White House that has repeatedly pushedlegal boundaries and a Supreme Court that has in case after case blessed those efforts since Trump returned to power.\n\nBut like most major Supreme Court opinions, the ruling Friday raised new questions about how the court’s broad parsing of federal law would play out in practical terms for American businesses, consumers and voters heading into a midterm election.\n\nIn a combative news conference hours after the decision, Trump attacked several justices and announced he would rely on other legal authorities to keep tariffs in place.\n\nHere’s what to know about the blockbuster decision:\n\nSince returning to the White House, Trump has racked up an impressive record at the conservative Supreme Court, including a decision that made it harder for lower courts toblock his agendaand a series of important emergency decisionsblessing his immigrationpolicies and hispush to consolidate powerwithin the executive branch.\n\nAnd in 2024, the courtgranted the president immunityfrom criminal prosecution for some of the actions he took in the waning days of his first term — a landmark decision that the administration continues to regularly cite in recent cases.\n\nBut that successful record in major, merits cases came to a crashing halt Friday. Two of the justices he named to the bench during his first term – Neil Gorsuch and Amy Coney Barrett – ruled against him.\n\n“I’m ashamed of certain members of the court,” Trump said in an angry news conference at the White House reacting to the decision, calling the justices in the majority a “disgrace to our nation.”\n\nEven though the court’s decision to strike down Trump’s emergency tariffs waspredicted following the oral argumentslast fall, the ruling is a formalrepudiation of the administration’s push-the-limits approach. It underscored the notion that federal courts are one of the last institutions within the federal government willing – at times –to tell the president “no.”\n\nChief Justice John Roberts warned in his 21-page opinion that the administration had tried to pitch a “‘transformative expansion’ of the president’s authority over tariff policy” to justify its global tariffs and “as demonstrated by the exercise of that authority in this case — over the broader economy as well.”\n\nBut it’s far too soon to say whether the opinion signals a resetting of the relationship between the executive and judicial branches. There are several other cases pending on court’s docket that Trump will have a difficult time winning, including his effort toend birthright citizenshipandfire a memberof the Federal Reserve Board.\n\nOther cases, including the fight over his push tofire the leaders at other independent agencies, have received a more favorable audience at the Supreme Court.\n\nThe court’s decision could have enormous consequences not only for the economy and foreign relations but also potentially for this year’s midterm election.\n\nTrump has faced pushback from some Republicans over his unprecedented use of tariffs. Now, he may need Congress to pursue the backup plans he hopes will fill the gap left by the decision. For instance, he will need help from lawmakers to extend a series of global tariffs he announced Friday.\n\nThat would put Republican lawmakers on the hook to vote for import duties during an election year.\n\n“President Trump is a very skilled negotiator, and I want him to continue to be successful in expanding market access,” Republican Sen. Chuck Grassley of Iowa said in a carefully worded statement. “I urge the Trump administration to keep negotiating, while also working with Congress to secure longer-term enforcement measures so we can provide expanded market opportunities and certainty for Iowa’s family farmers and businesses.”\n\nMost Americans see tariffs as generally harmful to the economy, according to recent polling conducted prior to the Supreme Court’s ruling on President Trump’s tariff policies, with a majority saying that the president’s authority to set tariffs should be limited. AMarquette Law Schoolpoll found that a 56% majority of said that tariffs hurt the US economy.\n\nAnd aNPR/PBS News /Marist pollfound that Democrats (87%) and independents (63%) call tariffs harmful to the economy.\n\nThe president made clear after the ruling that he will not back down from attempting to use tariffs. But Trump may now likely have to shift his messaging because his “backup” authorities are not as robust as the one he reached for early in this administration and that the Supreme Court has now shut down.\n\nHe’ll have his first real opportunity to do so on Tuesday when he delivers his State of the Union address.\n\nLast year, as Trump made his way off the House floor after delivering his speech to a joint session of Congress, he made a point to shake Roberts’ hand.\n\n“Thank you again,” Trumpcould be heard tellingthe chief, months after the court granted him immunity from criminal prosecution. “I won’t forget it.”\n\nTuesday, Roberts is unlikely to experience a similarly warm reception.\n\nThe timing of the Supreme Court’s tariffs decision has longbeen a point of speculation. Initially, the court expedited the case. Some market analysts predicted the court would rule as soon as December, theorizing that the majority wouldn’t want to allow the administration to continue to collect tariff revenue if it had determined the policy was illegal.\n\nIn the end, the court handed down its decision about 3 1/2 months after it heard arguments.\n\nWhile that timing was fairly standard, it also bumped the decision right up against Trump’s address on Tuesday. At least some justices are expected to attend, as they often do. They will sit in the front row, as in past years, straight faced and still.\n\nTrump, on the other hand, will have a global stage on which to air his grievances at the court, an effort that started immediately.\n\n“What a shame,” Trump said at the White House, describing the justices in the majority as “fools and lapdogs for the RINOs and the radical left Democrats.”\n\nAt one point, Trump suggested, without providing any evidence, that the justices who voted against him may have been influenced by foreign actors. He also said Gorsuch and Barrett – whom he appointed – were an “embarrassment to their families.”\n\nRoberts did not respond to CNN’s request for reaction to Trump’s comments.\n\nTrump had already raged for months over the court’s deliberations, complaining about the possibility that the justices could invalidate the policy. More recently, he complained that the court was taking too long to render a decision.\n\n“To think, I have to be in the United States Supreme Court for many, many months waiting for a decision on tariffs,” he complained during a speech in Georgia on Thursday. “I’ve been waiting forever.”\n\nMany justices have shunned showing up to the presidential address at all. The late Justice AntoninScalia once described the State of the Unionas a “childish spectacle.”\n\nIn 2010, Roberts told students at the University of Alabama that while he thought “anybody” can criticize the Supreme Court, the backdrop of the State of the Union might not be the best setting.\n\n“The image of having members of one branch of government standing up literally surrounding the Supreme Court cheering and hollering,” Roberts said, “is troubling.”\n\nTrump said Friday that the justices were still invited to his speech.\n\n“Barely,” he said.\n\n“Honestly, I couldn’t care less if they come.”\n\nThe dispute over Trump’s tariffs now heads back to lower courts, where judges will have to figure out how to sort through a repayment process that Justice Amy Coney Barrett predicted would be a procedural “mess.”\n\nIt was Barrett’s comment during oral arguments that, partly, had given some hope that the court would signal something about what should happen with the at least $134 billion the government has already collected. Instead, the court was silent.\n\nBecause of that silence, refunds will now almost certainly become a leading fight between the White House and the groups opposing the tariffs.\n\n“Time to pay the piper, Donald,” California Gov. Gavin Newsom, a Democrat, said in a statement. “These tariffs were nothing more than an illegal cash grab that drove up prices and hurt working families, so you could wreck longstanding alliances and extort them. Every dollar unlawfully taken must be refunded immediately — with interest. Cough up!””\n\nThe justices who ruled against Trump said nothing about how that process could play out. But Justice Brett Kavanaugh wrote in his dissenting opinion that the federal government “may be required to refund billions of dollars” to companies that paid the tariffs, noting that those businesses “may have already passed on costs to consumers or others.”\n\nIn recent months, scores of companies took the proactive step of bringing claims in federal court to ensure that they could recoup tariff payments should the justices rule against Trump.\n\nAmong those businesses is Costco, whose lawyers told the Court of International Trade in November that a lawsuit the major wholesaler brought that month was necessary “to ensure that its right to a complete refund is not jeopardized.”\n\nBut that flood of litigation is certain to take time and likely won’t proceed in earnest for several more months. It’s also possible that administrative channels are opened up for companies to attempt to obtain refunds over the tariff payments.\n\nDuring oral arguments at the high court last year, a lawyer for some of the companies challenging Trump’s tariffs pointed to a decades-old case in which importers had the ability to file an “administrative protest” to recoup a harbor maintenance tax that was declared unlawful by the justices.\n\n“It’s a very complicated thing,” the lawyer, Neal Katyal, told the justices. “The refund process took a long time.”\n\nDespite the court’s ruling, Trump isn’t totally out of options when it comes to imposing tariffs as part of his economic agenda.\n\n“We have alternatives,” Trump said at the White House in response to the decision. “Great alternatives.”\n\nKavanaugh, whose dissenting opinion was joined by conservative Justices Clarence Thomas and Samuel Alito, emphasized that other tools are available.The court’s majority opinion was silent on those other options, which more clearly provide the president authority to set import duties.\n\n“In essence, the court today concludes that the president checked the wrong statutory box by relying on IEEPA rather than another statute to impose these tariffs,” Kavanaugh wrote.\n\nThose other levers for imposing tariffs, while powerful, come with limitations on timing and scope, often requiring investigations before they can be employed.\n\n“While I am sure that they did not mean to do so, the Supreme Court’s decision today made a president’s ability to both regulate trade and impose tariffs more powerful and more crystal clear rather than less,” Trump said. “I don’t think they meant that.”\n\nTrump announced Friday that he would enact a 10% global tariff under a trade law known as Section 122. Trump does have broad power to impose tariffs under that law, but those levies can only be in place for a 150 days absent an extension from Congress.\n\nThe conservative Supreme Court repeatedly relied on a legal theory, the “major questions doctrine,” to strike down policies implemented by President Joe Biden that were not explicitly authorized in law. On Friday, Roberts and two conservative justices were prepared to rely on that same theory to shut down Trump’s tariffs.\n\nThe basic idea is that the executive branch has even less room to take actions based on vague laws when major political or economic questions are at stake. Critics have argued that the theory is largely made up and, because of that, is hard to apply. The opinion Friday underscored that, at the very least, the conservative justices are still working out the specifics of the theory.\n\nMuch of the writing in the decision focused on a quarrel between the justices over whether and how to apply the doctrine. Though technical, that is hugely important because how the court resolves that debate could foreshadow the outcome in future cases involving the president’s power.\n\nKavanaugh, among other criticisms, wrote that the doctrine shouldn’t apply in a case involving a president’s foreign affairs agenda.\n\n“This court hasneverbefore applied the major questions doctrine — or anything resembling it — to a foreign affairs statute,” he wrote. “I would not make this case the first.”\n\nBut Gorsuch framed the decision as fairly clear cut.\n\n“Whatever else might be said about Congress’s work in” the emergency law Trump was relying on, he wrote, “it did not clearly surrender to the president the sweeping tariff power he seeks to wield.”\n\nJustice Elena Kagan, joined by the two other liberals, rebuffed Roberts’ use of the major questions doctrine to side with Trump.\n\nKagan has in the past criticized the conservative majority’s use of the major questions doctrine to halt executive actions on environmental regulations. Likewise, she was wary of using that tool to strike down Trump’s tariffs, even though she agreed with the decision to do so.\n\n“I need no major-questions thumb on the interpretive scales,” Kagan wrote. “Without statutory authority, the president’s tar­iffs cannot stand.”\n\nCNN’s Adam Cancryn, Elisabeth Buchwald, Ariel Edwards-Levy and Tierney Sneed contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "Donald Trump’s sweeping emergency tariffs"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf",
      "text": "6-3 decision"
    },
    {
      "url": "https://www.cnn.com/2025/06/27/politics/takeaways-birthright-citizenship-supreme-court-decision",
      "text": "block his agenda"
    },
    {
      "url": "https://www.cnn.com/2025/09/08/politics/supreme-court-ice-patrols-california",
      "text": "blessing his immigration"
    },
    {
      "url": "https://www.cnn.com/2025/09/08/politics/supreme-court-ftc-commissioner-unpaid",
      "text": "push to consolidate power"
    },
    {
      "url": "https://www.cnn.com/2024/07/01/politics/supreme-court-donald-trump-immunity",
      "text": "granted the president immunity"
    },
    {
      "url": "https://www.cnn.com/2025/11/05/politics/takeaways-supreme-court-tariffs-trump",
      "text": "predicted following the oral arguments"
    },
    {
      "url": "https://www.cnn.com/2025/12/05/politics/supreme-court-agrees-to-hear-birthright",
      "text": "end birthright citizenship"
    },
    {
      "url": "https://www.cnn.com/2026/01/21/politics/takeaways-supreme-court-federal-reserve-lisa-cook-trump-power",
      "text": "fire a member"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/supreme-court-to-hear-separation-of-powers-dispute-over-fired-ftc-commissioner",
      "text": "fire the leaders at other independent agencies"
    },
    {
      "url": "https://law.marquette.edu/poll/2026/02/05/new-marquette-law-school-national-survey-finds-63-say-u-s-supreme-court-should-limit-trumps-tariff-authority/",
      "text": "Marquette Law School"
    },
    {
      "url": "https://maristpoll.marist.edu/wp-content/uploads/2026/02/NPR_PBS-News_Marist-Poll_USA-NOS-and-Tables_202602021147.pdf",
      "text": "NPR/PBS News /Marist poll"
    },
    {
      "url": "https://www.cnn.com/2025/03/18/politics/john-roberts-donald-trump-impeachment",
      "text": "could be heard telling"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/where-is-supreme-court-ruling-on-trump-tariffs",
      "text": "been a point of speculation"
    },
    {
      "url": "https://www.cnn.com/2015/01/20/politics/supreme-court-state-of-the-union/index.html",
      "text": "Scalia once described the State of the Union"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b86de8579d13a71b5a6e538263aaa10d2366a9b602e371acdcb5c60628801779",
  "scraped_at": "2026-02-23T07:38:00.179279+00:00"
}