{
  "url": "https://lite.cnn.com/2026/02/21/politics/ken-paxton-texas-senate-republican-primary",
  "title": "Controversy hasn’t stopped Ken Paxton yet. Will a Senate run be different? | CNN Politics",
  "date": "2026-02-24T07:33:56.843109+00:00",
  "authors": [
    "Eric Bradner, CNN"
  ],
  "text": "Source: CNN\n\nKen Paxton may be the political equivalent of Teflon.\n\nHe’s survived under a cloud of controversy all 12 years he has served as the state’s attorney general. Republicans in the state Houseimpeached himbefore the Senatedeclined to remove himfrom office, authoritiesinvestigated himfor securities fraud before reaching a settlement, and his wife – a state senator and longtime political adviser – accused him of adultery andfiled for divorcelast year on “biblical grounds.”\n\nHe’s still leading in the polls ahead of the March 3 primary for Texas’ Republican Senate nominationas he seeks to unseat incumbent Sen. John Cornyn, a longtime rival.\n\nOn the line is a key US Senate seat and possibly the GOP majority. Paxton’s bid hasworried national Republicanswho think boosting him through the November midterms would cost hundreds of millions of dollars and embolden Democrats who think he could be the right opponent for them to break a three-decade statewide losing streak.\n\nA competitive race in Texas would fundamentally alter the midterm landscape. Democratsneed to net four flipped seats to take control of the Senatein November, and their top targets now are North Carolina, Maine, Alaska and Ohio — all contests where party leaders recruited a candidate who has won statewide before.\n\nTexas could give Democrats another chance — and some Democrats in the state believe Paxton would be more vulnerable this year than Sen. Ted Cruz was when former US Rep. Beto O’Rourkecame within 3 pointsof defeating him in 2018.\n\nBut it’s also a vastly more expensive state. And for all of the headlines about him, Paxton is a proven statewide winner.\n\nDemocrats who have run against Paxton in the past said the party should be careful what it wishes for.\n\n“For every one of those Democrats who’s hoping for him to win, I hope they’re willing to invest hundreds of millions of dollars into the state to fight him,” said Rochelle Garza, the Democratic nominee for attorney general in 2022, in a race Paxton won by nearly 10 percentage points. “I cannot underscore enough how dangerous it will be to have him as a senator from this state.”\n\nPaxton’s record includes suing Democratic presidents Barack Obama and Joe Biden roughly 150 times combined, delighting conservatives who saw him as among the party’s most aggressive crusaders against federal overreach. Hebacked President Donald Trump’s false claims about voter fraudin 2020, unsuccessfully suing four swing states that Biden had won and asking the Supreme Court to block their Electoral College votes from being counted.\n\nPaxton has also benefitted from the backing of major Texas conservative power brokers – particularlyTim Dunn, the oil and gas magnate from Midland who has also aligned himself with Trump’s political and policy operations. Dunn has poured millions into backing Paxton in the past and supported efforts to oust Republicans in the Texas House of Representatives who had voted to impeach him in 2024 primaries.\n\nHowever, with this election, that appears to have changed: Political action committees aligned with Dunn have not spent to support Paxton. Paxton did get a potentially important boost when Turning Point Action, the conservative nonprofit founded by the late Charlie Kirk,endorsed himthis month.\n\nPaxton lags far behind Cornyn in the fundraising battle and has been swamped on the airwaves with $58.9 million of the $92.8 million total in ads reserved so far, according to the tracking firm AdImpact, being spent by groups supporting Cornyn. For Paxton, ad spending is a relatively paltry $2.3 million.\n\nAs he rallied dozens of supporters Thursday night northwest of Houston, Paxton urged Republican voters to ignore the onslaught of “these fake ads” currently blanketing the state’s airwaves, attacking his record.\n\n“Trump went through the very same thing, and look where he’s at,” Paxton told reporters Thursday after his rally at The Angry Elephant, a politics-themed bar and restaurant in Magnolia. “It’s going to be the same way for me.”\n\nA recent University of Houston Hobby School of Public Affairs poll showed Paxton in the lead with 38% support among likely GOP primary voters, compared to 31% for Cornyn and 17% for US Rep. Wesley Hunt, with 12% undecided.\n\nIf no candidate tops 50% on March 3, the top two finishers would move on to a May 26 primary runoff.\n\nTrump has not endorsed a candidate so far.\n\nAs Republicans sort through their three-way Senate primary, Democrats are choosing between state Rep. James Talarico and US Rep. Jasmine Crockett in the Senate race.\n\nThey argue that even in deep-red Texas,  the Senate seat is likelier to be in play if Republicans nominate Paxton rather than Cornyn – known for a more neutral demeanor and a record of working with Democrats even as he hasangered some Trump supportersfor challenging the president in the past.\n\nGarza, who is now president of the Texas Civil Rights Project, an advocacy group, said running against Paxton means facing an opponent who “operates with absolute impunity.” She said Paxton would not agree to debate her, but she believes “it did get under his skin” when her campaign cast him as corrupt in advertisements.\n\n“If you turn Texas, the whole country turns,” Garza said. “I do think it’s an issue of investment. I also think it’s an issue of talking about who Ken Paxton really is: He’s a crook. He’s a thief. He’s a cheater. He’s only interested in his own power and staying in power so that he doesn’t go to jail.”\n\nPaxton, for his part, told reporters Thursday night that faced with investigations, “we overcame them all.”\n\n“You can make up whatever you want to make up. The allegations are the allegations. But the truth is the truth,” he said.\n\nHe also pointed to Trump being impeached twice and said his own impeachment in the state House – which Paxton survived because the state Senate ultimately voted against convicting him – is not a “disqualifying event.”\n\n“What matters is what the people of Texas think, and they’ve been behind me from the beginning,” Paxton said.\n\nAt The Angry Elephant – which specializes in hot dogs like the “Joe Biden ‘Shroom Dog” and the “Al Gore Frito Pie Dog” – Paxton devoted most of his stump speech Thursday night to recounting his legal battles against the Obama and Biden administrations.\n\n“We were standing up for Texas. We were standing up for Constitution. We were standing up for the rest of the country,” Paxton said, with a large photograph of Richard Nixon campaigning in Philadelphia in 1968, in front of a “Nixon’s the one!” banner, displayed on the wall behind him.\n\nDawn Bednarz, a 57-year-old retiree who worked in special education and attended Paxton’s event, said she sees the attorney general as “a fighter.”\n\n“They have thrown everything at him,” she said. “He has fought for us. He has fought for the mothers, he’s fought for our children and he delivers results.”\n\nBednarz acknowledged that Paxton “is going to be controversial,” but she said she has no concerns about his electability.\n\n“We need fighters now,” she said. “My kids and my grandkids, if I ever get them – they need a shot at what I had, and they’re not going to have it with the way things are going.”\n\nSally, a retiree who wouldn’t share her last name, citing privacy concerns, said she sees Paxton as more representative of her values than Cornyn and Hunt.\n\n“I don’t always like his politics. I don’t always like his baggage,” she said of Paxton. “But I want someone that votes the way we do.”\n\nAn hour before Paxton’s Thursday night event, at an early voting center in nearby Spring, electability was on the minds of several Republican voters who spoke with CNN.\n\nRetirees William and Barbara Stringer, from The Woodlands, said they like Paxton, but voted for Cornyn because they fear Paxton would lose in November.\n\n“I think he did a good job as attorney general, but he’s got a lot of baggage,” William Stringer said.\n\n“Too much baggage,” Barbara Stringer added.\n\nTommy Gober, a cybersecurity instructor who lives in The Woodlands, said he was thinking about electability and his desire to “tone down some of the rhetoric” when he cast his ballot for Hunt.\n\n“He’s not the most moderate candidate, but I think he is more moderate” than Paxton, Gober said of Hunt.\n\nConnie, a retiree who said she wouldn’t share her last name because of privacy concerns, also voted for Hunt – but said “Ken Paxton was another one I would have went with. It was a toss-up.”\n\nA deciding factor, she said, was that she believes Hunt stands a better chance of beating the winner of the Democratic primary.\n\nAt The Angry Elephant, most of the crowd was strongly behind Paxton. But Paula Jones, who lives in Montgomery and works for her husband’s oil and gas equipment business, arrived late and was disappointed to find that Paxton had only spoken for about 15 minutes and hadn’t addressed or taken any questions from the crowd about the affair or corruption allegations he faces.\n\nShe said she’d ruled out voting for Hunt after learning that he’d missed dozens of House votes this year while campaigning for the Senate. But she does plan to vote in the Republican primary and is deciding between Cornyn and Paxton.\n\nShe said the controversies surrounding Paxton aren’t necessarily dealbreakers.\n\n“That’s a typical man. That’s a narcissistic man – and you know, our president may be a little like that too,” Jones said, adding that she’s a strong Trump supporter. “Those are usually the ones that are most successful when they set their minds to it, and they forget how to behave everywhere else at times. That doesn’t mean they’re not good for the job.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2023/05/27/politics/ken-paxton-impeachment-texas-house",
      "text": "impeached him"
    },
    {
      "url": "https://www.cnn.com/2023/09/16/politics/ken-paxton-impeachment-trial",
      "text": "declined to remove him"
    },
    {
      "url": "https://www.cnn.com/2024/03/26/politics/texas-ag-paxton-settles-case",
      "text": "investigated him"
    },
    {
      "url": "https://www.cnn.com/2025/07/10/politics/ken-paxton-divorce-texas-senate",
      "text": "filed for divorce"
    },
    {
      "url": "https://www.cnn.com/2025/04/06/politics/cornyn-texas-senate-primary",
      "text": "worried national Republicans"
    },
    {
      "url": "https://www.cnn.com/2026/01/18/politics/senate-2026-midterm-elections-voters",
      "text": "need to net four flipped seats to take control of the Senate"
    },
    {
      "url": "https://www.cnn.com/2018/11/06/politics/texas-senate-ted-cruz",
      "text": "came within 3 points"
    },
    {
      "url": "https://www.cnn.com/2020/12/10/politics/texas-attorney-general-ken-paxton-supreme-court-case",
      "text": "backed President Donald Trump’s false claims about voter fraud"
    },
    {
      "url": "https://www.cnn.com/2022/07/24/politics/texas-far-right-politics-invs",
      "text": "Tim Dunn"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/ken-paxton-turning-point-endorsement-texas-senate",
      "text": "endorsed him"
    },
    {
      "url": "https://www.cnn.com/2025/04/06/politics/cornyn-texas-senate-primary",
      "text": "angered some Trump supporters"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/ken-paxton-texas-senate-republican-primary",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/politics/ken-paxton-texas-senate-republican-primary",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b8d85aa2db95dc91f93ff9f5e034596a7b948262d095094c2298e426d8e279b2",
  "scraped_at": "2026-02-24T07:33:56.843122+00:00"
}