{
  "url": "https://lite.cnn.com/2026/02/20/europe/trash-dumping-dog-trained-italy-intl-scli",
  "title": "Man trained dog to illegally dump garbage, Italian authorities say | CNN",
  "date": "2026-02-22T07:10:46.279997+00:00",
  "authors": [
    "Barbie Latza Nadeau, CNN"
  ],
  "text": "Source: CNN\n\nSome people will go to extreme lengths to avoid paying for regular garbage collection – and sometimes they enlist help from man’s best friend.\n\nAuthorities in Sicily, Italy, have released footage of a dog carrying garbage to a rogue land dump near Catania.\n\nThe cunning canine can be seen carrying a large bag of trash with his teeth and gingerly leaving it on the roadside, according to video released by the Catania municipality Thursday.\n\n“Inventiveness… can never be an alibi for incivility,” the local authority said in a post on Facebook.\n\n“The environmental unit of Catania’s municipal police has released two videos recorded by surveillance cameras in which a dog is seen depositing a bag of waste in the street,” the post read.\n\n“This behavior is both cunning and doubly unfair, because in addition to littering the city, it attempts to evade the rules by exploiting the unwitting four-legged friend. Respect for urban decorum and the environment is everyone’s duty.”\n\nThe man has been identified and fined, according to the post.\n\nThe episode underscores what is a burgeoning problem across Italy.\n\nThe situation is particularly bad in the southern provinces and islands, where garbage collection is sometimes as low as 57%, meaning garbage can be left in dumpsters and trash cans for days.\n\nThe capital Rome has the highest rate of garbage tax evasion, according to the authorities, followed by Naples.\n\nRates of collection are much higher in the northern regions of Italy, where rates of evasion are considerably lower, according to the Guardia di Finanza (Financial Police).\n\nEach year, nearly 10,000 waste related offenses, including illegal dumping, burning and burying are recorded each year, according to the Legambiente environmental group, prompting many municipalities to set up surveillance camera traps to monitor illegal activity.\n\nFines for illegal dumping range from €1,500 ($1,770) to €18,000 ($21,200) and in some cases carry criminal charges. Illegal dumping is often tied to organized crime syndicates who are known as the eco-mafia by law enforcement.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/europe/trash-dumping-dog-trained-italy-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/europe/trash-dumping-dog-trained-italy-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "b923bbc8a3f5fb48bc351a25ac47bd72c455860ca31692b7a595d92b2ffc145a",
  "scraped_at": "2026-02-22T07:10:46.280014+00:00"
}