{
  "url": "https://lite.cnn.com/2026/02/18/europe/pope-leo-board-of-peace-refusal-intl",
  "title": "Vatican will not participate in Trump’s ‘Board of Peace’ | CNN",
  "date": "2026-02-19T07:31:18.455490+00:00",
  "authors": [
    "Christopher Lamb, CNN"
  ],
  "text": "Source: CNN\n\nPope Leo XIV will not be joining US President Donald Trump’s“Board of Peace,”the Vatican’s top diplomat said Tuesday, adding that the United Nations should be left to handle crisis situations.\n\nThe board, which will be chaired indefinitely by Trump, was originally designed to oversee reconstruction of Gaza. However, its objective has since expanded to make the board a global peacekeeping body.\n\nPope Leo was invited to join the board last month.\n\nCardinal Pietro Parolin, the Holy See Secretary of State, told reporters they will not take up the invitation saying they were left “perplexed” by some points of the plan and that “critical issues” needed to be resolved.\n\nThe cardinal said that one of the Vatican’s concerns “is that at the international level it should above all be the UN that manages these crisis situations. This is one of the points on which we have insisted.”\n\nParolin’s comments came after attending an event with the Italian government to mark the anniversary of the Lateran Pacts, which created the Vatican City as a sovereign state nearly a century ago.\n\nWhile Italy and the European Union have said they plan to attend the board as observers, the cardinal said the Vatican would not “participate in the Board of Peace because of its particular nature, which is evidently not that of other States.”\n\nThe White House called the Vatican decision “deeply unfortunate.”\n\n“I don’t think that peace should be partisan or political or controversial. And of course, the administration wants all those who were invited to join the board of peace to join,” White House Press Secretary Karoline Leavitt said on Wednesday. “This is a a legitimate organization where there are tens of member countries from around the world, and we think that’s an unfortunate decision,” she added.\n\nThe Vatican is not the only state to have declined invitations. Britain, France and Norway are not signing up. Diplomats, officials and world leaders have expressed concerns over the expanded remit of the board, Trump’s indefinite chairmanship and the potential damage it could cause to the UN’s work.\n\nPope Leo XIV, the first US-born pontiff, has made peacemaking a central part of his papacy, warning last month that “war is back in vogue” in a major diplomatic address. Leo stressed the UN “should play a key role” in addressing conflicts while insisting on the importance of humanitarian law.\n\nThe pope has made repeated appeals for Gaza since his election, called for a two-state solution, and for the right of Palestinians to live peacefully “in their own land.” During the Israel-Hamas war he pressed for the release of the October 7 hostages, maintained dialogue with Israel’s leaders and has lamented the rise of antisemitism.\n\nLeo has criticized Trump’s policies on immigration while the pontiff’s insistence on international, humanitarian law contrasts with a president who told The New York Times in January that he feels constrained only by his “own morality” while dismissing international law and the post-World War II order.\n\nThe board is due to holdits first meetingin Washington on Thursday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/world/trump-board-of-peace-explainer-intl-hnk",
      "text": "“Board of Peace,”"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/europe/pope-leo-state-of-world-address-envoys-intl",
      "text": "war is back in vogue"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/politics/trump-board-of-peace-meeting-gaza",
      "text": "its first meeting"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/europe/pope-leo-board-of-peace-refusal-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/europe/pope-leo-board-of-peace-refusal-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ba38a52b6d4e55dda11921f0d5b01b2276241348b4bf2c56bfb4eedd5d09ca59",
  "scraped_at": "2026-02-19T07:31:18.455502+00:00"
}