{
  "url": "https://lite.cnn.com/2026/02/19/politics/voter-fraud-dhs-us-citizens-voted-naturalized",
  "title": "DHS is hunting for any US citizens who may have voted before being naturalized | CNN Politics",
  "date": "2026-02-20T07:28:07.703265+00:00",
  "authors": [
    "Priscilla Alvarez",
    "Tierney Sneed",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Department of Homeland Security is doubling down on the administration’s ongoing investigations into potential voter fraud — reviewing cases involving US citizens and whether they registered to vote, or voted, prior to being naturalized, according to an internal memo reviewed by CNN.\n\nThe request, stemming from President Donald Trump’s March executive order on voting, marks one of the latest initiatives by his administration to amplify allegations of voter fraud and pursue the denaturalization of US citizens.\n\nThe memo, distributed to leadership last week, states that Homeland Security Investigations’ Identity and Benefit Fraud Unit is overseeing the initiative “designed to identify, investigate, and disrupt activities that undermine the integrity of federal, state, and local elections, and to ensure compliance with applicable election laws.”\n\nIt also requested that HSI offices “review all open and closed voter fraud cases… and identify any person(s) who registered to vote, and/or voted in any federal, state, or local election, and subsequently became naturalized United States citizens.”\n\n“This is nothing new. We are implementing the executive order signed by the President,” a spokesperson for the Department of Homeland Security told CNN. “Not only should illegal aliens NOT be electing American leaders—but it is a felony and federal crime to vote in federal elections.”\n\nThe initiative was first reported byMSNOW.\n\nIn addition to the White House push on voter fraud, the administration has tried to broaden federal power to strip citizenship as part of a larger effort linked to Trump’s hardline immigration policies.\n\nThe specter of non-citizen voting has been a focus of Trump and his allies, including in Congress, where Republicans are advancing legislation that would require Americans show documents proving their citizenship when they register to vote.\n\nInstances of non-citizens voting are rare, but election officials and voter advocates acknowledge that non-citizens do sometimes end up on registration rolls, often inadvertently.\n\nSeveral states arealready using federal immigration datato vet their rolls and those reviews have frequently flagged false positives, CNN has reported. For instance, in Idaho, after a search of that data tagged 760 potential non-citizens among 1 million-plus resident on the rolls, further review by election officials narrowed the list to about a dozen cases that were referred for possible federal criminal investigation.\n\nThe new memo cites a number of federal criminal statutes targeting fraudulent voting and registration for immigration authorities to consider. Those statutes require that the person to have “knowingly” registered to vote or voted when they were ineligible.\n\nThe new memo comes as the White House had already been coordinating plans last fall between the Justice Department and the Department of Homeland Security for sharing data as part of the conservative pursuit of voter fraud.\n\nThe aim of that push, according to a source familiar with internal administration discussions that took place late last year, was to identify names on voter rolls who might not be US citizens.\n\nThe Justice Department is currently on an unprecedented campaign to obtainprivate voter datafrom state voter rolls, which could include social security numbers or driver’s license numbers, and has brought 25 lawsuits against state election officials. DOJ has sued officials — mostly Democrats — that have refused to hand over the confidential registration information. Some Republican state election chiefs are balking at the data request as well.\n\nIn court filings and in official correspondence with the states, the Justice Department has claimed itneeds the data for enforcement of federal voter registration lawsthat govern the removal of deceased voters and voters who have moved, as well as require that states maintain a centralized, digitized voter registration list. Justice Department officials have also verbally told election officials they intend to review the voter rolls against federal voter immigration data, according to West Virginia Secretary of State Kris Warner.\n\nIn the handful of the DOJ voter roll cases where judges have issued rulings, the judges have all ruled against the Trump administration — either rejecting the DOJ arguments for obtaining the data on the merits or throwing out the cases for procedural reasons.\n\nCNN’s Katelyn Polantz contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.ms.now/news/memo-shows-white-house-directing-dhs-to-hunt-for-voter-fraud-by-naturalized-citizens",
      "text": "MSNOW"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/trump-voter-roll-audit-push",
      "text": "already using federal immigration data"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/republican-election-officials-trump-voter-roll",
      "text": "private voter data"
    },
    {
      "url": "https://files.constantcontact.com/e949222d701/ed164568-7c31-48e6-a03f-89f082080313.pdf",
      "text": "needs the data for enforcement of federal voter registration laws"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/voter-fraud-dhs-us-citizens-voted-naturalized",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/voter-fraud-dhs-us-citizens-voted-naturalized",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bb57bdb7d5798a006da5ffee59bf193b13026c98cdb73c3af789c706b75b7148",
  "scraped_at": "2026-02-20T07:28:07.703281+00:00"
}