{
  "url": "https://lite.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
  "title": "Takeaways from Donald Trump’s State of the Union address | CNN Politics",
  "date": "2026-02-25T07:31:29.267254+00:00",
  "authors": [
    "Aaron Blake"
  ],
  "text": "Source: CNN\n\nPresident Donald Trumpdelivered the first State of the Union address of his second term Tuesday night at the US Capitol.\n\nThe speech came shortly after the Supreme Courtstruck downhis signature global tariffs, as he considers a second round ofpotential military strikes on Iranand as his political fortunes appear to be aboutas low as they’ve ever beenin either of his two terms.\n\nTrump’s speech clocked in at about an hour and 47 minutes, breaking the record for length set by his address to Congress last year.\n\nHere are eight takeaways from his speech.\n\nTrump has struggled to halt his declining political fortunes in recent months. But as he tried to frame up the 2026 election on Tuesday night, he turned to an old faithful: immigration.\n\nAfter gesturing at “angel moms” whose children were victimized by undocumented immigrants, Trump said voting for Democrats would be voting to reopen America’s borders.\n\n“We can never forget that many in this room not only allowed the border invasion to happen before I got involved, but indeed they would do it all over again if they ever had the chance,” he said.\n\nTrump then did something he loves to do with these speeches: challenge Democrats to decide whether to applaud.\n\nHe urged members to stand up and show support if they agreed with the statement that “the first duty of the American government is to protect American citizens, not illegal aliens.”\n\nDemocrats remained seated.\n\nRepublicans, meanwhile, sought to emphasize the moment, standing and applauding for a long time to show the contrast.\n\nEventually, Trump spoke again and told Democrats, “You should be ashamed of yourself not standing up.” Democratic Reps. Rashida Tlaib of Michigan and Ilhan Omar of Minnesota yelled at Trump, despite Democratic leaders having previously warned their members against outbursts.\n\nTrump often turns to immigration in election years. The issue isn’t as strong for him as it once was, and in fact he’squite a bit underwater on itthanks to what Americans overwhelmingly views as overzealous actions by federal officials in Minneapolis and elsewhere.\n\nBut polls also show Americans still tend to favor the Republican Party over the Democratic Party on the issue of immigration.\n\nTrump didn’t offer a repeat of Friday’sangry broadside against the US Supreme Courtfor striking down his global tariffs. He instead focused on claiming he still has great leverage with other tariff authorities (which ishighly debatable).\n\nHe did, however, make some news on the tariff front.\n\nFor one, he volunteered that Congress shouldn’t bother codifying his tariffs into law.\n\n“Congressional action will not be necessary,” Trump said.\n\nIt’s clear tariffs make even many Republicans uncomfortable, and it appears unlikely Congress could pass anything anyway. But with his tariff authoritiesstill uncertain, Trump not asking Congress to pass something that has a better chance of passing legal muster was something to see. (The Constitution, after all, gives Congress the power to tariff.)\n\nThat suggests Trump has not heeded Justice Neil Gorsuch’s plea forAmerican government to start including more legislating.\n\nThe president also made a big prediction.\n\n“I believe the tariffs paid for by foreign countries will, like in the past, substantially replace the modern-day system of income tax, taking a great financial burden off the people that I love,” he said.\n\nIndeed, early in American history, tariffs were the predominant form of taxation. But Trumpprobably shouldn’t hold his breathon that one.\n\nTlaib and Omar weren’t the only ones who ignored Democratic leaders’ pleas for lawmakers to avoid outbursts. (Tlaib urged Trump to release more Epstein files, while Omar accused the president of killing Americans.)\n\nEarly in the speech, Rep. Al Green of Texas was escorted from the House chamber, as he wasduring Trump’s speech to Congress last year. When Trump entered the chamber, Green displayed a sign behind him that said, “Black people aren’t apes!” – a reference to Trump recentlysharing and then deleting a racist videodepicting the Obamas as apes.\n\nGreen was censured by the House after last year’s outburst.\n\nAnd when Trump claimed he had ended eight wars, a Democrat echoed GOP Rep. Joe Wilson’s infamous outburst aimed at then-President Barack Obama, calling Trump a liar.\n\nStill other members made a show out of leaving the chamber mid-speech.\n\nTrump is nothing if not a showman. And Tuesday’s speech includedplenty of stagecraftand attempts at creating memorable moments.\n\nHe spent an extended period of the early part of the speech paying tribute to the gold medal-winning US men’s Olympic hockey team, with most of the team present in the gallery. He then said he would give one of them, goaltender Connor Hellebuyck, a Presidential Medal of Freedom for his performance.\n\nAs Trump introduced the players, he reprised his line from his 2016 campaign about winning so much that people would get tired of winning.\n\nThe president also repeatedly pointed throughout the speech to whether Democrats were standing and applauding. When many did so for the hockey team, he intoned: “That’s the first time I’ve ever seen them get up.”\n\nMedals also abounded.\n\nTrump awarded a Legion of Merit and two Medals of Honor. The latter included one to 100-year-old Korean War veteran Royce Williams and another to Chief Warrant Officer 5 Eric Slover, for his role in the Trump-ordered mission to oust then-Venezuelan President Nicolás Maduro.\n\nThere was also a heartwarmingfamily reunion for Enrique Márquez, a political prisoner of the Maduro regime.\n\nTrump steered clear of some key vulnerabilities.\n\nWhile he attacked Democrats for the current shutdown of the Department of Homeland Security, he didn’t mention the reason Democrats have held out: immigration agents killing two US citizens, Renee Nicole Good and Alex Pretti, in Minneapolis. Trump also didn’t mention the embattled US Immigration and Customs Enforcement agency. He didn’t even give much mention to his deportation efforts.\n\nNor did Trump mention the Epstein files, despite his administration claiming it demonstrated real transparency by releasing them (after Congress forced it to).\n\nAnd Trump didn’t spend much time at all on his prescriptions for the economy and affordability – an issue that he still hasn’t figured out how to talk about, despite it probably being his party’s biggest liability.\n\nOne of the most urgent questions is what Trump will do about Iran. Eight months after striking its nuclear facilities, the president has entertained further strikes if Iranian leaders don’t cut a deal.\n\nBut even as he’s done this, Trump hasn’t made a coherent or focused case for war.\n\nHe started to make an attempt on Tuesday, and his brief pitch was an all-of-the-above pitch.\n\nTrump claimed Iran and its proxies have “killed and maimed thousands of American service members” with roadside bombs. He also said the Iranian regime had killed “it looks like 32,000 protesters.”\n\nBut perhaps most notably, he talked about Iran’s nuclear threat. And he for once tried to reconcile striking Iran again with his past claims that he had“obliterated” Iran’s nuclear programjust eight months ago.\n\n“They were warned to make no future attempts to rebuild their weapons program, in particular, nuclear weapons,” Trump said. “Yet they continue starting it all over. We wiped it out, and they want to start all over again – and are, at this moment again, pursuing their sinister ambitions.”\n\nTrump concluded by saying he still prefers to cut a deal.\n\nThen he added: “But one thing is certain: I will never allow the world’s number one sponsor of terror, which they are by far, to have a nuclear weapon. Can’t let that happen.”\n\nAnother major subplot: What Trump might do on a more functional level to impact the 2026 midterm elections, which are looking increasingly dire for the GOP.\n\nHe’s pushing hard for Congress to pass strict voter ID legislation called the “Save America Act”; his Justice Department has seized 2020 ballots in Fulton County, Georgia; and he’s spoken vaguelyabout “nationalizing” elections.\n\nRemember, Trump himself mounted an unprecedented effort to overturn the 2020 election based on falsehoods, showing he’s capable of going to extreme places.\n\nOne statement stood out Tuesday night.\n\n“They want to cheat,” Trump said of Democrats. “They have cheated, and their policy is so bad that the only way they can get elected is to cheat. And we’re going to stop it. We have to stop it.”\n\nThere is no evidence of widespread fraud in recent elections, and Democrats have won plenty in recent American history. But this statement suggests Trump could again go to some pretty ugly places in a tough election year for the GOP.\n\nTrump is no stranger to false claims, and his speech Tuesday night wasunsurprisingly replete with them.\n\nWhen he began touting his record, the president quickly cited that he inherited “inflation at record levels.” But while the most recent reading was a rate of 2.4% in January, marking an eight-month low, it was 3.0% in January 2025, which is far off any records. (It fell sharply over Biden’s last 2.5 years in office after it hit a 40-year high of 9.1% in June 2022.)\n\nHe also said he inherited a “wide-open border.” But while border crossings have hit 21st Century lows in this term, they had already dropped substantially late in President Joe Biden’s tenure.\n\nTrump claimed gas was below $2.30 per gallon in some states. AAA shows the average priceisn’t that low in any state.\n\nHe claimed investment “commitments for more than $18 trillion pouring in from all over the globe.” This iswildly exaggerated.\n\nHe also said, “More Americans are working today than at any time in the history of our country.” That is strictly true, in terms of raw numbers, but that’s because the population has grown. Indeed, the unemployment rate has risen under Trump and job growthwas anemic in 2025, one of the worst years in decades.\n\nTrump claimed we were in a “golden age” and that the “roaring economy is roaring like never before.” But to make that claim, he took plenty of liberties.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "struck down"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/iran-trump-military-options-nuclear",
      "text": "potential military strikes on Iran"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/trump-approval-rating-independents-cnn-poll",
      "text": "as low as they’ve ever been"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/politics/ice-polling-americans-views-immigration",
      "text": "quite a bit underwater on it"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/donald-trump-tariffs-economic-agenda",
      "text": "angry broadside against the US Supreme Court"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/tariffs-ruling-supreme-court-trump-gop",
      "text": "highly debatable"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/politics/donald-trump-tariff-difficulties-section-122",
      "text": "still uncertain"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-us-iran-02-20-26?post-id=cmlv52i4i000a3b6ub7v3leqn",
      "text": "American government to start including more legislating"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026#cmm1frzzt0000356r3tzvxxqt",
      "text": "probably shouldn’t hold his breath"
    },
    {
      "url": "https://www.cnn.com/2025/03/05/politics/al-green-house-gop-censure",
      "text": "during Trump’s speech to Congress last year"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/donald-trump-obamas-apes-truth-social",
      "text": "sharing and then deleting a racist video"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026?post-id=cmm1irx5700013b6sdryvfm2i",
      "text": "plenty of stagecraft"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026?post-id=cmm1ibdly00043b64xkprw6wp",
      "text": "family reunion for Enrique Márquez"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/nuclear-program-iran-trump-strike",
      "text": "“obliterated” Iran’s nuclear program"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/leavitt-trump-contradict-nationalize-elections",
      "text": "about “nationalizing” elections"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/fact-check-state-of-the-union",
      "text": "unsurprisingly replete with them"
    },
    {
      "url": "https://gasprices.aaa.com/state-gas-price-averages/",
      "text": "isn’t that low in any state"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/fact-check-trump-wsj-op-ed",
      "text": "wildly exaggerated"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/economy/us-sotu-economy-trump-vis",
      "text": "was anemic in 2025"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bc29a926bf7f266068983b8e9b7eef456522e3ec0b01464f4877489bf820a522",
  "scraped_at": "2026-02-25T07:31:29.267270+00:00"
}