{
  "url": "https://lite.cnn.com/2026/02/09/politics/us-strikes-boat-2-killed-1-survivor",
  "title": "US military says 2 killed in boat strike, with 1 survivor | CNN Politics",
  "date": "2026-02-11T16:33:42.148300+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe US military conducted a strike againstanother alleged drug-trafficking boatin the eastern Pacific Ocean on Monday, killing two people with one survivor, according to US Southern Command.\n\n“On Feb. 9, at the direction of #SOUTHCOM commander Gen. Francis L. Donovan, Joint Task Force Southern Spear conducted a lethal kinetic strike on a vessel operated by Designated Terrorist Organizations,” SOUTHCOMsaid on X, noting the US Coast Guard had been notified to activate a search and rescue mission for the survivor.\n\nA Coast Guard spokesperson told CNN in a statement that “Maritime Rescue Coordination Center Ecuador has assumed coordination of search and rescue operations,” and that USCG would provide technical support.\n\nAt least 121 people have now been killed in strikes on suspected drug boats as part of Operation Southern Spear, a campaign the Trump administration says is aimed at curtailing narcotics trafficking.\n\nThe administration has labeled those killed as “unlawful combatants” and claimed the ability to engage in lethal strikes without judicial review due to aclassified Justice Department finding.\n\nMonday’s boat strike is the third publicly known attack of the year, and the second to leave a survivor.A strike in Januarykilled two people and left one survivor.\n\nThe administration has publicly presented little evidence that those killed in Operation Southern Spear are affiliated with drug cartels, or that each of the vessels had drugs on them.\n\nThe legality of the strikes has also come under intense scrutiny in Congress since the operations began in September. There is including particular interest in the first attack on September 2, which included a follow-up strike that killed two crew members who had initially survived. Multiple current and former military lawyers previously told CNN the strikes do not appear lawful.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/02/politics/timeline-us-strikes-caribbean-pacific-vis",
      "text": "another alleged drug-trafficking boat"
    },
    {
      "url": "https://x.com/Southcom/status/2021023735881564262",
      "text": "said on X"
    },
    {
      "url": "https://www.cnn.com/2025/10/06/politics/classified-justice-department-memo-cartel-strikes",
      "text": "classified Justice Department finding"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/us-military-strikes-boat-pacific-survivor",
      "text": "A strike in January"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/us-strikes-boat-2-killed-1-survivor",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/us-strikes-boat-2-killed-1-survivor",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bca3a3873f1e7a47cc52effc52bcd5c191eb223039d28e200261423b6ecc0f71",
  "scraped_at": "2026-02-11T16:33:42.148313+00:00"
}