{
  "url": "https://lite.cnn.com/2026/02/18/politics/texas-senate-primary-cornyn-paxton-hunt-crockett-talarico",
  "title": "Electability and enthusiasm: How the Texas Senate primaries are testing the direction of both parties | CNN Politics",
  "date": "2026-02-19T07:31:22.605373+00:00",
  "authors": [
    "Arlette Saenz, CNN"
  ],
  "text": "Source: CNN\n\nIn Texas, a pair of US Senate primaries set for next month have emerged as an early gauge of where the energy is in both political parties and sparked a sharp debate over what it will take to win the reliably Republican state in November.\n\nWith early voting now underway, the results of the closely watched and increasingly expensive primaries stand to shape how Democrats and Republicans view the potential competitiveness of the general election contest in Texas as theGOP seeks to maintain controlof its 53-seat majority in the chamber.\n\nFirst, the party must select a nominee. Republicans are engaged in a three-way battle between an incumbent senator fighting for political survival, a state attorney general who’s defied odds amid a series of scandals, and a lesser-known US congressman pushing for generational change. Looming over the GOP face-off isPresident Donald Trump, who has refrained from offering an endorsement of four-term Sen. John Cornyn despite pleas from senior leaders in his party.\n\nMeanwhile, the Democratic contest features two rising stars in Texas politics – both showcasing vast digital reach but offering differing theories on how the party can win in a deeply conservative state where no Democrat has won statewide since 1994.\n\nThe fault lines in each party’s primary were on display as early voting kicked off on Tuesday. Campaigning at a Mexican restaurant in Austin, Cornyn warned of repercussions if one of his opponents – state Attorney General Ken Paxton – wins the Republican nomination.\n\n“We will have an election day massacre,” said Cornyn. “If Ken Paxton is at the top of the ticket, we risk losing the Senate seat, losing the majority in the House of Representatives, and it will take a toll on everybody in the ballot.”\n\nConcerns about Paxton’s electability have run throughout the primary race with top Republicans fretting his political, legal and personal baggage could put the Senate seat in jeopardy. Some senior Republicans fear it could cost the party $200 million to defend the seat if Paxton emerges as the nominee.\n\nDespite some GOP misgivings, Paxton has seen sustained support from elements of the president’s MAGA base. Heearned the endorsementof Turning Point Action, an affiliate of the influential conservative non-profit Turning Point USA founded by the late political activist Charlie Kirk.\n\nPublic polling in the Texas Senate primaries has been limited, but a recent University of Houston Hobby Schoolpollshowed Paxton in the lead with 38% support among likely GOP primary voters, compared to 31% for Cornyn and Rep. Wesley Hunt at 17%. A sizable slice of voters – 12% – said they were undecided.\n\n“He has adopted the Washington mentality, the Washington swamp, and he is not one of us,” Paxton said of Cornyn as he campaigned in Allen, Texas Tuesday. “It is time, no matter what, for John Cornyn to come home, and we’re gonna beat him in 2 weeks.”\n\nHunt, a Houston-area congressman, has tried to draw a generational contrast with Cornyn, even highlighting the divide in a closing ad of his campaign.\n\n“In 2004 I graduated from West point and joined the army. By then, John Cornyn had already been a politician for 20 years,” Hunt said in an ad released as early voting began.\n\nCornyn and his allies have knocked Hunt in recent weeks for missing votes in the US House where House Speaker Mike Johnson is operating with a razor-thin majority.\n\nThe split GOP field could result in no candidate is clearing the 50% benchmark to avoid a late May runoff between the top two finishers, further drawing down valuable resources for the fall campaign.\n\nBut one of the biggest wildcards remaining is Trump, who has thus far withheld an endorsement.\n\n“I just haven’t made a decision on that race yet. It’s got a ways to go,” Trump told reporters Monday. “They’ve all supported me. They’re all good, and you’re supposed to pick one. So we’ll see what happens. But I support all three involved.”\n\nThe prospect of Paxton at the top of the GOP ticket has raised the Democratic Party’s hopes about flipping the Senate seat come November. But Democrats are engaged in their own intraparty primary battle over who is best positioned to lead the charge against the eventual GOP nominee.\n\n“I know I’m a threat. I just need people to decide that they are going to show up today and vote for the fighter that they know that I am,” US Rep. Jasmine Crockett told reporters outside a Dallas library where she voted on Tuesday.\n\nThe recent University of Houston Hobby School poll showed Crockett running ahead of her Democratic opponent, state Rep. James Talarico, 47% to 39% among likely Democratic primary voters, with 12% saying they were still undecided.\n\nCrockett, a former attorney whoentered the racein December, has risen to political prominence during her time on Capitol Hill. Her sparring moments with GOP lawmakers and officials have often gone viral, raising her profile on the national stage.\n\nPart of her campaign argument has hinged on the ability to reenergize parts of the Democratic base, including voters of color who sat out in the 2024 election, and she’s argued her legislative experience on the federal level makes her stand apart from Talarico, a Presbyterian seminarian and former teacher who serves in the Texas state legislature.\n\nBut some in the party have raised questions about her viability in a general election. One of the most public divides played out last month on the “Las Culturistas” podcast, where comedians Matt Rogers and Bowen Yang encouraged their audiences not to donate to her campaign, suggesting she wouldn’t win the general election contest. (The two have since apologized.)\n\n“I am tired of people asking whether or not I am electable. The reality is that that is nothing but a dog whistle,” Crockett told reporters Tuesday. “For people to try to minimize me as if I am nothing more than a meme or somebody that can only go into clashes, I just tell you to do your research. The reality is that I’ve been getting it done.”\n\nTalarico has also seen his following rise through social media, including by speaking about his faith. He’s centered much of his strategy around finding common ground with voters, including independents and Republicans.\n\n“We’re going everywhere. We’re talking to everyone. We’re not writing off any voter. We’re not writing off any community because that is how we are going to win this state in November,” Talarico said Tuesday at an Austin rally as he started a 14-city tour in the lead up to primary day.\n\nAs early voting kicked off in Texas, Talarico went viral after “The Late Show” host Stephen Colbertsaid CBS lawyers told the showit could not air an interview with Talarico due to potential FCC concerns. CBS later said “The Late Show” was given “legal guidance” but was not “prohibited” from broadcasting the interview.\n\nTalarico seized on the moment, saying on social media, “Trump is worried we’re about to flip Texas.”\n\nWhile it did not run on the network, the late night sit-down was posted on YouTube, garnering more than 5 million views on the platform as of Wednesday morning. And the moment gave him a boost, with Talarico’s campaign later saying it saw the biggest fundraising day of his Senate run, raising $2.5 million in 24 hours.\n\nIn an interview with MSNOW on Tuesday, Crockett acknowledged the dustup might have worked to Talarico’s advantage.\n\n“I think it probably gave my opponent the boost he was looking for,” Crockett said in an interview on MSNOW. “It’s probably better that he didn’t get on and that they went straight to streaming because we know that when we resist and when we know that it seems like they’re trying to change the rules … or bend the knee to this president, that it backfires in historic fashion.”\n\nSpending on both sides has soared in the lead-up to early voting.\n\nTotal ad spending and reservations have reached $92.8 million, making the Texas Senate primary the second most expensive Senate primary on record, according to thetracking firm AdImpact. (Arizona’s Senate primary in 2022 which featured a contentious GOP race to take on Democrat Mark Kelly tops the list at $109.5 million.)\n\nThe majority of Republican spending — $58.9 million — has come through groups supporting Cornyn as he’s battled to maintain his seat, according to the data. Ad spending in support of Hunt has reached $10.8 million, while for Paxton it was just $2.3 million.\n\nOn the Democratic side, spending in support of Talarico came in at $15.3 million, compared with $2.8 million backing Crockett.\n\nThis story has been updated with additional information.\n\nCNN’s David Wright contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/politics/senate-races-february-2026",
      "text": "GOP seeks to maintain control"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "President Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/ken-paxton-turning-point-endorsement-texas-senate",
      "text": "earned the endorsement"
    },
    {
      "url": "https://www.uh.edu/hobby/primary2026/",
      "text": "poll"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/jasmine-crockett-colin-allred",
      "text": "entered the race"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/media/colbert-talarico-cbs-trump-fcc",
      "text": "said CBS lawyers told the show"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/texas-senate-primary-cornyn-paxton-hunt-crockett-talarico",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/politics/texas-senate-primary-cornyn-paxton-hunt-crockett-talarico",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bccf3ed486194280b47b7338688512027be04c230ed20f8f64e34c536b3d6bbc",
  "scraped_at": "2026-02-19T07:31:22.605386+00:00"
}