{
  "url": "https://lite.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
  "title": "A big snowstorm could hit the East Coast this weekend. Here are the scenarios | CNN",
  "date": "2026-02-20T07:27:41.360052+00:00",
  "authors": [
    "Chris Dolce, CNN"
  ],
  "text": "Source: CNN\n\nFebruary is primetime forbig Northeast snowstormsand a storm brewing this weekend could deliver on that… or be nothing more than just a minor inconvenience.\n\nThe computer models meteorologists use to forecast agree a storm will begin to develop off the coast of the mid-Atlantic on Sunday. It could even strengthen enough to be classified asa bomb cyclonethrough Monday.\n\nBut models diverge on the storm’s exact track Sunday into Monday, which will determine who gets snow and more. A change of just 100 or 200 miles could be the difference between big cities in the Northeast seeing a full-fledged nor’easter that packs significant snow and strong winds, or a storm that just brings light snow that maybe slows travel.\n\nWe’ll be more confident on the storm’s track and impacts in the next day or two, since it’s still a few days away from even forming.\n\nHere are the scenarios that are in play:\n\nThis scenario is most likely at this time given recent computer model projections.\n\nThe storm tracks far enough offshore to prevent it from being a major event in most areas.\n\nStill, at least light to localized moderate snow and gusty winds could impact an area from southern New England into the mid-Atlantic Sunday into Monday. That could include Boston, New York City, Philadelphia and Washington, DC.\n\nSnow could also extend as far west as the Interior Northeast and Great Lakes.\n\nSnow in all of these areas might slow down travel, but should be manageable.\n\nGusty winds and some coastal flooding could also occur.\n\nThis scenario is less likely than the first scenario, but remains possible.\n\nA powerful storm develops close enough to the Northeast coast to deliver major impacts over a widespread area — including from Washington, DC, to New York and Boston.\n\nHeavy snow and strong winds would make travel very difficult on roads and at airports beginning Sunday afternoon and lasting through Monday.\n\nThe potential for significant coastal flooding and beach erosion is higher in this scenario.\n\nSome computer model runs still hang onto this scenario, but it seems the least likely outcome at this point.\n\n﻿In this final scenario, the storm movesso far offshore that it brings no impacts at all.\n\nThere could still be some snow or rain showers in the Great Lakes and Northeast from a separate disturbance, but impacts should be minimal.\n\nThe bottom line:This level of track uncertainty is common days ahead of a possible East Coast storm, so it’s best to keep checking back daily until the forecast becomes clearer.\n\nA similar scenario played out in late-January when some computer models showed a winter storm delivering heavy snow to all of the Northeast, but the system stayed offshore, only scraping southeast New England.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/weather/february-winter-storm-forecast-northeast-climate",
      "text": "big Northeast snowstorms"
    },
    {
      "url": "https://www.cnn.com/2022/12/21/us/bomb-cyclone-xpn",
      "text": "a bomb cyclone"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/weather/snow-east-coast-weather-forecast-climate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "be1f357cb4675cc8ff55788e10a0609c481b929b54712ec903d4340d4257ca11",
  "scraped_at": "2026-02-20T07:27:41.360069+00:00"
}