{
  "url": "https://lite.cnn.com/2026/02/14/travel/travel-news-italy-property-foreign-buyers",
  "title": "These Americans made big investments in Italian property. Here are the rewards and the pitfalls | CNN",
  "date": "2026-02-15T07:11:13.082731+00:00",
  "authors": [],
  "text": "Source: CNN\n\nIn our travel roundup this week: why British Chinese food is baffling to Americans, the couple who bought an Italian mansion sight unseen, plus who’s staying in North Korea’s luxury hotels.\n\nVito Andrea Racanelli’s ancestors migrated from Italy to America in the late 1800s. More than a century and a half later, he and his family decided to do it in reverse, choosing Tuscany as their home. Racanelli, a Denver-based attorney, spent more than $1 million on a sprawling farmhouse in Radicondoli.\n\n“Buying real estate in Italy is completely different,” he tells CNN, suggesting that foreign buyers hire help with navigating the process, rather than trying to tackle it all on their own. Read the full story of the renovation forwhat else he learned.\n\nFor CNN subscribers, we have two more tales of property-buying abroad.\n\nTexas couple John Alan and Vicky Ambrose bought the empty shell of a Piedmont mansion for 140,000 euros (around $160,000) without even seeing it.\n\nThey then embarked on a three-year renovation, spending a further 150,000 euros to transform the property into a boutique luxury apartment with two panoramic balconies. Here’swhat it looks like now.\n\nMussomeli, in Sicily, is famous as one of the towns around Italy selling off ruined homes for just one euro, or about $1.20. These bargain-basement homes are in need of a complete rebuild, but the project also includes “premium” homes, which need fewer interventions, and are often fully inhabitable, starting from around $12,000.\n\nAround 450 houses have now been sold in the town, transforming the community, where the most popular properties with foreigners are those with hillside views. Here’s whatlocals, both established and new, say life is like there.\n\nHere’s a reminder this Valentine’s Day that our hit series “Chance Encounters,” about extraordinary travel connections, is available in podcast form.\n\nAmerican Kerri Cunningham fell for Brit Dirk Stevens when they met as teenagers on summer vacation in Europe. They were each other’s first love but lived on opposite sides of the Atlantic. Then almost three decades later, they unexpectedly reunited.Listen here.\n\nMexico was the scene for yacht captain Bob Parsons and librarian Beverly Carriveau’s summer romance that lasted through the decades. A “thunderbolt” passed between them in Mazatlán in 1968, recalls Carriveau, and their lives were never the same again.Hear it in her own words.\n\nOf course, it’s not just lovers who go the distance on Valentine’s Day. That bouquet of roses you ordered will have made a long and chilly journey to your sweetheart’s door. Here’swhere they’ve been.\n\nFor decades, Somalia’s name has been shorthand for conflict, piracy and danger. Yet, against the odds, the East African nation is now seeing a quiet rise in foreign tourists. That’s despite most Western governments still advising against all travel. Here’s what’s behind thesurge in tourism.\n\nOver in South Asia, Bangladesh has tigers, tea plantations and beaches, but it’s never been a mainstream tourist destination. Just 650,000 international visitors arrived in 2024. Here’s whatthe obstaclesare that are holding it back.\n\nFinally, North Korea is busy building luxury hotels, filled with top-class amenities such as outdoor hot tubs and ski-in ski-out lodges – but state media shows few actual guests. With almost no foreign tourists allowed, who’s actually staying in these fancy accommodations? CNN’s Will Ripley breaks it down in thisvideo.\n\nEating funge, a staple of Angolan cuisine, requires dexterity and a willingness to use your fingers. In this video, CNN’s Richard Quest tries his hand at funge for the very first time.\n\nAre you an international traveler planning or reconsidering a trip to the United States?\n\nWe want tohear from you.\n\nShe spent a week on a South Pacific island with her best friend’s husband.\n\nTheir time there was“incredible.”\n\nA criminal investigation. A landmark trial. A walk for peace.\n\nWhat do you remember fromthe week that was?\n\nWhy British Chinese food is baffling to Americans.\n\nSweet and sour chicken ballsare a UK delicacy.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/travel/american-man-1-million-new-home-italy",
      "text": "what else he learned"
    },
    {
      "url": "https://www.cnn.com/travel/texas-couple-mansion-italy-biella",
      "text": "what it looks like now"
    },
    {
      "url": "https://www.cnn.com/travel/mussomeli-italy-one-euro-town-daily-life",
      "text": "locals, both established and new"
    },
    {
      "url": "https://www.cnn.com/audio/podcasts/chance-encounters/episodes/e3bc1dbe-4bb4-11f0-aea7-53a973f62590",
      "text": "Listen here"
    },
    {
      "url": "https://www.cnn.com/audio/podcasts/chance-encounters/episodes/e2e29a44-4bb4-11f0-aea7-bf763d7ba772",
      "text": "Hear it in her own words"
    },
    {
      "url": "https://cnn.com/2026/02/12/us/valentines-day-flowers-long-trip",
      "text": "where they’ve been"
    },
    {
      "url": "https://www.cnn.com/travel/somalia-tourism-surge-evisa-somaliland",
      "text": "surge in tourism"
    },
    {
      "url": "https://www.cnn.com/travel/bangladesh-dhaka-tourism-attractions",
      "text": "the obstacles"
    },
    {
      "url": "https://www.cnn.com/2025/12/23/world/video/north-koreas-new-hotels-vrtc-digvid",
      "text": "video"
    },
    {
      "url": "https://www.cnn.com/travel/international-traveler-united-states-callout",
      "text": "hear from you"
    },
    {
      "url": "https://www.cnn.com/2026/01/06/travel/niue-south-pacific-whales-friend-husband-ex",
      "text": "“incredible.”"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/02/us/cnn-5-things-news-quiz-feb-13-sec/",
      "text": "the week that was"
    },
    {
      "url": "https://www.cnn.com/travel/british-chinese-takeout-uk-american-differences",
      "text": "Sweet and sour chicken balls"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/travel/travel-news-italy-property-foreign-buyers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/travel/travel-news-italy-property-foreign-buyers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bec7df073be382da85d79e69d751c03b2e9b61d5d96a9a72b02ea660fbdb1e08",
  "scraped_at": "2026-02-15T07:11:13.082744+00:00"
}