{
  "url": "https://lite.cnn.com/2026/02/17/style/chinese-artist-yin-xiuzhen-old-clothes-carry-new-meaning",
  "title": "For Chinese sculpture artist Yin Xiuzhen, old clothes carry new meaning | CNN",
  "date": "2026-02-18T07:32:33.058552+00:00",
  "authors": [
    "Precious Adesina, CNN"
  ],
  "text": "Source: CNN\n\nOn a rainy afternoon in London, Yin Xiuzhen sits under a canopy of red, pink, purple and orange garments stretched over a steel frame. From inside, the carpeted dome, complete with rugs and cushions, makes a vibrant sanctuary. From the outside, the structure, which stands next to a large mirror, resembles a human heart. Together, they form “A Heart to Heart,” an almost 25-foot-tall installation created specifically for the first major survey of the Chinese artist’s work in the UK.\n\n“I think it’s very important for people to be able to sit down and talk through their hearts,” Yin said, dressed in a matching brown shirt and trousers with floral embellishments, ahead of the show’s opening. “In this era, communication between every individual is very important. As we all know, we are living in a chaotic, volatile world.”\n\nNamed after the new work, the exhibition “Yin Xiuzhen: Heart to Heart,” at London’s Hayward Gallery, explores three decades of the artist’s practice. It brings together several of her most significant and notably large projects, many of which have been shown at leading institutions including the Museum of Modern Art (MoMA) and the Guggenheim in New York, as well as biennials and museum exhibitions across Europe, Asia and the US.\n\nYin’s ongoing international success is something of an anomaly. “If you look at Chinese contemporary art, all the big artists are mostly men, and a lot of them are painters,” said Yung Ma, a senior curator at the gallery, who has known her for over 10 years. “I don’t think there are many female artists of her generation still working today, at least not on that level.”\n\nBorn and raised in Beijing, and initially trained in oil painting, the artist has been constructing artworks from used clothes for more than three decades. The first came in 1995, when she created “Dress Box,” an installation and video piece, for her first solo exhibition at a now-defunct contemporary art museum in the Chinese capital. In the work, Yin placed her own garments, collected over 30 years, into an old wooden trunk made by her father. She then filled the trunk with cement, “encasing all these memories into one,” as Hayward Gallery assistant curator Hannah Martin put it. A neatly folded pink shirt remains visible on top, guarding the stories hidden beneath.\n\nAn accompanying photo series, “My Clothes,” put the 32 items sealed within the trunk into perspective, offering context for each one’s significance. When Yin was growing up, her mother worked in a garment factory, where she would buy offcuts to sew into fresh items designed by Yin herself. “I always call clothes a second layer of skin,” Yin said. “Clothes bear the inference of our cultural background.”\n\nThe artist has moved on from solely using her own clothes and now acquires garments in a multitude of ways. “I collect different clothes from different groups of people to symbolize the collective consciousness of different groups,” Yin said, noting how her formative years, which include coming of age amid the chaos of Mao Zedong’s Cultural Revolution, exposed her to a staunch prioritization of joint, rather than individualistic, identity. In China, valuing “the individual over the collective was considered a shame,” she explained.\n\nBoth Yin and the exhibition’s curator point to her 2007 work “Collective Subconscious (Blue),” in which a type of minivan known as a “mianbaoche” (literally translating to “bread van” in Chinese due to its loaf-like appearance), is extended along the center using various items of clothing, creating a large-scale installation that viewers can sit inside.\n\nIntroduced to the country in the 1980s, a time when few people had cars of their own, the minivan was an inexpensive option that allowed growing numbers of Chinese people to take to the roads. The vehicles were often used as taxis or for freelance businesses. “It was a symbol of progression,” Ma said. “Having a vehicle like that was meant to embody some sort of entrepreneurial spirit and tied into the capitalist development of China.”\n\nBut Yin also remembers how Beijing became almost unrecognizable in the early- to mid-1990s. Cycling through the city to work as an art teacher, she recalled passing “through countless hutongs (traditional alleyways) and old city streets.” On her return, she said she would often discover that the buildings had disappeared. In her 1996 piece “Ruined City,” she covered popular Chinese furniture and clay roof tiles in dry cement powder, evoking a demolition site.\n\n“By 1995 and 1996, with the real estate boom in full swing, entire swaths of hutongs and courtyard houses were being razed,” she added. “At the time, many intellectuals, architects and artists called for a halt to the large-scale demolition and construction to protect the ancient capital, but their voices were too weak.” The sense of hope offered by Yin’s minivan serves as a stark contrast to the despair of those forced out of their homes echoing through “Ruined City.”\n\nYin also looks beyond China for inspiration. The first installation that visitors to her London show encounter takes a broader look at the urban experience. Atop a reconstruction reminiscent of an airport conveyor belt, Yin’s ongoing “Portable Cities” series recreates miniature cities in discarded suitcases made from items donated by residents of the location depicted. “Portable City: London,” for example, uses clothes collected from staff at the Southbank Centre, the arts complex that houses the Hayward Gallery. One member even stopped to point out a purple-patterned shirt they had contributed to the piece.\n\n“People in China didn’t really start international travel until the ‘90s,” Ma, the curator, said, highlighting that this was around the time Yin became a professional artist. Yin added: “My first international travel was to Japan, and later the Netherlands. I was at an airport terminal when I saw the conveyor belt, and this idea just came to me.”\n\nThe artwork adds a global perspective, but in “A Heart To Heart,” Yin is more concerned with matters closer to home — her audience’s hearts and minds. The installation’s heart-shaped form, and the act of talking inside it, are integral to her wider practice. In Chinese, “xin,” which is commonly translated to “heart” in English, can refer to the heart and mind in tandem. While Western thought often separates the two, in Chinese culture, emotion and reason are more deeply intertwined.\n\n“The original Chinese title can be translated as ‘talk through heart’,” Yin said. “I envision it as not only talking through the heart, but talk and heart — the two acts embodied in the same installation.”\n\n“Yin Xiuzhen: Heart to Heart” is at the Hayward Gallery in London until May 3.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/style/chinese-artist-yin-xiuzhen-old-clothes-carry-new-meaning",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/style/chinese-artist-yin-xiuzhen-old-clothes-carry-new-meaning",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bf513ab72abca44161cc205b7ed234ada420fb87feba3fd38e5666653d32d0a5",
  "scraped_at": "2026-02-18T07:32:33.058565+00:00"
}