{
  "url": "https://lite.cnn.com/2026/02/11/travel/lincolns-rock-blue-mountains-sydney-overtourism-intl-hnk",
  "title": "A K-pop star, a cliff edge and 2,000 daily visitors: How one Australian beauty spot spiraled into crisis | CNN",
  "date": "2026-02-11T16:31:36.061577+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nLincoln’s Rock has long been one of the Blue Mountains’ quieter sunset spots — a rocky overhang with sweeping views across eucalyptus valleys just outside Sydney. But in recent years, the once-sleepy Australian lookout has found itself at the center of a global social media storm.\n\nLocal officials say a surge of visitors chasing a single viral photo has transformed the site almost overnight, bringing crowds, safety fears and mounting environmental concerns to an area unable to cope with mass tourism.\n\nProblems came to a head in 2023, when K-pop star Jennie Kim of Blackpink shared images of herself perched on the edge of the cliff, legs dangling over the drop. The post racked up millions of likes before later being removed — but not before copies spread widely across other international platforms.\n\n“They’re not there to enjoy the view,” Graham Reibelt, who has lived in the Blue Mountains for 45 years and runs a local tourism website called Ask Roz, tells CNN. “They’re there just to be photographed on this spot.”\n\nSince then, locals say visitor numbers have skyrocketed, with long lines forming daily as travelers queue up to recreate the same shot. At peak periods, the lookout has drawn thousands of people a day, overwhelming narrow access roads and limited parking facilities.\n\nConcerned about safety risks and environmental damage, the Blue Mountains City Council temporarily closed access to the rock last month while officials work on a long-term plan — a decision that has prompted debate among residents, conservationists and local businesses that depend on tourism.\n\nThe Blue Mountains is a UNESCO-recognized World Heritage site comprised of eight conservation areas, making it one of the largest protected bushlands in Australia. More than that, it represents at least 22,000 years of Indigenous history.\n\n“The Blue Mountains never really got damaged with development,” says David King, a Gundungurra man who teaches visitors about the local history and culture of the area that has been his ancestors’ homeland for millennia. “You’ve almost got untouched lands. I go out there at least three times a week, because it’s a very spiritual place for me.”\n\nOne of the rarest birds in Australia, the Glossy Black Cockatoo, also makes its home in the mountains. According to the World Wildlife Fund, fewer than 8,000 of these birds are left in Australia.\n\nAnnette Cam, president of the Blue Mountains Conservation Society, said low-lying plants are a major feeding source of the cockatoos, but the birds avoid those areas when there are too many people.\n\nCam has written to the council to say she supports the closure. She says Lincoln’s Rock shouldn’t be reopened until “satisfactory arrangements have been made to manage visitor numbers appropriately.”\n\nWhile the wider Blue Mountains region would be better able to cope with a surge in visitor numbers, many tourists are focusing their time solely on Lincoln’s Rock.\n\nTo reach the site, vehicles have to squeeze through a narrow two-lane road and then try to secure one of only 16 available parking spaces.\n\n“We have never promoted Lincoln’s Rock as a location for tourists,” Reibelt said. “We always thought that because there’s a lack of amenities, the parking’s shocking, it would create a bad experience and we want them to come back.”\n\nKay Yang, a 25-year-old from Shenzhen, China, said she visited the lookout last July with her younger sister.\n\nThe trip, she said, was driven by her sister’s desire to recreate the K-pop idol’s photo, which she had seen re-shared on Chinese social media platform Xiaohongshu, also known as RedNote.\n\n“We only went there to take photos, and then we left,” Yang said. She confirmed that she and her sister didn’t join a tour group and didn’t visit any other parts of the Blue Mountains.\n\nYang says that the crowd itself was manageable, but the steep cliff edge made her uneasy.\n\n“I was actually a bit scared,” she said. “There’s no protection at all, and when you look down, it’s a cliff.”\n\n“I think when you’re traveling, you should still have a basic sense of respect for nature,” Yang adds. “It’s really about keeping a basic level of manners.”\n\nNot all locals think the throngs of Lincoln’s Rock visitors are a bad thing. Christina Doyle, who opened a small coffee cart outside her home near the site, said she welcomed the arrival of customers from around the world, many of whom mentioned wanting to take “the Jennie photo.”\n\nDoyle says the lookout’s closure had cut business at Christina’s Cafe to three or four customers per day, killing her profit margin.\n\nShe understands why some locals don’t enjoy the influx of visitors, but says there’s a need for balance.\n\n“It’s a known tourist location,” Doyle said. “Most of the businesses in this city thrive on tourism.”\n\nThe community is now weighing a range of options — from fencing off the most dangerous edges to introducing timed entry or daily visitor caps — as they search for a way to protect the site without stripping away its appeal.\n\nMeanwhile, Lincoln’s Rock has found itself on a growing list of global destinations that now mark the frontline in the battle against overtourism, where debate rages over how to welcome a global audience drawn by viral fame while safeguarding the very landscapes that made those images irresistible in the first place.\n\nRecently, Rome’s Trevi Fountain has beguncharging $2 per person.\n\nIn Japan, tourists flocking to a small town at the base of Mount Fuji to re-create a viral photo caused so many issues that the local government temporarily resorted to erectinga black fabric barrierto block the famous view.\n\nFor residents like Christina Doyle, the goal isn’t to shut visitors out altogether, but to find a balance between access and preservation.\n\n“We can only hope that it remains unfenced and doesn’t look too industrial when the work is completed,” she said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/travel/trevi-fountain-rome-fee-overtourism",
      "text": "charging $2 per person"
    },
    {
      "url": "https://www.cnn.com/travel/japan-mount-fuji-view-barrier-tourists-intl-hnk",
      "text": "a black fabric barrier"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/travel/lincolns-rock-blue-mountains-sydney-overtourism-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/travel/lincolns-rock-blue-mountains-sydney-overtourism-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "bfd9503236a97094775813d27087e4e8cc317e59d7de484af212048f739cedc4",
  "scraped_at": "2026-02-11T16:31:36.061591+00:00"
}