{
  "url": "https://lite.cnn.com/2026/02/10/science/hydrogen-oceans-earth-core",
  "title": "Earth’s core may be the planet’s biggest source of hydrogen, scientists estimate | CNN",
  "date": "2026-02-12T21:31:24.055562+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPicture all of Earth’s oceans, which cover about 70% of the planet and are mostly made of hydrogen. Now multiply that by nine. That may be the amount of hydrogen in Earth’s core, possibly making it the planet’s largest hydrogen reservoir, researchers recently estimated.\n\nAnd nine hydrogen “oceans” is the low end of their calculation; there could be as much as 45 oceans’ worth of hydrogen locked in the core. Put another way, hydrogen may make up roughly 0.07% to 0.36% of Earth’s total core weight, scientists reported Tuesday in the journalNature Communications. This suggests that Earth acquired most of its water — the planet’s main source of hydrogen — as the planet formed, rather than later through comet impacts that would have left water on the planet’s surface as some scientists have suggested, said lead study author Dongyang Huang, an assistant professor in the School of Earth and Space Sciences at Peking University.\n\n“Earth’s core would store most of the water in the first million years of Earth’s history,” Huang told CNN in an email. Next in water abundance is the mantle and crust. “The surface — where life resides — contains the least,” he said.\n\nMore than 4.6 billion years ago, rocks, gas and dust around our sun collided to form a young planet. Over time, these collisions shaped Earth’s core, mantle and crust. In Earth’s deep interior and under enormous pressure, a dense, hot and fluid metal core began to churn. Made mostly of iron and nickel, it powers Earth’s protective magnetic field.\n\n“Hydrogen can only enter the core-forming metallic liquid if it was available during Earth’s main growth phases and participated in core formation,” said Rajdeep Dasgupta, a professor of Earth systems science in the department of Earth, Environmental and Planetary Sciences at Rice University in Texas. Dasgupta was not involved in the new research.\n\nStudying the origin and distribution of hydrogen is key to understanding planetary formation and the evolution of life on Earth. Scientists have long wondered how much hydrogen might be buried in Earth’s molten metal engine, and have analyzed chemical interactions in iron to try to estimate the metallic core’s hydrogen reservoir. But the core is too deep for direct observation, and its high-pressure conditions are challenging to replicate in a lab.\n\nIn general, hydrogen is difficult to quantify “because it is the lightest and smallest element, meaning its quantification is beyond the capacities of routine analytical methods,” Huang said.\n\nLow density in the core previously hinted at an abundance of hydrogen, though it was tricky for scientists to pin down the amount compared with other known core elements that were somewhat easier to measure, such as silicon and oxygen. Prior research inferred the amount of core hydrogen by using X-ray diffraction to look at the lattice structure in iron crystals, which expands more when hydrogen is present. But these interpretations varied widely, ranging from 10 parts per million by weight to 10,000 parts per million (or 0.1 oceans to more than 120 oceans), according to the study.\n\n“The technique is fundamentally different from earlier methods,” Huang said. Researchers sharpen samples into needlelike shapes with diameters of about 20 nanometers (0.0000007874 inches), then place them under finely controlled high voltage. Next, the samples’ atoms are ionized and counted one at a time, he explained.\n\nTo create the new estimate, scientists conducted experiments replicating core temperatures and pressures, using iron as a stand-in for the liquid metal core. They melted the iron with lasers in a high-pressure device called a diamond anvil cell, then directly observed hydrogen and other core elements using atom probe tomography, which captures 3D images and measures chemical composition at the atomic scale.\n\nThis approach relies on assumptions about how atoms are arranged in Earth’s core and how silicon, oxygen and hydrogen disperse there, Huang said. Their experiments revealed how hydrogen interacted with silicon and oxygen in nanostructures as the metal cooled, with the ratio of hydrogen to silicon being roughly 1 to 1. By combining observations of these ratios in the samples with prior estimates of core silicon, the researchers were then able to approximate the amount of core hydrogen.\n\nThe interplay they observed between silicon, oxygen and hydrogen in iron nanostructures offers clues to how heat may have been released from the core into the mantle to begin the process of building Earth’s magnetic field, “which is indispensable for developing the Earth into a habitable place,” Huang said.\n\nHowever, the scientists cautioned that more work will be required to confirm and fine-tune this estimate, as this indirect approach includes uncertainties and does not address other chemical interactions that may affect calculations of core hydrogen.\n\nIndeed, the amount of core hydrogen could be much higher than the new estimate suggests, said Kei Hirose, a professor at the University of Tokyo’s School of Science who studies composition of Earth’s core but was not involved in the new research.\n\nOne area of uncertainty is how much hydrogen in the iron samples escaped during decompression; this loss has been documented in other studies but was not included in the new calculations. Hirose’s work previously estimated that hydrogen makes up 0.2% to 0.6% of the weight in Earth’s core, “more than this new paper proposed,” he told CNN in an email.\n\nIf the authors’ measurements and hypothesis hold true, “it will suggest that hydrogen was delivered throughout Earth’s growth,” Dasgupta said. Gas from nebulas as well as water from comets and asteroids may have also been a source of Earth’s hydrogen, Hirose added.\n\nHydrogen is an essential element for life on Earth, “along with carbon, nitrogen, oxygen, sulfur, and phosphorus,” said Dasgupta, whose research investigates the role played by these volatile elements during Earth’s formation. “The new paper will definitely inform our future synthesis and discussion on this topic.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nature.com/articles/s41467-026-68821-6",
      "text": "Nature Communications"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/science/hydrogen-oceans-earth-core",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/science/hydrogen-oceans-earth-core",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c06f219627a19bb29680ccaee9ff13708400375ad502e9de13a40b4461c47fb5",
  "scraped_at": "2026-02-12T21:31:24.055575+00:00"
}