{
  "url": "https://lite.cnn.com/2026/02/17/media/colbert-talarico-cbs-trump-fcc",
  "title": "Colbert says CBS scrapped his James Talarico interview after Trump FCC’s threats | CNN Business",
  "date": "2026-02-19T07:31:43.263590+00:00",
  "authors": [
    "Brian Stelter, CNN"
  ],
  "text": "Source: CNN\n\nStephen Colbert taped a “Late Show” interview with James Talarico, a candidate in the Democratic Senate primary in Texas. But he says CBS lawyers intervened before the interview could air on TV.\n\n“We were told in no uncertain terms by our network’s lawyers, who called us directly, that we could not have him on the broadcast,” Colbert told his viewers Monday night.\n\nCBS told a different story in a statement Tuesday afternoon: The network said “The Late Show” was given “legal guidance” but was not “prohibited” from broadcasting the interview.\n\nThe controversy stems from the Trump administration’s intensifying pressure against broadcast TV networks.\n\nCBS has been uniquely vulnerable to the pressure due to the corporate ambitions of its parent company Paramount, which is currentlytryingto acquire Warner Bros. Discovery, including CNN.\n\nThe Federal Communications Commission, which regulates local stations owned by broadcasters like CBS, recently issued new guidance about an old regulation known as the “equal time” rule.\n\nThe rules do not apply to cable or streaming — which is why Colbert’s show posted the Talarico interview on YouTube as an “online-only exclusive” — but do apply to local TV and radio stations.\n\nThe rule require stations to give equal airtime to all legally qualified candidates for public office — if one is featured, his or her rivals have to be given time, too.\n\nThere are big exemptions for news coverage, and for the past two decades that exemption has also been thought to apply to late night and daytime talk shows.\n\nBut FCC chair Brendan Carr is rejecting that thinking. Last month, he said stations should no longer assume that shows like Colbert’s are exempted from the rule.\n\n“If you’re fake news, you’re not going to qualify for the bona fide news exemption,” Carr said at a press conference.\n\nAs Carr’s use of the phrase “fake news” indicates, he is a staunch ally of President Trump. He has been harshly critical of liberal-leaning talk shows like ABC’s “The View” and has been open about reducing the power of national networks.\n\nBut the FCC’s enforcement powers are limited. The lone Democratic commissioner at the FCC, Anna Gomez, said last month that Carr’s claims were misleading: “The FCC has not adopted any new regulation, interpretation, or Commission-level policy altering the long-standing news exemption or equal time framework.”\n\nA source at the FCC reiterated that point, saying, “Once again here, the threat is the point.”\n\n“The point is to force shows and networks to second-guess their decisions in light of this ‘new’ guidance,” the source told CNN on condition of anonymity.\n\nHowever, CBS indicated in a Tuesday statement that it is taking the new guidance seriously.\n\nIt said that Colbert’s show “was provided legal guidance that the broadcast could trigger the FCC equal-time rule for two other candidates, including Rep. Jasmine Crockett, and presented options for how the equal time for other candidates could be fulfilled.”\n\nAccording to CBS, the show “decided to present the interview through its YouTube channel with on-air promotion on the broadcast rather than potentially providing the equal-time options.”\n\nIn other words, Colbert’s long commentary claiming that he wasn’t even allowed to show Talarico’s picture was all part of a clever promotion of the show’s YouTube channel, according to the network.\n\nOn his show Tuesday night, Colbert said he was not informed of the statement CBS put out, but “CBS unilaterally told me that I had to abide by the equal time rules, something I have never been asked to do for an interview in the 21 years of this job.”\n\nHe described the network’s statement as “a surprisingly small piece of paper considering how many butts it’s trying to cover” and that “clearly this statement was written by, and I’m guessing for, lawyers.”\n\n“Every word of my script last night was approved by CBS’ lawyers, who for the record, approve every script that goes on the air,” the late-night host added.\n\nA report about the Trump administration’s reaction to an earlier Talarico interview may have prompted CBS to exercise caution in this instance.\n\nAfter Talarico appeared on “The View” two weeks ago, Reuters reported that the FCC was opening an investigation into the possible “equal time” violation.\n\nGomez called it a “sham” investigation, however, predicting that no meaningful action would be taken and calling it another example of “government intimidation.”\n\nOn Tuesday, Gomez decried the CBS action, saying, “CBS is fully protected under the First Amendment to determine what interviews it airs. That makes its decision to yield to political pressure all the more disappointing. Corporate interests cannot justify retreating from airing newsworthy content.”\n\nColbert’s comments on Monday night indicate that he feels the same way.\n\n“Let’s just call this what it is,” he said. “Donald Trump’s administration wants to silence anyone who says anything bad about Trump on TV. Because all Trump does is watch TV.”\n\nHe also had pointed words for Carr: “Sir, you’re chairman of the FCC, so FCC you.”\n\nIn the interview, Talarico called out the FCC’s conduct, albeit not by name.\n\nTalarico said Republicans “ran against cancel culture, and now they’re trying to control what we watch, what we say, what we read. And this is the most dangerous kind of cancel culture, the kind that comes from the top.”\n\n“They went after ‘The View’ because I went on there,” Talarico continued. “They went after Jimmy Kimmel for telling a joke they didn’t like. They went after you for telling the truth about Paramount’s bribe to Donald Trump.”\n\nLast year the previous owners of Paramount paid $16 million to resolve an extraordinary lawsuit filed by Trump over a “60 Minutes” news report he didn’t like.\n\nThe funds were allocated to Trump’s future presidential library, mirroring a settlement agreement that Disney’s ABC struck with Trump earlier.\n\nCritics of the settlement described it as a bribe because Paramount was trying to win Trump administration approval for a media mega-merger at the time.\n\nThe FCC allowed the merger to move forward just a few weeks after Paramount struck the settlement deal, though Carr insisted the matters were not connected.\n\nCarr has not responded to CNN’s request for comment about Colbert’s on-air criticism Monday night.\n\nBut Talarico has used the controversy to garner attention for his Senate candidacy, just weeks before the March 3 primary vote.\n\n“This is the interview Donald Trump didn’t want you to see,” he wrote on X overnight, sharing a clip of the YouTube video.\n\n“His FCC refused to air my interview with Stephen Colbert,” Talarico wrote. “Trump is worried we’re about to flip Texas.”\n\nThe interview has totaled more than 2 million views on YouTube, and millions of additional views on other social media platforms.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/media/wbd-netflix-paramount-shareholder-vote-bid",
      "text": "trying"
    },
    {
      "url": "https://www.youtube.com/watch?v=oiTJ7Pz_59A&t=1s",
      "text": "online-only exclusive"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/media/colbert-talarico-cbs-trump-fcc",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/media/colbert-talarico-cbs-trump-fcc",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c0a3671a6db632fae960b565c6b092117611278cbe7aee320993d8880285d7c1",
  "scraped_at": "2026-02-19T07:31:43.263603+00:00"
}