{
  "url": "https://lite.cnn.com/2026/02/25/economy/economy-trump-sotu-affordability-biden",
  "title": "Trump is right: The economy is strong. But he’s missing the big problem | CNN Business",
  "date": "2026-02-27T07:18:00.580244+00:00",
  "authors": [
    "Analysis by David Goldman"
  ],
  "text": "Source: CNN\n\nPresident Donald Trump made a passionate defense of the US economy during hisState of the Union addressTuesday night.\n\n“Inflation is plummeting, incomes are rising fast. The roaring economy is roaring like never before.”\n\nHyperboleaside, he’s right: America’s economyisstrong. But Trump is missing the point.\n\nAffordability, not economic strength, drives voters to the polls. Most Americans don’t care a lick about GDP, CPI, PCE or any of the other acronyms or data points that show the economy is on the right track. They care about their job security and thosefinancial fearsthat keep folks up at night: figuring out how to to pay for groceries, housing, health care, car payments, college and child care – all of which keep getting more expensive.\n\nTrump suggested that there’s still work to be done to Make America Affordable Again™️ and outlined some new policies to address Americans’ financial concerns.\n\nBut Trump’s message largely focused on American exceptionalism, his economic achievements, low inflation and robust foreign investment. He blamed his predecessor for ruining the economy and praised his administration’s work to rescue it.\n\n“I inherited an economy that was on the brink. Now our economy is literally the envy of the world.”\n\nThere’s a problem with that strategy, though.\n\nWant proof? That last quote wasn’t from Tuesday’s speech. That was from the2024 State of the Union, delivered by former President Joe Biden, whose party lost the election eight months later.\n\nTrump’s message, at least on paper, is largely correct. Jobs, wage growth, consumer spending and inflation under Trumplook pretty decentor have been mostly stable. The stock market is near a record high.\n\nThe US economygrew 2.2%in 2025, very much in line with the last three years of robust economic growth. The economy slowed down more than expected at the end of the year, but the longest-ever government shutdown stymied growth that should be made back this quarter.\n\nLast year wasn’t a great year for the labor market by any stretch. But unemployment remains low, and stronger-than-expected hiring in January suggests 2026 could be a much better year for job creation.\n\nInflation appears to be on the downswing again after a bumpy ride in 2025. And paycheck growth has been outpacing inflation for nearly three years, helping Americans stretch their dollars further.\n\nWealthier Americans are benefitting financially from the positive economic trends, while lower-income households are increasingly finding themselves left behind.\n\nThatK-shapedtrend isn’t new, but the gap between the haves and the have-nots has been widening in recent years, particularly as the housing market remains largely frozen. Folks who own homes – particularly those who refinanced with historically low rates during the pandemic – are for the most part better off than people who are trying and mostly failing to find anywhere affordable to live today.\n\nRising prices for necessities have hurt, too. And curtailed social services haven’t helped matters.\n\nThat has led the most vulnerable to make difficult choices. Delinquencies are on the rise, and a growing number of Americans aremore than three months late on their loans.\n\nTrump on Tuesday blamed Democrats for the inflation crisis that sent prices surging more than 20% during Biden’s term, a shock that Americans are still adjusting to. But Trump also defended his own tariffs, which added $1,000 in tax expenses for the average American household last year, according to the conservative-leaning Tax Foundation.\n\nAfter aSupreme Court rulinglast week that found the bulk of Trump’s tariffs illegal, Trump sharply criticized that decision and immediately announced alternate authorities to levy steep tariffs again. Although tariffs haven’t sent prices skyrocketing as many feared, they remain among Trump’s least-popular policies and serve as a political vulnerability for Republicans ahead of this year’s midterm elections.\n\nAfter awhirlwind of affordability proposalsto start 2026, Trump unveiled a few more Tuesday night, including a retirement plan for Americans without access to a 401(k) and requirements that tech companieshelp defraythe increased cost of electricity caused by surging demand from AI data centers.\n\nTrump also highlighted the policies he’s already enacted, including tax cuts,Trump Accountsfor babies and a number of efforts to lower prescription drug prices for many patients.\n\nIt’s a strategy that hasn’t exactly paid off so far: The affordability initiatives havereceived mixed reviewsand will take time to work their way through the economy. And Trump isn’t exactly sticking to the script.\n\nThe president’s State of the Union address comes amid a kind of economic roadshow to hammer home a message that his staff want him to communicate: that the economy is strong thanks to his administration’s actions. But the messaging has at times got lost as Trump veers off script to focus on other issues he appears to favor, such as immigration enforcement and unfounded accusations of election fraud.\n\nIt hasn’t helped that Trump has called affordability a “hoax” and a battle he has won. In the meantime, Trump’s rah-rah message on the economy and trade is falling on deaf ears and risks making him look out of touch ahead of a crucial election.\n\n“America is rising. We have the best economy in the world. And since I’ve come to office, our GDP is up, our trade deficit with China is down to the lowest point in over a decade, and we’re standing up against China’s unfair economic practices.”\n\nWhoops, that was Biden in 2024 again.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/politics/live-news/trump-state-of-the-union-2026",
      "text": "State of the Union address"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/fact-check-state-of-the-union",
      "text": "Hyperbole"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/fact-check-trump-democrats-affordability",
      "text": "financial fears"
    },
    {
      "url": "https://www.congress.gov/118/meeting/house/116942/documents/HHRG-118-JU00-20240312-SD001.pdf",
      "text": "2024 State of the Union"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/economy/us-sotu-economy-trump-vis",
      "text": "look pretty decent"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/economy/us-gdp-economy-q4",
      "text": "grew 2.2%"
    },
    {
      "url": "https://www.cnn.com/2025/12/31/economy/k-shaped-consumers-left-behind-2026",
      "text": "K-shaped"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "more than three months late on their loans"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/supreme-court-tariffs",
      "text": "Supreme Court ruling"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/business/affordability-economy-trump",
      "text": "whirlwind of affordability proposals"
    },
    {
      "url": "https://www.cnn.com/2026/01/16/business/pjm-electricity-auction-ai",
      "text": "help defray"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/business/parents-trump-accounts-kids-faq",
      "text": "Trump Accounts"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/politics/affordability-america-trump-proposals",
      "text": "received mixed reviews"
    }
  ],
  "hash": "c1894e895ff56a77f935d0fa1d3532c55ac56466bd1a32f619be4adc68157e7a",
  "scraped_at": "2026-02-27T07:18:00.580260+00:00"
}