{
  "url": "https://lite.cnn.com/2026/02/21/travel/travel-news-canada-underground-path-reso",
  "title": "Tunnels and fake ‘forests’: How to survive in the world’s harshest climates | CNN",
  "date": "2026-02-23T07:37:03.221863+00:00",
  "authors": [
    "Maureen O'Hare, CNN"
  ],
  "text": "Source: CNN\n\nIn our roundup ofCNN Travelstories this week: five-star luxury in Turkey, a fairytale castle with an underground Nazi complex, plus a bikini problem on an Australian bus.\n\nCanadian winters are not for the unprepared.\n\nTemperatures can drop as low as -4 F (-20 C) in Toronto and Montreal, so when the deep freeze hits, folks head where it’s warm: deep underground.\n\nToronto’s PATH and Montreal’s RÉSO are vast subterranean cities-within-cities where urbanites work, shop, commute and socialize, fully protected from the harsh weather above.Take a look here.\n\nBy contrast, in Qatar, where summer temperatures can hit 120 F (49 C), it’s extreme heat which locals work hard to avoid. Rather than sheltering indoors or in super-cooled shopping malls, however, people can now comfortably stroll outside thanks to a new innovation: an air-conditioned “forest” on Gewan Island.\n\nThe Crystal Walk promenade, stretching over about a third of a mile, or 450 meters, provides shade under artificial branches covered in 10 tons of crystals that give it its name. Here’show it works.\n\nFinally, the climate crisis is making winemaking an increasingly volatile business, but one winemaker in Namibia has worked out how to produce award-winning wines in one of the driest places in the world.\n\nAt Neuras Wine and Wildlife Estate, on the edge of the Namib Desert, grapes are grown under netting to keep off hungry baboons, meaning there’s plenty for us tipple-loving primates to enjoy. This is how theycracked the code.\n\nHere are two more stories of the subterranean, one sinister and one salty.\n\nThe first is for CNN subscribers. In Poland’s Owl Mountains, an underground Nazi complex lies underneath the fairytale Baroque architecture of Książ Castle. It’s tied to one of the Third Reich’s most mysterious construction projects and, legend has it, a lost train filled withstolen gold.\n\nA four-hour drive away, just southeast of Krakow, lies the Wieliczka Salt Mine — part cathedral, part industrial relic, part theme park.\n\nEvery day, up to 9,000 visitors descend into the mine, which was declared a UNESCO World Heritage Site in 1978. There are more than 150 miles of tunnels across nine underground levels, and guests are encouraged tolick the walls.\n\nWith new openings in Italy, Poland, the Netherlands and the United Kingdom, Robert De Niro and his business partners are expanding Nobu’s hotel chain across Europe fast. CNN joined them at the opening of their new hotel-restaurant on Rome’s iconic Via Veneto.Watch here.\n\nParadise Bay, in Turkey’s Bodrum Peninsula, is a hotbed of exciting new five-star openings. Exclusive villas here can cost around$50,000 a night.\n\nVilla Maçakızı, popular with A-list celebrities, is one of the best established. ”Whatever people want, whatever their wildest imagination,” the team can “put that together and make it happen,” says general manager Andrew Jacobs.\n\nEating on the London Underground is usually frowned upon, but one of the city’s most unusual dining experiences lies at the northern end of the Victoria tube line inside a decommissioned train carriage. Supperclub.tube hosts up to 36 guests for multi-course tasting menus, served between moquette seats and polished chrome fittings.\n\nBikinis have been banned on a Sydney bus after modesty complaints.\n\nLocals say passengers in swimwear are“off-putting” and “confronting.”\n\nItaly’s famous “Lovers’ Arch” collapsed on Valentine’s Day.\n\nBetter to haveloved and lostthan never to have loved at all.\n\nLuck be a lady with Chinese sodiac predictions.\n\nSeewhat’s in store for 2026as we enter the Year of the Fire Horse.\n\nA civil rights icon. A massive avalanche. A royal scandal.\n\nWhat do you remember fromthe week that was?\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/travel",
      "text": "CNN Travel"
    },
    {
      "url": "https://cnn.com/2026/02/17/travel/toronto-path-canada-underground-networks",
      "text": "Take a look here"
    },
    {
      "url": "https://us.cnn.com/travel/gewan-island-qatar-air-conditioned-forest",
      "text": "how it works"
    },
    {
      "url": "https://cnn.com/travel/namib-desert-neuras-wine-spc",
      "text": "cracked the code"
    },
    {
      "url": "https://cnn.com/travel/ksiaz-castle-poland-nazi-tunnels-gold-train",
      "text": "stolen gold"
    },
    {
      "url": "https://cnn.com/travel/wieliczka-salt-mine-tours-poland",
      "text": "lick the walls"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/business/video/robert-de-niro-nobu-hotels-rome-intl-digvid",
      "text": "Watch here"
    },
    {
      "url": "https://cnn.com/2025/09/15/travel/villa-macakizi-paradise-bay-bodrum",
      "text": "$50,000 a night"
    },
    {
      "url": "https://cnn.com/2026/02/13/travel/sydney-beach-bikini-ban-bus-intl-scli",
      "text": "“off-putting” and “confronting.”"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/travel/italy-lovers-arch-collapses-valentines-day",
      "text": "loved and lost"
    },
    {
      "url": "https://cnn.com/travel/chinese-zodiac-predictions-2026-year-of-the-fire-horse",
      "text": "what’s in store for 2026"
    },
    {
      "url": "https://cnn.com/interactive/2026/02/us/cnn-5-things-news-quiz-feb-20-sec/",
      "text": "the week that was"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/travel/travel-news-canada-underground-path-reso",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/travel/travel-news-canada-underground-path-reso",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c1a3c57c4d1ecf06048a8272c0e8e8bcb511c3c2bc548953e4b672ae784df313",
  "scraped_at": "2026-02-23T07:37:03.221876+00:00"
}