{
  "url": "https://lite.cnn.com/2026/02/10/business/corruption-index-transparency-international-united-states-intl",
  "title": "The US slips to its lowest-ever rank in a global corruption index | CNN Business",
  "date": "2026-02-11T16:40:00.124945+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe United States has fallen to its worst-ever position in a leading global index that measures perception of corruption in the public sector among independent experts and businesspeople.\n\nThe world’s most powerful democracy last year slipped one notch to 29th place, out of 182, in Transparency International’s Corruption Perceptions Index (CPI). That’s the lowest rank since 2012, when the index, established in 1995, was relaunched usingnew methodology.\n\nIn its new position, the United States tied with the Bahamas and was beaten by Lithuania (28), Barbados (24) and Uruguay (17).\n\nThe US ranking has been on a downward trend for the past decade. It took another hit last year, when the Trump administrationguttedthe federal government’s ability to fight public corruption by pausing investigations into corporate foreign bribery and curtailing enforcement of a foreign agent registration law, among other measures.\n\nSince returning to the White House, US President Donald Trump has alsoactively weakenedinstitutions anddeployedthe tools of government against his perceived foes.\n\nThe United States’ overall CPI score also hit its lowest-ever level, extending its downward slide over the past decade. It came in at 64 on a scale where 100 is very clean and 0 is highly corrupt.\n\n“We are very concerned about the situation in the United States,” Transparency International CEO Maíra Martini told CNN Tuesday. “This declining trend might continue.”\n\nIn a statement, Transparency International, a not-for-profit coalition fighting corruption, raised further alarm about the United States: “Although 2025 developments are not yet fully reflected, actions targeting independent voices and undermining judicial independence raise serious concerns.”\n\nIt added: “Beyond the CPI findings, the temporary freeze and weakening of enforcement of the Foreign Corrupt Practices Act signal tolerance for corrupt business practices, while cuts to US aid for overseas civil society have weakened global anti-corruption efforts.”\n\nThe worsening of corruption in the United States was mirrored by “a worrying decline in performance” across other democracies, including Canada and the United Kingdom, Transparency International said.\n\nThe UK also achieved its lowest CPI score on record, 70, following a decade of decline. But its position in 20th place remained unchanged.\n\n“We are not tackling the root causes of corruption in our politics,” Daniel Bruce, CEO of the UK chapter of Transparency International, said in a video posted to X.\n\nHe pointed to “mega donors” to UK political parties and “questionable public appointments,” referring to the criminal investigation into former government minister, Peter Mandelson.\n\nMandelson, who was briefly ambassador to the United States under the incumbent Labour government, is currently the subject of apolice investigationfor allegedly passing market-sensitive information to the late financier and convicted sex offender Jeffrey Epstein. The scandal has plunged the government of Prime Minister Keir Starmer intocrisis.\n\nBruce called on the UK government to “go further to remove the corrupting influence of big money in our politics.”\n\nThe global average score in the index also pointed to a deterioration globally: It fell toits lowest level (42), and suffered its first drop, in more than a decade. “The vast majority of countries are failing to keep corruption under control,” Transparency International said.\n\nDenmark topped the index for the eighth year in a row with a score of 89. The public sectors in Finland and Singapore were seen as the second- and third-cleanest in the world.\n\nSince the index focuses on public sector corruption, high scores do not necessarily reflectlow levels of corruption across the board.\n\nThe private sectors in high-ranking Switzerland and Singapore, for example, “have faced scrutiny for facilitating the movement of dirty money,” Transparency International said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/politics/corruption-justice-department-trump-new-york",
      "text": "gutted"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/politics/corruption-justice-department-trump-new-york",
      "text": "actively weakened"
    },
    {
      "url": "https://www.cnn.com/2025/09/22/politics/weaponization-trump-biden-analysis",
      "text": "deployed"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/uk/uk-police-searching-peter-mandelson-linked-properties-intl",
      "text": "police investigation"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/keir-starmer-resignation-crisis-epstein-fallout-intl",
      "text": "crisis"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/corruption-index-transparency-international-united-states-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/business/corruption-index-transparency-international-united-states-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c1e4a8657d84310d897375663694b93ac3c0a396bc641f93ce4e6db0695468be",
  "scraped_at": "2026-02-11T16:40:00.124958+00:00"
}