{
  "url": "https://lite.cnn.com/2026/02/10/science/roman-feces-medicine-study-scli-intl",
  "title": "Scientists find first physical evidence that Romans used human poop as medicine | CNN",
  "date": "2026-02-11T16:32:40.148988+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nResearchers in Turkey say they have unearthed archaeological evidencethat theRomansused human feces in medical treatments.\n\nAlthough Roman texts described the practice, this is the first time that physical evidence has been documented, according to a study publishedin the Journal of Archaeological Science: Reports.\n\nLead study author Cenker Atila, an archaeologist at Turkey’s Sivas Cumhuriyet University, told CNN that he had spotted residues in some Roman glass bottles, known as unguentaria, at the Bergama Museum during research for “Glass Objects from Bergama Museum,” a 2022 book he coauthored.\n\nAtila found residues in seven different vessels but only obtained a conclusive result from one artifact excavated in the ancient city of Pergamon that dates from the second century.\n\nAfter removing the clay cap and collecting a sample of brownish flakes within the bottle, Atila found that it contained “human feces, a high concentration of thyme and olive oil,” he said.\n\n“Because we are well acquainted with ancient textual sources, we immediately recognized this as a medicinal preparation used by the famous Roman physician Galen,” he said.\n\nBorn into a wealthy Greek family in Pergamon,Galenwas an anatomical pioneer who served three Roman emperors; his medical texts had lasting influence for some 1,500 years.\n\n“Finding the very remedy described by Galen himself was both a great surprise and a source of immense excitement for us,” Atila added.\n\nAccording to ancient texts, human and animal feces were known as “treatments for conditions ranging from inflammation and infection to reproductive disorders,” the study authors wrote.\n\n“Although often discussed with euphemism or caution, such substances were not necessarily perceived as repulsive or irrational. Rather, they occupied a liminal space in ancient pharmacology – considered potent and efficacious, yet also symbolically and sensorially charged,” the authors added.\n\nAtila said the results of the study analysis mean a medical practice “previously known only from ancient written sources has now been physically proven through an archaeological object.”\n\n“At the same time, our findings provide evidence that ‘fecal transfer,’ which holds an important place in modern medicine today, was already known in antiquity,” he said, referring to the practice of collecting a fecal sample from a healthy donor and transplanting them to a patient in order to harness thebenefits of microbiota.\n\n(The US Food and Drug Administration has approved two fecal transfer products for the prevention of recurrent bacterialinfection of the colonin adults.)\n\nWhile this kind of glass bottle was typically used to hold perfume, this one was apparently repurposed as a medicine bottle, Atila said.\n\nAs for the thyme, it was used for its antibacterial properties and to suppress the odor of the feces, he explained.\n\n“When we opened the bottle, we did not encounter any noticeable smell,” he said.\n\nThe investigation was scientifically solid, said Nicholas Purcell, a professor emeritusof ancient history at the University of Oxford, England, who was not involved in the study.\n\nThe findings are not surprising, as this kind of therapy is prominent in Roman texts, he said, “but it is very nice to join that tradition up with archaeological material.”\n\n“I’d be very interested in the context in which this was found, before it reached the museum stores,” said Purcell, who raised the possibility that the glass bottle may have been found in a tomb, perhaps buried alongside a doctor or a patient.\n\n“The default has been to think little glass vessels in tombs held lovely luxuries, especially perfumes and cosmetics, but the main contribution of this neat piece of research could be to widen that enquiry,” he added.\n\nThestudywas published on January 19.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/06/science/map-ancient-roman-empire-roads",
      "text": "Romans"
    },
    {
      "url": "https://www.britannica.com/biography/Galen",
      "text": "Galen"
    },
    {
      "url": "https://www.cnn.com/audio/podcasts/chasing-life/episodes/7fb9ba3d-609f-430d-a21c-ae9e012b2a7e",
      "text": "fecal transfer"
    },
    {
      "url": "https://www.cnn.com/2021/05/12/health/human-gut-microbiome-study-scli-intl-scn-wellness",
      "text": "benefits of microbiota"
    },
    {
      "url": "https://www.mayoclinic.org/diseases-conditions/c-difficile/symptoms-causes/syc-20351691",
      "text": "infection of the colon"
    },
    {
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S2352409X26000246",
      "text": "study"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/science/roman-feces-medicine-study-scli-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/science/roman-feces-medicine-study-scli-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c2e95b7d8c4478908a05d8f3a31be754bbdc25630a7f3f3e572af8bc606aa567",
  "scraped_at": "2026-02-11T16:32:40.149001+00:00"
}