{
  "url": "https://lite.cnn.com/2026/02/13/economy/us-inflation-cpi-consumer-prices-january",
  "title": "Inflation slowed in January, but some prices are still biting | CNN Business",
  "date": "2026-02-14T07:07:46.950465+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA Friday the 13th economic report appeared to deliver some fortunate news: Annual inflation slowed significantly.\n\nHowever, certain details of the latest Consumer Price Index presented a more sobering picture: Some price pressures aren’t just persisting, they’re accelerating.\n\nThe January CPI report capped off a week of new data that underscored a seemingly incongruent US economy:Consumer spending petered outas debt and meager pay gains weighed, butunexpectedly strong hiringfueled some optimism for the future.\n\n“This is one of those tough weeks where spreadsheets and data are cheery, but households still aren’t,” Tyler Schipper, an associate professor of economics at the University of St. Thomas, in St. Paul, Minnesota.“Even a good inflation report from the perspective of economists is higher prices, and that is not going to sit well with a lot of households.”\n\nHere’s a rundown of what the January inflation data shows, what it means in the context of the broader economy and, especially, whether cost of living concerns are abating.\n\nConsumer prices rose 2.4% in January from the year before, marking an eight-month low and a sharp cooldownfrom the 2.7% rate notched in December, according to the Bureau of Labor Statistics’ CPI report that landed on Friday, two days late because of the brief and partial federal shutdown that ended last week.\n\nOn a monthly basis, prices rose 0.2%, slower than the December pace and helped by tumbling gas prices, the continuation of a years-long slowdown in housing-related costs and a more moderate increase in food prices.\n\nFriday’s monthly reading came in better than projected as economists had forecast a 0.3% increase.\n\nEconomists had expected the annual rate to slow to 2.5%. But inflation came in even slower, at 2.4%, helped by more favorable prices at the pump grocery store. Math played a role as well – because prices spiked so much in January 2025, this January looked even better by comparison.\n\nPlus, the data could still be affected by disruptions from the historically long federal shutdown last fall, noted Lydia Boussour, EY-Parthenon senior economist.\n\nThe core CPI gauge – a closely watched measurement that excludes volatile food and energy prices – also saw its annual rate of inflation ease.\n\nCore CPI slowed to 2.5%, its lowest rate since March 2021, right before the pandemic-era inflationary spike.\n\nBut the underlying trajectory went in a different direction: The core CPI index accelerated to a five-month high of 0.3% from December’s 0.2%.\n\n“While mild topline inflation is encouraging, it would be premature to declare victory on inflation,” Joe Brusuelas, RSM US chief economist, wrote in an email to CNN, “as one can clearly observe beneath the headline sharp turn of the year pricing and sustained increase in tariff-sensitive goods.”\n\nThe CPI, which is the most widely used inflation gauge, measures the average change in prices for ﻿a broad basket of commonly purchased goods and services.\n\nThe monthly reads on those categories can sometimes be quite volatile; however, they also can be telling for where consumers are feeling pinched or seeing some welcome relief.\n\nGains in housing-related costs, the heaviest-weighted in the CPI, continued a years-long slowdown since the pandemic jacked up those expenses for many Americans. But economists caution that estimates to fill in the blanks during the government shutdown could be making that shelter inflation look better than it actually is.\n\nThe price readings should sort out come April (the BLS uses rotating six-month panels for its rent price data), which would likely cause a lift in overall inflation, economists have said.\n\nFor the Federal Reserve, Friday’s report combined withthe strong January jobs datashould keep further interest-rate cuts off the table in March, Schipper said.\n\nBut even if inflation is moving in a welcome direction for many Americans, it stillmight not feel that great, he added, especially for lower- and middle-income households that have seen slower wage and wealth gains than higher-income Americans.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "Consumer spending petered out"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "unexpectedly strong hiring"
    },
    {
      "url": "https://www.cnn.com/2026/01/13/economy/us-cpi-consumer-prices-inflation-december",
      "text": "from the 2.7% rate notched in December"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "the strong January jobs data"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/business/trump-tariffs-consumers-nightcap",
      "text": "might not feel that great"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/economy/us-inflation-cpi-consumer-prices-january",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/economy/us-inflation-cpi-consumer-prices-january",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c32a09c1ff59d7d694382e37148d7b4ed4b9d7db53664665effb2b4d50fc89d4",
  "scraped_at": "2026-02-14T07:07:46.950479+00:00"
}
