{
  "url": "https://lite.cnn.com/2026/02/18/us/word-of-week-scots-irish-cec",
  "title": "Word of the Week: When did ‘Scots-Irish’ become a synonym for ‘white’? | CNN",
  "date": "2026-02-19T07:31:34.999804+00:00",
  "authors": [
    "Harmeet Kaur, CNN"
  ],
  "text": "Source: CNN\n\nLast week, Jeremy Carl, who was nominated by the Trump administration for a top State Department post, was asked in his Senate confirmation hearing to define white identity.\n\nCarl, who published a book called “The Unprotected Class: How Anti-White Racism Is Tearing America Apart,” struggled for 20 seconds to articulate exactly what he considered white culture to be. Then heofferedas an example former Sen. Jim Webb’s 2004 book “Born Fighting: How the Scots-Irish Shaped America” and “the sort of Scotch-Irish military culture and certain pride that went with that.”\n\n“Scots-Irish,” often used interchangeably with “Scotch-Irish,” is a popular label among the currently ascendent set of American conservatives. Vice President JD Vance, an aggressive nativist, called himself “a Scots-Irish hillbilly at heart” in his career-making memoir “Hillbilly Elegy.”\n\nThe term also appeared over the weekend in a social media post from Elon Musk, though he botched the spelling of “Scot” and perplexingly combined the term with “English.”\n\n“For a country to survive, there has to be a common culture. Nobody dies to defend a ‘multicultural economic zone’!” Musk, a South African-born immigrant of mixed Canadian and South African background,wroteon X. “American culture, with its English-Scotts-Irish origin, is great and worth fighting for. Some may not realize it, but that’s why people come here.”\n\nA certain amount of confusion and imprecision is built into the use of the term. In a country founded out of a colonial patchwork of European, African and Native American cultures, overlaid with further immigration from around the globe, “Scots-Irish” has long served as a kind of shorthand for mythic ideas about what makes someone a “real American.” These days, to its proponents, it basically just means white.\n\nBut “Scots-Irish” has a specific and complex history. The first known use of it was by the English in the 1500s, to describe Catholics who moved back and forth between the Scottish Highlands and islands and the northern part of Ireland, said Kerby Miller, a professor emeritus of history at the University of Missouri. That 16th century term for Catholics became a 17th century term for Protestants, as Britain set about colonizing the Irish province of Ulster with Scottish Presbyterians. (Today in the north of Ireland, Protestants of Scottish origin are described as “Ulster Scots.”)\n\nDuring the 1700s, Scots in Ulster migrated in large numbers to what would eventually become the US. These people were sometimes called “Scots-Irish,” but by the time of the American Revolution, Miller said most of them simply referred to themselves as “Irish.”\n\nWhatever they were calling themselves at the time,Scottish Protestants from northern Ireland played a significant role in the settlement and founding of the US, said Liam Kennedy, a professor of American Studies at University College Dublin. They primarily moved westward and south to Appalachia, as the English elite positioned them at the frontier to protect British development from the French and from Native Americans. Kennedy said several Ulster Protestants signed the Declaration of Independence, and they had a key hand in the Revolutionary War and in the genocide of Native Americans.\n\nOver the years, the Scottish Protestants from Ulster began to assimilate into the general white middle class, Kennedy said. It wasn’t until around the 1850s that the term “Scotch-Irish” came into wider use in the US, Miller said — as more politically conservative Irish Protestants and their descendants sought to set themselves apart from the rapidly growing Irish immigrant population, especially the Irish Catholics who’d fled famine and settled in crowded northeastern cities. (Though the preferred term for Scottish people is “Scots,” Americans at the time more commonly used “Scotch-Irish.” “Scots-Irish” is the term preferred by scholars.)\n\n“Scots-Irish” and “Scotch-Irish” came to evoke the kind of grit, frontierism and backcountry roots seen as essential to American identity and its culture, said Patrick Griffin, a historian of early modern Atlantic history at the University of Notre Dame.\n\n“At that time, to be considered Scotch-Irish was to be considered, in many ways, the epitome of everything that was fundamentally American,” he said. “That was to be Protestant, that was to be a person that was not coming from an urban area, that was to be a person whose ancestors probably could have shed blood for the American cause in the revolution.”\n\nThrough the late 1800s and early 1900s, “Scots-Irish” became a formal political identity, with various Scots-Irish societies forming around the country. For many people, the identityoffered a sense of pride and rootedness in the country’s history, Griffin said. But it was also weaponized and used to exclude others. Thomas Dixon, whose 1905 novel “The Clansman” inspired the film “The Birth of A Nation,”dedicatedhis book to “the memory of a Scotch-Irish leader of the South, My uncle, Colonel Leroy McAfee, Grand Titan of the invisible empire, Ku Klux Klan.”\n\n“You have people like President Woodrow Wilson, for example, proudly calling themselves ‘Scots-Irish, or ‘Scotch-Irish,’ to distinguish themselves from the Irish who were Catholics but also to distinguish themselves as conservative, as respectable, as not working-class, as God-fearing, loyal, patriotic Americans and so on and so forth,” Miller added.\n\nA century after Wilson, American conservatives have retooled “Scots-Irish” identity into something less high-toned, cast in opposition to a multicultural, educated elite. For JD Vance, born and raised in Middletown, Ohio, “Scots-Irish” ancestry is a core part of his origin story, essential to his flatlander’s claim on humble Appalachian heritage.\n\n“I may be white,” Vance wrote in “Hillbilly Elegy,” “but I do not identify with the WASPs (White Anglo-Saxon Protestant) of the Northeast. Instead, I identify with the millions of working-class white Americans of Scots-Irish descent who have no college degree.”\n\nThis identity may be more attitudinal than historic. In Vance’s case, even with his Appalachian family connections, genealogists have so far been unable to trace his ancestry back to Ireland.\n\nDetached from any provable personal origins in Ireland, “Scots-Irish” evokes another term in vogue on the right: “Heritage Americans,” describing those who can trace their roots in the country back to the Civil or Revolutionary Wars. Like “Scots-Irish,” “Heritage American” can be fuzzy. For some, the labelincludesIndigenous peoples, the descendants of enslaved Africans and even immigrants who arrived via Ellis Island, so long as they conform to “Anglo-Protestant” norms and don’t dwell on past injustices. Others make no such allowances. As the right-wing podcaster Scott Greerwrotelast year in The American Conservative: “Heritage American is more palatable to the public than ‘white.’” (The Atlanticreported that until 2015, Greer wrote under the pseudonym Michael McGregor — a Scottish surname — for a journal founded by the white nationalist Richard Spencer.)\n\nMusk, in conflating “Scots-Irish” and “English” identity in his February 15 post, also seemed to be signaling a broader conception of whiteness. “It’s basically referring to whiteness, but not just any old whiteness,” Kennedy said. “It’s a whiteness of heritage. It’s a whiteness of settlement. It’s a whiteness of frontierism — all things I suspect that he can identify with through his own sense of white South Africanness.”\n\nWhether they opt for “Scots-Irish,” “Heritage American” or just “white,” it’s clear that some on the right seek to further a different narrative about the country, one in which the US is “not a nation of immigrants, but a settler nation, a nation of frontierspeople,” Kennedy said.\n\n“Those are two different origin stories of the one country,” he added. “And you can certainly see which one of those that Musk identifies with.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://bsky.app/profile/chrismurphyct.bsky.social/post/3meovxwm6ic2x",
      "text": "offered"
    },
    {
      "url": "https://x.com/elonmusk/status/2022919799752294493",
      "text": "wrote"
    },
    {
      "url": "https://www.tandfonline.com/doi/full/10.1080/17533170802172883",
      "text": "dedicated"
    },
    {
      "url": "https://x.com/contramordor/status/1794811572684263627?s=20",
      "text": "includes"
    },
    {
      "url": "https://www.theamericanconservative.com/are-heritage-americans-real/",
      "text": "wrote"
    },
    {
      "url": "https://www.theatlantic.com/politics/archive/2018/09/a-daily-caller-editor-wrote-for-an-alt-right-website-using-a-pseudonym/569335/",
      "text": "The Atlantic"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/us/word-of-week-scots-irish-cec",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/us/word-of-week-scots-irish-cec",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c4e1a9154feee6e3538793823ae7b5bd8d113b5e25ede87cd8b8dc3037d0da05",
  "scraped_at": "2026-02-19T07:31:34.999818+00:00"
}