{
  "url": "https://lite.cnn.com/2026/02/13/politics/supreme-court-trump-uninvited-d-john-sauer",
  "title": "Nobody asked: Trump’s DOJ steps up uninvited recommendations at Supreme Court | CNN Politics",
  "date": "2026-02-14T07:08:29.316872+00:00",
  "authors": [],
  "text": "Source: CNN\n\nPresident Donald Trump’s administration is stepping into high-profile appeals at the Supreme Court without invitation at an unprecedented pace, supporting conservative groups in casesdealing with guns, religion and climate change.\n\nThe courtregularly invites the Justice Department to offer its view on whether to hear appeals, andrecommendations from the solicitor general, the administration’s top appellate attorney, have long carried a special weight at the Supreme Court.\n\nBut Solicitor GeneralD. John Sauer’s office is using the relationship more aggressively than in the past, urging the Supreme Courtto take onculture war cases that alignwith the president’sagenda — even when the court has not asked for the Justice Department’s input. The administrationhas butt into at least five cases without invitation, most recently a potentially significant appeal involving religious preschools.\n\n“It’s using the solicitor general’s unique position as a way to push not just the policy and political agenda of the current president, but the broader ideological agenda of the Republican Party,” said Steve Vladeck, CNN Supreme Court analyst and professor at Georgetown University Law Center.\n\nThe solicitor general’s office has largely avoided the political turmoil churning through the rest of the Justice Department during Trump’s second term. Like everyone else in the department, Sauer works at Trump’s pleasure — but his position, often referred to as the “10th justice” — has also long been viewed as having a responsibility to the Supreme Court, not just the administration.\n\nAnd so far, Sauer has managed to successfully balance those sometimes-competing demands. The 6-3 conservative court repeatedly sided with Trump last year, backing the administration 80% of the time on its emergency docket. It is a record that Attorney General Pam Bondi was quick to tout ahead of a fiery confrontation with House Democrats earlier this week.\n\n“We’ve obtained 24 favorable rulings at the US Supreme Court,” Bondi told the House Judiciary Committee on Wednesday before tacking on a promise. “Even more to come.”\n\nBut that dual responsibility can mean added scrutiny if it appears the solicitor general is veering from past practice into more political territory.\n\nWhen an appeal lands at the Supreme Court, the parties spend weeks submitting written arguments trying to get the vote of the four justices needed to grant an appeal. While third-party groups often submit friend-of-the-court briefs attempting to influence that decision, it is especially notable when the solicitor general does so – in part because of how infrequently it happens.\n\nThe five uninvited briefs filed by the Trump administration represented more intervention than previous administrations exercised.\n\nThe Biden administration, for instance, did not file any similar briefs in merits cases over fouryears, though it did submit an unsolicited recommendation in an emergency appeal in 2021 in a death penalty case from Oklahoma. The Clinton administration filed five briefs over eight years in office,according to a review by SCOTUSblog. Only two were filed during Trump’s first, four-year term.\n\nSauer’soffice did not respond to a series of questions from CNN about how the decision is made to intervene and the process that it uses.\n\nBut a source familiar with the Justice Department’s approach noted that it appeared to be working: The court has so far agreed with recommendations from the solicitor general’s office in three out of five cases. (Two other appeals arepending.) That source stressed that the practice of filing uninvited briefs still remains exceedingly rare.\n\n“Only infrequently does the solicitor general file unsolicited amicus briefs at the certiorari stage,” Patricia Millett, a former assistant to the solicitor general who is now a federal appeals court judge, wrote in an academic journal in 2009. “After all, if the court believes that the government’s views would be helpful to its decision, it will ask for them.”\n\nThe department’s credibility, Millett wrote then, “depends, in large part, on consistently applying extremely selective and exacting criteria before asking the court to exercise its jurisdiction.”\n\nIn its most recent uninvited brief, the Justice Department in late January urged the Supreme Court to take up an appeal involving a Colorado law that requires preschools to enroll children regardless of race, ethnicity, religion, sexual orientation, gender identity, disability and other factors.\n\nThe Archdiocese of Denver is challenging that law. The church, represented by the religious public interest firm Becket, wants to receive public funding for its Catholic preschools but decline to admit students from families who don’t “see eye to eye” on the church’s opposition to same-sex marriage and those who identify as transgender.\n\nIn the filing, Sauer warned that the lower court opinions supporting the Colorado law could “stymie religious exercise in major portions of the country.” The conservative Supreme Court hasrepeatedly sided with religious groupsin recent years in similar cases, finding that such laws effectively discriminate against religion and violate the First Amendment.\n\nTo justify the administration’s intervention, Sauer told the court that the United States had, in part, a “substantial interest in the preservation of the free exercise of religion.”\n\nFor Becket, which hassuccessfully argued many religious casesat the high court, the brief from the Trump administration was huge – an affirmation of its argument that the justices should grant their appeal.\n\n“Looking back at some of the past cases they’ve filed in, I think the vast majority of them end up going to the court,” Nick Reaves, a senior counsel with Becket, said of the Justice Department’s decision to enter into an appeal, known as a petition for a writ certiorari in legal speak.\n\n“The solicitor general knows what makes a good petition and knows when it’s important for the court to weigh in on an issue,” Reaves said.\n\nThe court will decide whether to hear the case later this year.\n\nSauer also submitted an uninvited brief in a significant Second Amendment case involving a Hawaii law that bars people fromcarrying guns onto private propertywithout the explicit approval of the property owner. The Trump administration urged the Supreme Court to take up the case and rule against Hawaii, claiming that the state’s law “functionally eliminates” the general Second Amendment right to carry firearms in public.\n\nAfter the Supreme Court agreed with that recommendation, Bondi touted the administration’s involvement in a social media post.\n\n“As I said soon after taking office, the Second Amendment is not a second-class right,”she wrote on X. “My Justice Department will continue to be the most pro-Second Amendment Justice Department in history.”\n\nThe Supreme Court heard oral arguments in January and a majority of justices signaled they wereprepared to strike down the law. A decision is expected by the end of June.\n\nSome of the cases the administration has entered on its own are far less controversial. One involved an early-stage prisoner lawsuit against federal prison officials that almost certainly would have drawn in the Justice Department if allowed to continue. Another involved an Alabama prisoner who has been sentenced to death, a case that could have direct implications for the federal government’s ability to execute prisoners on federal death row.\n\nBut other cases deal with issues of national significance.\n\nIn September, the administration weighed in on a major environmental appeal dealing with whether local governments may sue fossil fuel producers for damages from climate change. The Justice Department urged the Supreme Court to take up that case and overturn a decision from Colorado’s highest court that allowed the litigation against Suncor Energy and Exxon Mobil to move forward.\n\nIn its brief to the Supreme Court, DOJ warned that without intervention, “every locality in the country could sue essentially anyone in the world for contributing to global climate change.”\n\nThe Supreme Court could announce whether it will hear that appeal within weeks.\n\nJohn Elwood, a veteran appellate attorney, counted seven such briefs filed by the Trump administration, including two that came in emergency cases.\n\n“In absolute terms, the numbers remain small,” Elwoodwrote on SCOTUSblogthis week. “But relative to historical practice, the increase is meaningful. A mechanism once used sparingly is now being deployed with some regularity.”\n\nBut William Jay, a veteran appellate attorney who served in the solicitor general’s office and clerked for Justice Antonin Scalia, said that there may be a more practical reason why the Biden administration was less likely to file uninvited briefs than Trump: the Democratic administration probably reasoned it had to be more selective about the cases it urged the conservative court to hear.\n\nBiden’s DOJ may have filed less “not because it was reluctant to file amicus briefs,” Jay said, “but because it didn’t want those cases decided by the current Supreme Court.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/03/politics/supreme-court-guns-hawaii-second-amendment",
      "text": "dealing with guns"
    },
    {
      "url": "https://www.cnn.com/2025/02/10/politics/how-the-10th-justice-can-help-trumps-agenda-at-the-supreme-court",
      "text": "D. John Sauer"
    },
    {
      "url": "https://www.scotusblog.com/2026/02/no-invitation-necessary-when-the-solicitor-general-weighs-in-unsolicited/",
      "text": "according to a review by SCOTUSblog"
    },
    {
      "url": "https://www.cnn.com/2021/06/17/politics/supreme-court-fulton",
      "text": "repeatedly sided with religious groups"
    },
    {
      "url": "https://www.cnn.com/2025/06/27/politics/lgbtq-books-schools-supreme-court",
      "text": "successfully argued many religious cases"
    },
    {
      "url": "https://www.cnn.com/2025/10/03/politics/supreme-court-guns-hawaii-second-amendment",
      "text": "carrying guns onto private property"
    },
    {
      "url": "https://x.com/AGPamBondi/status/1993042781346955299?s=20",
      "text": "she wrote on X"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/politics/hawaii-supreme-court-guns-private-property-public-property",
      "text": "prepared to strike down the law"
    },
    {
      "url": "https://www.scotusblog.com/2026/02/no-invitation-necessary-when-the-solicitor-general-weighs-in-unsolicited/",
      "text": "wrote on SCOTUSblog"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/supreme-court-trump-uninvited-d-john-sauer",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/supreme-court-trump-uninvited-d-john-sauer",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c52fc008462518b3e09e3fda84ec7986580d3bc57d155a0fb538ff12be9ba0bc",
  "scraped_at": "2026-02-14T07:08:29.316886+00:00"
}