{
  "url": "https://lite.cnn.com/2026/02/16/china/china-submarine-building-iiss-report-intl-hnk-ml",
  "title": "China is building submarines faster than ever, think tank says. Why that’s a problem for Washington | CNN",
  "date": "2026-02-17T07:29:57.897304+00:00",
  "authors": [
    "Brad Lendon, CNN"
  ],
  "text": "Source: CNN\n\nChina has ramped up its production of nuclear-powered submarines over the past five years to the point where it is launching subs faster than the United States, threatening to negate a sea-power advantage that has long belonged to Washington, a new think tank report says.\n\nThe buildup in the People’s Liberation Army Navy’s nuclear-powered sub force includes both ballistic-missile and attack subs,the reportfrom the International Institute for Strategic Studies (IISS) says.\n\nDuring the years 2021 to 2025, China’s submarine building surpassed that of the US in both numbers of subs launched – 10 to 7 – and tonnage – 79,000 to 55,500, says the report, which looked at shipyard satellite imagery to draw estimates of China’s construction.\n\nBeijing does not disclose fleet numbers.\n\nIt’s a stark turnaround from the 2016 to 2020 period, when China only added three subs (23,000 tons) to the US Navy’s seven (55,500 tons), according to the IISS analysis.\n\nThe numbers represent subs launched but not necessarily completed and added to the active-duty fleet, where the US still maintains a large advantage.\n\nAs of early 2025, China had 12 active nuclear-powered submarines, six ballistic-missile boats and six guided-missile or attack boats, according to the IISS’ “Military Balance 2025.” The US had 65 total subs, with 14 of those being ballistic-missile boats.\n\nChina also maintains a large conventionally powered sub fleet, with 46 boats, according to the “Military Balance.”\n\nThe US has zero conventionally powered subs which – unlike nuclear-powered subs – need to refuel regularly.\n\nTo accommodate its nuclear-powered sub fleet growth, Beijing has significantly expanded the Huludao yard of Bohai Shipbuilding Heavy Industry Co. in northern China, according to the report, headlined “Boomtime at Bohai.”\n\nIt comes after a Congressional Research Service report to Congress last month said the US Navy is falling well behind its submarine-building goal of two Virginia-class attack boats per year, with US shipyards delivering only 1.1 to 1.2 subs a year since 2022.\n\nThe US is also building new Columbia-class ballistic-missile submarines, but that program is at least a year behind schedule, with first-in-the-class USS District of Columbia not expected to be delivered to the Navy until 2028, the admiral in charge of the programtold Breaking Defenselast week.\n\n“The greater numbers in the water present a growing challenge to (the US and other Western) countries as they struggle to increase their own output,” the IISS report says.\n\nThe IISS report highlights two Type 094 ballistic-missile subs (SSBNs) that have been launched at the Huludao shipyard. With the ability to fire nuclear-armed ballistic missiles, the Type 094s add to Beijing’s growing nuclear triad of land-based intercontinental ballistic missiles and bombers, it says.\n\nAnd China has even better SSBNs in the works, the IISS says.\n\n“The Type-096, is still expected to begin production at Bohai this decade, entering service either in the late 2020s or early 2030s,” it says.\n\nBesides the SSBNs, the PLA Navy’s nuclear-powered launch numbers for the past five years include at least six guided-missile sub (SSGN) hulls, the report says. These boats have the vertical launch system (VLS), which could be used to fire new high-speed anti-ship missiles displayed at China’s Victory Day parade in Beijing last fall.\n\nBut the IISS report isn’t all bad news for Washington and its allies.\n\n“Chinese designs almost certainly lag behind US and European boats in terms of quality,” the report says.\n\nThe newest Chinese subs are not believed to be as quiet as US ones, leaving the stealth advantage to the US Navy.\n\nStill, experts say, in naval combat, thelarger force usually prevails. And China already possesses the world’s-largest fleet of destroyers, frigates and surface combatants.\n\nMeanwhile, Washington has struggled to keep up.\n\nNavy Secretary John Phelan last summer told a US House of Representatives hearing that US naval construction was in dire straits.\n\n“All of our programs are a mess,” Phelan said.\n\n“I think our best one is six months late and 57% over budget … That is the best one,” he testified.\n\nWhen it comes to submarine numbers over the next five years, the Congressional Research Service (CRS) report says US attack sub numbers are expected to hit the “bottom of the valley” to 47 in 2030, as aging Los Angeles-class attack boats are retired.\n\nAn increase to 50 attack subs is not expected until 2032 – if construction goals are reached – the report says.  But it notes that plans to sell three to five Virginia-class subs to Australia as part of the AUKUS deal could hamper plans to increase the US fleet in the short term.\n\nThe upcoming sub force “valley” was first noted in 1995, the CRS report says, adding, it “could lead to a period of heightened operational strain for the SSN force, and perhaps a period of weakened conventional deterrence against potential adversaries such as China.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.iiss.org/online-analysis/military-balance/2026/02/boomtime-at-bohai-china-ramps-up-submarine-production/",
      "text": "the report"
    },
    {
      "url": "https://breakingdefense.com/2026/02/columbia-class-submarines-see-construction-ramp-up-navy-official-says/",
      "text": "told Breaking Defense"
    },
    {
      "url": "https://www.cnn.com/2023/01/16/asia/china-navy-fleet-size-history-victory-intl-hnk-ml",
      "text": "larger force usually prevails"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/china/china-submarine-building-iiss-report-intl-hnk-ml",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/china/china-submarine-building-iiss-report-intl-hnk-ml",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c851bba21c1a5a9b94965e2ce06265bb59b4cb1fff512d7fef34dd2ae0790eaa",
  "scraped_at": "2026-02-17T07:29:57.897316+00:00"
}