{
  "url": "https://lite.cnn.com/2026/02/09/business/eddie-bauer-bankruptcy",
  "title": "Operator of Eddie Bauer stores in the US and Canada files for bankruptcy | CNN Business",
  "date": "2026-02-11T16:33:50.416544+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nEddie Bauer LLC filed for Chapter 11 bankruptcy protection on Monday and hopes to sell about 200 of its namesake outdoor sportswear stores in the United States and Canada,citing declining sales and supply chain challenges.\n\nThe company said itsfinancial headwinds were exacerbated by the Trump administration’s uncertain tariff policies and inflation, among other factors.\n\nMost of the outfitter’s locations will remain open while the company looks for a buyer. But if that process fails, Eddie Bauer shops in the US and Canada operated by the LLC could close, the company noted. The company couldn’t say when individual stores may close, a spokesperson told CNN over email.\n\n“While the leadership team at Catalyst was able to make significant strides in the brand, including rapid improvements in product development and marketing, those changes could not be implemented fast enough to fully address the challenges created over several years,” Marc Rosen, the chief executive of Catalyst Brands, which owns the Eddie Bauer brand, in astatement.\n\nThis is the third bankruptcy for the more than 100-year-old company, following a Chapter 11 filing in 2003 and six years later, because of the 2008 financial crisis.\n\nEddie Bauer stores outside of the US and Canada will remain open because they are operated by other licensees, the company said in a press release. The company’s online sales and wholesale operations will transition to a different firm called Outdoor 5 LLC, allowing e-commerce to remain available.\n\nThe brand isn’t the first major retailer to file for bankruptcy so far this year. Saks Global filed forbankruptcyin January amid a broaderluxury market slumpand under high debt loads from buying its luxury rival,Neiman Marcus.\n\n“This is not an easy decision, and we are grateful to the Retail Company’s associates and customers for their loyalty and trust,” Rosen said. “We are working to minimize the impact on the Retail Company’s employees, vendors, customers and other stakeholders.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.businesswire.com/news/home/20260208409879/en/Eddie-Bauer-LLC-Operator-of-US-and-Canadian-Stores-Initiates-Voluntary-Chapter-11-Process-With-Support-of-Lenders",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/business/saks-global-files-for-bankruptcy-retail-hnk",
      "text": "bankruptcy"
    },
    {
      "url": "https://www.cnn.com/2025/02/22/business/luxury-brands-middle-income-aspirational-consumer",
      "text": "luxury market slump"
    },
    {
      "url": "https://www.cnn.com/2024/07/05/business/saks-fifth-avenue-neiman-marcus-amazon",
      "text": "Neiman Marcus"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/business/eddie-bauer-bankruptcy",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/business/eddie-bauer-bankruptcy",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c9850cca2f13f856eb514afacdf9a6d44161e8d7b9f1abdafa28e251ab22861e",
  "scraped_at": "2026-02-11T16:33:50.416556+00:00"
}