{
  "url": "https://lite.cnn.com/2026/02/13/science/spacex-crew-12-launch-nasa",
  "title": "SpaceX, NASA to launch new ISS crew, ending a month of skeleton staffing | CNN",
  "date": "2026-02-13T07:30:43.252798+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA SpaceX capsule will soon ferry four astronauts to the International Space Station, bring the orbiting laboratory back to full staff after a month of operating with a skeleton crew.\n\nThe mission, called Crew-12, will lift off no earlier than 5:15 a.m. ET Friday from Cape Canaveral Space Force Station in Florida.\n\nNASA, which contracts SpaceX for the astronauts’ transport to and from the space station, had sought to expedite the Crew-12 launch due to the staffing situation. But the agency had to forgo two possible launch windows on Wednesday and Thursday because of unfavorable weather along the rocket’s flight path.\n\nThe International Space Station has been operating with three people on board — well below the seven-person staff the space agency desires — since mid-January.\n\nThe new launch comes after a previous SpaceX staffing mission, Crew-11, was forced to make an early return to Earth because of an undisclosed medical issue by an unidentified member.\n\n“NASA was ready. The team responded quickly and professionally, as did the teams across the agency, working closely with our commercial partners and executed a very safe return,”   NASA Administrator Jared Isaacman said during a news conference in January, adding that the astronaut was in stable condition. “This is exactly why we train, and this is NASA at its finest.”\n\nUpon Crew-11’s splashdownreturnoff the coast of California, all four astronauts went to Scripps Memorial Hospital in La Jolla. The crew — which included NASA’s Zena Cardman and Mike Fincke, Japan Aerospace Exploration Agency astronaut Kimiya Yui and Roscosmos cosmonaut Oleg Platonov of Russia — later appeared at a news conference.\n\n“How we handled everything all the way through, from nominal operations to this unforeseen operation, really bodes well for future exploration,” Fincke said.\n\nOn board the Crew-12 mission will be NASA’s Jessica Meir and Jack Hathaway, European Space Agency astronaut Sophie Adenot and Russian cosmonaut Andrey Fedyaev.\n\nNASA typically likes to have a direct handover between incoming and outgoing crews on the space station, a process that can bring staffing levels up to 11 as the arriving astronauts orient themselves on the laboratory with the help of the departing crew.\n\nGiven Crew-11’s emergency medical departure, the Crew-12 astronauts will get no such handover period. But Meir said she and her crewmates were able to exchange information with the Crew-11 astronauts on the ground.\n\n“We ran into them several times and had a little bit of a debrief so they could pass along some pertinent things,” shesaidduring a February 8 news conference.\n\nThe Crew-11 astronauts’ premature departure left the football field-size space station with three remaining staff members: two Russian cosmonauts, Sergey Kud-Sverchkov and Sergei Mikayev,as well as NASA astronaut Chris Williams, who traveled to the orbiting laboratory as part of a rideshare agreement with Roscosmos, NASA’s Russian counterpart.\n\nThe situation is less than ideal. NASA has routinely indicated that a robust crew presence on the space station is crucial for maximizing value and productivity on board the orbiting laboratory — which costs about $3 billion per year to operate and maintain.\n\nHowever, as Meir noted, before SpaceX began offering NASA routine trips to orbit for the space agency’s astronauts, it was common for only three astronauts to helm the space station.\n\n“The time of my last flight — around six, seven years ago — we did these indirect handovers,” Meir said, referring to the process of conducting a handoff with new crewmates on the ground rather than in orbit. “It was more rare to have that direct handover where the other crew stayed on board before you arrived.”\n\nStill, temporarily having three crewmates aboard the station does limit the amount of research that can be carried out. And Isaacman has signaled that he considers novel research on the orbiting laboratory to be a priority.\n\nSuch work, Isaacman has said, can help pave the way for new, commercial space stations that can replace the aging laboratory.   NASA has long hoped that private-sector companies would build space stations in low-Earth orbit so that the space agency can focus on efforts to explore the deeper solar system.\n\n“I, like a lot of space enthusiasts, dream of the day where we have multiple commercial space stations in low-Earth orbit,” Isaacman said during aSenate confirmation hearingin December. “But I think in order for that to be a financially viable model, we have to absolutely maximize the remaining life of the International Space Station — get the highest potential science and research to the space.”\n\nDuring their roughly eight-month stay on the space station, the Crew-12 astronauts are slated to carry out an array of research projects, including ultrasound scans of their blood vessels to investigate changes in circulation and pharmaceutical research related to bacteria that cause pneumonia. The group will also conduct a simulated lunar landing — an effort to assess how abrupt changes in gravity affect the human body and cognition.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/science/nasa-astronauts-splashdown-iss-health-concern",
      "text": "return"
    },
    {
      "url": "https://www.youtube.com/watch?v=3CuHCROAwRI",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/science/nasa-astronauts-depart-iss-health-concern",
      "text": "Senate confirmation hearing"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/science/spacex-crew-12-launch-nasa",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/science/spacex-crew-12-launch-nasa",
      "text": "Cookie Settings"
    }
  ],
  "hash": "c9d52385f85996f5092093c0e570c84dfc8ec7491a852d8530056b45f8f1ba9e",
  "scraped_at": "2026-02-13T07:30:43.252811+00:00"
}