{
  "url": "https://lite.cnn.com/2026/02/25/health/measles-doctors-states",
  "title": "Hospitals fighting measles confront a challenge: Few doctors have seen it before | CNN",
  "date": "2026-02-26T07:31:59.969949+00:00",
  "authors": [
    "Andrew Jones, KFF Health News"
  ],
  "text": "Source: CNN\n\nAt around 2 a.m., 7-year-old twin brothers arrived at Mission Hospital in Asheville. Both had a fever, a cough, a rash, pink eye, and cold symptoms.\n\nThe boys sat in one waiting room and then another. Two hours and 20 minutes passed before the two were isolated, according toCenters for Medicare & Medicaid Services recordsobtained by KFF Health News. Then two more hours ticked by.\n\nAs the sun rose, an emergency room doctor called the state epidemiologist and described the symptoms. The public health official told him to keep the kids in the hospital and quarantine them. Shortly after that call, the patients were diagnosed.\n\nIt was measles.\n\nHospital staff gave the father instructions on how to quarantine the family and sent them home.\n\nThe virus exposed at least 26 other people in the hospital that January day, federal investigators determined. Health inspectors for CMS investigated the measles infections and other failures in care and concluded that the twins’ symptoms should have triggered an isolation procedure for which Mission Hospital staffers had trained seven months earlier. CMS designated Mission in “Immediate Jeopardy” for the exposures and other unrelated issues, one of the most severe sanctions a hospital can face, threatening to pull federal funding unless it remedied the problems.\n\nA spokesperson for Mission said its staff was trained to manage airborne sickness and is following federal rules.\n\nAs U.S. hospitals face an increasing risk of encountering measles, and pressure to immediately spot it, health care workers face an unusual barrier: Many don’t know what it looks like.\n\n“There’s a word, ‘morbilliform’ — it means measles-like, and there are lots of viruses that can cause a rash that looks like a measles rash in children,” said Theresa Flynn, a pediatrician in Raleigh and the president of the North Carolina Pediatric Society. In 30 years in health care, she’s never seen a measles case, she said.\n\nNorth Carolina has reported more than 20 cases since mid-December, and more than 3,000 people nationwide have been infected since the beginning of 2025.\n\nChildren in areas with low immunization rateshave been especially susceptibleto outbreaks, triggering public health campaigns to promote the measles vaccine. CMS Administrator Mehmet Oz encouraged vaccination in aCNN interview on Feb. 8.\n\nWith two doses of the measles, mumps, and rubella vaccine, a person has a 3% chance of getting the virus after exposure. If exposed, an unvaccinated person has a 90% chance of being infected, according to the CDC. It can take a week or two before someone infected with measles shows symptoms.\n\nBut for the past year, the Trump administration hassown doubt about vaccine effectiveness. Health and Human Services Secretary Robert F. Kennedy Jr. was a longtime anti-vaccine activist before taking office, and under his leadership the Centers for Disease Control and Prevention has reduced the number of shots recommended to children.\n\nAfter measles erupted in West Texas last year, Kennedy publiclyrecommended unconventional and unproven treatmentsfor the virus, including steroids, antibiotics, and cod liver oil.\n\nInfectious disease experts and doctors said federal policies have left health care workers to lean on their own experience or guidance from their state public health systems to fight a disease that many are preparing to see for the first time and that initially may behave like the common cold.\n\n“As measles becomes more common, all of us are leveling up in our ability to recognize and immediately respond to suspected measles,” Flynn said.\n\nOfficially, the U.S. has maintained “measles elimination status” since 2000, meaning the U.S. has avoided significant spread of the virus. After outbreaks in Texas, Arizona, Utah, and now South Carolina, the nation is on track to lose that designation before the year is out.Its own adopted regulationstie elimination status to a lack of a continuous viral spread persisting for 12 months.\n\nOne county in South Carolina, an hour’s drive from Asheville, has hadmore than 900 casesin the current outbreak — more than Texas reported in all of 2025.\n\nSymptoms of measles, a virus thatattacks the lungs and airways, can include fever, cough, a blotchy rash, and red, watery eyes. Researchers consider measles among the most contagious diseases, and the virus may remain active for up to two hours after an infected person leaves a room.\n\nIt can be lethal, with1 to 3 deaths per 1,000 cases in children.\n\nIn 2025, two children in Texas and one adult in New Mexico died of measles.\n\nAlong with tracking data, the CDCprovides detailed summarieson its website for diagnosing measles. State public health agencies and some counties have developed dashboards tracing the disease as it surfaces in such places as hospitals, schools, grocery stores, and airports. Large hospital systems developed staff training protocols last year and shared them with area clinics.\n\nLook for the three C’s,that guidance said: cough, coryza (cold symptoms), and conjunctivitis (pink eye). According to CMS inspection records, HCA Healthcare, which owns Mission Hospital, trained Mission staff on the three C’s early last year. On top of failing to isolate the twin patients right away, Mission staff didn’t have a designated area for patients with respiratory symptoms, federal inspectors found.\n\nThe CDC advises health workers to immediately place patients with measles or suspicious symptoms in a special isolation room, where airflow is controlled inward. The Mission patients were separated from other patients only by plastic partitions, according to the CMS records.\n\nMission spokesperson Nancy Lindell said the hospital was equipped and staffed to manage airborne illnesses like measles.\n\n“Our hospital has been working with state and federal health officials on proactive preparedness, and we are following guidance provided by the CDC,” Lindell said.\n\n(Dogwood Health Trust, a private foundation established as part of HCA’s purchase of Mission Health, helps fund KFF Health News coverage.)\n\nMost U.S. clinics and hospitals have never experienced measles cases, said Patsy Stinchfield, a former president of the National Foundation for Infectious Diseases and a nurse practitioner. She called CMS’ Immediate Jeopardy penalty for Mission “extreme,” given the virus can be so difficult to identify.\n\n“In the middle of winter right now, measles looks like every other viral respiratory infection that kids come in with,” Stinchfield said.\n\nThe CDC has been less communicative in the past year with clinics about their response to outbreaks, said health workers and infectious disease experts. This disconnect began soon after Trump took office, according to aKFF Health News investigationfinding that health officials in West Texas were unable to talk with CDC scientists as measles surged last February and March.\n\n“We certainly do not feel the support or guidance from the CDC right now,” said Brigette Fogleman, a pediatrician at Asheville Children’s Medical Center, where staff members have come up with their own method of staving off the virus: screening patients over the phone and in their cars before a visit.\n\nIn response to questions about how the CDC is supporting health care organizations during the measles resurgence, spokesperson Andrew Nixon said that “state and local health departments have the lead in investigating measles cases and outbreaks” and that the CDC provides support “as requested.” He pointed to numerous guides and simulation tools the agency has developed as the virus has spread.\n\nJennifer Nuzzo, an epidemiologist and director of the Pandemic Center at Brown University, acknowledged that diagnosing measles is a major challenge, emphasizing that coordination among public health agencies is critical in overcoming that challenge.\n\nStinchfield attributed the spread of measles to CDC leaders’ lack of communication to clinics and to the public — no ads on buses, no social media campaigns, no sense of urgency. “When you are at the highest level of measles cases in 30 years, we should be seeing lots more from our federal government,” Stinchfield said. “And I think it’s harming kids and causing an inordinate amount of work and expense that really doesn’t belong in health care right now.”\n\nIn North Carolina’s Buncombe County, home to Asheville and Mission Hospital, health officials had counted seven measles cases by mid-February and anticipated many more, according to state epidemiologist Zack Moore. It’s unclear how many of those are connected to the Mission exposure.\n\n“We are preparing for a future in which we follow a trajectory like South Carolina,” Moore said, “where we see sort of a gradual accumulation of cases, and then all of a sudden it reaches kind of a tipping point, and we see a more explosive growth in the outbreak and spread across the state.”\n\nFogleman, who is also a pediatrician, and Buncombe health department director Jennifer Mullendore spoke during arecent Facebook livestreamhosted by the county, urging families to get their children vaccinated, debunking vaccine misinformation, and updating parents on local case numbers.\n\nDays before, a local private school had quarantined about 100 students after an exposure.Only 41% of students therewere immunized, according to state data.\n\nAt Fogleman’s clinic, parents are asked to wait in their vehicles with their children, and staffers come out to screen them there. Some parents resist vaccination and note recently weakened federal recommendations around measles vaccinesfor children under 4, she said.\n\nKennedy handpicked the committee members who made those recommendations, with several members having spread medical misinformation in the past.\n\nOne parent recently told a nurse, “It’s only measles. It doesn’t kill anybody,” Fogleman said.\n\nThat’s not true, her team must explain.\n\nAs the clinic holds families in the parking lot, trying to figure out whether symptoms point to the dangerous virus, it’s difficult to get the message across, Fogleman said, especially when the nation’s top disease agency hasn’t conducted a widespread information campaign about the risks from measles — or the vaccine’s ability to almost entirely prevent it.\n\n“We can’t change the past,” Fogleman said. “All we can do is try to educate and move forward.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.documentcloud.org/documents/27174819-memorial-mission-hospital-and-asheville-surgery-center-cms-2567/",
      "text": "Centers for Medicare & Medicaid Services records"
    },
    {
      "url": "https://www.documentcloud.org/documents/27174820-memorial-mission-hospital-ccn-340002-termination-extension-letter-01262026/",
      "text": "Immediate Jeopardy"
    },
    {
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12357784/#:~:text=Measles%2C%20once,3%5D%2E",
      "text": "have been especially susceptible"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/politics/video/cms-dr-oz-measles-trumprx-vaccine-lower-drug-prices",
      "text": "CNN interview on Feb. 8"
    },
    {
      "url": "https://www.cdc.gov/measles/vaccines/index.html#:~:text=One,mumps,-While",
      "text": "With two doses of the measles"
    },
    {
      "url": "https://www.documentcloud.org/documents/27289795-cdc-2025-0024-9452-attachment-1-1/",
      "text": "sown doubt about vaccine effectiveness"
    },
    {
      "url": "https://www.cnn.com/2025/03/06/health/kennedy-measles-texas-doctor-treatment#:~:text=Leslie%20Motheral%2C%20a%20pediatrician%20in,t%20need%20to%20treat%20them.%E2%80%9D",
      "text": "recommended unconventional and unproven treatments"
    },
    {
      "url": "https://pubmed.ncbi.nlm.nih.gov/15106085/#:~:text=the%20United%20States%20currently%20uses%20the%20absence%20of%20endemic%20measles%20%28i%2Ee%2E%2C%20no%20indigenous%20chains%20of%20transmission%20persisting%20for%20%3Eor%3D1%20year%29%20as%20the%20programmatic%20goal%20for%20measles%20elimination%2E",
      "text": "Its own adopted regulations"
    },
    {
      "url": "https://kffhealthnews.org/news/article/measles-outbreak-south-carolina-vaccine-misinformation-kennedy-rfk/",
      "text": "One county in South Carolina"
    },
    {
      "url": "https://dph.sc.gov/diseases-conditions/infectious-diseases/measles-rubeola/measles-dashboard",
      "text": "more than 900 cases"
    },
    {
      "url": "https://www.cdc.gov/measles/about/index.html",
      "text": "attacks the lungs and airways"
    },
    {
      "url": "https://www.cdc.gov/measles/signs-symptoms/index.html#:~:text=Death%2E%20Nearly%201%20to%203%20of%20every%201%2C000%20children%20who%20become%20infected%20with%20measles%20will%20die%20from%20respiratory%20and%20neurologic%20complications",
      "text": "1 to 3 deaths per 1,000 cases in children"
    },
    {
      "url": "https://www.cdc.gov/measles/hcp/clinical-overview/index.html",
      "text": "provides detailed summaries"
    },
    {
      "url": "https://www.cdc.gov/measles/hcp/clinical-overview/index.html#:~:text=A%20prodrome%20of%20fever%20(as,Followed%20by%20a%20maculopapular%20rash",
      "text": "that guidance said"
    },
    {
      "url": "https://kffhealthnews.org/news/article/texas-measles-outbreak-cdc-vaccines-rfk-trump/",
      "text": "KFF Health News investigation"
    },
    {
      "url": "https://www.cdc.gov/measles/vaccines/index.html#:~:text=One,mumps,-While",
      "text": ""
    },
    {
      "url": "https://www.cdc.gov/measles/vaccines/index.html#:~:text=One,mumps,-While",
      "text": ""
    },
    {
      "url": "https://www.facebook.com/100064493752159/videos/930782012638628",
      "text": "recent Facebook livestream"
    },
    {
      "url": "https://www.dph.ncdhhs.gov/programs/epidemiology/communicable-disease/infectious-respiratory-diseases/measles-rubeola/nc-measles-vaccination-data-dashboard",
      "text": "Only 41% of students there"
    },
    {
      "url": "https://www.cdc.gov/vaccines/hcp/imz-schedules/child-adolescent-notes.html",
      "text": "for children under 4"
    }
  ],
  "hash": "ca3184f1d7f2daf900b4785bbb12418659fd8cce74b8f969a011b085f086c0b4",
  "scraped_at": "2026-02-26T07:31:59.969962+00:00"
}