{
  "url": "https://lite.cnn.com/2026/02/19/politics/white-house-east-wing-vote-commission",
  "title": "Commission voting on White House East Wing concept has few members with arts experience, little time for public comment | CNN Politics",
  "date": "2026-02-20T07:29:26.400354+00:00",
  "authors": [
    "Sunlen Serfaty, CNN"
  ],
  "text": "Source: CNN\n\nThe Commission of Fine Arts, an independent federal agency that advises the president and Congress on design plans for monuments, memorials, coins and federal buildings, is usually made up of experts in architecture, art and urban and landscape design.\n\nBut when the commission meets on Thursday to evaluate President Donald Trump’s sweeping new East Wing renovation plans, the seven-member group may be more notable for its political loyalties.\n\nThe commission’s vote on Trump’s design – a key step before its final sign off – would likely take place only after two of the president’s allies are sworn in as members.\n\nIt will mark the first time the panel fully filled with Trump’s appointees is meeting. Since last year, the president has worked hard to install loyalists on the committee, gutting the board completely in October as East Wing demolition got underway.\n\nIn January, he appointed four new officials. “The commission is stacked with loyalists who will rubber stamp all of the president’s projects,” a source familiar with the workings of the commission predicted.\n\n“It’s sad that a majority of the commissioners lack expertise in art and architecture,” the person told CNN. “There is only one architect, yet he recused himself from reviewing the ballroom. This means that not a single architect will be reviewing the White House project. [And] unlike in the past, the commission also lacks an artist and a landscape architect.”\n\nAnd just this week, Trump announced he would appoint his executive assistant, Chamberlain Harris — a 26-year-old without any extensive arts experience — as a new member. Harris is set to be sworn in Thursday along with Pamela Hughes Patenaude, former deputy secretary of Housing and Urban Development during the first Trump administration.\n\nThe White House told CNN in a statement: “President Trump has an incredible eye and appreciation for the arts, and only selects the most talented people possible. These individuals possess a wealth of experience that reflects the values of everyday Americans and President Trump’s vision to Make America Great Again.”\n\nOther current members include Mary Anne Carter, chair of the National Endowment for the Arts who is a close friend of White House chief of staff Susie Wiles; art critic and conservative commentator Roger Kimball; architect James McCrery, who was previously hired to helm the ballroom construction; and Matthew Taylor, a White House official who is working on Trump’s proposed National Garden of American Heroes.\n\nLast month, James McCrery recused himself from reviewing the White House ballroom.\n\n“I am obligated to and also just a sense of propriety, McCrery told the committee in January, “I’m obligated to recuse myself from discussion in any action that takes place both in this meeting and in any of the feature meetings regarding this particular project.”\n\nAlthough commission chairman Rodney Cook previously said he wanted the commission to meet in person to allow Shalom Baranes, the architect, to present to the committee with a physical model of the ballroom, Thursday’s gathering is happening virtually on Zoom.\n\nAn in-person commission meeting would have allowed the public to make statements in support of or in opposition to the projects being discussed, but instead, according to the commission, comments can be submitted to be shared with the Commission members before the meeting and read or summarized at the discretion of the CFA chairman.\n\nThe lack of more opportunity for public comment is highly unusual, said the source familiar with the commission, who also noted other drawbacks of the virtual meeting, including lack of access for media and presentation material to be submitted.\n\n“No project as significant as the ballroom has ever been reviewed by the commission meeting virtually,” they said. “It’s outrageous.”\n\nLast week, the most detailed renderings yet of the ballroom project were briefly made available.\n\nThe renderings from Shalom Baranes Associates — which were posted by the National Capital Planning Commission on its website and then swiftly taken down — show the new East Wing could span approximately one street block, significantly longer than the West Wing. It also appears to be more than half the length of the Treasury Building.\n\nThe renderings are now posted on the CFA website.\n\nTrump’s project requires a review from the CFA and approval from the National Capital Planning Commission, where the president has also already installed a number of loyalists.\n\nThe National Capital Planning Commission is set to meet next on March 5 to discuss the proposal.\n\nThe CFA will also meet again on March 19. The president has indicated that he wants above ground construction on the East Wing to begin by April.\n\nCNN’s Kaanita Iyer, Betsy Klein and Devan Cole contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/white-house-east-wing-vote-commission",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/white-house-east-wing-vote-commission",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cac541f54eed5b377aa07471c7afb9b4acec965e286f5574ce60e3966eb878ce",
  "scraped_at": "2026-02-20T07:29:26.400367+00:00"
}