{
  "url": "https://lite.cnn.com/2026/02/13/sport/ioc-nazi-era-t-shirt-scli-intl-spt",
  "title": "IOC under fire over Nazi-era Olympic Games t-shirt | CNN",
  "date": "2026-02-15T07:11:55.378331+00:00",
  "authors": [],
  "text": "Source: CNN\n\nTheInternational Olympic Committee(IOC) has been criticized for selling merchandise commemorating the 1936 Berlin games, whichAdolf Hitlerused to showcase his Nazi ideology.\n\nThe website for the Olympics — currently in the spotlight due to the ongoing Milan Cortina Winter Olympics — features a men’s T-shirt marking the controversial Nazi games. The garment, which is showing as “out of stock,” is part of the IOC’s “Heritage Collection.”\n\nThe T-shirt features the original poster for the 1936 games, designed by Franz Würbel. It depicts an athletic male figure crowned with a laurel wreath and with the Olympic rings in the background. The Brandenburg Gate sits beneath him, with the caption: “Germany Berlin 1936 Olympic Games.”\n\nThelanding pagefor the Heritage Collection on the Olympics website states: “Each edition of the Games reflects a unique time and place in history when the world came together to celebrate humanity.”\n\nHitler used the games, held three and a half years after the Nazis came to power, as a spectacle of Nazi propaganda. He set out to showcase the racial superiority of so-called Aryan athletes and openly denigrated African-American participants as “non-humans.”\n\nNevertheless, African-American athlete Jesse Owens emerged as the star of the games, taking to the podium to collect four gold medals, surrounded by people giving the Nazi salute.\n\nChristine Schmidt is the co-director of the Wiener Holocaust Library in London, the world’s oldest archive of Holocaust materials.\n\nShe told CNN: “The Nazis used the 1936 Olympics to showcase their oppressive regime to the world, aiming to smooth over international relations while at the same time preventing almost all German-Jewish athletes from competing, rounding up the 800 Roma who lived in Berlin, and concealing signs of virulent antisemitic violence and propaganda from the world’s visitors.\n\n“The Nazis’ fascist and antisemitic propaganda infiltrated their promotion of the games, and many international Jewish athletes chose not to compete. The IOC would be minded to consider whether any aesthetic appreciation of these games can be comfortably separated from the horror that followed.”\n\nThe decision to sell the T-shirt was also criticised by Scott Saunders, CEO of International March of the Living, an annual educational program that will this year see around 8,000 people gathered at the former Auschwitz death camp to commemorate the Holocaust.\n\nHe told CNN: “As the world reflects on this latest controversy, it is impossible not to recall that we are approaching 90 years since the 1936 Berlin Olympics — an event the Nazi regime used to legitimize itself on the global stage while persecution of Jews was already well underway.\n\n“Sport has the power to unite, to inspire, and to elevate the very best of humanity. But history reminds us that it can also be manipulated to sanitize hatred and normalize exclusion. The lesson of Berlin is urgent. When antisemitism resurfaces in public life, whether in stadiums, streets, or online, silence is not neutrality. It is complicity.”\n\nThe IOC defended its decision to produce and sell the T-shirt. In a statement sent to CNN, an IOC spokesperson said the Olympic Heritage Collection “celebrates 130 years of Olympic art and design” and features all previous games.\n\nThe spokesperson added: “While we of course acknowledge the historical issues of ‘Nazi propaganda’ related to the Berlin 1936 Olympic Games, we must also remember that the Games in Berlin saw 4,483 athletes from 49 countries compete in 149 medal events. Many of them stunned the world with their athletic achievements, including Jesse Owens.\n\n“The historical context of these Games is further explained at the Olympic Museum in Lausanne. For the 1936 edition, the number of T-shirts produced and sold by the IOC is limited, which is why they are currently sold out.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/02/12/sport/ukrainian-skeleton-withdrawn-olympics-helmet",
      "text": "International Olympic Committee"
    },
    {
      "url": "https://cnn.com/2025/11/28/tv/video/amanpour-jonathan-freedland-traitors-circle",
      "text": "Adolf Hitler"
    },
    {
      "url": "https://shop.olympics.com/en/x-3078",
      "text": "landing page"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/sport/ioc-nazi-era-t-shirt-scli-intl-spt",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/sport/ioc-nazi-era-t-shirt-scli-intl-spt",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cb100a9d5d5a4abc0fdecf9aca4c60da029e17dd1992bad99091f0209b3e523a",
  "scraped_at": "2026-02-15T07:11:55.378344+00:00"
}