{
  "url": "https://lite.cnn.com/2026/02/23/us/kouri-richins-trial-murder-husband",
  "title": "Kouri Richins: Testimony begins in murder trial for Utah woman accused of killing husband Eric | CNN",
  "date": "2026-02-24T07:31:30.071933+00:00",
  "authors": [
    "Nicki Brown, CNN"
  ],
  "text": "Source: CNN\n\nKouri Richins’ in-laws gave emotional testimony Monday in her murder trial, describing her behavior in the aftermath of her husband’s sudden death – which prosecutors allege occurred because of afatal poisoningorchestrated by the Utah mother of three.\n\nRichins, 35, is accused of killing her husband Eric Richins with a lethal dose of fentanyl in March 2022. Prosecutors allege she killed him for financial gain and to start a new life with the man with whom she was having an affair.\n\n“I knew right then my brother was gone, and I fell to the floor,” Katie Richins-Benson said, struggling to speak through tears as she described arriving at her brother’s home in Kamas, outside Salt Lake City, the day of his death. She testified Kouri Richins “wasn’t crying like I was, she wasn’t hysterical. Just stood there and shook her head ‘no’ at me.”\n\nEugene Richins, the father of Eric Richins, testified he didn’t remember speaking to Kouri Richins the morning of his son’s death, after he went to the couple’s home.\n\n“I don’t recall her saying much of anything to me,” Eugene Richins said. “When I came in and my daughter Katie told me that Eric was gone, they helped me on the couch. And I don’t ever recall even talking to Kouri to be quite honest with you.”\n\nThe emotional testimony followed opening statements in Kouri Richins’ trial, where she is facing counts of aggravated murder, attempted aggravated murder, insurance fraud and forgery. She haspleaded not guiltyto all the charges. If convicted of the most serious charge, she could face up to life in prison.\n\n“The evidence will prove that Kouri Richins murdered Eric for his money and to get a fresh start at life,” Brad Bloodworth, chief prosecutor in the Summit County Attorney’s Office, said in his opening statement Monday. “More than anything, she wanted his money to perpetuate her facade of privileged affluence and success.”\n\nIn her own opening statement, Richins’ defense attorney Kathy Nester acknowledged her client is a “flawed person,” but said jurors would see by the end of the case that she is innocent.\n\nThe jury watched about half an hour of police body camera footage recorded after Eric Richins, 39, was found dead in the early morning hours of March 4, 2022. The footage showed Kouri Richins crying while speaking with first responders as more family members, including Richins-Benson, arrived at the couple’s home.\n\nAn autopsy would later reveal Eric Richins died from a fentanyl overdose, with about five times the lethal dose in his blood, according to charging documents.\n\n“That extraordinary amount of fentanyl was intentional, not accidental,” Bloodworth said.\n\nAround 9 p.m., Kouri Richins and her husband had a drink together before she went to sleep in the bedroom of one of their sons, she told an officer, according to the bodycam footage. When she returned to the master bedroom around 3 a.m., Richins said, she found her husband lying in their bed, not breathing.\n\n“I just came into bed, in our bed, and I turned over and he’s just cold, he’s just cold,” Richins said when she called emergency services early that morning, according to a recording of the call played during the defense’s opening statement. She told the 911 operator she didn’t know what happened.\n\nNester said throughout the case, Richins has repeatedly “told her truth.”\n\n“It’s exactly what she told that 911 operator that you just heard, and you’re going to hear over and over again: ‘I don’t know what happened,’” Nester told the jury. “You’re going to hear that Eric Richins’ family simply could not accept that.”\n\nEric Richins took marijuana gummies to help his back pain, some of which he got from dispensaries and others from unknown sources, Nester said. Kouri Richins told investigators after her husband’s death that she believedthey could have contained fentanyl, according to court documents.\n\nAn empty bottle for pain pills was found in Eric Richins’ nightstand after his death, Nester said. The bottle’s label said the pills were prescribed to Eric Richins and had expired in 2016, she said.\n\nDuring cross-examination, Richins-Benson testified her brother was prescribed hydrocodone for a medical procedure he underwent years ago. Eric Richins didn’t like to take the pills but would take them when his back pain was “extreme,” she said.\n\nEric Richins’ family “needed someone or something to blame for losing someone they loved that wasn’t Eric himself, and that’s totally understandable,” the defense attorney said.\n\nEric Richins’ sister said she was “dumbfounded” when, the morning of Eric’s death, Kouri Richins spoke with someone about an upcoming closing for her real estate business while consoling one of her sons.\n\n“’You can’t tell me you’re going to close on that Midway mansion when my brother just died,’” Richins-Benson recalled telling her sister-in-law. “And she looked at me matter of fact and said, ‘Yeah, absolutely. He has nothing to do with it. The money’s already gone through. It’s all my business. I’m going to.’”\n\nThe same day, Kouri Richins also said she had decided to sell their family home, Richins-Benson testified.\n\n“I had just lost one of the most important people in my entire life, and she was planning on selling the house that he had just been wheeled out of, (and) closing on a multi-million-dollar mansion,” she said. “I could not wrap my head around it.”\n\nEugene Richins testified that, later in 2022, Kouri Richins told him the medical examiner determined Eric Richins died from a combination of Covid-19 and a lung fungus, which had also killed Eugene Richins’ wife. However, when the family contacted the medical examiners’ office, they were told the results had not yet been released and they had never received a call from Kouri Richins, Eugene Richins said.\n\nProsecutors allege Kouri Richins killed her husband to profit off his lucrative business and life insurance policies – funds she could then use to support her struggling real estate business.\n\nOn the day of Eric Richins’ death, his estate was worth roughly $4 million, and his wife owed more than $4.5 million to over 20 different lenders, Bloodworth said. Eric Richins’ life was insured for more than $2 million through several life insurance policies, one of which prosecutors allege his wife fraudulently applied for weeks before he died.\n\nKouri Richins was also “chronically unhappy” in her marriage and wanted to start a new life with another man she was seeing, Bloodworth said.\n\nNester acknowledged the couplehad an “imperfect marriage” and had previously contemplated divorce, but said the couple decided to stay together after going through marriage counseling. One of Eric Richins’ friends said the couple was the happiest he’d ever seen them in the weeks before his death, the defense attorney said.\n\nHowever, prosecutors allege that Kouri Richins attempted to poison her husband on Valentine’s Day in 2022, weeks before his death.\n\nA woman who cleaned Kouri Richins’ houses told investigators that Richins asked for fentanyl in early 2022, charging documents said. The woman said she bought more than 15 pills she believed contained fentanyl on February 11, 2022, and then gave them to Richins.\n\nOn Valentine’s Day, a few days later, Richins left her husband a sandwich and a note before leaving to meet up with her “paramour,” prosecutors said in charging documents.\n\nLater that day, Eric Richins told two friends he felt like he was going to die after eating the sandwich, according to the charging documents. “I think my wife is trying to poison me,” he said to one. He told the other friend he broke out in hives, then injected himself with an EpiPen and drank a bottle of Benadryl.\n\nIn her opening statement, Nester said Eric Richins had an allergic reaction to the sandwich, which “wasn’t even a blip to Eric.”\n\nIn late February 2022, Richins allegedly asked the woman for more fentanyl, saying the previous drugs were not strong enough. Prosecutors said the woman bought more drugs on February 26, 2022, and her phone records show contact with Richins around the time she met with the drug dealer.\n\nWithin a week, Eric Richins was dead.\n\nAfter first responders left Kouri Richins’ home the morning of her husband’s death, Bloodworth said three GIFs – a type of animated image – were accessed on Richins’ phone: One was captioned “Idiots. Idiots everywhere.” Another showed a woman wiping away her tears with dollar bills, and a third included the caption, “I’m really rich.”\n\nKouri Richins deleted cell phone messages and data from the months surrounding her husband’s death, Bloodworth said, showing she had a “guilty conscience.”\n\nAfter Kouri Richins was informed of her husband’s cause of death, her phone’s internet history allegedly includedvisits to websitesabout women’s prisons in Utah, life insurance payments, and how police recover deleted cell phone data.\n\nA defense attorney who no longer represents Richins previously said the searches were merely a response to the investigation at the time and not indicative of guilt.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/us/kouri-richins-utah-trial",
      "text": "fatal poisoning"
    },
    {
      "url": "https://www.cnn.com/2024/08/27/us/kouri-richins-hearing-verdict-husband",
      "text": "pleaded not guilty"
    },
    {
      "url": "https://www.cnn.com/2023/06/12/us/utah-mom-husband-killing-court-documents",
      "text": "visits to websites"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/kouri-richins-trial-murder-husband",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/us/kouri-richins-trial-murder-husband",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cb1fbb5f640d72c93bb7ea0680b6ecb8a71d9ceb4d515c9e12c4b329c7d7e3c9",
  "scraped_at": "2026-02-24T07:31:30.071946+00:00"
}