{
  "url": "https://lite.cnn.com/2026/02/11/sport/word-of-week-stoat-winter-olympics-cec",
  "title": "Word of the Week: The adorable, lethal ‘stoat’ is the face of the Winter Olympics | CNN",
  "date": "2026-02-12T21:31:22.014981+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nTina and Milo — thesibling mascotsrepresenting the 2026 Olympic and Paralympic Winter Games, respectively — have beenbouncing aroundMilan and Cortina, chopping it up withSnoop Doggandcheering onathletes from the stands.Grinning, plushie versions are now coveted pieces ofOlympics merch,and the organizers have assigned the slender, sharp-eyed creatures distinct personalities and interests: Tina, with her cream-colored fur, has developed an affinity forcurling; the brown-coated Milo, whose official biography says he was born missing one paw, is prone to playing practical jokes.\n\nIn Italian, Tina and Milo are called “ermellini.” For English-speaking Olympic fans, though, the word being used is “stoats.”\n\n“Stoat” — a word first recorded in the 1400s and which stems from the Middle English “stote” — is one of the English names for a small predatory mammal, Mustela erminea, with a short, black-tipped tail, found not only in the Italian Alps but across a broad stretch of Europe, Asia and North America. Stoats are six to 12 inches long, with brown coats that, in some subspecies, turn white in the winter except for the black tail tip.\n\nSmall though they are, stoats belong to the famously fierce mustelid family, a carnivorous classification that also includes otters, ferrets and wolverines. They are highly intelligent, voracious predators who can take down prey six times their size, says Andrew Veale, a wildlife geneticist and ecologist who has mapped the stoat genome. Stoats are also excellent swimmers —the animals were introduced to New Zealand in a failed attempt to control rabbits (which in turn were introduced for food and sport) but instead have destroyed much of the country’s native bird species, in large part because of their ability to reach offshore islands in search of more prey, Veale says.\n\nAs for their Olympic credentials, Veale calls them “the greatest athletes of the animal world.”\n\n“Snowboarders would wish they could perform the aerial acrobatics that stoats do. They can wind back on themselves as contortionists,” he wrote in an email. “They are intense. Their heart rate sounds like a living sewing machine on meth.”\n\nThat personality and deadly skill set has not endeared stoats to humans, who have traditionally viewed them as vicious or even uncanny. The Oxford English Dictionary offers a secondary, figurative definition of “stoat” meaning “a treacherous fellow; a sexually aggressive man, a lecher.” In Celtic mythology, stoats were seen as prone to mischief and thieving. There are even tales of them poisoning people and holding funerals for their dead. “It was not good luck to encounter a stoat when setting out on a journey, even a short one, but one could turn the luck to good by greeting the stoat as a neighbor,” an entry inThe Encyclopedia of Celtic Mythology and Folklorereads.\n\nBut humans have been lethal to stoats in return, especially when their pelts turn white. That fur, called “ermine,” was longcovetedby European monarchs and aristocrats (“ermine furs adorn the imperious,” as The Velvet Underground sing in “Venus in Furs”). In the stock image of a royal robe lined with white fur speckled in black, each speckle represents the tail of one dead stoat. The ceremonial robes for the UK’s House of Lords feature ermine trim, and King Charles III donned a traditional red and ermine robe at his coronation.\n\n“Ermine” may also refer to the animal itself, which has multiple available names in English. Until about five years ago, there wasn’t much difference between calling one a “stoat,” an “ermine” or a “weasel.” “Stoat” typically refers to the animal in its brown summer coat, while “ermine” is used when it’s in its white winter coat. People in North America generally called stoats short-tailed weasels, but a2021 studyfound that the American stoat and the European stoat were distinct enough to be considered separate species.\n\nFurther complicating the mustelids’ lexical family tree, the Haida ermine, found on islands off the Pacific Northwest coast, was also once considered a subspecies of the common stoat, but is now recognized as its own species. Still, people continue to use “stoat,” “ermine” and “weasel” interchangeably — the speaker’s nationality or accent can offer clues about what species they’re referring to.\n\nWhatever they’re called, Tina and Milo seem to have shed their ill-omened reputation and are bringing cheer to this year’s Olympians.Japanese figure skaterKaori Sakamotosquealed with delight when presented with a Tina plushie, while freestyle skierEileen Guhoisted the mascot into the air after earning a silver medal.\n\nAs Veale sees it, stoats are “clearly the best mascots” for the 2026 Winter Olympics. But he has some notes for Tina and Milo.\n\n“It’s unfortunate that the actual mascots, Tina and Milo, don’t quite show the majesty and athleticism of the animals themselves,” he said. “But I guess reproducing that in a costume would be a tricky ask.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://olympic.ca/2024/02/08/meet-tina-and-milo-the-mascots-for-milano-cortina-2026/",
      "text": "sibling mascots"
    },
    {
      "url": "https://x.com/juegosolimpicos/status/2021027838514823615?s=20",
      "text": "bouncing around"
    },
    {
      "url": "https://x.com/SnoopDogg/status/2020968898208977381?s=20",
      "text": "Snoop Dogg"
    },
    {
      "url": "https://x.com/juegosolimpicos/status/2019430815369777585?s=20",
      "text": "cheering on"
    },
    {
      "url": "https://x.com/CBSNews/status/2019776120808165483?s=20",
      "text": "Olympics merch"
    },
    {
      "url": "https://x.com/juegosolimpicos/status/2020154563450269828?s=20",
      "text": "curling"
    },
    {
      "url": "https://archive.org/details/encyclopediaofce0000mona/page/426/mode/1up?q=stoat",
      "text": "The Encyclopedia of Celtic Mythology and Folklore"
    },
    {
      "url": "https://www.nationalgeographic.com/history/article/ermine-weasel-stoat-royal-renaissance-robes",
      "text": "coveted"
    },
    {
      "url": "https://onlinelibrary.wiley.com/doi/10.1111/ddi.13234",
      "text": "2021 study"
    },
    {
      "url": "https://x.com/RT_com/status/2020500013038915881?s=20",
      "text": "Kaori Sakamoto"
    },
    {
      "url": "https://x.com/ChinaDaily/status/2021064578227228783?s=20",
      "text": "Eileen Gu"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/sport/word-of-week-stoat-winter-olympics-cec",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/sport/word-of-week-stoat-winter-olympics-cec",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cb22276d898feaab4e2a60df97b9c4ba402972362255851b50abe56627fc1d65",
  "scraped_at": "2026-02-12T21:31:22.014995+00:00"
}