{
  "url": "https://lite.cnn.com/2026/02/19/investing/jamie-dimon-jpmorgan-trump-lawsuit",
  "title": "JPMorgan Chase pushes back on Trump’s $5 billion lawsuit, arguing it ‘fraudulently’ includes Jamie Dimon | CNN Business",
  "date": "2026-02-20T07:28:42.002186+00:00",
  "authors": [
    "John Towfighi, CNN"
  ],
  "text": "Source: CNN\n\nJPMorgan Chase on Thursday hit back at President Donald Trump’s debanking lawsuit against the company and CEO Jamie Dimon, filing to move the case from Florida state court to federal court and arguing the president’s initial lawsuit “fraudulently” included Dimon.\n\nJPMorgan Chase lawyers wrote in a notice, first reported by Bloomberg, thatTrump’s lawsuitis based on a statute that explicitly exempts federally regulated bank executives who are acting in their official role.\n\nTrump’s lawsuit was filed with respect to Florida’s Deceptive and Unfair Trade Practices Act, which does not apply to federally regulated bank officers, the lawyers argued. That means Dimon was improperly, or “fraudulently” included in the suit, they argued.\n\nTrump last month sued JPMorgan Chase and Dimon, alleging the bank improperly removed him as a client in 2021 due to political reasons. The suit, initially filed in Florida state court, seeks $5 billion in damages.\n\nJPMorgan is a citizen of Ohio for legal reasons, according to the filing. Since none of the plaintiffs are Ohio citizens, the suit would be eligible to be heard in federal court. By including Dimon, Trump’s lawyers tried to keep the suit in state court, JPMorgan Chase argued. Since Dimon was “fraudulently” included as Florida’s DUTPA exempts federally regulated bank executives acting in their official role, the suit should move to federal court, the bank’s lawyers argued.\n\nJPMorgan Chase declined to comment. CNN has reached out to the White House for comment.\n\nJPMorgan’s lawyers also pushed back on Trump’s allegations that the bank dropped him as a customer over political reasons.\n\n“Finally, Plaintiffs threadbare allegations do not allege sufficient facts to plead a claim,” the lawyers wrote.\n\n“Plaintiffs further fail to plead the basic facts necessary to establish their blacklist claim,” the lawyers wrote. “It is unclear what Plaintiffs mean by this term. They do not explain what this blacklist entails, when it was created, to whom it was supposedly circulated, or any other detail describing it. Nor is it plausible that JPMorgan could create such a list consistent with the complex federal regulatory scheme to which it is subject.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/business/jpmorgan-chase-trump-lawsuit-debanking",
      "text": "Trump’s lawsuit"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/business/jpmorgan-chase-trump-lawsuit-debanking",
      "text": "Trump last month sued JPMorgan Chase and Dimon"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/investing/jamie-dimon-jpmorgan-trump-lawsuit",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/investing/jamie-dimon-jpmorgan-trump-lawsuit",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cb732328f149176b8621b154c5f49b403fb849c4c37b361a5163ea0a00b33d11",
  "scraped_at": "2026-02-20T07:28:42.002200+00:00"
}