{
  "url": "https://lite.cnn.com/2026/02/17/uk/sarah-ferguson-companies-epstein-fallout-intl",
  "title": "Sarah Ferguson: Six companies directed by former British duchess to shut down amid Epstein storm | CNN",
  "date": "2026-02-18T07:32:18.583327+00:00",
  "authors": [
    "Billy Stockwell, CNN"
  ],
  "text": "Source: CNN\n\nSix companies linked to Sarah Ferguson, the ex-wife of Andrew Mountbatten-Windsor, are to be shut down after thelatest release of filesrelated to Jeffrey Epstein revealed the depth of her friendship with the late sex offender, documents show.\n\nFerguson is listed as the sole director of the companies, all of which applied in recent days to be struck off the UK’s official Companies House register, where virtually all businesses must file information such as directors’ details and annual returns.\n\nIt is not clear exactly what services the companies provided. One firm was involved in public relations and communications services, according to Companies House. Another was a retail business.\n\nThe move comes after the US Department of Justice released a fresh tranche of the so-called“Epstein files”on January 30, sparking renewed scrutiny of Mountbatten-Windsor and Ferguson due to their ties to the disgraced financier after he was convicted for soliciting sex from a minor.\n\nA spokesperson for Ferguson, who is also known as “Fergie,” said last year that the former duchess had severed her ties with Epstein “as soon as she was aware of the extent of the allegations.”\n\nBut the latest DOJ files suggest that was not the case.\n\nThe documents appear to show that not only did Ferguson maintain contact, but she visited him in Miami five days after he was released from prison in 2009 having served 13 months of an 18-month sentence for soliciting prostitution from a minor.\n\nOther exchanges demonstrate her strong affection toward Epstein at the time.\n\nIn January 2010, Ferguson wrote: “You are a legend. I really don’t have the words to describe, my love, gratitude for your generosity and kindness. Xx I am at your service. Just marry me.”\n\nIn August 2009, the former duchess thanked him for being “the brother I have always wished for.”\n\nMountbatten-Windsor and Ferguson’s daughters Princesses Beatrice and Eugenie have also faced scrutiny in recent weeks after their names featured in the latest tranche of files.\n\nCNN has reached out to Ferguson’s representatives for comment on the exchanges seen in the Epstein documents and the company closures. Being named in the Epstein documents does not indicate any wrongdoing.Mountbatten-Windsorhas previously denied any wrongdoing over his ties to the late sex offender.\n\nDays after the January release, Ferguson’s charitable foundation “Sarah’s Trust” announced it would close “for the foreseeable future” after “some months” of discussion, according to the UK’s PA Media news agency.\n\nOn February 13, a company called “S. Phoenix Events Limited,” where Ferguson is listed as a director, filed an application on Companies House to “strike the company off the register” – in other words, close it down.\n\nThe other five companies filed similar applications on February 16.\n\nThe companies that are set to close are Philanthrepreneur Limited, Fergie’s Farm Limited, La Luna Investments Limited, Solamoon Limited, Planet Partners Productions Limited and S. Phoenix Events Limited.\n\nAccording to the UK government, businesses can be removed from Companies House only if they have not traded in the last three months, among other conditions.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/uk/beatrice-eugenie-parents-epstein-scandal-fallout-intl",
      "text": "latest release of files"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "“Epstein files”"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/uk/andrew-mountbatten-windsor-epstein-files-pictures-intl-gbr",
      "text": "Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/uk/sarah-ferguson-companies-epstein-fallout-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/uk/sarah-ferguson-companies-epstein-fallout-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cbbce4d49a7c35525abc7b5c8fd4999dd6baa26927fb3cae607682720a54f33c",
  "scraped_at": "2026-02-18T07:32:18.583340+00:00"
}
