{
  "url": "https://lite.cnn.com/2026/02/16/uk/beatrice-eugenie-parents-epstein-scandal-fallout-intl",
  "title": "Princesses Beatrice and Eugenie grapple with fallout from parents’ Epstein scandals | CNN",
  "date": "2026-02-17T07:31:08.337029+00:00",
  "authors": [
    "Lauren Said-Moorhouse, CNN"
  ],
  "text": "Source: CNN\n\nPrincesses Beatrice and Eugenie have been swept into the maelstrom that has engulfed their parents,Andrew Mountbatten-Windsorand Sarah Ferguson, forcing them to grapple with renewed scrutiny swirling around the British monarchy.\n\nThe sisters, now 37 and 35 respectively, are named hundreds of times in the latest tranche of the so-called“Epstein files”recently published by the US Department of Justice. At least one of the references is highly embarrassing, referring to a young Eugenie’s private life.\n\nBeatrice and Eugenie are among the few members of the Windsor clan to hold “HRH” titles, meaning “His” or “Her Royal Highness,” but they do not represent the monarch as working members of “The Firm.”\n\nMuch of the criticism of the York family, as they were known in Britain, has centered onMountbatten-Windsor’s relationship with Jeffrey Epstein.However, the latest disclosures from the DOJ files also reveal the apparent depth of the late sex offender’s friendship with the princesses’ mother, who appears to have brought her daughters into his world.\n\n“It’s incredibly distressing for both young women to see themselves mentioned so freely by their parents to a convicted sex offender,” said Russell Myers, the royal editor of Britain’s The Mirror newspaper, who has covered the Windsor family for the past decade and co-hosts the award-winning royal podcast “Pod Save The King.”\n\nHe told CNN that while there was “a great deal of sympathy for them,” the emails sparked questions over what, if anything, the women knew.\n\n“The questions remain, both inside the palace and publicly, as to whether Beatrice and Eugenie could have raised concerns both to their parents, or more widely, considering how close they were brought into Epstein’s world, even after he was convicted of serious sex offenses.”\n\nThe princesses’ father is facing mounting pressure to answer more questions about his involvement with Epstein, with British police now investigating claims of misconduct in public office and breach of official secrets after unearthed emails appear to suggest the former princeshared confidential materialwith the sex offender during his tenure as UK trade envoy.\n\nMountbatten-Windsor, whom CNN has approached for comment, has not publicly reacted to the latest allegations but has previously denied any wrongdoing over his ties to Epstein, including after he reached anout-of-court settlementwith a woman who said she was trafficked to him as a teen.\n\nFerguson’s spokesperson said last year that the former duchess had severed her ties with Epstein “as soon as she was aware of the extent of the allegations.” But the DOJ files suggest that was not the case.\n\nThe documents appear to show that not only did Ferguson maintain contact, but she visited him in Miami five days after he was released from prison in 2009 having served 13 months of an 18-month sentence for soliciting prostitution from a minor. Beatrice and Eugenie, who were then 20 and 19, joined their mother at a meal with him on July 27, 2009.\n\nIn one email exchange, Epstein initially drops a quick note to a partially redacted address which appears as “ferg,” asking “where are you?” Roughly an hour and a half later, “Sarah” says she is “In Miami” and “aiming to get to you for 12.30 for lunch.”\n\nThe financier then offers her a car, which “Sarah” declines but asks for the address and clarifies: “It will be myself, Beatrice and Eugenie.”\n\nEpstein sends another email the following day, this time to former British socialite and co-conspiratorGhislaine Maxwell,confirming the visit took place. A separate email thread between Epstein and his personal assistant days earlier also appears to indicate that he paid for the trio’s flights to the US at a cost of $14,080.10.\n\nA month later, another email showcases Ferguson’s affection for Epstein when she reaches out to him with an excited update on potential business opportunities for her brand and books which have come her way. “In just one week, after your lunch, it seems the energy has lifted,” she writes. “I have never been more touched by a friends (sic) kindness than your compliment to me infront (sic) of my girls. Thank you Jeffrey for being the brother I have always wished for.”\n\nThat fondness continues in a January 2010 email from “Sarah,” who writes: “You are a legend. I really don’t have the words to describe, my love, gratitude for your generosity and kindness. Xx I am at your service. Just marry me.”\n\nIn a shocking exchange two months later, “Sarah” appears to discuss her younger daughter’s intimate life, telling Epstein: “Not sure yet. Just waiting for Eugenie to come back from a shagging weekend!!”\n\nA few months later, Epstein emails Ferguson saying a redacted name will be in London at the weekend and enquires if there is “any chance of your daughters saying h=llo (sic).” She replies saying that “Beatrice is in London with her father. Eugie is away with a cool boyfrie=d (sic).”\n\nIn another email chain from 2011 between Epstein, Ferguson and her then-spokesperson, the former duchess says that Beatrice advised her on how to handle a journalist to whom she had a given a statement about the sex offender.\n\nMeanwhile, that December and the year after, Epstein was forwarded the family’s Christmas card via email from Mountbatten-Windsor, both of which included photographs of the princesses. In a 2019 interview with the BBC, the former prince claimed that he had not been in touch with Epstein after 2010.\n\nCNN has reached out to Ferguson’s representatives for comment on the exchanges seen in the Epstein documents. CNN has also sought to contact the princesses for comment but had not heard back by time of publication.\n\nAfter being asked to leave the Royal Lodge in Windsor, Mountbatten-Windsor has nowmoved to Norfolk,where he is staying temporarily at a property on King Charles’ privately owned Sandringham estate. Ferguson has also left the home they shared until recently but is making her own arrangements.\n\nBeatrice and Eugenie have kept a low profile since the latest Epstein document dump, although the latter was photographed at a contemporary art fair in Doha last week.\n\nThere has been a lot of sympathy for the sisters as Britons have watched each salacious detail emerge. Certainly, there is no suggestion of wrongdoing simply because they have been named repeatedly in the Epstein files.\n\nMyers says their family has always been close, but the recent revelations have left the siblings “deeply distressed.”\n\nThe daughters “have a degree of loyalty,” the royal journalist told CNN, but “it is without question that their relationships with their parents have been left severely strained by their conduct.”\n\nThe two princesses have carved out successful lives beyond palace walls. Both are married – Beatrice to British property developer Edoardo Mapelli Mozzi and Eugenie to businessman Jack Brooksbank – and have started their own families.\n\nBeatrice founded BY-EQ, a strategic consultancy for business leaders, and has previously served as vice president of partnerships and strategy for software company Afiniti; Eugenie works as a director of art dealer Hauser & Wirth. Additionally, both are patrons for numerous charities and other philanthropic organizations.\n\nCNN reached out to a dozen associations the sisters have been involved with amid the controversy surrounding their parents – including the Anti-Slavery Collective, which  Eugenie co-founded, and the Salvation Army, another organization she has lent her support to – but many had not responded by time of publication.\n\nBorne, a UK-based medical research charity focused on preventing premature birth and improving outcomes for mothers and babies, told CNN that Beatrice “became a patron of Borne following her personal experience with prematurity” and that “her role is focused exclusively on raising awareness.”\n\nThe Outward Bound Trust’s chief executive, Martin Davidson, said Beatrice was involved with the organization “in her honorary role as Deputy Patron,” which “focused on supporting our work to inspire young people to realise their potential through learning and adventure in the outdoors.”\n\nIn a statement to the BBC, a Salvation Army spokesperson did not mention Eugenie specifically but emphasized that the organization puts “victims and survivors at the heart of all our decision making and we are closely monitoring this story.”\n\nKing Charles’ decision in October to strip Mountbatten-Windsor of his titles and honors has done little to dampen the shock surrounding the scandal, and the latest disclosures have at timesovershadowed the work of the monarchy.\n\nBeatrice and Eugenie appear to have quietly tried to disentangle themselves from their parents’ mess. They have not made any public statements, have kept a distance from their parents in public and, instead, spent Christmas with the King and rest of the Windsor clan in Sandringham.\n\nMyers, who has also authored the upcoming book “William & Catherine: The Intimate Inside Story,” points out that while the princesses are not officially working family members, King Charles and Prince William have called on them in the past to help at events.\n\nHe added that that William “gets on very well” with both of his cousins and “is deeply sympathetic of their situation and doesn’t believe that their reputation should be tarnished” by their parents’ actions.\n\nAnd in yet another stunning development last week, Buckingham Palace said King Charles stands “ready to support” British police in their investigations into Mountbatten-Windsor’s alleged sharing of sensitive material while he was serving as UK trade envoy in 2010.\n\nMyers described the move as a “seminal moment.”\n\n“Not only has Andrew Mountbatten-Windsor been completely exiled from the royal family, both the King and Prince William understand the public’s revulsion with such continued and distressing allegations.”\n\nHe continued, “It further demonstrates how Andrew will no longer be protected by the institution, and the overriding feeling is that he should do the right thing and speak to (US) investigators probing Jeffrey Epstein’s crimes if he has any information.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/uk/andrew-mountbatten-windsor-epstein-files-pictures-intl-gbr",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "“Epstein files”"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/uk/andrew-mountbatten-windsor-epstein-files-pictures-intl-gbr",
      "text": "Mountbatten-Windsor’s relationship with Jeffrey Epstein."
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
      "text": "shared confidential material"
    },
    {
      "url": "https://www.cnn.com/2022/03/08/us/prince-andrew-virginia-giuffre-settlement",
      "text": "out-of-court settlement"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/video/ghislaine-maxwell-trump-clemency-pardon-digvid",
      "text": "Ghislaine Maxwell,"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/europe/andrew-mountbatten-windsor-moves-royals-epstein-intl-hnk",
      "text": "moved to Norfolk,"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/world/video/video-king-charles-heckled-former-prince-andrew-epstein-hnk-digvid",
      "text": "overshadowed the work of the monarchy"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/uk/beatrice-eugenie-parents-epstein-scandal-fallout-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/uk/beatrice-eugenie-parents-epstein-scandal-fallout-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cbf43a3b53e2f36070a122a7fb22db7d434f83405c4fba58456ce875abce7211",
  "scraped_at": "2026-02-17T07:31:08.337041+00:00"
}