{
  "url": "https://lite.cnn.com/2026/02/18/world/surprise-antarctica-first-time-intl-scli",
  "title": "Shark caught on camera for first time in Antarctica’s deep waters | CNN",
  "date": "2026-02-19T07:31:57.722981+00:00",
  "authors": [
    "Story by the Associated Press"
  ],
  "text": "Source: AP\n\nAn ungainly barrel of a shark cruising languidly over a barren seabed far too deep for the sun’s rays to illuminate was an unexpected sight.\n\nMany experts had thought sharks didn’t exist in the frigid waters of Antarctica before this sleeper shark lumbered warily and briefly into the spotlight of a video camera, researcher Alan Jamieson said this week. The shark, filmed in January 2025, was a substantial specimen with an estimated length of between three and four meters (10 and 13 feet).\n\n“We went down there not expecting to see sharks because there’s a general rule of thumb that you don’t get sharks in Antarctica,” Jamieson said.\n\n“And it’s not even a little one either. It’s a hunk of a shark. These things are tanks,” he added.\n\nThe camera operated by the Minderoo-UWA Deep-Sea Research Centre, which investigates life in the deepest parts of the world’s oceans, was positioned off the South Shetland Islands near the Antarctic Peninsula. That is well inside the boundaries of the Antarctic Ocean, also known as the Southern Ocean, which is defined as below the 60-degree south latitude line.\n\nThe center on Wednesday gave The Associated Press permission to publish the images.\n\nThe shark was 490 meters (1,608 feet) deep where the water temperature was a near-freezing 1.27 degrees Celsius (34.29 degrees Fahrenheit).\n\nA skate appears in frame motionless on the seabed and seemingly unperturbed by the passing shark. The skate, a shark relative that looks like a stingray, was no surprise since scientists already knew their range extended that far south.\n\nJamieson, who is the founding director of the University of Western Australia-based research center, said he could find no record of another shark found in the Antarctic Ocean.\n\nPeter Kyne, a Charles Darwin University conservation biologist independent of the research center, agreed that a shark had never before been recorded so far south.\n\nClimate change and warming oceans could potentially be driving sharks to the Southern Hemisphere’s colder waters, but there was limited data on range changes near Antarctica because of the region’s remoteness, Kyne said.\n\nThe slow-moving sleeper sharks could have long been in Antarctica without anyone noticing, he said.\n\n“This is great. The shark was in the right place, the camera was in the right place and they got this great footage,” Kyne said. “It’s quite significant.”\n\nThe sleeper shark population in the Antarctic Ocean was likely sparse and difficult for humans to detect, Jamieson said.\n\nThe photographed shark was maintaining a depth of around 500 meters (1,640 feet) along a seabed that sloped into much deeper water. The shark maintained that depth because that was the warmest layer of several water layers stacked upon each other to the surface, Jamieson said.\n\nThe Antarctic Ocean is heavily layered, or stratified, to a depth of around 1,000 meters (3,280 feet) because of conflicting properties including colder, denser water from below not readily mixing with fresh water running off melting ice from above.\n\nJamieson expects other Antarctic sharks live at the same depth, feeding on the carcasses of whales, giant squids and other marine creatures that die and sink to the bottom.\n\nThere are few research cameras positioned at that specific depth in Antarctic waters. Those that are can only operate during the Southern Hemisphere summer months, from December through February.\n\n“The other 75% of the year, no one’s looking at all. And so this is why, I think, we occasionally come across these surprises,” Jamieson said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/world/surprise-antarctica-first-time-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/world/surprise-antarctica-first-time-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cc44848680e60362ccbfc2ec52d84788a7807aab30761ceb30cad2371de78fe0",
  "scraped_at": "2026-02-19T07:31:57.722994+00:00"
}