{
  "url": "https://lite.cnn.com/2026/02/21/politics/chief-justice-john-roberts-tariffs-analysis",
  "title": "John Roberts ends Trump’s big Supreme Court winning streak | CNN Politics",
  "date": "2026-02-22T07:09:53.150599+00:00",
  "authors": [
    "Joan Biskupic, CNN Chief Supreme Court Analyst"
  ],
  "text": "Source: CNN\n\nChief Justice John Roberts brought the drama Friday as he ascended the courtroom bench to declare — at long last —President Donald Trump’s tariffs unlawful.\n\nFor 10 gripping minutes, he methodically laid out the case against Trump’s signature economic initiative, one that has yielded billions of dollars for the national treasury yet roiled world markets and hit US consumers hard.\n\nThe announcement in the white marble setting was classic Roberts.\n\nThe chief justice, now in his 21st year in the center chair, latched onto his choice standard-bearers of the law. He emphasized the limits of the question at hand, saying nothing about refunds. And he was a study in composure — a contrast to the scene at the White House later in the day as Trump denounced the justices in vitriolic, highly personal terms.\n\nRoberts’ voice was steady, his words measured, as if to minimize this outsize clash between the judiciary and executive. (He emphasized that the justices had similarlyrejected major initiativesof then-President Joe Biden.)\n\n“We claim no special competence in matters of economics or foreign affairs,” Roberts elaborated in his 21-pagewritten opinion. “We claim only, as we must, the limited role assigned to us by Article III of the Constitution. Fulfilling that role, we hold that (the International Emergency Economic Powers Act) does not authorize the President to impose tariffs.”\n\nFor those at the scene, Roberts invoked, by name, the revered Chief Justice John Marshall, who wrote the milestones on judicial authority and constitutional separation of powers. Two centuries ago, in 1824, Marshall had deemed the authority to impose tariffs “a branch of the taxing power,” which is firmly the domain of Congress.\n\nIn Roberts’ written opinion, he cited the case (Gibbons v. Ogden), not Marshall by name. But for this historic courtroom moment, with the other eight justices on the elevated bench, Roberts sought to claim the mantle of the great chief justice.\n\nTrump, as he stood before cameras at the White House,cast the Roberts Court majority as his nemesis. He called the justices who ruled against him a “disgrace to our nation.” He reserved particular wrath for two of his appointees, Justices Neil Gorsuch and Amy Coney Barrett, calling them an “embarrassment to their families.”\n\nRoberts, from his vantage point, has not responded in kind. The chief justice said nothing later in the day about Trump’s comments and in fact has avoided provoking the president. Only on rare occasion has he rebuked Trump, despite the president’s constant tirades against the judiciary.\n\nLast year, after Trump referred to a federal judge overseeing a migrant deportation case as “crooked” and declared the judge should be impeached,Roberts issued a brief statement. Its terms were as dispassionate as Trump’s were heated. Impeachment, the chief justice said, “is not an appropriate response to disagreement concerning a judicial decision. The normal appellate review process exists for that purpose.”\n\nThis court, with its conservative supermajority, is not apt to chart a new path against the president. Based on the justices’ comments during December’s oral arguments in the controversy over Trump’s efforts to fire the heads of independent agencies, for example,the president is likely to prevail on broad removal power.\n\nTrump may fail in his unprecedented effort to end birthright citizenship, embodied in the Fourteenth Amendment. That case will beargued on April 1. Like his unilateral action to impose tariffs, Trump’s desire to end the guarantee of citizenship for virtually all children born in the US has no precedent.\n\nAt bottom, Trump may be headed for losses only in the most extreme cases.\n\nAmerican businesses and consumers, foreign countries and global markets, had been awaiting this decision along with Trump. His administration, which had lost in lower courts, had asked the justices for fast-tracked consideration, warning that a total of $1 trillion could be collected by late spring and that clarity was needed.\n\nThe main challengers, an Illinois educational-toy maker and New York wine importer, had also urged the justices to rule quickly, and many economic and legal observers hadexpected a decisionin early January.\n\nPerhaps because of weeks of dashed expectations, the courtroom was not filled Friday. Several seats in the lawyers’ section, press rows and justices’ guest area were empty.\n\nYet, directly below Roberts, at a table in the well of the courtroom, was Solicitor GeneralJohn Sauer, who had aggressively argued the Trump pro-tariff position, and in the general lawyers’ section further back, sat Neal Katyal, who had represented one of the sets of challengers.\n\nThe justices themselves betrayed no special anticipation as Roberts began the morning proceeding with the announcement that he had the decision in Learning Resources v. Trump. And, unlike other big-stakes cases, none of the dissenting justices chose to read any excerpt from their writings. Most justices simply looked out, impassively, at the spectators.\n\nTrump has had a remarkable winning streak at the Supreme Court, aided by Sauer, his former private lawyer whom he named to the solicitor general post after his reelection. Their run began with the 2024 decision that gave Trump, then between his two terms,substantial immunityfrom criminal prosecution.\n\nBut Trump’s unilateral moves on tariffs tested even a court majority that has been inclined toward enhanced presidential authority. The Constitution gives Congress the power to apply taxes and tariffs and never before had a president invoked the IEEPA as grounds for tariffs. Trump had especially targeted goods from Canada, Mexico and China, asserting leverage against criminal drug trafficking.\n\nRejecting Trump’s appeals, Roberts stressed the limits of the 1977 law, particularly as confronted by Congress’ taxing power under the Constitution. He noted that a tariff, after all, is simply a tax on imported goods.\n\nSauer, in arguing for an expansive interpretation of the IEEPA, had relied heavily on a 1981 case,Dames & Moore v. Regan. In that controversy, the high court upheld President Jimmy Carter’s reliance on IEEPA to use frozen Iranian assets as a “bargaining chip” to win the release of 52 American hostages.\n\nDissenting Justice Brett Kavanaugh, another of Trump’s nominees, joined by Justices Clarence Thomas and Samuel Alito, similarly contended that the 1981 case helped justify tariffs.\n\nRoberts was especially ready to shoot down that assertion. He had been a law clerk to then-Justice William Rehnquist in 1981when Rehnquist penned the Dames & Moore decision.\n\nIn his opinion Friday, Roberts lifted five distinct lines from Rehnquist limiting the reach of Dames & Moore, including “We attempt to lay down no general ‘guidelines’ covering other situations not involved here…” and  “We re-emphasize the narrowness of our decision.”\n\nThen Roberts, with a trace of levity that he’d left behind when he entered the courtroom, added, “This is not quite ‘no, no, a thousand times no,’ but should have sufficed to dissuade” dissenters from invoking the case.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/takeaways-supreme-court-stands-up-to-trump-on-emergency-tariffs",
      "text": "President Donald Trump’s tariffs unlawful"
    },
    {
      "url": "https://www.cnn.com/2023/06/30/politics/supreme-court-student-loan-forgiveness-biden",
      "text": "rejected major initiatives"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/25pdf/24-1287_4gcj.pdf",
      "text": "written opinion"
    },
    {
      "url": "https://www.archives.gov/milestone-documents/gibbons-v-ogden",
      "text": "Gibbons v. Ogden"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/business/video/trump-justices-tariffs-ruling-digvid",
      "text": "cast the Roberts Court majority as his nemesis"
    },
    {
      "url": "https://www.cnn.com/2025/03/18/politics/john-roberts-donald-trump-impeachment",
      "text": "Roberts issued a brief statement"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/supreme-court-to-hear-separation-of-powers-dispute-over-fired-ftc-commissioner",
      "text": "the president is likely to prevail on broad removal power"
    },
    {
      "url": "https://www.cnn.com/2025/12/05/politics/supreme-court-agrees-to-hear-birthright",
      "text": "argued on April 1"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/politics/where-is-supreme-court-ruling-on-trump-tariffs",
      "text": "expected a decision"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/supreme-court-trump-uninvited-d-john-sauer",
      "text": "John Sauer"
    },
    {
      "url": "https://www.supremecourt.gov/opinions/23pdf/23-939_e2pg.pdf",
      "text": "substantial immunity"
    },
    {
      "url": "https://tile.loc.gov/storage-services/service/ll/usrep/usrep453/usrep453654/usrep453654.pdf",
      "text": "Dames & Moore v. Regan"
    },
    {
      "url": "https://www.cnn.com/2025/10/29/politics/supreme-court-tariffs-dames-moore-regan-rehnquist-roberts",
      "text": "Justice William Rehnquist in 1981"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/politics/chief-justice-john-roberts-tariffs-analysis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/politics/chief-justice-john-roberts-tariffs-analysis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cc9310b6ca793845ec881126bc7d4087b3e68004c71936006c9a5eb2a215bdfa",
  "scraped_at": "2026-02-22T07:09:53.150614+00:00"
}
