{
  "url": "https://lite.cnn.com/2026/02/11/europe/russian-drone-strike-toddlers-killed",
  "title": "Russian drone strike kills three Ukrainian toddlers and their father | CNN",
  "date": "2026-02-11T16:38:16.047318+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThree toddlers and their father were killed in a Russian drone strike in eastern Ukraine that also injured their pregnant mother, local emergency services said.\n\nThe family only arrived in the town of Bohodukhiv, some 60 kilometers (38 miles) west of Kharkiv, the previous day after fleeing shelling, said Oleg Synegubov, the governor of the Kharkiv region.\n\n“(They) had just evacuated from Zolochiv, trying to escape from constant shelling and find a safer place to live. This was their first night in the new place,” he said on Telegram.\n\nAuthorities in Zolochiv said later on Wednesday there had been further attacks on the village, including a drone strike that injured two teenagers.\n\nSynegubov named the victims as two-year-old twin boys Ivan and Vladislav, their one-year-old sister Miroslava, and their 34-year-old father Gryhoriy. Earlier on Wednesday, authorities said Miroslava was the oldest of the three siblings – a confusion that could have been caused by the fact that the family was new to the area.\n\nVolodymyr Belyi, the town’s mayor, said the strike was a “crime that is beyond human comprehension.”\n\n“We lost the most precious thing we had – our future,” he said in a statement.\n\nPolice said the mother, who is 35 weeks pregnant, suffered head wounds and burns. She has now been discharged from the hospital, said Synegubov, who also clarified the identity of another survivor, a 73-year-old neighbor whom police had wrongly identified as the children’s grandmother.\n\nThe home where the family was staying was completely destroyed in the strike and subsequent fire. Photos from the scene show burnt rubble, with charred toys clearly visible in what used to be the inside of the home.\n\nUkraine’s President Volodymyr Zelensky said the attack showed Russia was not serious about peace.\n\n“Each such Russian strike undermines confidence in everything that is being done diplomatically to end this war,” he said in a statement on Telegram.\n\nZelensky said Russia launched 129 attack drones into Ukraine overnight, striking Kharkiv, Dnipropetrovsk, Zaporizhzhia, and Poltava regions.\n\nAttacks continued during the day. Authorities in the Kharkiv region said that a drone struck a medical vehicle transporting five healthcare workers and civilian passengers, leaving one woman dead.\n\nRussia also fired two ballistic missiles towards Lviv on Wednesday afternoon, the mayor of the western Ukrainian city Andriy Sadoviy said. He said Ukraine managed to “neutralise” them, which he said was a “monumental” task.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/europe/russian-drone-strike-toddlers-killed",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/europe/russian-drone-strike-toddlers-killed",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ccb8a46bc52138a0ec2b9d6fe0cc5af3e2c02ab1a465c258715f5e348fb02bdd",
  "scraped_at": "2026-02-11T16:38:16.047330+00:00"
}