{
  "url": "https://lite.cnn.com/2026/02/13/politics/military-lasers-directed-energy-el-paso",
  "title": "US military’s urgent push for laser weapons behind El Paso airport shutdown | CNN Politics",
  "date": "2026-02-14T07:08:10.222528+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Defense Department has been aggressively pursuing laser weapons and defense systems, a push that gained significant attention this week when the use of an anti-drone laser system led to thetemporary shutdown of airspaceover El Paso, Texas.\n\nThe interest in high-energy systems has only accelerated as military planners look to grapple with the rise of commercially available drones and as the defense industry has jumped to develop laser-based weapons systems for ground, sea and air forces.\n\nCNN reported that Customs and Border Protection was using a new counter-drone laser technology in El Paso which caused the Federal Aviation Administration to shut down airspace over the west Texas city. Defense Secretary Pete Hegseth signed off on loaning the laser technology to CBP from the Defense Department in recent weeks, one of the sources told CNN.\n\nIt’s just the latest in the Pentagon’s long-running efforts to harness lasers for the military. The Defense Department has been researching directed energy weapons since at least the 1960s, according to aCongressional Research Service report, though only in roughly the last decade has the department made significant progress. The first directed energy weapon was deployed in 2014, the reports says, aboard the USS Ponce, a now-decommissioned amphibious transport dock.\n\nBut the last several years, with the surge in the use of drones in the war in Ukraine along with persistent concerns about protecting US troops stationed in the Middle East, has driven a surge of interest in the technology.\n\nIn November, the head of research at the Pentagonwhittled down the list of technology prioritiesfor the agency, with directed energy making the cut as one of six areas the military would push resources towards.\n\nDirected energy weapons, such as high-energy lasers, could be used to shoot down drones, complete short-range air defense missions, and defend against rockets, artillery and mortar attacks, CRS said.\n\nIn 2017, the Army demonstrated the Mobile Expeditionary High Energy Laser 2.0  at the White Sands Missile Range in New Mexico. The system was used to take down small drones and quad copters, which the lead of the Army’s SMDC High Energy Laser Division, called “highly successful.”\n\n“We look forward to working with industry and continue to mature the technology because we believe this technology is critical to the Army and will be very beneficial once we are able to get the technology mature enough to transition it and field it one day,” Adam Aberle said in the release.\n\nAnd just last fall, the Army put out a request for information to defense industry partners specifically on an Enduring-High Energy Laser (E-HEL) production request. The RFI says the weapon system will be used against drones classified in groups 1-3, meaning smaller drones that weigh under 1,320 pounds.\n\nBut it’s not just the Army. The Air Force deployed a High-Energy Laser Weapon Systemdeveloped by RTXoverseas for the first time in 2019. Lockheed Martin has also developed a high-energy laser for the US Navy, called the HELIOS, or High Energy Laser with Integrated Optical-dazzler and Surveillance. The weapon system wasdeliveredto the Navy in 2022; the USS Preble, an Arleigh Burke-class destroyer, became the first ship outfitted with the HELIOS.\n\nIn 2022, the Navy tested the Layered Laser Defense (LLD), a weapon system also designed by Lockheed Martin, to counter drones and fast-attack boats. ANavy releasecalled the testing historic and said it was the first time the Navy had used “an all-electric, high-energy laser weapon to defeat a target representing a subsonic cruise missile in flight.”\n\nThe Navy’s top surface warfare officer, Vice Adm. Brendan McLane, said at the Surface Navy Association National Symposium last month that the Preble’s use of HELIOS is an example of the military developing future platforms to “deliver on their promise to the American people.”\n\n“Last fall successful at-sea testing paved the way for future laser weapons systems. We need to continue on this path,” McLane said. “I am committed to advancing laser technology to the fleet. The dream of a laser on every ship can become a real one.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
      "text": "temporary shutdown of airspace"
    },
    {
      "url": "https://www.everycrsreport.com/files/2024-07-11_R46925_4c1e5a38ad3d6906a3ea03e0972e08d8979659f3.pdf",
      "text": "Congressional Research Service report"
    },
    {
      "url": "https://x.com/DoWCTO/status/1990466242658832574?s=20",
      "text": "whittled down the list of technology priorities"
    },
    {
      "url": "https://www.rtx.com/raytheon/what-we-do/integrated-air-and-missile-defense/lasers#:~:text=Hi%2Dres%20Image-,The%20U.S.%20Air%20Force's%20new%20palletized%20laser%20weapon%20is%20the,emplaced%20to%20protect%20critical%20infrastructure.",
      "text": "developed by RTX"
    },
    {
      "url": "https://news.lockheedmartin.com/2022-08-18-Lockheed-Martin-Delivers-Integrated-Multi-Mission-Laser-Weapon-System-to-the-Navy",
      "text": "delivered"
    },
    {
      "url": "https://www.navy.mil/DesktopModules/ArticleCS/Print.aspx?PortalId=1&ModuleId=523&Article=2998829",
      "text": "Navy release"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/military-lasers-directed-energy-el-paso",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/military-lasers-directed-energy-el-paso",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cdf52069c16bbbc40715d722bc846efebb25d6e77a4f39497f596a9c8161b742",
  "scraped_at": "2026-02-14T07:08:10.222541+00:00"
}