{
  "url": "https://lite.cnn.com/2026/02/26/politics/brady-tkachuk-team-usa-canada-white-house-video",
  "title": "Brady Tkachuk: US Olympic hockey player distances himself from White House video trashing Canadians | CNN Politics",
  "date": "2026-02-27T07:15:24.942574+00:00",
  "authors": [
    "Kit Maher"
  ],
  "text": "Source: CNN\n\nWhile the Trump administration has shown no hesitation to bash Canada – especially after the US men’s Olympic hockey teamwon goldin overtime – one of the players took issue with a recent AI-generated TikTok posted by the White House that made it sound like he was trash-talking Canadians.\n\n“They booed our national anthem, so I had to come out and teach those maple-syrup-eating-f**ks a lesson,” Team USA’s Brady Tkachukappears to sayin the video posted on the White House TikTok earlier this week. A disclaimer at the bottom of the video notes that it “contains AI-generated media,” with the clip appearing to modify footage from one of Tkachuk’s press conferences.\n\nWhile Tkachuk won gold on the US men’s Olympic hockey team – beating Canada 2-1 – he plays professionally on a Canadian-based National Hockey League team, as captain of the Ottawa Senators.\n\nBut whatever animosity the White House directed toward Canada was not shared by the player himself, who told reporters on Thursday that he did not condone the video.\n\n“It’s clearly fake, because it’s not my voice and not my lips moving,” Tkachuk said. “I’m not in control of any of those accounts and, uh, yeah so, I know that those words would never come out of my mouth, so can’t do anything about it.”\n\nPressed, if he liked the video, Tkachuk said, “I would never say that. That’s not who I am, so yeah, I guess I don’t like that video.”\n\n“If you watch the video, that’s not my voice and something that I never say, and I don’t really know how that, kind of, took a storm on its own when I play here and give everything I have here,” Tkachuk said. “That’s something that – never a thought would happen in my head, and especially would never say it.”\n\n“I would never say anything like that,” he added.\n\nFour other players on the US men’s Olympic hockey team also play for Canada-based teams.\n\nCNN has reached to the White House for comment on Tkachuk’s remarks and the video itself.\n\nCommenting on Trump’s prior taunts to make Canada the 51st USstate, Tkachuk told reporters, “I know I don’t want that, because I still want to play in the best-on-best tournaments.”\n\nThe TikTok is just the latest example of the White House mocking Canada as itpromotes Team USA’s winand subsequent visit to Washington on social media.\n\nOn Monday, Trump posted an AI-generated video of himself playing hockey in a suit and red tie, throwing one Canadian player down on the ice and beating up another. Below the video was an old social media post from former Canadian Prime Minister Justin Trudeau, whom Trump often referred to as “Governor,” which said, “You can’t take our country – and you can’t take our game.”\n\nThe video ends with the AI-generated USA players hugging him.\n\nTrump’s comments about the US women’s Olympic hockey team, which also won gold against Canada in the Olympics, also sparked controversy this week.\n\n“I must tell you, we’re gonna have to bring the women’s team — you do know that,” Trump said over a speakerphoneheld by FBI Director Kash Patel, when inviting the men’s team to the White House and his State of the Union Address. If he didn’t invite them, Trump said, “I do believe I probably would be impeached,”\n\nThe captain for the US women’s Olympic hockey team called Trump’s comments a “distasteful” joke. The women’s team declined to attend the State of the Union address, citing scheduling issues.\n\nIt’s also not the first time the White House has gotten in hot water for an AI-generated video. Just weeks ago, Trump posted aracist videodepicting former President Barack Obama and first lady Michelle Obama as apes, which he blamed on a staffer who didn’t watch it all the way through. While the White House often doubles down when criticized, the video was deleted after widespread bipartisan backlash, including pushback from the only Black GOP senator, Tim Scott.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/19/sport/team-usa-canada-olympic-hockey",
      "text": "won gold"
    },
    {
      "url": "https://www.tiktok.com/@whitehouse/video/7609740037386702093",
      "text": "appears to say"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/team-usa-hockey-olympics-trump-state-of-the-union",
      "text": "promotes Team USA’s win"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/kash-patel-team-usa-hockey-locker-room",
      "text": "held by FBI Director Kash Patel"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/sport/video/hilary-knight-team-usa-womens-hockey-trump-joke-vrtc-digvid",
      "text": "distasteful"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/donald-trump-obamas-apes-truth-social",
      "text": "racist video"
    }
  ],
  "hash": "ce43830e61ad0ce4594b3dc041cba124a1e7c0eb3698b736003c8230c12dfa0e",
  "scraped_at": "2026-02-27T07:15:24.942586+00:00"
}