{
  "url": "https://lite.cnn.com/2026/02/27/tech/ai-memory-chips-smartphones-intl-hnk",
  "title": "AI is gobbling up the world’s memory chips, sending smartphone prices to record highs, report says | CNN Business",
  "date": "2026-02-27T07:14:55.940373+00:00",
  "authors": [
    "Stephanie Yang",
    "Wayne Chang"
  ],
  "text": "Source: CNN\n\nA global shortage in memory chips sparked by artificial intelligence has dealt a “tsunami-like shock” to the smartphone industry, pushing prices to all-time highs, according to a new report.\n\nA worsening shortfall of memory components is expected to put phone manufacturers out of business and make smartphones more expensive than ever this year, according to the paper by the International Data Corporation, a Boston-based technology analysis firm.\n\n“What we are witnessing is not a temporary squeeze, but a tsunami-like shock originating in the memory supply chain, with ripple effects spreading across the entire consumer electronics industry,” said Francisco Jeronimo, who leads research on mobile devices at the IDC, in a Thursday report.\n\nThe report estimates that the average selling price of smartphones will rise 14% this year to an all-time high of $523, while manufacturers will no longer be able to make phones that cost less than $100. The IDC also predicts that 2026 smartphone sales will see a record decline of 12.9% to 1.12 billion units, the lowest level in more than a decade.\n\nThis particular semiconductor crisis stems from a boom in artificial intelligence, and the subsequent rush to build data centers that rely heavily on memory chips. As demand has skyrocketed, the world’s largest memory chip manufacturers in Asia have pivoted to supplying the AI industry, leaving little left for consumer electronics like laptops, gaming consoles and phones.\n\nThe IDC said it expects the shortage to permanently affect smartphone manufacturers, and have a greater impact on smaller makers using Google’s Android operating system, while tech giants like Apple and Samsung would be insulated from the pain and would have the opportunity to increase market share.\n\n“In short, there is no return to business as usual for vendors and consumers,” said Nabila Popal, senior research director at the IDC, in the same report.\n\nFor years, memory chips were considered a modest but steady business, with much thinner profit margins than cutting-edge chips used in computer processing.\n\nThe growing demand from AI has changed that.\n\nJensen Huang, chief executive of Nvidia, whose AI chips have made it the most valuable company in the world, has said memory chips are vital to the development of AI.\n\n“The amount of memory that’s needed for AI to be useful is increasing quite substantially,” he told reporters in Taiwan in late January. “Memory is very important for the future of AI.”\n\nAs AI improves, it requires larger amounts of both processing power and memory storage. In particular, the older technology that smartphones and laptops need is called DRAM, or dynamic random-access memory. But those components are being used in another, more advanced kind of chip that supports data centers and other technologies that require larger amounts of storage, called HBM, or high bandwidth memory.\n\nNow prices for both DRAM and HBM chips have hit record highs, nearly doubling in the first quarter of 2026 compared with the previous quarter, according to technology research firm Counterpoint Research. That’s forcing electronics manufacturers to cut down on memory in their devices or focus on making premium products.\n\nStock prices of the world’s top three suppliers of memory chips – SK Hynix, Samsung and Micron – hit all-time highs this year, and their production capacity is nearly booked out. Shares of Taiwanese competitors have also surged, with companies like Nanya Technology Corporation, Winbond Electronics Corporation and Powerchip Semiconductor Manufacturing Corporation (PSMC) all pledging to increase production.\n\nAnalysts and tech executives have warned that the memory shortage will persist well into next year. In a January earnings call, Tesla CEO Elon Musk said that limited supply of memory chips could be one of the biggest challenges to future growth, and suggested the company invest in its own chip manufacturing facilities to ensure supply.\n\nSee Full Web Article",
  "links": [],
  "hash": "ceafb5a05357cb66fc41697ef1af19cd9f49962f150c52e67ef89a203cce93f5",
  "scraped_at": "2026-02-27T07:14:55.940386+00:00"
}