{
  "url": "https://lite.cnn.com/2026/02/25/politics/fbi-agents-fired-classified-documents-kash-patel-toll-records",
  "title": "FBI Director Kash Patel ousts personnel tied to Trump classified documents probe | CNN Politics",
  "date": "2026-02-28T07:01:54.139012+00:00",
  "authors": [
    "Evan Perez",
    "Hannah Rabinowitz",
    "Holmes Lybrand"
  ],
  "text": "Source: CNN\n\nFBI Director Kash Patel ordered the ouster of at least 10 employees involved in the investigation of President Donald Trump’s alleged mishandling of classified documents at his Mar-a-Lago estate, four people briefed on the matter told CNN.\n\nThe ousters are part of a wider internal investigation into the actions taken in the probe that resulted in criminal charges against Trump and two of his employees, three people briefed on the matter said.\n\nPatel ordered the wider investigation following the discovery of records showing that the FBI used subpoenas to obtain his communication records and the communications of now White House Chief of Staff Susie Wiles during a 2022-2023 probe that eventually came under the leadership of special counsel Jack Smith, the people briefed on the matter said.\n\nPatel disclosed the seizure of the records in a statement Wednesday.\n\n“It is outrageous and deeply alarming that the previous FBI leadership secretly subpoenaed my own phone records – along with those of now White House Chief of Staff Susie Wiles – using flimsy pretexts and burying the entire process in prohibited case files designed to evade all oversight,” he said.\n\nThe FBI director briefed Wiles on the seizure Wednesday, according to a source familiar with the matter.\n\nReutersfirst reportedPatel discovering the records were obtained. CNN has reached out to Wiles for comment. A spokesperson for Smith declined to comment.\n\nThe ouster of FBI employees is the latest in a series of Patel pushing out agents and other employees who worked on cases related to the January 6, 2021, attack on the US Capitol and on the Trump Mar-a-Lago documents cases.\n\nThe FBI Agents Association denounced the moves in a statement on Wednesday.\n\n“The FBIAA condemns today’s unlawful termination of FBI Special Agents, which—like other firings by Director Patel—violates the due process rights of those who risk their lives to protect our country,” the association said. “These actions weaken the Bureau by stripping away critical expertise and destabilizing the workforce, undermining trust in leadership and jeopardizing the Bureau’s ability to meet its recruitment goals—ultimately putting the nation at greater risk.”\n\nThe Justice Department investigated Trump for both retaining classified documents and attempting to overturn the 2020 election results. Subpoenaing information for those around Trump was part of the normal process of such an investigation. Patel himself was compelled to testify before a grand jury in 2022 as part of those investigations,CNN previously reported.\n\n﻿Following Trump’s reelection, Smith dropped the election subversion case and the classified documents case against him, citing longstanding Justice Department rules against prosecuting a sitting president.\n\nRepublicans in Congress have recently complained about Smith using a grand jury to subpoena phone toll records of several lawmakers around the January 6, 2021, Capitol attack.\n\nContrary to some claims from Republican lawmakers, investigators subpoenaed call logs but there is no evidence they “tapped” those phones.\n\nCall logs do not reveal substance of calls, rather they are just a log of calls placed and received.\n\nThis story has been updated with additional information.\n\nCNN’s Betsy Klein and Kristen Holmes contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.reuters.com/world/us/fbi-obtained-kash-patel-susie-wiles-phone-records-during-biden-administration-2026-02-25/",
      "text": "first reported"
    },
    {
      "url": "https://www.cnn.com/2022/11/04/politics/kash-patel",
      "text": "CNN previously reported."
    }
  ],
  "hash": "cf2f398b59ca8c8b1c3e6c558df6572f0f2967bbdae9da4fc2bb22bceb59c9af",
  "scraped_at": "2026-02-28T07:01:54.139024+00:00"
}