{
  "url": "https://lite.cnn.com/2026/02/16/entertainment/robert-duvall-death",
  "title": "Robert Duvall has died. Here’s how he’d like to be remembered. | CNN",
  "date": "2026-02-17T07:30:16.558041+00:00",
  "authors": [
    "Brian Lowry, CNN"
  ],
  "text": "Source: CNN\n\nRobert Duvall, the Oscar-winning actor best known for “The Godfather,“ “Apocalypse Now” and many other tough-guy roles over an acclaimed screen career that spanned six decades, has died. He was 95.\n\nDuvall died “peacefully” at his home in Middleburg, Virginia on Sunday, according to a statement sent by his public relations agency on behalf of his wife, Luciana.\n\nDuvall memorably played the Corleone family consigliere, or key adviser, in Francis Ford Coppola’s “The Godfather,” earning his first of seven Academy Award nominations for the 1972 film before reprising the role two years later in “The Godfather Part II.”\n\nBorn in San Diego, California – his father was a career naval officer – Duvall played a wide variety of roles, from cowboys to military men.\n\nHe attended Principia College in Illinois and served in the army during the Korean War before moving to New York and studying drama under famed acting coach Sanford Meisner. During that period, he shared an apartment with Dustin Hoffman and hung out withGene Hackman, another young actor who would go on to great success. Hackmandiedlast year.\n\nDuvall appeared in a number of plays before being cast in the film version of “To Kill a Mockingbird” in the small but pivotal of Arthur “Boo” Radley in 1962. (He later named one of his dogs “Boo.”)\n\nAn array of film roles followed, among them the bad guy opposite John Wayne in Wayne’s lone Oscar-winning performance, “True Grit”; the part of Major Frank Burns in the Robert Altman movie “M*A*S*H”; and the lead in “Star Wars” director George Lucas’ dystopian 1971 sci-fi directing debut, “THX 1138,” in which Duvall (and everyone else) sported shaved heads.\n\nThat came out the year before “The Godfather,” and his role as Corleone family attorney Tom Hagen propelled Duvall into another echelon. The actor worked constantly thereafter, playing a network executive in the satire “Network,” and migrating to television in the blockbuster TV miniseries “Lonesome Dove.”\n\nDuvall won an Oscar for portraying a country singer in the 1983 movie “Tender Mercies,” in which he did his own singing.\n\nHe also earned Academy Award nominations for playing a marine at odds with his family in “The Great Santini,” and as Lt. Col. Kilgore in the Vietnam War epic “Apocalypse Now,” which reunited him with Coppola and featured him delivering the oft-quoted line, “I love the smell of napalm in the morning.”\n\nDuvall noticeably skipped appearing in the long-delayed “The Godfather Part III” in 1990, due to a pay dispute with Coppola, telling Bob Costas that Al Pacino was going to be paid five times the amount he was offered, which was “totally unacceptable.”\n\nLater, in an interview with Larry King, Duvall called his decision not to appear in the third “Godfather” movie “a matter of principle.”\n\nRoles in other Westerns were also a part of his oeuvre, such as “Open Range” opposite Kevin Costner, and his Emmy-winning role in another miniseries, “Broken Trail.”\n\nDuvall also became a filmmaker, writing, directing and costarring in the 1997 movie “The Apostle,” about a troubled preacher, and later directing the films “Assassination Tango” and “Wild Horses.” He was again nominated for an acting Oscar for his work in “The Apostle.”\n\nHe remained active well into the 2010s, earning his final Oscar nomination at 84 for “The Judge” in 2014, and appearing in such films as “Jack Reacher” and “Widows.”\n\nDuvall also played a number of historical figures during his career, including Robert E. Lee (“Gods and Generals”), Joseph Stalin (in the HBO movie “Stalin”) and Nazi war criminal Adolf Eichmann (“The Man Who Captured Eichmann”).\n\nMarried four times, Duvall’s last marriage was to Argentinian actress-director Luciana Pedraza.\n\nDuvall had a history of supporting Republican candidates. He attended George W. Bush’s inauguration, raised money for Mitt Romney’s candidacy and narrated a video at the Republican National Convention in 2008.\n\nHe was awarded the National Medal of Arts during the Bush administration in 2004.\n\nDuvall’s representative’s statement added on Monday that no formal service will be held. Instead, “the family encourages those who wish to honor his memory to do so in a way that reflects the life he lived by watching a great film, telling a good story around a table with friends, or taking a drive in the countryside to appreciate the world’s beauty.”\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/02/27/entertainment/actor-gene-hackman-obit",
      "text": "Gene Hackman"
    },
    {
      "url": "https://www.cnn.com/2025/02/27/entertainment/gene-hackman-betsy-arakawa-death/index.html",
      "text": "died"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/entertainment/robert-duvall-death",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/entertainment/robert-duvall-death",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cf5d312a7b66dbc85b301279487ab11aedbdba008ad15e2d8b594abaf3ed8bc9",
  "scraped_at": "2026-02-17T07:30:16.558053+00:00"
}