{
  "url": "https://lite.cnn.com/2026/02/19/politics/trump-launches-his-board-of-peace-with-lofty-pledges-but-questions-remain",
  "title": "Trump’s first Board of Peace meeting sees lofty pledges, but questions remain | CNN Politics",
  "date": "2026-02-20T07:28:19.812161+00:00",
  "authors": [
    "Jennifer Hansler",
    "Oren Liebermann",
    "CNN"
  ],
  "text": "Source: CNN\n\nIt had the hallmarks of a Trump political rally – Laura Branigan’s “Gloria” blaring over speakers and red “USA” hats handed out to participants.\n\nBut the event in Washington, DC, Thursday was meant to mark a major moment in global governance. It was the inaugural meeting of theBoard of Peace, the organization chaired by US President Donald Trump that aims reconstruct and reshape Gaza after years of war. And it carried with it potentially far-reaching implications for how the White House handles international conflicts and who gets to call the shots.\n\nIn lengthy remarks, the US president announced that nine nations had pledged more than $7 billion to Gaza relief. A handful of countries would commit troops to be sent there as part of a stabilization force, he said. Trump also said the United States would contribute $10 billion to the Board of Peace, which he will indefinitely chair. A billionaire member of the board’s executive committee outlined the development potential of the enclave, even as the vast majority of Gaza lies in ruins after nearly two years of Israeli bombardment. Even so, FIFA, complete with a flashy and seemingly AI-generated video, previewed “a complete football ecosystem.”\n\nNow, there are major questions of how these lofty ambitions will comport with the realities on the ground in Gaza. There have been repeated violations of Trump’s ceasefire, and the humanitarian situation there remains precarious. Moreover, the key issue of the demilitarization of Hamas has not yet been solved, raising questions of when and how reconstruction and deployment can actually take place.\n\nIn his remarks, Trump, who has sought to lean into the role of peacemaker, did little to assuage concerns about the board’s efforts to supersede the United Nations.\n\n“The Board of Peace is going to almost be looking over the United Nations and making sure it runs properly,” he said, adding that the UN has “tremendous potential.”\n\n“We’re also going to maybe take it a step further, where we see hot spots around the world, we can probably do that very easily,” Trump said at the conclusion of the Board of Peace meeting, which comes as he considers military action against Iran. Though the UN Security Council resolution that empowered the Board of Peace dealt specifically with Gaza, the founding charter for the group claims its own authority to deal with any theoretical conflict.\n\nRoughly four dozen countries had representatives at Thursday’s meeting, but only half of those are members of the board. The other half, including the majority of participants from Europe, were there as observers. A senior European Union diplomat told reporters in Brussels on Thursday, “It is clear there are issues with the Board of Peace.” But in the absence of another mechanism or international organization to shape the future of Gaza, there is no other choice.\n\nMany of the US’ traditional allies have turned down membership on the board amid concerns about its broad mission. There are also concerns about some potential members. Trump added later on Thursday he would like to see Russia and China join the board.\n\nAaron David Miller, a former Middle East negotiator for the US, told CNN that the meeting seemed detached from reality, noting that the demilitarization plan is not ready for “prime time.”\n\nThere is an understanding among US officials and regional allies that demilitarization will be a long-term process, sources have told CNN. One US official said the expectation is that the technocratic Palestinian government will facilitate conversations with Hamas on the matter, and although there are efforts ongoing, there is no timeline for it actually taking place. In a statement on Thursday evening, Hamas made no mention at all of disarmament or the demilitarization of Gaza. Instead, it called on the international community to compel Israel fully open the crossings into Gaza and begin reconstruction.\n\nIt is unclear if the International Stabilization Force (ISF) will deploy before there is demilitarization. According to Trump, Morocco, Albania, Kosovo, and Kazakhstan “have all committed troops and police to stabilize Gaza.”\n\nEgypt and Jordan, he added, “are likewise providing very, very substantial help, troops, training and support for a very trustworthy Palestinian police force.”\n\nAnd the board-affiliated National Committee for the Administration of Gaza aims to “restore security via professional civilian police under one authority … including training and developing 5,000 Gazan police to be deployed in 60 days,” committee chair Ali Shaath said at the meeting Thursday. But the committee has been unable to enter Gaza, stuck in Cairo with little power to implement its decisions or govern the enclave in any meaningful way.\n\nHigh RepresentativeNickolay Mladenov, who serves as the key link between the board and the Palestinian technocratic committee, noted on Thursday that in order to begin reconstruction, “there is no other option” than the full demilitarization of Gaza and the decommissioning of weaponry in the enclave.\n\nTrump said Bahrain, Qatar, Saudi Arabia, Uzbekistan and Kuwait have given more than $7 billion towardsGaza relief but did not go into specifics of how or when the money would be invested. It is also unclear what the $10 billion US contribution to the board will be specifically used for, though a US official said it would be contributed over the coming years.\n\nMiller noted “the money is no good if you can’t spend it.”\n\nPart of the issue, he said, is that the Israeli government is unlikely to allow infrastructure into the parts of Gaza it does not control or they’re going to insist on inspecting “every item.” The other issue is ongoing military strikes, he noted.\n\n“I think under the right circumstances, external actors could have significant impact. I just don’t see how you trim what I saw today into a reality that would make Gaza whole, secure and prosperous,” Miller said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/politics/trump-launches-board-of-peace",
      "text": "Board of Peace"
    },
    {
      "url": "https://www.cnn.com/2026/01/18/middleeast/gaza-nickolay-mladenov-profile-intl-cmd",
      "text": "Nickolay Mladenov"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-launches-his-board-of-peace-with-lofty-pledges-but-questions-remain",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/trump-launches-his-board-of-peace-with-lofty-pledges-but-questions-remain",
      "text": "Cookie Settings"
    }
  ],
  "hash": "cfd9e79d74507a2d79992077fe79721151eb6add050fbb9755bbbc27eb9061c2",
  "scraped_at": "2026-02-20T07:28:19.812175+00:00"
}