{
  "url": "https://lite.cnn.com/2025/11/02/politics/timeline-us-strikes-caribbean-pacific-vis",
  "title": "A timeline of US strikes on boats that have killed at least 138 | CNN Politics",
  "date": "2026-02-21T07:04:33.790146+00:00",
  "authors": [
    "Michael Rios",
    "Avery Schmitz",
    "Matt Stiles",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe US military has killed at least 138 people in strikes that have destroyed 44 boats as part of a campaign that Washington says is aimed at curtailing the flow of drugs into the United States. There have been at least four survivors of those strikes, two of whom were briefly detained by the US Navy before being returned to their home countries. Two others are presumed dead.\n\nThe US Coast Guard launched a search for an unspecified number of survivors who abandoned ship before their vessels were struck on December 30 in international waters. The Coast Guard suspended its search on January 2. The Coast Guard launched a search for a survivor of a boat strike on January 23 and there is another search for a survivor of a boat strike on February 9.\n\nThe Trump administration has told Congress that the US is now in an “armed conflict” against drug cartels beginning with its first strike on September 2, labeling those killed “unlawful combatants” and claiming the ability to engage in lethal strikes without judicial reviewdue to a classified Justice Department finding.\n\nSome members of Congress as well as human rights groups have questioned that finding and argued that potential drug traffickers should face prosecution, as had been the policy of interdiction carried out by the US before President Donald Trump took office.\n\nThe Trump administration has also not provided public evidence of the presence of narcotics on the boats struck, nor their affiliation with drug cartels.\n\nMilitary officials have said that no US service members have been harmed in the strikes.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/06/politics/classified-justice-department-memo-cartel-strikes",
      "text": "due to a classified Justice Department finding"
    },
    {
      "url": "https://www.cnn.com/2025/11/02/politics/timeline-us-strikes-caribbean-pacific-vis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2025/11/02/politics/timeline-us-strikes-caribbean-pacific-vis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d0361e87aa2af25bab3c9f18053ffab3f3c4353040ff2f26c154c29d4dcfe59b",
  "scraped_at": "2026-02-21T07:04:33.790159+00:00"
}