{
  "url": "https://lite.cnn.com/2026/02/17/americas/venezuela-delcy-wright-energy-intl-latam",
  "title": "I’ve covered Venezuela for a decade. But this US visit was like nothing I’ve seen before | CNN",
  "date": "2026-02-19T07:32:26.666590+00:00",
  "authors": [
    "Analysis by Stefano Pozzebon, CNN"
  ],
  "text": "Source: CNN\n\nIt is less than two months since US special forcescapturedVenezuela’s longtime authoritarian leader Nicolas Maduro during a nighttime raid in Caracas, yet it is hard to overstate how different the South American country now feels.\n\nThere’s a new buzz, an optimism that, to be frank, I have never seen before.\n\nI moved to Caracas in 2016.\n\nIn the decade that followed, Venezuela saw it all: a quarter of the population fled a catastrophic economic collapse; crime rates exploded before gradually yielding in the aftermath of COVID-19; anti-Maduro demonstrators took to the streets year after year only to be overpowered by tear gas and rubber bullets.\n\nYet throughout it all, Maduro ruled on, seemingly unmovable.\n\nWorking in Caracas as a foreign correspondent during the most turbulent months of 2019, I often thought of this quote from the Italian novel “The Leopard” about the conquest of Sicily in the 19th century: “Everything must change for everything to remain the same.”\n\nIn Maduro’s Venezuela, elections – at least nominally – would be held almost every year. But while cabinet ministers would come and go, the man at the top – Maduro – would always remain the same.\n\nLikewise, the permacrisis in the economy, which endured despite Caracas’ introduction of a national crypto currency, the Petro, to bypass US sanctions, or the central bank’s removal of five zeros from the national currency, the Bolivar, to subdue hyperinflation.\n\nAs recently as late last year, it had seemed as if no crisis were big enough for the government to turn the page. Venezuela appeared doomed to repeat the cycle.\n\nWhat happened on January 3 changed everything: US special forces captured Maduro during a raid in Caracas and spirited him away to New York City to face narco-trafficking charges that he denies.\n\nIn his absence, Maduro has been replaced by his former deputy,Delcy Rodriguez, now acting president, who has ruthlessly transformed her country’s geopolitical outlook. After just 39 days in power, Rodriguez welcomed the US Secretary of Energy Chris Wright as the highest-ranking US official to visit Caracas since President Bill Clinton in 1997.\n\nI was there to cover Wright’s visit. Here’s why I think the changes happening in Venezuela now are like nothing I have seen before.\n\nLast week, one of the most surreal moments I witnessed took place not in Caracas, but in a Chevron-run oil field in the middle of nowhere calledPetroindependencia1.\n\nCNN was one of three international outlets invited to tag along, as RodriguezchaperonedWright around her country toshowcasethe potential of what are thought to be the largest oil reserves in the world.\n\nThe moment seemed straightforward: two leaders visiting an industrial complex, shaking hands, smiling for the camera and making a nondescript speech or two.\n\nWhat I had not expected to see was Rodriguez and Wright traveling in the same vehicle with minimal staff, Rodriguez amicably switching from English to Spanish to make sure the secretary was comfortable, and the pair discussing the finer technical details of how oil wells work (crude de-emulsification processes, anyone?)\n\nBear in mind that for the past 27 years the United States has been Venezuela’s arch-nemesis.\n\nUnder Maduro and his predecessor, Hugo Chavez, oil projects from Western companies like the one we visited were tolerated at best but often expropriated, while the government pushed for closer commercial ties to Iran and Russia for political reasons.\n\nPoliticians of all backgrounds would be uncomfortable speaking English in public because it was considered the language “of the Empire.”\n\nIn the past few weeks, Rodriguez has swept that all away: she has installed a new economic leadership that seems competent and thorough; She has abandoned the combative rhetoric to build ties with both the US and European companies, the latter of which were granted new licenses last week, and, more importantly, has sought positive relations with the few entrepreneurs that remain in the country.\n\nData reviewed by CNN shows that, in the weeks since Rodriguez took over, at least seven tankers have left the port  we visited to head to Texas and Louisiana. According to the White House, the US is brokering the sale of hundreds of millions of oil barrels – profits from which are already hitting the street and calming the inflationary spiral, to the point that Caracas this month felt cheaper to me than in December.\n\nClearly, much remains to be done: Chevron claims the project we visited produces around 40,000 barrels per day, but its capacity is seven times higher. Secretary Wright told us that “political obstacles” still need to be removed and that this will require time, but when I asked Rodriguez, she told me the two countries were working nonstop to cement a new energy partnership that, she hopes, will be “long-term”.\n\nThat is quite the change from a woman who said in 2019 that “capitalism is uncapable of generating happiness.”\n\nJust as our selected group was visiting oil fields on Thursday, pockets of students took to the streets in Caracas and other cities to demand the release of political prisoners, hundreds of whom remain behind bars according to human rights watchdogs.\n\nThose were small protests, involving hundreds rather than tens of thousands, but a sign that, slowly but surely, Caracas’ repression machine is not as feared as it once was.\n\nStudent protests have long been a pillar of anti-Maduro opposition, but the last time the democratic movement ventured out in the open was in January 2025.\n\nTheprevious July, security forces arrested more than 2,000 protesters in less than two days to quash the revolt after electoral authorities controversially granted Maduro a victory despite overwhelming evidence of the contrary.\n\nThis time, the protesters did not seek a confrontation with the police, their leader, Miguelangel Suarez, told me.\n\nSuarez, a 26-year-old politics student, believes there is an opening now to reclaim the public space. “We have the opportunity to test how far (the repression) is willing to go. The time to press for political guarantees is now,” he told me.\n\nOther leaders in the opposition are also daring the government more openly than before. On February 9, Juan Pablo Guanipa, a close ally of Nobel laureate Maria Corina Machado and who had spent more than eight months in prison, was re-arrested hours after being released for leading a protest in Caracas. Rather than being sent back to a cell, he was placed under house arrest and could be in line for a full pardon if an amnesty law currently being discussed is approved.\n\nMachado is the undisputed leader of Venezuela’s democratic movement, but she has spent the past few weeks on the sidelines, saying she trusts the Trump administration will push for a full transition to democracy – and new elections – once the country is stable and the economic crisis reined in.\n\nWhat I saw in Caracas falls short of Machado’s ambitions, as Maduro’s government remains in power even if he does not.\n\nMachado has claimed she intends to return to Caracas as soon as possible but at this point it is unclear if she would be allowed back. She declined to speak to CNN for this piece.\n\nSuarez told me he respects Machado’s leadership in the democratic movement, but that he believes Venezuela must reach other tangible goals before being able to return to the polls: “To rebuild Venezuela, Machado must be allowed to be in the country, all our exiled brothers must be allowed in. Political prisoners must be released, the political parties allowed to do politics, the electoral authorities must change and there must be separation between powers. When we reach that, we can move on with the transition to democracy.”\n\nSimilar caution was palpable among several diplomats I spoke to. The consensus, at least among the international community, is that Venezuela is taking the first small steps toward democracy but that it should not rush ahead.\n\n“No haste but not hesitation” is something I heard from more than one source, most of whom asked not to be identified by name as they were not authorized to speak with the media.\n\nThroughout 2025, the growing confrontation between Maduro and US President Donald Trump seemed to leave no good options for Venezuela, sandwiched as it was between an authoritarian government and a threatened foreign intervention that reminded some of Iraq circa 2003.\n\nIn the end, the foreign intervention took place but was far less bloody than feared, and since then the incoming personnel from the US have been diplomats and oil executives rather than Marines.\n\nIt means going slow – nobody has toppled any statue of Maduro’s, yet – but also avoiding the mistakes of the forever wars.\n\nWhat has changed is that today feels better than yesterday, and Venezuela believes in the opportunity to make tomorrow even better.\n\nThe change of mentality is profound, even with the obstacles left behind by 12 years of authoritarianism.\n\nNobody in Caracas is fooling themselves: the country is on its knees, and a lot of work is required before Venezuela can be great again, but even the harshest critics must acknowledge the enthusiasm.\n\nPerhaps, the most surreal conversation I had was not hearing aChavistapresident singing capitalism’s praise, or friends who have been out of the country for eight years finally looking for a flight to Caracas; but a European diplomat who, after a long pause, told me: “At least for now, we’ve got to admit that Trump got this one right.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/03/americas/venezuela-explosions-intl-hnk",
      "text": "captured"
    },
    {
      "url": "https://www.cnn.com/2026/01/26/americas/venezuela-delcy-rodriguez-enough-us-orders-trump-oil-hnk-intl",
      "text": "Delcy Rodriguez"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/americas/venezuela-oil-wright-rodriguez-latam-intl",
      "text": "showcase"
    },
    {
      "url": "https://www.cnn.com/2024/07/30/americas/venezuela-protests-election-explainer-intl-hnk",
      "text": "previous July"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/americas/venezuela-delcy-wright-energy-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/americas/venezuela-delcy-wright-energy-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d061639b337bd9e44cb66f1a55c9710049b6498c9ff4d4019dc23f120bfa659a",
  "scraped_at": "2026-02-19T07:32:26.666604+00:00"
}