{
  "url": "https://lite.cnn.com/2026/02/22/travel/what-to-do-stranded-mexico-intl-hnk",
  "title": "Mexico travel guidance: What you need to know as violence erupts over death of cartel leader | CNN",
  "date": "2026-02-24T07:32:02.101765+00:00",
  "authors": [
    "Charlotte Reck, CNN"
  ],
  "text": "Source: CNN\n\nAn outbreak of deadly violence affecting tourist destinations in Mexico has prompted urgent warnings from the US and other governments, urging their citizens to remain in place over fears for their safety.\n\nThe US State Department said people in the areas of Jalisco and Nayarit, including in popular vacation spots, should seek shelter amid unrest following the death of cartel leader “El Mencho” Oseguera Cervantes.\n\nIn an update on Monday, the state department said the “situation has returned to normal” in the states of Baja California (including Tijuana, Tecate, and Ensenada), Quintana Roo (including Cancun, Cozumel, Playa del Carmen, and Tulum), Colima, Guanajuato, Estado de Mexico, Nuevo Leon, Oaxaca, Puebla, Queretaro, San Luis Potosi, Sinaloa, Tamaulipas, Veracruz, and Zacatecas.\n\nCanada has also issued similar warnings for areas hit by unrest while warning of possible disruption to transport for those looking to leave. The UK Foreign and Commonwealth Office has urged British citizen in Jalisco to stay indoors.\n\nAlthough airports remain open and operating normally, some domestic and international flights have been canceled in the western Mexican cities of Guadalajara and Puerto Vallarta.\n\nIn some parts of the country, buses were ignited, roads were blocked and clashes with authorities escalated quickly  as  organized crime groups carried out attacks  in areas also popular with US, Canadian and British tourists.\n\nFor individuals in affected areas, the US State Department advises:\n\nAnyone needing assistance help can contact:\n\nFrom US & Canada: 1-888-407-4747\n\nFrom Overseas (including Mexico): +1 202-501-4444\n\nTourism in Mexico is on the rise. The country reportedly welcomed a record 47.4 million visitors between January and July 2025 — a 13.8% increase on the same period in 2024.\n\nTravelers preparing to explore Mexico’s archaeological sites or beaches are encouraged to prepare carefully. According to the US State Department guidance:\n\nThose who choose to proceed with travel are encouraged to take additional precautions:\n\nMexico will co-host the FIFA World Cup from June 11 to July 19, 2026, alongside the United States and Canada. More than five million fans are expected across the 16 host cities in the three countries.\n\nIn Mexico, matches will take place in Guadalajara, Mexico City and Monterrey. However, with Jalisco currently categorized by the US government as a state where visitors should reconsider travel, some fans may weigh their plans carefully.\n\nFans who have secured tickets are advised to:\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://mx.usembassy.gov/security-alert-update-ongoing-security-operations-u-s-mission-mexico-february-22-2026/",
      "text": ""
    },
    {
      "url": "https://www.cnn.com/world/live-news/mexico-el-mencho-killed-travel-chaos-02-23-26-intl-hnk?post-id=cmlykomjz000n3b6pt5dklwas",
      "text": ""
    },
    {
      "url": "https://www.cnn.com/2026/02/22/travel/what-to-do-stranded-mexico-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/travel/what-to-do-stranded-mexico-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d06e14969d090d029a55fc1433c2e11c99bebaee4b2b018dc4d9c8d00aa0df4e",
  "scraped_at": "2026-02-24T07:32:02.101777+00:00"
}