{
  "url": "https://lite.cnn.com/2026/02/23/economy/callout-tariffs-small-business-consumers",
  "title": "How have you been affected by tariffs? | CNN Business",
  "date": "2026-02-24T07:31:51.364153+00:00",
  "authors": [
    "Alicia Wallace, CNN"
  ],
  "text": "Source: CNN\n\nDuring the past year, President Donald Trump has imposed sweeping and steep tariffs on most imported goods with the intent to reduce trade deficits and bolster US-based manufacturing.\n\nThe near-term effects have been monumental both in and outside of the United States by reshaping global trade, raising the effective tariff rate to levels not seen in more than a century, upending the regular course of business and supply chains, and driving uncertainty as well as costs higher for some businesses and consumers.\n\nThe massive shift in US trade policy hasn’t come without some twists, with one of the biggest occurring last week: The US Supreme Court ruled that Trump exceeded his authority with how he imposed some tariffs. Trump responded by announcing plans to institute a 15% global tariff.\n\nWhile it remains to be seen how the latest shifts will play out, we want to hear how you have been affected this past year.\n\nIn what ways have tariffs directly impacted you? Have you held off on making certain purchases, curtailed your spending or made other decisions?\n\nIf you own a business, how have tariffs affected your operations, sales and supply chains? Have you had to pull back on hiring or even laid off some workers?\n\nIf you’d be willing to share your experience with a CNN reporter for possible inclusion in an upcoming article, we’d like to hear from you.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/economy/callout-tariffs-small-business-consumers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/economy/callout-tariffs-small-business-consumers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d31825006175f43acd58405bf1aa36255896b86d80015d610116eb76f1f8ad37",
  "scraped_at": "2026-02-24T07:31:51.364166+00:00"
}