{
  "url": "https://lite.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
  "title": "California avalanche: 6 close friends on a backcountry ski trip identified as among those killed | CNN",
  "date": "2026-02-24T07:34:09.332436+00:00",
  "authors": [
    "Elizabeth Wolfe",
    "Chris Boyette",
    "Cindy Von Quednow",
    "CNN"
  ],
  "text": "Source: CNN\n\nA group of six mothers and wives, their lives linked by their great love of the outdoors, are among the nine skiers who are confirmed or presumed dead after their backcountry tour was overtaken Tuesday by the deadliest avalanche the US has seen in decades.\n\nThe women were part of a tight-knit group of friends who had traveled from as far as Idaho to embark on a three-day guided trip near California’s Lake Tahoe, their families said. All were experienced skiers who “deeply respected the mountains.”\n\nSisters Liz Clabaugh and Caroline Sekar are among the dead, and the others have been identified by their families as Carrie Atkin, Danielle Keatley, Kate Morse and Kate Vitt. A spouse of a Tahoe Nordic Search and Rescue team member was also among those killed, authorities have said.\n\nThe tour of 15 people, including four guides, was on their final day and heading back to the trailhead when a member of the group cried, “Avalanche!”\n\nWithin moments, the group was overcome by a football-field-sized crush of snow and ice. Only two of the friends survived, as well as a guide and two other group members.\n\nThe survivors frantically searched through the snow for their ski partners and friends, eventually digging out three people who were no longer alive, Nevada County Undersheriff Sam Browntold CBS News.\n\n“Uncovering people who are deceased, that they know and probably cared about, is just horrible,” Brown told the outlet.\n\nSurvivors, some of them injured, huddled under a makeshift shelter for hours as they waited for rescue teams to arrive. Though they were ferried out safely, the effort to recover the others’ remains has been hindered by days of heavy snow and persistent avalanche risk.\n\nControlled explosions began at the accident site Friday in an effort to release unstable snowpack and protect recovery crews from another avalanche, the sheriff’s office announced.\n\nThe tour company that organized the trip, Blackbird Mountain Guides, said the guides leading the expeditionwere highly trainedand certified in avalanche education.\n\nBut the families of the six women said they still have “many unanswered questions” and the sheriff’s office has said it is investigating whether criminal negligence contributed to the incident.\n\n“We are devastated beyond words,” the families said. “Our focus right now is supporting our children through this incredible tragedy and honoring the lives of these extraordinary women.”\n\nFamilies whose lives were intertwined by this group of women are asking for privacy as they grieve their “sudden and profound loss.”\n\nThe group of friends, who were from Idaho, the Bay Area and the nearby Truckee-Tahoe region, were “passionate, skilled skiers who cherished time together in the mountains,” the families said.\n\nThe trip had been organized well in advance. They had trained and prepared for the backcountry conditions, trusted their professional guides, and were fully equipped with avalanche safety equipment, according to the statement.\n\nBut the conditions that day proved to be severe. Conditions were so treacherous that the bodies of the eight dead skiers had to be left on the icy mountainside, the sheriff said.\n\nOne other is still missing, presumed dead among the blanket of snow, according to Nevada County Sheriff Shannan Moon.\n\n“We are heartbroken and are doing our best to care for one another and our families in the way we know these women would have wanted,” the families said.\n\nThe brother of Sekar and Clabaugh toldThe New York Timeshe is wounded to have lost both of them.\n\n“These are two of the best people I’ve ever known,” McAlister Clabaugh told the newspaper. “They were incredible sisters, mothers, wives and friends. And the idea that they are both gone is, I don’t even know how to put it into words.”\n\nSekar’s neighbordescribed her as “a wonderful human being who loved life,” CNN affiliate KXTV reported. She was “a very vibrant person, one of the nicest people I’ve ever known.”\n\nVitt “seemed like a super friendly, great mom,” one of her neighbors, Carleen Cullen, told KXTV. “She was just always out there with her kids and getting them hustled off to school and after-school activities.”\n\nSome of the victims were also members of the Sugar Bowl Academy community, a private school and ski training center located near the avalanche site, the academy said in a statement.\n\nCalifornia Gov. Gavin Newsom expressed his condolences Thursday,noting his wife had a connection to some of the victims.\n\n“Turns out (we have)a lot of mutual friends in Marin County. Just learning some of my wife’s old family friends,” he told reporters at an event in the Bay Area.\n\n“I’ve been in that area many, many times. Stayed in those cabins just a year or so ago, and very mindful of the terrain and the nature of this,” Newsom added, referring to huts the group stayed in during the trip.\n\nA community vigil in memory of the victims will be held at 6 p.m. Sunday in downtown Truckee. Additionally, there will be an interfaith service at Church of the Mountains at 5:30 p.m. Monday.\n\nThe deadliest avalanche in California’s recorded history has drawnrescue and recovery resources from as far as Los Angeles — about 500 miles away.\n\nBut even while incident response teams have the resources they need to recover the bodies from the avalanche site, they must wait for a break in the storm to safely trek back through the rough terrain.\n\n“Adverse weather, coupled with ongoing avalanche danger, has hindered the recovery process,” the Nevada County Sheriff’s Office said in an update Friday.\n\nOver a foot of additional snow was dumped on the already-risky area Thursday. Though heavy snow subsided Thursday night, extreme cold continues to be a concern through Saturday, with temperatures expected to reach the teens in the morning and the 20s for most of the afternoon, according to CNN Meteorologist Allison Chinchar.\n\nThe sheriff’s office said it used aerial surveys before deciding to begin controlled explosions at the avalanche site Friday. The tactic could reduce the risk of another avalanche and make the area safer for first responders.\n\nEven on a good day, the area is not for the inexperienced.\n\n“It’s a very remote, rugged area on the north side of the highway there. It is not a groomed area or a ski resort area. This is a backcountry area,” Moon said.\n\nAs a result of the avalanche, the Tahoe National Forest closed all lands and trails in the Castle Peak areauntil March 15, forest officials announced Thursday.\n\n“Due to the current instability of the snowpack and need to prioritize first responder access to the area, members of the public are prohibited from entering the closure area,” officials said in asocial media post.\n\nTuesday’s tragedy marks the deadliest avalanche in the US since 1981, when 11 people died in an avalanche on Ingraham Glacier on Mount Rainier in Washington, according to theAssociated Press.\n\nThe Blackbird Mountain Guides group had spent three days traversing Castle Peak’s wild terrain and staying in huts near Donner Summit — an area that before 2020 was closed to the public for nearly a century.\n\nAs the skiers trekked home on the final day, the snowpack had formed a weak layer that had been loaded up with snow, making conditions ripe for an avalanche, according to Chris Feutrier, USDA forest supervisor for the Tahoe National Forest. The area was under the second-highest level, a 4 of 5, of an avalanche threat Tuesday.\n\nAt 11:30 a.m., the Nevada County dispatch center received a 911 call reporting the avalanche, Moon said. The avalanche wasclassifiedas a 2.5 on a five-level scale that measures the destructive potential of moving avalanche debris, the sheriff said.\n\n“A two would bury a person. A three would bury a house, and it’s right in the middle of those two,” Moon told CNN.\n\nThough dozens of search and rescue personnel swarmed to the area, it would take crews several hours to reach the group in “horrific” conditions, she said.\n\n“Lots of snow, gale force winds, winds making it impossible to see,” Moon said of the conditions. For their own safety, rescue crews had to proceed at a “slow and steady pace.”\n\nAfter a panicked search for the other buried skiers, the survivors — some of whom were injured — settled in for a long wait. They formed a makeshift shelter to stay warm, Moon said.\n\nBefore rescue units arrived on the scene, they knew six people had survived. The surviving group had been communicating with them via emergency beacons and iPhone SOS signals, Moon said. One of the guides was able to communicate with rescuers by text during the hours crews were trying to reach them.\n\nBy around 5:30 p.m., rescuers were able to reach the avalanche site, Moon said. With no road to the remote scene, they drove as far as they could on a snowcat, a specialized snow vehicle equipped with large treads, before they had to ski the rest of the way.\n\nTwo of the survivors were unable to walk due to their injuries, the sheriff said. Rescuers were able to get them over two miles of snow to the awaiting snowcats. Two people rescued were later transported to hospital, authorities said.\n\nThe bodies of the skiers killed in the avalanche had to be left behind, authorities explained, as the sheer terrain and extreme weather made it dangerous for first responders to coordinate their removal.\n\nBlackbird Mountain Guides said all four guides on the trip were American Mountain Guides Association trained or certified in backcountry skiing andguides in the field had been in communication with senior guides at their base about conditions and route decisions.\n\nBlackbird said it is still working to understand exactly what happened and that investigations are underway.\n\nThe company suspended all field operations through at least February 22, as it supports families and staff.\n\n“We ask that people following this tragedy refrain from speculating. We don’t have all the answers yet, and it may be some time before we do. In the meantime, please keep those impacted in your hearts,” the company said.\n\nThe sheriff’s office told CNN Friday that it’s conducting an investigation into whether criminal negligence was involved, telling Reuters, “in addition to the coroner’s death investigations.”\n\nIt cautioned the investigation was in the preliminary stages and it was too early to name a specific target of any possible charges, Reuters reported.\n\nCNN has reached out to the Nevada County District Attorney’s Office, which would decide on any possible charges. The attorney’s office declined to comment to Reuters.\n\nThe California Division of Occupational Safety and Health told CNN it has also launched a probe into Blackbird Mountain Guides. The agency said it has six months to complete its investigation and issue any citations if they find any violation.\n\nCNN has reached out to Blackbird Mountain Guides.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cbsnews.com/news/california-avalanche-survivors-tried-to-unbury-their-friends-near-lake-tahoe/",
      "text": "told CBS News"
    },
    {
      "url": "https://blackbirdguides.com/pages/live-incident-updates",
      "text": "were highly trained"
    },
    {
      "url": "https://www.nytimes.com/2026/02/19/us/tahoe-avalanche-victims-sisters.html",
      "text": "The New York Times"
    },
    {
      "url": "https://www.abc10.com/article/news/local/california-deadly-avalanche-investigation-launched/103-849717c9-e57f-4c46-ba09-10f8bbf005a2",
      "text": "Sekar’s neighbor"
    },
    {
      "url": "https://www.fs.usda.gov/r05/tahoe/alerts/castle-peak-avalanche-closure?fbclid=IwY2xjawQEb09leHRuA2FlbQIxMABicmlkETJEVDUwS0luM0QwRmZNSDM0c3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHlYvowvmoJJMpLrMXB3lmLK61GMUwJVejFX-v3ue_8jhAmUJZFluBQ2QnYIq_aem_aLLGP2blkR0Jf7QbsdgyTg",
      "text": "until March 15"
    },
    {
      "url": "https://www.facebook.com/photo/?fbid=1386293883539889&set=a.308275298008425",
      "text": "social media post"
    },
    {
      "url": "https://apnews.com/article/deadliest-avalanches-us-history-california-tahoe-f46c5a04ab59ea7bf1618a2643e1523f",
      "text": "Associated Press"
    },
    {
      "url": "https://avalanche.org/avalanche-accidents/#/report/4187d5a2-dbbc-437d-8ac8-8c5dd4d0b1f9",
      "text": "classified"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d35670c1ce0cad498e064fe8ca171dc57308401c41793ed08ad576ee350c672c",
  "scraped_at": "2026-02-24T07:34:09.332450+00:00"
}