{
  "url": "https://lite.cnn.com/2026/02/22/politics/shutdonw-tsa-precheck-global-entry-suspended-hnk",
  "title": "DHS reverses course on TSA PreCheck suspension after confusion | CNN Politics",
  "date": "2026-02-23T07:35:49.278180+00:00",
  "authors": [
    "Martin Goillandeau",
    "Alexandra Skores",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe Department of Homeland Security on Sunday walked back its decision to suspend the Transportation Security Administration’s PreCheck program, after initially sparking confusion for travelers when it said it was temporarily halting the popular service.\n\nTSA “will evaluate on a case-by-case basis and adjust operations” according to staffing changes, a spokesperson for the agency told CNN on Sunday.\n\nDHS said in a statement earlier in the day that PreCheck, along with the Global Entry program, would shut down at 6 a.m. ET amid apartial government shutdown.\n\nBut as of Sunday morning, travelers were still able to pass through lines servicing TSA PreCheck at Ronald Reagan Washington National Airport and Dulles International Airport near Washington, DC.\n\nCNN has reached out to Customs and Border Protection about the status of Global Entry.\n\nBoth programs are funded by fees charged to members.\n\nDHS Secretary Kristi Noem had said in a statement to CNN that TSA and CBP “are focusing on the general traveling public at our airports and ports of entry.”\n\n“Shutdowns have serious real-world consequences, not just for the men and women of DHS and their families who go without a paycheck, but it endangers our national security,” the statement added. The Washington Postfirst reportedon the measures.\n\nUS Travel Association President Geoff Freeman said after the reversal his organization was “glad that DHS has decided to keep PreCheck operational and avoid a crisis of its own making.”\n\n“We are urging the same for Global Entry,” Freeman said. “These Trusted Traveler Programs strengthen aviation security and improve screening efficiency. They are funded by user fees, and there is no reason at this time for them to be suspended.”\n\nThe move to suspend the programs would be a significant escalation in how the DHS shutdown would impact travelers, effectively dismantling expedited airport security lanes and fast‑track customs processing relied on by millions of frequent flyers who are US citizens or legal permanent residents as well as international passengersfrom more than 20 countries.\n\nThe confusion comes during a partial government shutdown affecting only DHS, after Congress failed to reach a funding agreement amid a standoff overimmigration enforcement policy.\n\nDemocrats have pushed for new restrictions on agencies including Immigration and Customs Enforcement and CBP after the fatal shootings of two US citizens by federal officers in Minneapolis this year. Republicans have largely opposed the proposed changes, while pressing Democrats to agree to measures such as stricter enforcement against so‑called sanctuary cities.\n\nDHS also said it is suspending all courtesy and family escorts at airports for members of Congress, saying that service “is drawing staff away from the critical mission of getting passengers screened.” TSA said in a statement Sunday the escort service was “suspended to allow officers to focus on the mission of securing America’s skies.”\n\nMeanwhile, DHS employees deemed essential, including an estimated63,000TSA agents,have continued working without pay.\n\nNoem said in her statement that “The American people depend on this department every day, and we are making tough but necessary workforce and resource decisions to mitigate the damage inflicted by these politicians.”\n\nDemocrats on the House Homeland Security Committeecondemnedthe initial move to suspend these programs, accusing DHS’ leadership of “punishing travelers” and “ruining your travel on purpose.”\n\nUS Travel Association President and CEO Geoff Freeman said in a statement his organization was “disgusted” that “Democrats and Republicans have used air traffic controllers, TSA, CBP and the entire travel experience as a means to achieve political ends.”\n\n“Travelers should be prioritized, not leveraged,” Freeman wrote. “Travel is the gateway to the American economy and Americans should not have their mobility, security or travel experience diminished because elected leaders fail to resolve their differences.”\n\nThe suspension of TSA PreCheck lanes at US airports would require enrolled travelers to use standard security screening. It’s uncertain how international passengers returning or entering the US through Global Entry would be impacted as most of this process is done at automated kiosks. The eventual disruptions are likely to increase wait times at customs and passport control.\n\nCNN has also reached out to the three TSA PreCheck providers processing enrollments as their websites still seem to be accepting applications.\n\nTSA PreCheck, which costs between $76.75 and $85 for a five‑year membership, surpassed 20 million active members in 2024,according to TSA.\n\nMore than 12 million travelers are enrolled in Global Entry,according to CBP.The program charges a $120 application fee, also for a five-year membership.\n\nTogether, DHS trusted-traveler programs cover more than 40 million vetted airline passengers, according to TSA.\n\nWhile previous government shutdowns disrupted enrollment operations and led to longer airport lines, TSA PreCheck lanes and Global Entry kiosks remained open.\n\nDuring last year’s record shutdown, the programs were not formally suspended, but staffing shortages contributed to longer security lines, temporary checkpoint closures at some airports, and lingering flight delays and cancellations as congestion spread across the US air travel system.\n\nThis story and headline have been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "partial government shutdown"
    },
    {
      "url": "https://www.washingtonpost.com/nation/2026/02/21/tsa-precheck-global-entry-shutdown/",
      "text": "first reported"
    },
    {
      "url": "https://www.cbp.gov/travel/trusted-traveler-programs/global-entry/eligibility",
      "text": "from more than 20 countries"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/immigration-democrat-shutdown-demands-poll",
      "text": "immigration enforcement policy"
    },
    {
      "url": "https://x.com/TSA/status/2022067729503858905?s=20",
      "text": "63,000"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/department-homeland-security-government-shutdown",
      "text": "have continued working without pay"
    },
    {
      "url": "https://x.com/HomelandDems/status/2025420989178257425",
      "text": "condemned"
    },
    {
      "url": "https://www.tsa.gov/news/press/releases/2024/08/08/tsa-precheckr-reaches-milestone-20-million-members",
      "text": "according to TSA"
    },
    {
      "url": "https://www.cbp.gov/newsroom/local-media-release/cbp-launches-global-entry-enrollment-departure-atlanta-international",
      "text": "according to CBP."
    },
    {
      "url": "https://www.cnn.com/2025/11/11/us/shutdown-travel-problems-linger",
      "text": "During last year’s record shutdown"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/shutdonw-tsa-precheck-global-entry-suspended-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/shutdonw-tsa-precheck-global-entry-suspended-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d4065bf410447ff98749a5eca585b373ef44f3829f02f015e3f1870fd8855282",
  "scraped_at": "2026-02-23T07:35:49.278194+00:00"
}