{
  "url": "https://lite.cnn.com/2026/02/12/sport/parker-kingston-byu-rape-charge",
  "title": "BYU standout receiver Parker Kingston charged with first-degree rape in Utah | CNN",
  "date": "2026-02-12T21:30:30.952117+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nProsecutors in Utah have filed a first-degree felony rape charge against Brigham Young University standout wide receiver Parker Kingston, officials said Wednesday.\n\nKingston, 21, is being held without bail in St. George, a city near Arizona, Washington County prosecutors said. His initial appearance in court is scheduled for Friday.\n\nThe investigation began last February, prosecutors said in a news release. A woman who was 20 years old at the time told officers at a St. George hospital that Kingston assaulted her on February 23, 2025, prosecutors said. Police gathered digital and forensic evidence and interviewed the parties involved and other witnesses, prosecutors said.\n\nIt was not clear if Kingston had an attorney. He didn’t immediately respond to a message seeking comment. A phone message left for his family was not immediately returned.\n\nBYU said in a statement that it takes any allegation very seriously, and will cooperate with law enforcement. It said it would not be able to comment further due to federal and university privacy laws and practices for students.\n\nKingston had a team-leading 67 receptions and 928 yards with five TD catches last season. He also rushed for 199 yards on 25 carries with a score, and returned 17 punts for 230 yards and a TD.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/sport/parker-kingston-byu-rape-charge",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/sport/parker-kingston-byu-rape-charge",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d45048379029bf65085ed816917aed011f82b66553e8a2c1ed2559f8d757d4c9",
  "scraped_at": "2026-02-12T21:30:30.952131+00:00"
}