{
  "url": "https://lite.cnn.com/2026/02/24/us/house-midair-collision-bills",
  "title": "House rejects quick passage of bill that some say would have prevented deadly DC midair collision | CNN",
  "date": "2026-02-25T07:32:08.733929+00:00",
  "authors": [
    "Alexandra Skores",
    "Pete Muntean"
  ],
  "text": "Source: CNN\n\nThe House of Representatives rejected a measure Tuesday afternoon that would have swiftly mandated collision avoidance systems on every plane in the US. Supporters have advocated for the ROTOR Act, saying it could have prevented last year’s deadly midair collision near Washington, DC.\n\nSixty-seven people were killed on January 29, 2025, when a US Army helicopter on a training flightcollidedwith an American Airlines regional jet, operated by PSA Airlines, as it was landing at Ronald Reagan Washington National Airport.\n\nMost aircraft are already required to automatically send out signals known as ADS-B (Automatic Dependent Surveillance - Broadcast), which include their location and other data so they can be tracked. The American regional plane was sending out the signal, but Army helicopters did not transmit the data. Neither pilot was able to receive information from the other because their aircraft were only equipped to transmit, not receive, ADS-B information.\n\nThe ROTOR Act, which was introduced in the Senate last year, would require all aircraft transmitting to also receive ADS-B data, called “ADS-B In,” so pilots could use it to look for other aircraft.\n\nOn Tuesday, the House voted to not give the bill a fast track to passage, which would have required approval of two-thirds of representatives. It still could be approved, but will now need to go through the standard legislative process.\n\n“Congress let down the families and the flying public today,” the parents of Sam Lilley, the first officer on the American Airlines regional jet, said in a statement. “We knew this fight would not end here, but we are in complete dismay over this vote.”\n\nThe National Transportation Safety Board Chair Jennifer Homendy called the results of the vote “devastating” for families and investigators.\n\n“We have to move forward and figure out a way to work together to improve safety and to .. fully address our recommendations otherwise we’re going to be right back here when more people die,” she said.\n\nA House committee is proposing a competing bill, called the ALERT Act, which it says is a wide-ranging measure to address all 50 issues the NTSB brought up in its report.\n\n“The best way to serve and honor the victims and their families is by thoughtfully addressing the broad range of safety issues raised by the now-complete accident investigation, and that’s just what the ALERT Act does,” said Transportation Committee Chair Sam Graves, a Missouri Republican. “The ROTOR Act touches on only two of the NTSB’s 50 recommendations and provides an overly prescriptive approach to mandating a specific technology, which is still largely under development, in a manner that can prove burdensome to some operators and create barriers to its adoption.”\n\nThe ALERT Act, would not require ADS-B In on every aircraft, specifically having a rulemaking committee look at “collision mitigation” technology and would exempt many aircraft, like those commonly flown by private pilots.\n\nThe act also requires some aircraft be equipped with technology “capable” of receiving ADS-B transmissions, but does not require they actually to use it.\n\nThe NTSB says many of the measures in the House bill fall short of addressing their concerns.\n\n“We stand ready to work with the House but saying that they implement our recommendations right now is completely false. It does not implement our recommendations in many, many areas,” Homendy told CNN. “Claiming falsely that they implement our recommendations is not right and that does make me angry.”\n\nAccident investigators and families of the victims have increased calls for collision avoidance technology since the deadly collision.\n\n“It is clear from our investigation that had the crew had ADS-B In flight 5342 would have had a 59 second alert versus the 19 seconds they had … which was ineffective in preventing the crash,” Homendy said.\n\nHolding up a letter dated February 14, 2008, Doug Lane, a father and husband who lost his wife Christine and son Spencer, told a news conference on Tuesday that the Federal Aviation Administration had his son’s whole life to expand ADS-B. The agency failed, he said.\n\n“Sixteen years, six months and 12 days after this letter was written, (Spencer) was dead,” Lane said. “I learned from the NTSB that ADS-B In, recommended in a letter before he was born, would have saved his life, my wife’s life, and 65 other beautiful people.”\n\nThe ROTOR Act would also require military aircraft to use ADS-B to transmit their location in most situations, including during training flights, which the Department of Defense currently opposes.\n\nDemocratic Rep. Don Beyer of Virginia said at the news conference said it was a “surprise” to hear Defense Secretary Pete Hegseth and the department had objections to the bill, “last minute.”\n\nMilitary aircraft under the ALERT Act would be allowed to fly without broadcasting their location.\n\nLaura Augendre, who lost her cousin Peter Livingston, his wife Donna, and their daughters Everly and Alydia in the collision, said Congress needs to act now.\n\n“The ROTOR Act takes a critical step forward by ensuring that safety technology is not just available, but operational, and used for the purpose it was designed to serve,” Augendre said. “The best time to make these changes was years ago. The next best time is today.”\n\nHomendy said she hopes the House will work with the NTSB to make the changes needed to improve the ALERT Act, but it does not work in its current form.\n\n“We stand ready to work with the house, to work with the Senate on whatever package moves forward,” she said. “I hope that we can work together and move forward on a bill that we can all support.”\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/us/live-news/plane-crash-dca-potomac-washington-dc-01-29-25",
      "text": "collided"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/us/house-midair-collision-bills",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/us/house-midair-collision-bills",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d45fe74497e0a9696886f288e64376ea6b5f1fb735fd7164ac1b5348aed0e271",
  "scraped_at": "2026-02-25T07:32:08.733941+00:00"
}