{
  "url": "https://lite.cnn.com/2026/02/13/sport/ilia-malinin-winter-olympics-shock",
  "title": "Ilia Malinin seemed at ease carrying the weight of Olympic expectation on his shoulders – until he wasn’t | CNN",
  "date": "2026-02-14T07:06:55.464551+00:00",
  "authors": [],
  "text": "Source: CNN\n\nWhenIlia Malinin’sscore was displayed on screen at the end of his free skate on Friday, no one could believe what they saw.\n\nJournalists looked at each other in stunned silence, while members of the crowd sat with their mouths open even wider than their eyes.\n\nThe eighth-place finish just didn’t look right next to his name. He was supposed to win and make history doing so. This just couldn’t happen.\n\nBut then the cruel reality of sport soon kicked in, and the realization of what had transpired in the previous five minutes began to dawn on those inside the Milano Ice Skating Arena.\n\nThe self-proclaimed“Quad God”had not won the gold medal. He hadn’t won any medal at all.\n\nWhile others tried to come to terms with the almighty surprise, Malinin was still playing catch-up with all the emotionsracing through his head.\n\n“Honestly, I still haven’t been able to process what just happened,” the 21-year-old told reporters just minutes after his routine.\n\n“It’s a lot of mixed emotions. Going into this competition, I felt really good this whole time, really solid. I thought that all I needed to do was go out there and trust the process.\n\n“But of course, it’s not like any other competition; it’s the Olympics, and I think people only realize the pressure and the nerves that actually happen from the inside. It was just something that overwhelmed me, and I felt like I had no control.”\n\nBefore any of the athletes took to the ice, everyone was talking about how, not if, Malilin was going to win gold. He had established a five-point lead over his closest rival after a superb short program routine earlier in the week and just needed to see it out again on Friday.\n\nThe conversation before had mainly centered around whether he would become the first skater to land a quadruple Axel at the Olympics, a move so difficult that only he had ever successfully performed it in competition.\n\nIf he were to lose to anyone, though, it would likely be to Yuma Kagiyama. So when the Japanese star struggled in the routine before Malinin, it left the door wide open for the American to secure his second Olympic gold.\n\nHe couldn’t miss. Until he did.\n\nMalinin told reporters that the nerves really kicked in when he took his starting pose in the middle of the rink. When everyone sat on the edge of their seat, waiting for him produce magic, the youngster’s head was somewhere entirely different.\n\n“All the traumatic moments of my life really just started flooding my head, and there were just so many negative thoughts that just flooded into there,” he added. “I just did not handle it.”\n\nIt led to a uncharacteristically sloppy and relatively simplistic routine, complete with two falls that the American just couldn’t recover from.\n\nEvery slip was greeted with increasingly louder gasps from the crowd. Each fall then triggered a cacophony of cheers as supporters did their best to rally behind an athlete so clearly in need of help.\n\nHis usual swagger, an attitude some see as arrogance, had abandoned him. He looked totally exposed on the global stage.\n\nThe routine just couldn’t end quickly enough and Malinin wasn’t able to hide his disappointment, looking so desperately sad as he skated off the ice, trying his best to hold back the tears.\n\nMalinin then sat down next to his father and coach Roman Skorniakov to hear his score, both looking dumbfounded when the point total was read out.\n\nThe American, though, still had the awareness to congratulate Kazakhstan’s Mikhail Shaidorov on his most unlikely gold medal – Shaidorov himself not really knowing how to react to what he just witnessed.\n\nTo put all this into perspective,the two-time and reigning world championhad not faced defeat since 2023. It’s just not a feeling that he’s used to.\n\nBut all that expectation was clearly weighing on the rookie Olympian more than he was letting on. When he looked so confident in the buildup, joking with the crowd and waving to his adoring fans, his smile masked how he truly felt.\n\nSo when Malinin kept his poise in front of reporters, articulately expressing his feelings after the event, you sensed that in reality, there was a young man just wanting the ground to swallow him up.\n\n“It wasn’t my best day, and it was definitely something I wasn’t expecting,” he said. “But it’s done, I can’t go back and change it, even though I would love to.\n\n“From here, it’s just regrouping, figuring out what to do next and going from there.”\n\nLooking back, there were signs at this year’s Games that the “Quad God” was in fact mortal.\n\nHe looked shaky during the short program of the team event, falling to second place behind Japan’s Kagiyama. That performance was quickly forgotten, though, after his free skate inspired Team USA to win gold.\n\nStill, the magnitude of this collapse cannot be understated. Sports analyst Christine Brennan told CNN that the moment was “as big an upset in sports as we’ve probably ever seen,” and she wouldn’t be alone in thinking that.\n\nThere is some sort of precedent for this in figure skating.\n\nIn 2018, the “Quad King” Nathan Chen suffered a similar fate after many had tipped him to take home gold in PyeongChang. But after falling multiple times, he finished fifth in the individual competition. Chen, though, returned to the Olympics in 2022 and captured the gold medal.\n\nMalinin, then, will pray for something similar and hope that Milan Cortina was just the first chapter in what will be an Olympic redemption down the line. Given his undoubted ability, you certainly wouldn’t bet against him.\n\nBut for now, all Malinin can do is learn from the experience and try to address how he manages the pressure that will only ramp up from here.\n\nIt’s a reminder, though, that even the most supernatural athletes are as human as the rest of us. Malinin just did a good job of hiding it.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://us.cnn.com/sport/live-news/milan-winter-olympics-results-highlights-medals-02-13-26",
      "text": "Ilia Malinin’s"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/sport/figure-skating-backflip-explainer",
      "text": "“Quad God”"
    },
    {
      "url": "https://us.cnn.com/sport/live-news/milan-winter-olympics-results-highlights-medals-02-10-26",
      "text": "racing through his head."
    },
    {
      "url": "https://www.cnn.com/2024/03/24/sport/ilia-malinin-wins-first-world-title-figure-skating-spt-intl",
      "text": "the two-time and reigning world champion"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/sport/ilia-malinin-winter-olympics-shock",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/sport/ilia-malinin-winter-olympics-shock",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d4ab223440a2206ff957ee58373f31fb9125b1eeac90c21605582c21ba4f6435",
  "scraped_at": "2026-02-14T07:06:55.464565+00:00"
}