{
  "url": "https://lite.cnn.com/2026/02/27/politics/bill-clinton-epstein-deposition-house",
  "title": "Bill Clinton denies having any knowledge of Epstein’s crimes in historic deposition | CNN Politics",
  "date": "2026-02-28T06:58:42.257752+00:00",
  "authors": [
    "Annie Grayer",
    "MJ Lee"
  ],
  "text": "Source: CNN\n\nBill Clinton on Friday denied having any knowledge of Jeffrey Epstein’s crimes during what he said was the pair’s “brief acquaintance” under more than six hours of questioning from lawmakers who sought to unravel the former president’s ties to the late convicted sex offender.\n\nRepeatedly, lawmakers showed Clinton photos of himself with women from Epstein materials recently released by the Justice Department, asking if he had sex with them. Each time, he told them he did not, two sources familiar with the testimony said.\n\nAt one point, the panel homed in on a particularly well-known photo of Clinton in a jacuzzi with a woman, her face redacted. Clinton said he did not know her, and he denied having sex with her, two sources said.\n\nLawmakers of both parties said Clinton answered every question posed to him, and the former president broadly denied wrongdoing.\n\n“I had no idea of the crimes Epstein was committing,” Clinton said in his opening statement to the House Oversight Committee, shared publicly on social media. “I know what I saw, and more importantly, what I didn’t see. I know what I did, and more importantly, what I didn’t do. I saw nothing, and I did nothing wrong.”\n\nBut the questioning about his sexual activities underscored how Clinton’s past ties to Epstein have come to haunt him and his family.\n\nClinton’s testimony capped a high-profile two days in the Republican-led panel’s Epstein inquiry, following the sworn testimony of his wifethe day before.\n\nThe former president defended Hillary Clinton in a video statement after his deposition. “I also have to say something personal. Republicans made Hillary testify yesterday, and she had nothing to do with Jeffrey Epstein. Nothing. She has no memory of ever even meeting him,” he said in thevideo. “She neither traveled with him, nor visited any of his property. So whether 10 people or 10,000 people were subpoenaed, including her, was simply not right.”\n\nThe appearance saw lawmakers trek to Chappaqua, New York, to avoid the spectacle of a former president testifying under oath in Washington. But Clinton’s deposition behind closed doors was no less historic. He became the first former president compelled to testify under subpoena before a congressional committee, setting a new precedent that could have sweeping ramifications, including for President Donald Trump.\n\nAttorneys for the Clintons and the Republican-led panel negotiated behind the scenes – through email exchanges, letters and phone calls – for months over the terms of the interview. Ultimately, the pair only agreed to comply with their subpoenas after the House had moved toward a bipartisan vote to hold them in criminal contempt of Congress for refusing to appear as scheduled.\n\n“I think everybody would agree that he’s been very cooperative, and he’s actually answering the questions fairly to the best of his ability. He has not taken a pass on pleading the fifth for any questions,” Rep. Robert Garcia, the top Democrat on the Oversight panel, said of Clinton.\n\nRep. James Comer, the Republican chair of the panel, said Clinton flashed “Southern people skills.”\n\n“He’s a charming individual, obviously,” Comer said.\n\nUnlike his wife, who testified on Thursday that shenever metEpstein, Clinton has a documented history of interactions with him and Ghislaine Maxwell – who was convicted in connection with Epstein’s crimes.\n\nThe panel inquired about Clinton’s name appearing in the flight logs of Epstein’s plane, and about Epstein’s name appearing in Clinton’s White House visitors logs, two sources familiar with the testimony told CNN.\n\nClinton voluntarily recounted to the House investigators that Trump told him in the early 2000s at a golf tournament that he had a falling out with Epstein over a land deal, three sources familiar with the testimony told CNN.\n\nTrump said he was no longer friends with Epstein, Clinton recalled, according to those sources. It was the former president who volunteered his recollection of that conversation, one of the sources said.\n\nIn his opening statement, Clinton said that “no matter how many photos you show (him),” it would not change his assertion that he saw nothing wrong and did nothing wrong.\n\nAnd addressing themore than a dozen timeshe traveled with his staffers on Epstein’s private plane between 2001 and 2004, Clinton said: “As someone who grew up in a home with domestic abuse, not only would I not have flown on his plane if I had any inkling of what he was doing—I would have turned him in myself and led the call for justice for his crimes, not sweetheart deals.”\n\nThe former president islistedon a 2025 FBI document that compiled a list of more than a dozen sexual assault allegations, including against Trump, that appear to be unverified.\n\nClinton has never been accused by law enforcement of wrongdoing related to Epstein. His spokesperson has repeatedly stated that Clinton cut ties before the disgraced financier wascharged with soliciting prostitution in 2006and didn’t know about his crimes. Clinton has also denied ever having visited Epstein’s island.\n\nTrump, similarly, has long denied any wrongdoing related to Epstein.\n\nThe president, speaking with reporters in Washington as Clinton’s testimony was underway, expressed wariness over seeing him questioned by lawmakers in a deposition.\n\n“I don’t like seeing him deposed, but you know, they certainly went after me, a lot more than that,” Trump said. “I like him, and I don’t like seeing him deposed.”\n\nClinton ultimately did not address members of the media gathered outside of the Chappaqua Performing Arts Center, as Hillary Clinton had a day prior.\n\nThis story has been updated with additional details.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/politics/hillary-clinton-deposition-epstein-bill",
      "text": "the day before"
    },
    {
      "url": "https://x.com/BillClinton/status/2027582699251048660",
      "text": "video"
    },
    {
      "url": "https://www.cnn.com/2026/02/26/politics/hillary-clinton-deposition-epstein-bill",
      "text": "never met"
    },
    {
      "url": "https://www.cnn.com/2025/08/24/politics/kfile-ghislaine-maxwell-clinton-conference-vis",
      "text": "more than a dozen times"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/epstein-files-release-doj-01-30-26?post-id=cml17hk2q00003b6pj25vyt1l",
      "text": "listed"
    },
    {
      "url": "https://www.cnn.com/2025/08/12/politics/trump-epstein-relationship-timeline-invs-vis",
      "text": "charged with soliciting prostitution in 2006"
    }
  ],
  "hash": "d53c3fa4dc1781f72b5317a4060aaa5b1cd8bec78f4151e2dbe0fc2edd0ed6d0",
  "scraped_at": "2026-02-28T06:58:42.257765+00:00"
}