{
  "url": "https://lite.cnn.com/2026/02/11/australia/austin-appelbee-emergency-call-scli-intl",
  "title": "Australian teen’s emergency call after swimming to rescue family released | CNN",
  "date": "2026-02-11T16:31:23.668171+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAustralian authorities have released a recording of the emergency call made by hero teenAustin Appelbeeafter he swam for hours in rough seas to get help for his family.\n\nAustin, 13, can be heard calmly describing the situation and asking for a helicopter to search for his mother and two siblings in a recording released by the Western Australia Police Force on Wednesday.\n\nThe family had been paddleboarding and kayaking off the coast of Quindalup, Western Australia, on January 30when they were swept out to sea.\n\nAustin swam four kilometers (2.5 miles) to shore and then ran along the beach to reach a phone to call for help.\n\n“Hello, my name is Austin… I have two siblings, Beau and Grace. Beau is 12 and Grace is eight,” he said.\n\n“We got took out to sea and we got lost out there,” added Austin.\n\n“I don’t know what time it was but it was a very long time ago,” he said. “We couldn’t get back to shore and Mum told me to go back to get help.”\n\n“I think they’re kilometres out to sea. I think we need a helicopter to go find them,” said Austin. “I don’t know what their condition is right now, and I’m really scared.”\n\nAustin set out for shore in his kayak, but abandoned it when it started to take on water, leaving him to swim back. Once he reached the beach, he then had to run two kilometers to get to a phone.\n\nThe boy also had the presence of mind to request an ambulance for himself.\n\n“I’m sitting on the beach right now, and I have to also explain – I think I need an ambulance because I think I have hypothermia,” he said.\n\n“I’m extremely tired. I think I have heatstroke, and I feel like I’m about to pass out.”\n\nAustin’s brother and sister were ultimately rescued along with their mother Joanne, 47, after being found clinging to a paddleboard.\n\nSpeaking to CNN affiliate 9News earlier this month, Austin said that thinking of his family drove him on.\n\n“I just said ‘alright. Not today, not today, not today,’” he said. “I had to keep on going.”\n\nThe Western Australia Police Force praised Austin’s actions in astatementWednesday.\n\n“Austin’s ability to think clearly under pressure demonstrates the type of composure that greatly assists first responders during emergencies,” it read.\n\nPolice forward commander acting sergeant Andrew McDonnell said that Austin had helped his family out of an “extremely dire” situation.\n\n“They were in real trouble, and time was absolutely critical given how long they had been in the water and with daylight fading,” he said in the statement.\n\n“What Austin did was nothing short of extraordinary,” added McDonnell. “His bravery and courage in those conditions were remarkable, and his actions were pivotal in bringing about a successful outcome.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/australia/australia-teen-saves-family-scli-intl",
      "text": "Austin Appelbee"
    },
    {
      "url": "https://www.wa.gov.au/government/announcements/emergency-call-quindalup-ocean-rescue",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/australia/austin-appelbee-emergency-call-scli-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/australia/austin-appelbee-emergency-call-scli-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d5a8051390e21b812526b2cfb4eaf93dfbbe4e960680bf86d165b1af94571463",
  "scraped_at": "2026-02-11T16:31:23.668183+00:00"
}