{
  "url": "https://lite.cnn.com/2026/02/11/us/letitia-james-mean-arms-settlement-buffalo-shooting",
  "title": "Letitia James says Mean Arms to pay $1.75 million to Buffalo supermarket shooting victims | CNN",
  "date": "2026-02-12T21:30:49.860692+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nThe maker of a gun accessory tied to aracist shooting that killed 10 Black peopleat a supermarket in Buffalo will pay $1.75 million to survivors and victims’ families and stop selling the device in New York, state Attorney General Letitia James said Wednesday.\n\nThe agreement with Georgia-based Mean Arms settlesa lawsuit filed by Jamesand covers claims from various victims’ families and survivors of the 2022 attack at Tops Friendly Market. They also reached agreements to resolve their own separate suits against gunman Payton Gendron’s family and a gun seller, Vintage Firearms LLC, the plaintiffs’ lawyers announced Wednesday.\n\nThe claims against Mean Arms focused on an item that locks a magazine onto a rifle. The lock is supposed to keep people from swapping in high-capacity magazines, which are illegal in New York.\n\nBut according to James, Gendron easily removed the lock from an AR-15-style rifle and was able to add high-capacity magazines. She also said the company provided step-by-step instructions on the back of its product packaging on how to remove the lock.\n\n“We hope that by holding this manufacturer accountable and banning it from selling this device in New York state, we can offer the people of Buffalo some measure of comfort,” James, a Democrat, said at a news conference in the city.\n\nMessages seeking comment were left for Mean Arms and its attorney.\n\nSome victims’ relatives joined James on Wednesday and said the settlement is a step forward.\n\n“No one should be able to come into a store and, in two minutes, inflict so much damage to a community, to a family, to children,” said Pamela Pritchett, whose mother,Pearl Young, was killed. Young was a 77-year-old Sunday school teacher who ran a food pantry.\n\nEverytown Law, which helped represent some survivors and victims’ relatives, said in a statement that Vintage Firearms has permanently closed and its owner has agreed to refrain from obtaining a federal firearms license in the future. Eric Tirschwell of Everytown Law said its clients’ settlements with Gendron’s parents were confidential.\n\nAttorneys for the gunman’s parents and Vintage Firearms declined to comment.\n\nAuthorities say Gendron, who is white, targeted Tops, a supermarket in a predominantly Black neighborhood, for theattack. The victims ranged in age from 32 to 86 and included a guard, a man shopping for a birthday cake, a grandmother of nine and the mother of a former Buffalo fire commissioner.\n\nGendron is serving a sentence oflife in prisonwithout the possibility of parole afterpleading guilty in November 2022to multiple state charges including murder.\n\nA trial on federal hate crime and weapons countsis expected to begin this year. Gendron haspleaded not guilty. The Justice Department said it wouldseek the death penalty.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2023/02/15/us/buffalo-tops-grocery-shooting-payton-gendron-state-sentencing",
      "text": "racist shooting that killed 10 Black people"
    },
    {
      "url": "https://www.cnn.com/2023/05/11/us/new-york-lawsuit-gun-manufacturing-buffalo-shooting",
      "text": "a lawsuit filed by James"
    },
    {
      "url": "https://www.cnn.com/2022/05/15/us/buffalo-shooting-victims-what-we-know",
      "text": "Pearl Young"
    },
    {
      "url": "https://www.cnn.com/2022/05/14/us/buffalo-ny-supermarket-multiple-shooting",
      "text": "attack"
    },
    {
      "url": "https://www.cnn.com/2023/02/15/us/buffalo-tops-grocery-shooting-payton-gendron-state-sentencing",
      "text": "life in prison"
    },
    {
      "url": "https://www.cnn.com/2022/11/28/us/buffalo-tops-grocery-shooting-payton-gendron-plea/index.html",
      "text": "pleading guilty in November 2022"
    },
    {
      "url": "https://www.cnn.com/2022/12/09/us/buffalo-tops-grocery-shooting-payton-gendron-plea/index.html",
      "text": "is expected to begin this year"
    },
    {
      "url": "https://www.cnn.com/2022/07/18/us/buffalo-shooting-federal-not-guilty/index.html",
      "text": "pleaded not guilty"
    },
    {
      "url": "https://www.cnn.com/2024/01/12/us/buffalo-mass-shooter-death-penalty",
      "text": "seek the death penalty"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/letitia-james-mean-arms-settlement-buffalo-shooting",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/us/letitia-james-mean-arms-settlement-buffalo-shooting",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d5ac3eb07c06fe2f956c5785c28227ff6d31470b93386cda6ec10bfa2d26e767",
  "scraped_at": "2026-02-12T21:30:49.860707+00:00"
}