{
  "url": "https://lite.cnn.com/2026/02/20/food/topo-chico-us-shortage-supply-issues",
  "title": "America is running out of Topo Chico mineral water | CNN Business",
  "date": "2026-02-21T07:04:48.574160+00:00",
  "authors": [
    "Jordan Valinsky, CNN"
  ],
  "text": "Source: CNN\n\nAttention, Topo Chico fans: Brace yourself for a possible shortage that could stretch into the summer.\n\nCoca-Cola, which owns the carbonated mineral water brand, said the flagship product sold in glass bottles is “temporarily unavailable” in the United States because of “facility upgrades at the water source and production facilities in Mexico,” a spokesperson told CNN.\n\nProduction has slowed over the past two months because of problems with the wells in Monterrey, Mexico, that source the water, according to a letter sent by Coca-Cola to distributors and seen by CNN.\n\nThe company said in the letter that it recently “identified additional challenges in the source wells, including quality issues related to the source’s geology” resulting in the temporary stoppage of orders.\n\n“We are now making further investments at the source to improve source stability and quality and enable increased production, requiring us to temporarily stop production,” Coca-Cola said in the letter.\n\nA Coca-Cola spokesperson told CNN the product will be “back later this year,” with the letter stating the product likely won’t return until the third quarter.\n\nThe problem only affects the recognizable Topo Chico Mineral Water product, with other drinks — such as flavored sparkling water called Topo ChicoSaboresand canned cocktails — still available.\n\nCoca-Cola bought Topo Chico in 2017 for $200 million and premium water is akey part of its businessas drinkers shift away from sugary sodas. Water salesjumped 4%in its most recent quarter, partly driven by growth in North America.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.coca-cola.com/us/en/brands/topo-chico/products/sabores",
      "text": "Sabores"
    },
    {
      "url": "https://www.cnn.com/2025/06/17/food/coca-colas-smartwater-jennifer-aniston",
      "text": "key part of its business"
    },
    {
      "url": "https://www.coca-colacompany.com/media-center/coca-cola-reports-fourth-quarter-and-full-year-2025-results",
      "text": "jumped 4%"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/food/topo-chico-us-shortage-supply-issues",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/food/topo-chico-us-shortage-supply-issues",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d5db8f8c9e8015537f1475c56a891914ed53f49d124879b510b7ce88a1ed7135",
  "scraped_at": "2026-02-21T07:04:48.574172+00:00"
}