{
  "url": "https://lite.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
  "title": "Rescuers save 6 skiers trapped in California avalanche, at least 9 more missing | CNN",
  "date": "2026-02-18T07:30:59.606779+00:00",
  "authors": [
    "Associated Press, CNN Staff"
  ],
  "text": "Source: AP\n\nRescue crews on skis and snowcats battled blizzard conditions to save six backcountry skiers trapped Tuesday after an avalanche high in the rugged Northern California mountains that left at least 9 others missing as the danger of more slides remained high.\n\nThe six skiers who survived the avalanche were rescued Tuesday evening “with varying injuries,” the Nevada County Sheriff’s Office told CNN. “Due to extreme weather conditions, it took several hours for rescue personnel to safely reach the skiers and transport them to safety.”\n\nTwo of the six have been transported to hospital, and the search is ongoing for the other skiers still missing, the sheriff’s office said.\n\nSearch and rescue crews were dispatched to Frog Lake in the Castle Peak area, northwest of Lake Tahoe, after someone called 911 at about 11:30 a.m. to report an avalanche with people buried as a powerful winter storm moved through the state.\n\nHours later, Ashley Quadros, a spokesperson with the Nevada County Sheriff’s Office, said six skiers had been located and were asked to shelter in place “as best they can” until they could be reached.\n\nThe group was on the last day of a three-day backcountry skiing trip, said Steve Reynaud, a Tahoe National Forest avalanche forecaster with the Sierra Avalanche Center. Reynaud said his group has had contact with people on the ground in the area. He said the skiers had spent two nights at huts on a trip that required navigating “rugged mountainous terrain” on backcountry skis for up to 4 miles and bringing along all food and supplies.\n\nNevada County Sheriff Capt. Russell Greene said authorities were notified about the avalanche by the ski tour company that took the group to Castle Peak and by emergency beacons the skiers were carrying.\n\nThe skiers were in communication with officials through their emergency beacons, which can send texts, Greene toldKCRA, as rescue teams made their way to the group cautiously due to the high danger of triggering more avalanches.\n\n“We have brought in snowcats. We have snowmobiles on standby. We have individuals on skis. We have several different ways that people are attempting to get there,” he said. “It’s just going to be a slow, tedious process.”\n\nThe company leading the trip, Blackbird Mountain Guides, said in a statement on its website that it was coordinating with authorities on the rescue operation. It said 12 clients and four guides were in the group.\n\nThe sheriff’s office revised this in its update Tuesday, saying the group comprised of 15 people, including guides. CNN has reached out to Blackbird Mountain Guides for clarification.\n\nCalifornia is being walloped this week by a powerful winter storm bringing treacherous thunderstorms, high winds and heavy snow in mountain areas.\n\n“It’s particularly dangerous in the backcountry right now just because we’re at the height of the storm,” said Brandon Schwartz, Tahoe National Forest lead avalanche forecaster at the Sierra Avalanche Center based in Truckee.\n\nThe center issued an avalanche warning for the area in the Central Sierra Nevada, including the Greater Lake Tahoe region, starting at 5 a.m. Tuesday with large slides expected into Wednesday.\n\nThe dangerous conditions were caused by rapidly accumulating snowfall piling on fragile snowpack layers coupled with gale-force winds.\n\nSeveral ski resorts around Lake Tahoe were fully or partially closed due to the extreme weather. The resorts along highways have avalanche mitigation programs and were not expected to be at as high of a risk as the backcountry where travel in, near or below the avalanche terrain was strongly discouraged, the center said.\n\nCastle Peak, a 9,110-foot peak in the Donner Summit area of the Sierra Nevada, is a popular backcountry skiing destination. Donner Summit, which can be perilous in snow, is named for the infamous Donner Party, a group of pioneers who resorted to cannibalism after getting trapped there in the winter of 1846-1847.\n\nTraining in avalanche assessment and rescue and safety equipment is highly recommended for backcountry skiing, also known as off-piste skiing, which draws people wanting to glide deep into the wilderness far outside the confines of a resort’s boundaries. Backcountry skis are wider, heavier and have other features to handle going up and down ungroomed terrain, unlike cross-country skis, which are narrower and designed for flat, more groomed trails.\n\nIn the nearby town of Soda Springs, at least 30 inches of snow had fallen in the last 24 hours, according to the Soda Springs Mountain Resort.\n\nForecasters said the western slope of the Sierra Nevada in northern Shasta County — including portions of Interstate 5 — and parts of the state’s Pacific Coast Range could see up to 8 feet of snow before the storm moves through late Wednesday.\n\nThe storm wreaked havoc on roadways spanning from Sonoma County to the Sierra Nevada. Traffic was halted temporarily in both directions on I-80 near the Nevada state line due to spinouts and crashes, the California Department of Transportation reported.\n\nIn January, an avalanche in the region buried a snowmobiler in snow and killed him, authorities said. Each winter, 25 to 30 people die in avalanches in the US, according to the National Avalanche Center.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.kcra.com/",
      "text": "KCRA"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/us/castle-peak-avalanche-california-skiers",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d610bdebd6c16b273c89479690d657563d6e8f4073253c3ca52c4b5b8ea617ff",
  "scraped_at": "2026-02-18T07:30:59.606792+00:00"
}