{
  "url": "https://lite.cnn.com/2026/02/13/health/rfk-aides-jim-oneill-hhs-cdc",
  "title": "Two top aides to RFK Jr. leaving HHS as part of leadership shakeup | CNN",
  "date": "2026-02-14T07:07:48.990078+00:00",
  "authors": [],
  "text": "Source: CNN\n\nTwo top aides to Robert F. Kennedy Jr. are leaving the US Department of Health and Human Services, according to three people familiar with the moves.\n\nHHSDeputy Secretary Jim O’NeillandGeneral Counsel Mike Stuartare expected to soon leave HHS as part of a broader restructuring at the agency ahead of the midterm elections. Trump administration officials have discussed offering them other positions in the government, two people said.\n\nO’Neill, who is second-in-command behindSecretary Robert F. Kennedy Jr.at HHS and the interim leader of the US Centers for Disease Control and Prevention, has been a controversial figure at the agency, where he helped to amplify anti-vaccine messaging and concerns about Medicaid fraud, and cheered the United States’departurefrom the World Health Organization.\n\nWithin the administration, O’Neill was viewed as a shaky public communicator who had struggled to find his fit within the department, one of the people familiar with the matter said.\n\nHHS did not immediately comment. The White House did not respond to a request for comment. Politico first reported the planned departures.\n\nAlthough he doesn’t have any formal medical or public health background, O’Neill was named acting director at the CDC after the ouster of Dr. Susan Monarez in late August.  Before coming to HHS, O’Neill was CEO of the Thiel Foundation and an investment manager at Clarium Capital.  He previously served at HHS under President George W. Bush.\n\nO’Neill seldom visited the CDC, according to former agency leaders who declined to be named because they weren’t authorized to comment on the situation. HHS did not immediately comment on his level of engagement at the agency.\n\nO’Neill’s planned departure comes amid abroader shakeupat the top-most levels of HHS spurred by Trump officials’ desire to better focus the department’s policy priorities and improve its public messaging.\n\nThe White House is planning to make health care a central element of its midterm strategy in the coming months, touting its efforts to cut drug prices and encourage healthier eating while also making another run at passing sweeping legislation aimed at cutting health costs.\n\nTo advance that mission, White House and health officials in recent weeks decided to elevate four staffers well-regarded by senior Trump aides — including naming Medicare head Chris Klomp the new chief counselor at HHS. Klomp, who was central to the administration’s drug price initiative, is expected to run the daily operations at HHS and serve as the department’s de facto chief of staff.\n\nThis is a breaking news story.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.hhs.gov/about/leadership/jim-oneill.html",
      "text": "Deputy Secretary Jim O’Neill"
    },
    {
      "url": "https://www.hhs.gov/about/leadership/mike-stuart.html",
      "text": "General Counsel Mike Stuart"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/health/rfk-jr-american-healthcare-public-trust",
      "text": "Secretary Robert F. Kennedy Jr."
    },
    {
      "url": "https://www.cnn.com/2026/01/22/health/who-us-split",
      "text": "departure"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kennedy-hhs-change-control-vaccine",
      "text": "broader shakeup"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/health/rfk-aides-jim-oneill-hhs-cdc",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/health/rfk-aides-jim-oneill-hhs-cdc",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d6787606376f48e6fbf5b986105b35def8c7f60149420eb8e65711b413305db0",
  "scraped_at": "2026-02-14T07:07:48.990090+00:00"
}