{
  "url": "https://lite.cnn.com/2026/02/15/americas/venezuela-edmundo-gonzalez-opposition-intl-latam",
  "title": "Venezuela’s quiet opposition leader: Why Edmundo González is on the sidelines of a power struggle | CNN",
  "date": "2026-02-16T07:34:15.778739+00:00",
  "authors": [],
  "text": "In the weeks following the US military capture ofVenezuelan President Nicolás Maduro, the world’s attention turned to who was best placed to run a country that had spent 13 years under his authoritarian regime.\n\nSince Maduro’s unceremonious ouster at the hands of US special forces on January 3, the right to succeed him has been claimed by: Delcy Rodríguez, Maduro’s former deputy, currently sworn in as acting president with the apparent support of US President Donald Trump; Trump himself, who has previously claimed to be“in charge” of Venezuela; and the Venezuelan opposition, with leader María Corina Machado saying last month that her coalition should lead the country. Machado won the 2025 Nobel Peace Prize for fighting a tumultuous election that landed her at the top of Maduro’s most-wanted list.\n\nYet one key voice has been absent from the center stage:Edmundo González Urrutia– the man who stood in for Machado in the 2024 presidential election after she was barred from entering and who, according to both the opposition and several Western nations including the United States, actuallywon the vote.\n\nSince that disputed election, Machado’s international profile has skyrocketed – thanks not only to her daring escape from Venezuela when she traveled to Norway to collect her Nobel Prize, but her subsequentgifting of the awardto Trump when she met him at the White House in January. She is the one who has been engaging directly with US officials as the opposition tries to secure its position in post-Maduro Venezuela.\n\nGonzález, meanwhile, has stayed largely out of public view altogether. So, what happened to him?\n\nLiving in exile in Spain since late 2024, González has remained largely quiet since the US operation that ousted Maduro. He released astatementthe day after the attack — when Machado was still silent — saying the moment was “an important step, but not enough” and calling for the release of political prisoners.\n\nSince then, he hasn’t said much on the power transitions in Venezuela, instead focusing on the freeing of those prisoners – a matter close to his heart as his son-in-law, Rafael Tudares, was arrested and sentenced to 30 years in prison by Venezuelan authorities during Maduro’s presidency.\n\nFollowingTudares’ releasealongside dozens of other political prisoners, on the orders of Rodríguez in what the Venezuelan government said was a “peace” gesture, González made one of his few public comments on the 2024 election in an interview with Fox Noticias, in which he said, “More than 7 million Venezuelans voted for our candidacy, and it is from that reality that the process of democratic normalization in Venezuela must begin.”\n\nThat aside, since the election, he has been a man of few words – as, indeed, he always has been.\n\nA retired diplomat who served as Venezuela’s ambassador to Algeria and Argentina, he is far more comfortable negotiating behind the scenes. In fact, he was not the first, second, or even third choice of the opposition coalition known as the Democratic Unitary Platform. After the Maduro regime barred Machado, both academic Corina Yoris and former presidential candidate Manuel Rosales were considered as possible replacements.\n\nGonzález became the last resort for the opposition to submit a ballot within the electoral deadline.\n\n“The fact that he’s had this low profile has been actually a very positive thing for the opposition. And it’s why he was chosen, because he wasn’t polarizing, and he was much less likely to be blocked,” said Inter-American Dialogue President and CEO Rebecca Bill Chavez. “It was a quality that helped the opposition. But it’s also one of the reasons why he’s less visible today.”\n\nThose close to González’s circle know he never really wanted the presidency – as he himself has acknowledged on many occasions. “I never imagined I would find myself in this situation,” he told Venezuelan media in late April of 2024,shortly after his candidature was formalized.\n\nIt was shortly after that comment that a portrait by Bloomberg photographer Gaby Oraa went viral, showing him feeding wild colorful macaws known in Venezuela asguacamayas. And so, the last hope for the opposition quickly became the image of a beloved grandfather for voters.\n\nExperts say there is a political strategy behind González staying on the sidelines. “Political movements, in general, tend to project one clear political voice. And right now, it’s Machado,” said Chavez.\n\n“The fact that she won the Nobel Prize is a big piece of it. At the same time, I think it’s important to recognize that he is central to the opposition’s democratic legitimacy. He’s the one who holds the electoral mandate.”\n\nThat thinking is presumably why Machado so often uses “we” in her statements, though that is not enough to stop some voters from wondering why they hear so little from the man they consider the true president-elect.\n\nAnd it’s not just that González is so quiet, it’s that even the key players sometimes act as if he doesn’t exist. Take Trump, for instance. The US president has had plenty to say about both Rodríguez and Machado – from claiming the Nobel laureate wasn’t “respected” enough in Venezuela to assume power, to saying later in January thathe was considering involvingthe Venezuelan opposition “in some way” in the country’s leadership.\n\nBut Trump has been remarkably quiet about González, and it remains unclear what the next steps in the transition in Venezuela will be. In an interview withNBC Newsreleased on February 12, Rodríguez said Venezuela will have “fair and free” elections but did not provide timeline.\n\nDespite González’s own seeming preference to stay away from the spotlight, the choice comes with a price.\n\n“The opposition has basically been divided for about a couple of decades into two groups. The essential difference has not been ideological; it’s been over strategy,” Venezuela analyst for the International Crisis Group Phil Gunson, who has been living in Caracas for over two decades and knows González personally, told CNN.\n\nThose who are more hardline, such as Machado, believe in more aggressive political action – such as mass mobilization and protests – and have less faith in elections, while moderates like González lean toward taking advantage of any political openings that exist, including elections.\n\n“Politically, Edmundo is moderate. He doesn’t belong to the same part of the opposition as (Machado),” Gunson said. After González went into exile and Machado went into hiding following the 2024 vote, that relationship became more complicated.\n\n“She’s the one making all the decisions. She’s the one giving the orders. She’s the one putting out the statements. And often, she’s putting out statements in his name or in the name of the two of them, and he finds out after these statements have come out,” Gunson said. “She is rather autocratic in her political style.”\n\nAccording to Gunson, who used to be neighbors with González, Machado likes to have all the decisions made by her and her close circle. “And (González) is just not part of the close circle,” he told CNN.\n\nIn Washington, where Machado is well known on both sides of the political aisle, the official information center for Venezuela carries the names of both Machado and González. “They claim to be representing him, but they’re not. They don’t consult him,” Gunson said.\n\nMeanwhile, halfway across the world, in Madrid, González is surrounded by many Venezuelan exiles who want more aggressive political action. “His position is not comfortable,” Gunson said. “He’s geographically isolated from the decision-making. He’s very much kind of a prisoner of the sort of things that (Machado) says.”\n\nFor Gunson, that dynamic is unlikely to change. As someone who never really wanted the presidency in the first place, González finds himself quietly playing the role that was assigned to him: the figurehead who gives the opposition a sense of legitimacy.\n\n“We should see this as a sacrifice that he’s made because he felt that it was his duty to do that,” Gunson said.\n\n“But even now, he probably doesn’t dream of ever becoming president.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/americas/venezuela-maduro-fort-tiuna-compound-operation-reconstruction-intl-invs",
      "text": "Venezuelan President Nicolás Maduro"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/politics/venezuela-what-to-know-monday",
      "text": "“in charge” of Venezuela"
    },
    {
      "url": "https://www.cnn.com/2024/11/19/americas/venezuela-gonzalez-president-elect-intl-latam",
      "text": "Edmundo González Urrutia"
    },
    {
      "url": "https://www.cnn.com/2024/08/09/americas/venezuela-election-results-experts-improbability-intl-latam",
      "text": "won the vote"
    },
    {
      "url": "https://www.cnn.com/2026/01/15/americas/venezuela-machado-trump-meeting-nobel-intl-hnk",
      "text": "gifting of the award"
    },
    {
      "url": "https://www.instagram.com/reels/DTGtfi6CLg2/",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/americas/venezuela-oil-law-reform-delcy-trump-latam-intl",
      "text": "Tudares’ release"
    },
    {
      "url": "https://www.cnn.com/2024/06/08/americas/edmundo-gonzalez-venezuela-profile-intl-latam",
      "text": "shortly after his candidature was formalized"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/americas/venezuela-month-after-maduro-capture-latam-intl",
      "text": "he was considering involving"
    },
    {
      "url": "https://www.youtube.com/watch?v=Dex_nSM4SIM",
      "text": "NBC News"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/americas/venezuela-edmundo-gonzalez-opposition-intl-latam",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/americas/venezuela-edmundo-gonzalez-opposition-intl-latam",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d6b9e8b4fb05d522ba4277b21c4fdb15fa99c135ff7f6760fdb6d2dc45690b74",
  "scraped_at": "2026-02-16T07:34:15.778755+00:00"
}