{
  "url": "https://lite.cnn.com/2026/02/09/uk/william-kate-epstein-revelations-intl",
  "title": "Prince William and Kate ‘deeply concerned’ by Epstein revelations | CNN",
  "date": "2026-02-11T16:33:17.359692+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Prince and Princess of Wales have been “deeply concerned” by revelations from thetrove of new documentsrelated to Jeffrey Epstein released by the US Justice Department, a Kensington Palace spokesperson has said.\n\nSpeaking to journalists in Riyadh ahead of Prince William’s visit to Saudi Arabia later Monday, the spokesperson shared for the first time the couple’s view of the crisis that hasengulfed the palace and UK parliamentin recent weeks.\n\nThe palace spokesperson said: “I can confirm The Prince and Princess have been deeply concerned by the continuing revelations.”\n\n“Their thoughts remain focused on the victims.”\n\nPrince Williamis traveling to Saudi Arabia for a three-day tour. The visit was already a diplomatic test for the prince, involving a meeting with the crown prince and de facto Saudi ruler, Mohammed bin Salman (MBS).\n\nSaudi Arabia is one of the UK’s key Middle East allies and the British government has been strengthening ties, with recent visits by the chancellor and foreign secretary.\n\nBut many others have expressed concerns over the country’s human rights record, while MBS is a controversial figure whose reputation was further damaged after aUS intelligence report foundthat he ordered the 2018 killing of journalist Jamal Khashoggi.\n\nWithin the US Justice Department’s recent disclosures is a photograph of MBS with his arm around the late sex offender.\n\nThe image was shared in a group text exchange, which took place in 2016 between Epstein, a recipient labeled as “Terje” and an unnamed sender, according to the files.\n\nIn the photograph, both men are smiling in an ornate room with portraits and a flag in the background. It is not clear from the exchange when or where the image was taken or by whom; nor does it suggest any wrongdoing.\n\nSeparately, Epstein referenced a meeting with MBS on September 30, 2018, two days before Khashoggi’s killing at the Saudi consulate in Istanbul, Turkey. Epstein emailed Anas-Al Rasheed, the former Kuwaiti information minister and professor, “the meeting today with mbs, helpful.”\n\nAndrew Mountbatten-Windsor, brother of King Charles and uncle of Prince William, is among several prominent figures in British public life who has faced renewed scrutiny over his ties to the late sex offender.\n\nIn the latest development in the saga swirling around the royal, British police told CNN on Monday they were “assessing” claims Mountbatten-Windsorshared confidential reports with Epsteinduring his tenure as UK trade envoy.\n\nMountbatten-Windsor has previously repeatedly denied any wrongdoing over his ties to Epstein. He has not publicly responded to the latest allegations. CNN has contacted him for comment.\n\nWilliam’s role this week will be to further strengthen relations between the two nations without getting involved in politics. But he’s also facing unavoidable questions about the former Prince Andrew following therecent disclosuresof the Epstein files.\n\nHis spokesperson’s statement Monday, just hours before the trip began, suggests William is hoping to deal with the questions swirling around his uncle that have eclipsed much of the royal family’s recent work, allowing him to focus on the primary role of the visit.\n\nMountbatten-Windsor’s relationship with Epsteincost him his rolein the royal family, with King Charles in October taking the extraordinary step of stripping him of his titles and his home.\n\nThe former princemoved outof Royal Lodge, his longtime Windsor home, last week and is now reportedly staying in a temporary property at Sandrin﻿gham. He has not commented on the latest release of documents but has previously apologized for his links to Epstein and denied any wrongdoing.\n\nThe Kensington Palace spokesperson on Monday alsomade it clear that William and Kate supported King Charles’ actions to remove Mounbatten-Windsor’s titles and honors last year.\n\nBuckingham Palace released a statement in October that said: “Prince Andrew will now be known as Andrew Mountbatten Windsor. His lease on Royal Lodge has, to date, provided him with legal protection to continue in residence. Formal notice has now been served to surrender the lease and he will move to alternative private accommodation. These censures are deemed necessary, notwithstanding the fact that he continues to deny the allegations against him.”\n\nIt continued: “Their Majesties wish to make clear that their thoughts and utmost sympathies have been, and will remain with, the victims and survivors of any and all forms of abuse.”\n\nIn his role as heir to the throne, Prince William would have been consulted on that statement at the time.\n\nThe recent tranche of documents released by the US Department of Justice has once again reignited pressure on Mountbatten-Windsor.\n\nAmong the millions of documents arephotographsthat appear to show the disgraced royal kneeling over a woman whose face has been redacted. It is unclear when or where the images were taken; no captions or context for the photographs were provided with the document release.\n\nSeparately, an email found in the DOJ release appears toconfirm the authenticityof a photograph of Mountbatten-Windsor with his arm around the waist of Virginia Giuffre, one of the most prominent victims of Epstein’s sex trafficking ring, who alleged the royal abused her when she was a teenager.\n\nMountbatten-Windsor has previously denied all of Giuffre’s accusations and says he does not recall ever meeting her. He also previously questioned whether the now-infamous photo had been doctored. In 2022, he reached a settlement with Giuffre, settling a sex abuse lawsuit. While he didn’t admit wrongdoing, the former prince did acknowledge Giuffre’s suffering as a victim of sex trafficking.\n\nMeanwhile, Thames Valley Police confirmed last week that it was assessing allegations, first reported by the BBC, that a second woman has claimed that she was trafficked by Epstein to the UK for a sexual encounter with Mountbatten-Windsor in 2010.\n\nThe police said in a statement sent to CNN: “We are aware of reports about a woman said to have been taken to an address in Windsor in 2010 for sexual purposes.”\n\n“We are assessing the information in line with our established procedures.”\n\nIt continued, “We take any reports of sexual crimes extremely seriously and encourage anyone with information to come forward. At this time, these allegations have not been reported to Thames Valley Police by either the lawyer or their client.”\n\nThe police statement came after theBBC reportedlast month that an encounter allegedly occurred at Mountbatten-Windsor’s former residence on the Windsor estate when the woman was in her 20s.\n\nThe woman’s lawyer, Brad Edwards, told the BBC that after spending the night with him, the woman – who was not British – said she was then given a tour of Buckingham Palace. CNN has contacted Edwards for comment.\n\nLast week, the Duke of Edinburgh became the first royal to speak publicly on the Epstein documents. Hetold CNN’s Eleni Giokosthat it was “really important always to remember the victims” after being asked how he was “coping” since the latest release of Epstein documents.\n\nThis story has been updated with additional developments.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/epstein-files-musk-lutnick-branson-emails",
      "text": "trove of new documents"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "engulfed the palace and UK parliament"
    },
    {
      "url": "https://www.cnn.com/2013/02/08/europe/prince-william-fast-facts",
      "text": "Prince William"
    },
    {
      "url": "https://www.cnn.com/2021/02/26/politics/biden-administration-khashoggi-report",
      "text": "US intelligence report found"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/world/andrew-virginia-giuffre-photo-intl",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/andrew-mountbatten-police-epstein-trade-intl",
      "text": "shared confidential reports with Epstein"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/world/andrew-virginia-giuffre-photo-intl",
      "text": "recent disclosures"
    },
    {
      "url": "https://www.cnn.com/2025/10/30/europe/prince-andrew-title-and-honors-remove-latam-intl",
      "text": "cost him his role"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/europe/andrew-mountbatten-windsor-moves-royals-epstein-intl-hnk",
      "text": "moved out"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/uk/andrew-mountbatten-windsor-epstein-files-pictures-intl-gbr",
      "text": "photographs"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/world/andrew-virginia-giuffre-photo-intl",
      "text": "confirm the authenticity"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/clymxxlm3xzo",
      "text": "BBC reported"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/world/video/victims-epstein-prince-edward-digvids-intldsk",
      "text": "told CNN’s Eleni Giokos"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/uk/william-kate-epstein-revelations-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/uk/william-kate-epstein-revelations-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d75abd76588257f330a754602dfef67ecb3f3ecd19e1ea392294b153970d7c72",
  "scraped_at": "2026-02-11T16:33:17.359705+00:00"
}