{
  "url": "https://lite.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
  "title": "2020 election deniers drove the FBI’s seizures of Fulton County ballots, new documents show | CNN Politics",
  "date": "2026-02-11T16:39:14.973143+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nNewly unsealed court documents reveal that longtime skeptics of the 2020 election results played a key role in the sweeping search warrant the FBI obtained to seize ballots and other materials from Fulton County, Georgia — a major target of President Donald Trump’s attempts to overturn his defeat.\n\nThe FBI’s investigation “originated from a referral sent by Kurt Olsen, Presidentially appointed Director of Election Security and Integrity,” according to an affidavit that the FBI filed with a search warrant application thatwas made public on Tuesday.\n\nBefore his current role, Olsen was involved in the legal efforts to reverse Trump’s 2020 defeat to Joe Biden.\n\nThe affidavit is built around allegations of election fraud that have long circulated in far-right circles. The warrant application leaned on theories of missing ballot images or other alleged discrepancies in the count that have previously been touted by conservative researchers, some with only limited experience in election administration.\n\nNotably, it does not describe any claims of foreign interference; the absence of such evidence will likely raise further questions about the presence of Director of National Intelligence Tulsi Gabbard at the search.\n\nThe FBI’s affidavit said that it needed to seize the ballots to “corroborate the analysis that evinces that election records were destroyed and or the tabulation of votes included materially false votes, either through duplicated scanning of specific ballots, interjection of pristine ballots, or other methods described above.”\n\nGeorgia election officials have repeatedly attested to the integrity of Georgia’s 2020 election, which was vetted with an audit and a hand recount. Some of the alleged “deficiencies or defects” in the count that the FBI is now probing appear to be the result of administrative error that has already been scrutinized and found to have not affected the results of the presidential race.\n\nAmong the FBI’s witnesses in the current probe was a Georgia resident and chemical engineer who filed a 2022 complaint with the State Board of Elections alleging that “extra” ballots were injected into the absentee ballot count. Other witnesses include Republican-appointed, Trump-aligned members of the Georgia State Board of Elections who described missing ballot images in Fulton County’s records. The affidavit also lays out concerns about missing tabulator tape — which is a recording from each voting machine of the vote tally once that machine is closed.\n\nHowever, theFBI affidavit also characterizes assertions by Georgia election officials who cast doubt that the alleged discrepancies amounted to a flawed final count. For instance, former Georgia Election Director Chris Harvey, a witness described in the affidavit, “said during the hand count, they did not audit for issues like image discrepancies” and that, during an audit, the “concern is less about the images and more about the ballots and voter count.”\n\nLikewise, a former investigator for the Georgia Secretary of State’s offices said, according to the affidavit, that tabulator tapes were not relevant to the recount Georgia undertook that confirmed 2020 results, since the underlying ballots were what ultimately mattered in the recount.\n\nGeorgia Secretary of State Brad Raffensperger blasted the investigation. “Instead of wasting time and tax dollars trying to change the past with baseless and repackaged claims, let’s focus our efforts on building a safer, more affordable future for all hardworking Georgians,” he said in a statement.\n\nRaffensperger, who famously rebuffedTrump’s demands to “find” the votesneeded to overturn his 2020 loss in the state, is seeking the Republican nomination for governor this year.\n\nThe affidavit was unsealed as part of a lawsuit Fulton County officials have filed seeking the return of the ballot materials. The FBI says it’s investigating violations of a law requiring that election officials retain materials for 22 months after an election, as well as another law that criminalizes the false tabulation of ballots.\n\nThe FBI’s seizure of 2020 election materials in Georgia – along with the president’s recent calls to “nationalize” voting – has fueled concerns among some state election officials offederal intrusionin this year’s midterms.\n\nThe administration has actively sought to play a role in election functions reserved for state and local officials, including a massive drive by Trump’s Justice Department to gain access to each state’s complete voter rolls, including private information such as partial Social Security numbers and dates of birth.\n\nOn Tuesday, a federal judge rejected an administration lawsuit demanding Michigan’s voter lists, becoming the fourth judge to rule against the administration’s voter-roll quests in recent weeks.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.documentcloud.org/documents/26927587-warrant-affidavit-for-fulton-county-ballots/",
      "text": "was made public on Tuesday."
    },
    {
      "url": "https://www.cnn.com/2021/01/03/politics/trump-brad-raffensperger-phone-call-transcript/index.html",
      "text": "Trump’s demands to “find” the votes"
    },
    {
      "url": "https://www.cnn.com/2026/01/31/politics/trump-elections-midterms-democrats-secretaries-of-state",
      "text": "federal intrusion"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d7aacd869f58e3ad0a0cc672121fe10c0ccee6299045c2fc72f3cf75fd2617cc",
  "scraped_at": "2026-02-11T16:39:14.973154+00:00"
}