{
  "url": "https://lite.cnn.com/2026/02/20/style/melania-trump-inauguration-gown-smithsonian",
  "title": "Melania Trump wants to look perfect | CNN",
  "date": "2026-02-23T07:37:40.160316+00:00",
  "authors": [
    "Rachel Tashjian, CNN"
  ],
  "text": "Source: CNN\n\nFirst Lady Melania Trump stood in front of reporters, supporters and colleagues at the Smithsonian’s National Museum of American History on Friday in an ensemble of frosty wealth essentials – a Bottega Veneta peacoat, leather leggings and Christian Louboutin snakeskin heels – and extolled the virtues of a slash of black fabric that zigzagged across the white column gown she wore for her husband’s second inauguration as president, just over a year ago.\n\nThis was no mere ruffle or adornment; it was a black silk gazar summation of her biography, as imagined by her longtime stylist, designer Herve Pierre. “The meticulously formed black shape ‘Z’ on the front bodice summons decades of my early memories, life experiences, and influences,” she said. “And all of these stories are tucked deep within its crisp, strong seams — forever.”\n\nTrump was there to celebrate the addition of her gown to the collection of the Smithsonian National Museum of American History’s First Ladies Collection – a tradition that dates back over 100 years and has resulted in one of the museum’s most popular exhibitions.  The museum’s director Anthea Hartig praised the historic nature of the moment, which she said would “help pave a new path as Mrs. Trump becomes the only modern first lady to serve two nonconsecutive terms,” sentiments the museum’s secretary, Dr. Lonnie G. Bunch III, echoed. “This is really a milestone in its own right — the first First Lady to be represented by two inaugural gowns in the more than 100 years of this museum.”\n\n(Unsurprisingly, President Donald Trump’s recurring fisticuffs with the Smithsonian, which led to theremovalof text mentioning the president’s two impeachments from the National Portrait Gallery, and to artist Amy Sheraldcancelinga retrospective in fear of censorship, went unmentioned.)\n\nSince Helen Taft first donated her 1909 inauguration gown to the museum in 1912, the Smithsonian has assembled more than two dozen dresses, among other pieces, from first ladies’ wardrobes. Bunch called the first ladies exhibition “as much a timeline on American history as it is a look on fashion.” There is Michelle Obama’s goddess-like 2009 white inauguration gown embellished with flowers, which made previously unknown American designer Jason Wu a fashion star; and the staid velvet and satin blue gown Barbara Bush wore for her husband’s inauguration in 1989, back when designer Arnold Scassi was the go-to society designer for an old money set that treasured looking a bit upholstered. Each of these looks reveals the priorities and ideals of their administration, in their color, mood and silhouette. Time goes on and a sleeve begins to look comically dated and then, a few years later, it is perhaps beautiful again. Like a president’s record, a dress’s meaning becomes more nuanced and reconsidered over the years. We reward ourselves, and our understanding of our past, by reassessing time and time again.\n\nPerhaps no first lady has been as meticulous about her style choices as Melania Trump.   While first ladies tend to demure from too much fashion chatter, lamenting the public focus on something so artificial, Trump has viewed it as, if not one of her most powerful tools, then her most treasured one. “Personally, I relish the entire design process, from start to finish,” she said on Friday. “It takes time, it’s slow, but the end result is always magical. If you had a chance to see my new film, ‘Melania,’ you are well aware of what it took to bring this technical marvel to life.”\n\nIndeed, the most riveting parts of the otherwise blah “Melania” are the extensive fittings Trump undergoes to ensure the correct cut of her Adam Lippes coat and wide-brimmed hat, and the clean lines of that white and black gown. She is a fashion authoritarian, insisting on an inch more here and less there, a slightly different sash at the neck. Pierre suggests she is so exacting because she was once a model, but there is something beyond a sartorial knowledge earned through relentlessly putting on and taking off clothes. It is a sublime vanity that possesses her and, strangely, allows her to judge her own appearance more harshly than any tailor or wealthy Birkin-ed clothes horse might.\n\nThedefining featureof Trump’s two terms as first lady has been her obfuscation. Why does she wear her hats so low? Why does she sometimes dress in what appears to becostume? What in the world did she mean when she wore thatinfamous Zara fatigue jacketto the southern border? Ironically, Trump on Friday described the design of her inaugural gown as illuminating, almost idealistically simplistic: “The beautiful contrast between black and white sets a mood rich with emotion. American imagination appears in different creative forms, across all types of canvases—and often serves up a clear perspective. This dress speaks with a distinct point of view—a modern silhouette, bold and dignified, and ruthlessly chic.”\n\nWe will never know why Trump makes the choices she does, in style or in public action. But behind all of the smoke and mirrors, her inauguration dress reveals, is a very direct mandate: her wish, above all else, to look exactly as perfect as she wants, all of the time.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/11/politics/smithsonian-removes-trump-impeachments-detail-portrait-exhibition",
      "text": "removal"
    },
    {
      "url": "https://www.cnn.com/2025/07/24/style/artist-amy-sherald-cancels-smithsonian-exhibition",
      "text": "canceling"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/politics/melania-trump-movie-review",
      "text": "defining feature"
    },
    {
      "url": "https://www.cnn.com/2018/10/05/politics/melania-trump-pith-helmet-africa",
      "text": "costume"
    },
    {
      "url": "https://www.cnn.com/2018/06/21/politics/melania-trump-jacket-border-visit",
      "text": "infamous Zara fatigue jacket"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/style/melania-trump-inauguration-gown-smithsonian",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/20/style/melania-trump-inauguration-gown-smithsonian",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d7f737d2ac5355e05501881c4d5c6acf6419fcc39dae3748c78fe7355b6e79f3",
  "scraped_at": "2026-02-23T07:37:40.160330+00:00"
}