{
  "url": "https://lite.cnn.com/2026/02/26/sport/bukayo-saka-arsenal-ambitions-exclusive-soccer",
  "title": "Bukayo Saka: How family, focus and faith fuel Arsenal winger and club’s trophy ambitions | CNN",
  "date": "2026-02-27T07:16:17.498493+00:00",
  "authors": [
    "Aleks Klosok",
    "Amanda Davies"
  ],
  "text": "Source: CNN\n\nArsenal star Bukayo Saka has exclusively toldCNN Sportsthat his side has “the opportunity to make history” after the 24-year-old committed his long-term future to the current Premier League leaders.\n\nThe forward, who joined the club’s academy at the age of eight,recently signed a new five-year dealthat’ll extend his stay in North London until 2030.\n\nHe says the decision to commit long-term was “an easy choice” and one that reaffirms his belief that the Gunners can challenge for and win trophies on a consistent basis.\n\n“The club is going in the right direction, for sure. We have an amazing team and we’re back fighting for every trophy, so no place I’d rather be,” he told CNN Sports in an exclusive interview at the club’s training center.\n\n“To be playing at the highest level, to be playing for Arsenal, this is everything I want.”\n\nSilverware, however, has been in short supply in recent seasons for Arsenal.\n\nThe club’s last taste of major silverware came in 2020 withvictory in the FA Cupagainst Chelsea.\n\nIt was Saka and head coach Mikel Arteta’s first and only major trophy to date with the club, but as the winger says, “When you taste that victory, you just want to do it again and again and again.”\n\nSince then, Arsenal has flirted with a series of agonizing near misses, most notably pipped at the post by Manchester City in the 2022-23 and2023-24 Premier League campaigns.\n\n“It’s not a nice thing. No one’s happy to go through them,” he says.\n\n“What you learn is crucial and you just have to take it into the moment now which we’re in and try and do what we can to not have any miss next time.”\n\nAnd in this moment, Arteta’s side finds itself in contention to win a quadruple this season.\n\nThe Gunners sit five points clear at the top of the Premier League ahead of City and will face Pep Guardiola’s team in the League Cup final in March.\n\nThey’ve also reached the fifth round of the FA Cup and have qualified for the last 16 of the Champions League after finishing the league phase of the competitionwith a 100% win record.\n\n“It’s counterproductive to focus solely on (the Premier League),” he says when asked whether the league,which the club hasn’t won since 2004, is the priority this season.\n\n“You have to do what you can day-to-day because you can’t control the outcome. We’re in control so we’re just looking forward to that.”\n\nSaka’s form in the back end of this season will be integral to his side’s push on all four fronts.\n\nSince making his debut in November 2018, no player in an Arsenal shirt hasprovided more goals or assiststhan the winger.\n\nAnd the England international has been everpresent under Arteta, playing more minutes than any other player since the Spaniard’s appointment in 2019.\n\n“He’s been pivotal for me, crucial in my development,” emphasizes Saka.\n\n“I’ve become a much better player under him. He’s trusted me a lot and I’m very grateful. When people ask me what I want in a coach it’s him.”\n\nCould Saka one day see himself following in Arteta’s footsteps into the world of soccer management?\n\n“No chance,” he says adamantly.\n\n“From being a player to a manager, I think it’s times 10, the demands – and I feel like after playing football, I couldn’t see myself being a manager.”\n\nInjuries have contributed to a stop-start campaign for the England international this season, but his increasing influence on and off the pitch remains telling.\n\nHe’s captained the Gunners 14 times in the Premier League and was a key figure in the England side that reached the semifinals of the 2022 World Cup, as well as back-to-back finals at Euro 2020 and 2024.\n\n“There are different types of captains, some are more vocal, some lead by example. I’ll just be myself,” he explains.\n\n“I don’t think too much about it. If you think about it and you force it, it’s not going to be received well because people can see if you’re not being yourself. I just try and live in the moment … It’s just my instincts.”\n\nThat instinct and determination can, in part, be attributed to Saka’s upbringing.\n\nBorn in London to Nigerian parents, he credits them for imbuing the cultural values of his Yoruba heritage, shaping his character and approach to life and instilling the core values of discipline, humility and courage from an early age.\n\n“Their journey is inspiring,” he says smiling.\n\n“From being in Nigeria to being where we are today as a family… For me, the only explanation is God because it’s not normal.\n\n“It’s like one in a million chance for me to stand here today. I wouldn’t be here without them.”\n\nDuring his interview, Saka reads out a never-before-seen letter, written by his parents and given to him by CNN Sports, to mark the young star’s latest contract with the club.\n\nIn the letter, his parents speak of their “hearts overflowing with pride” at their son’s personal and professional achievements to date, which have “touched millions of hearts around the world.” The letter continues, touching on why, for them, “success is not measured only in achievements but in character.”\n\n“Wow,” he pauses after reading the letter.\n\n“I don’t really see my mom and dad speak with me like this a lot. I’m pretty speechless.\n\n“I don’t feel I’m here alone. I feel they’re right with me, and they always have been, so I’m grateful.\n\n“The reason I have such a connection to the people in this club and the fans is because they appreciate my values … so it started with them.”\n\nSaka says that the support of his family and Arsenal fans “makes you want to give back on the pitch and repay that love.”\n\nThat love was evident in abundance following theonline racial abusedirected at Saka, Marcus Rashford and Jadon Sancho following the Euro 2020 final defeat by Italy.\n\nHe admits, at the time, “it was a tough moment for me … I was on the floor,” but themessages of supportin the form of cards, letters and gifts that followed “lifted me up and helped me to come back and do what I’ve been doing in recent years.”\n\n“Love always wins because, for all the hatred and the negativity, the love that I received overcame everything,” he recalls.\n\nIt’s those ingredients of love and desire that fuel his ambition to go and leave “a legacy” on and off the pitch, not just for this generation, but future ones to come.\n\nAt the same time, he never wants to forget his roots and his parents who made this journey possible for him.\n\n“Thank you for everything, for the sacrifices, for the love, the discipline, for it all,” he says as a message back to his parents.\n\n“I’m forever grateful and I just hope I can continue to make them proud.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/sport",
      "text": "CNN Sports"
    },
    {
      "url": "https://www.arsenal.com/news/bukayo-saka-signs-new-long-term-contract-46329922",
      "text": "recently signed a new five-year deal"
    },
    {
      "url": "https://www.cnn.com/2020/08/01/football/arsenal-chelsea-fa-cup-final-football-spt-intl",
      "text": "victory in the FA Cup"
    },
    {
      "url": "https://www.cnn.com/2024/05/19/sport/manchester-city-wins-premier-league-title-spt-intl",
      "text": "2023-24 Premier League campaigns"
    },
    {
      "url": "https://www.uefa.com/uefachampionsleague/standings/",
      "text": "with a 100% win record"
    },
    {
      "url": "https://www.cnn.com/2004/SPORT/football/05/15/england.saturday/index.html",
      "text": "which the club hasn’t won since 2004"
    },
    {
      "url": "https://www.arsenal.com/news/stats-behind-bukayo-sakas-rise",
      "text": "provided more goals or assists"
    },
    {
      "url": "https://www.cnn.com/2021/07/12/football/england-racist-abuse-bukayo-saka-jadon-sancho-marcus-rashford-euro-2020-final-spt-intl",
      "text": "online racial abuse"
    },
    {
      "url": "https://x.com/Arsenal/status/1422867408386072578?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1422867408386072578%7Ctwgr%5E8395bdab0aba6fdbbde3d2d6ccaae9418d0ea8b3%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.bbc.co.uk%2Fsport%2Ffootball%2F58086692",
      "text": "messages of support"
    }
  ],
  "hash": "d9984413aa38c78933a092b2294df82de111f5a6f725aa0f177a18459d03f92f",
  "scraped_at": "2026-02-27T07:16:17.498507+00:00"
}