{
  "url": "https://lite.cnn.com/2026/02/23/business/peter-attia-resigns-from-cbs-news-following-epstein-backlash",
  "title": "Peter Attia resigns from CBS News following Epstein backlash | CNN Business",
  "date": "2026-02-24T07:31:34.232691+00:00",
  "authors": [
    "Ramishah Maruf",
    "Liam Reilly",
    "CNN"
  ],
  "text": "Source: CNN\n\nCelebrity doctor Peter Attia has resigned from his new contributor position at CBS News following new revelations about his relationship with Jeffrey Epstein.\n\n“Dr. Attia’s contributor role was newly established and had not yet meaningfully begun,” a spokesperson for Attia said in a statement.\n\n“As such, he stepped back to ensure his involvement didn’t become a distraction from the important work being done at CBS. He wishes the network and its leadership well and has no further comment at this time.”\n\nIn the newly released trove of documents from the Epstein files, Attia and the convicted sex offender exchanged lewd and personal messages with each other.\n\nFor example, Attia hadwrittenin 2016, “P*ssy is, indeed, low-carb. Still awaiting results on gluten content, though.”\n\nAttia, an influencer specializing in longevity medicine, was one of19 new contributorsnamed in January as part of Bari Weiss’ new strategy for CBS News.\n\nDuring a January town hall, Weiss teased the new batch of contributors as “just the start,” urging the network “to use them move.” Even as Weiss touted the changes before staffers — her first major move since assuming the reins in October — the executive signaled the need for the Tiffany Network to change.\n\n“Our strategy until now has been to cling to the audience that remains on broadcast television,” she said at the town hall. “If we stick to that strategy, we’re toast.”\n\nEven as Attiaapologizedto his team and patients, Weiss appeared inclined to allow the celebrity doctor to remain on as a network contributor.\n\nHe hadappearedon Weiss’ podcast “Honestly,” before she became head of CBS News. She had said Attia “consistently cuts through all that noise” in the health and wellness industry.\n\nCNN has reached out to CBS News for comment.\n\nAttia’s appearance in the Epstein files garneredfierce backlash from his fans. In a statement on X earlier in February, he said he was not involved in any criminal activity and had never been on the financier’s plane, island or his sex parties. Attia has not been accused of any wrongdoing.\n\n“To be clear, I never witnessed illegal behavior and never saw anyone who appeared underage in his presence,” he wrote.\n\nAttia also stepped down from his role as Chief Science Officer at David protein bars, the company’s CEOsaid on X.\n\nCNN’s Leah Asmelash contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02471177.pdf",
      "text": "written"
    },
    {
      "url": "https://www.cbsnews.com/news/cbs-news-names-new-contributors/",
      "text": "19 new contributors"
    },
    {
      "url": "https://x.com/PeterAttiaMD/status/2018350892395774116",
      "text": "apologized"
    },
    {
      "url": "https://www.thefp.com/p/outlive-living-forever-longevity-peter-attia",
      "text": "appeared"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/us/dr-peter-attia-epstein-files-cec",
      "text": "fierce backlash from his fans"
    },
    {
      "url": "https://x.com/PeterRahal/status/2018536070183575750",
      "text": "said on X"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/business/peter-attia-resigns-from-cbs-news-following-epstein-backlash",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/business/peter-attia-resigns-from-cbs-news-following-epstein-backlash",
      "text": "Cookie Settings"
    }
  ],
  "hash": "d9b78e86bdb2ae7b3324d9ce4cc3e1ffd60410b5fdf9681974fce6e78abb570b",
  "scraped_at": "2026-02-24T07:31:34.232705+00:00"
}