{
  "url": "https://lite.cnn.com/2026/02/22/travel/giant-tortoises-return-galapagos-island-intl",
  "title": "Giant tortoises return to Galapagos island after nearly 150 years | CNN",
  "date": "2026-02-24T07:33:10.889258+00:00",
  "authors": [
    "Story by Associated Press"
  ],
  "text": "Source: AP\n\nNearly 150 years after the last giant tortoises were removed from Floreana Island inEcuador’s Galápagos archipelago, the species made a comeback Friday, when dozens of juvenile hybrids were released to begin restoring the island’s depleted ecosystem.\n\nThe 158 newcomers, aged 8 to 13, have begun exploring the habitat they are destined to reshape over the coming years. Their release was perfectly timed with the arrival of the season’s first winter rains.\n\n“They are large enough to be released and can defend themselves against introduced animals such as rats and cats,” said Fredy Villalba, director of the Galápagos National Park breeding center on Santa Cruz Island, noting that the best specimens with the strongest lineage were selected specifically for Floreana.\n\nThese released juvenile specimens, out of a total of 700 planned for Floreana, will be introduced gradually. According to Christian Sevilla, director of ecosystems of the Galapagos National Park, they carry between 40% and 80% of the genetic makeup of the Chelonoidis niger – a species that has been extinct for 150 years.\n\nThe lineage of these hybrids traces back to Wolf Volcano on Isabela Island, a discovery that still puzzles scientists today. By selecting adults with the strongest genetic makeup, said Sevilla, the breeding program aims to gradually bring the extinct Floreana species back to its former purity.\n\nTwo centuries ago, Floreana was home to approximately 20,000 gianttortoises. However, whaling, a devastating fire, and relentless human exploitation eventually led to their complete extinction on the island.\n\n“In genetic terms, reintroducing a species to that island with a significant genetic component of the original species is vital,” biologist Washington Tapia told The Associated Press.\n\nTapia, a researcher and director of Biodiversa-Consultores – a firm specializing in the Galápagos Islands – emphasized that this process is about more than just numbers; it is about restoring a lost lineage.\n\nFloreana, an island spanning approximately 173 square kilometers (67 square miles), is a volcanic landmass and the southernmost point of the Galápagos archipelago. Situated in the middle of the Pacific Ocean – roughly 1,000 kilometers (621 miles) from the mainland coast – it remains a remote and vital ecological site.\n\nThe tortoises reintroduced to Floreana will share their territory with a diverse population of nearly 200 people alongside flamingos, iguanas, penguins, sea gulls and hawks. However, they must also contend with introduced plant species such as blackberry and guava, as well as animals like rats, cats, pigs and donkeys. These non-native species, introduced by human activity, represent potential threats to the island’s newest inhabitants.\n\nFloreana resident Verónica Mora described the release of the turtles as a dream come true. “We are seeing the reality of a project that began several years ago,” she said, adding that the community feels immense pride in the return of the giant tortoises.\n\nThe United Nations designated the Galápagos Islands as a Natural World Heritage Site in 1978. This honor recognizes the islands’ unique abundance ofterrestrialandmarine speciesfound nowhere else on the planet.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/10/30/science/tomatoes-reverse-evolution-galapagos",
      "text": "Ecuador’s Galápagos archipelago"
    },
    {
      "url": "https://www.cnn.com/2025/11/25/us/galapagos-tortoise-gramma-dies-hnk",
      "text": "tortoises"
    },
    {
      "url": "https://www.cnn.com/travel/article/pink-iguana-galapagos-island-intl-scli-scn",
      "text": "terrestrial"
    },
    {
      "url": "https://www.cnn.com/travel/article/coral-reef-ecuador-galapagos-scli-intl",
      "text": "marine species"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/travel/giant-tortoises-return-galapagos-island-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/travel/giant-tortoises-return-galapagos-island-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "db33c70a165aa8e991ab1ff1d46d157c379d08a27855a8895698a15ab2b7c8f0",
  "scraped_at": "2026-02-24T07:33:10.889272+00:00"
}