{
  "url": "https://lite.cnn.com/2026/02/19/business/walmart-amazon-sales-companies",
  "title": "Amazon overtakes Walmart to lead the world in sales | CNN Business",
  "date": "2026-02-20T07:29:08.235084+00:00",
  "authors": [
    "Nathaniel Meyersohn, CNN"
  ],
  "text": "Source: CNN\n\nAmazon has surpassed Walmart as the world’s largest company, measured by sales, breaking Walmart’s 13-year streak at the top of the list.\n\nAmazon posted $717 billion in sales in 2025. Walmart, the largest company in the world for more than a decade, recorded $713 billion in sales in 2025, the retailer announced Thursday.\n\nAlthough the two companies are significant competitors in consumer retail, Amazon’s revenue growth in cloud computing, advertising and other businesses helped it overtake Walmart.\n\nJeff Bezosstarted Amazonin 1994 as an online bookstore, but the company brought in nearly $129 billion in sales last year from its Amazon Web Services division. AWS provides a vast network of computing, storage and artificial intelligence options to companies and governments around the world. AWS is also a key profit driver for Amazon and helps the company offset losses from its retail business.\n\nThe majority ($464 billion) of Amazon’s revenue last year came from sales on its online and physical stores as well as from third-party sellers. Amazon also brought in more than $100 billion combined from advertising and Prime subscriptions.\n\nBy contrast, more than 90% of Walmart’s sales come from its physical stores and websites.\n\nDespite Amazon’s rapid rise, Walmart has adapted and is in its strongest shape in years.\n\nWalmart’s stock recently surpassed $1 trillion in value, the first traditional retailer to hit that mark. Walmart also moved its stock listing to the Nasdaq, signaling to investors it wants to be thought of as a tech company.\n\nWalmart’s business in the United States is surging, led by middle-class and upper-income households turning to the retailer to try to save money. The retailer continues to gain market share from rivals like Target.\n\nWalmart, led bynew CEO John Furner, said Thursday that US sales grew 4.6% last quarter.\n\n“The pace of change in retail is accelerating,” Furner said in a statement. “Our financial results show that we’re not only embracing this change, we’re leading it.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/interactive/2018/10/business/amazon-history-timeline/index.html",
      "text": "started Amazon"
    },
    {
      "url": "https://www.cnn.com/2025/11/14/business/walmart-doug-mcmillon-customers",
      "text": "new CEO John Furner"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/business/walmart-amazon-sales-companies",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/business/walmart-amazon-sales-companies",
      "text": "Cookie Settings"
    }
  ],
  "hash": "dba1a9fd52e377e739bb06a16c940cece1e17d888dcd04f09bc5d5ffaaad78d9",
  "scraped_at": "2026-02-20T07:29:08.235097+00:00"
}