{
  "url": "https://lite.cnn.com/2026/02/24/media/paramount-new-offer-warner-brothers-discovery-netflix",
  "title": "Paramount escalates Warner Bros. Discovery fight with new $31-per-share bid | CNN Business",
  "date": "2026-02-25T07:31:58.518349+00:00",
  "authors": [
    "Brian Stelter",
    "Jordan Valinsky"
  ],
  "text": "Source: CNN\n\nParamount has officially raised its offer for Warner Bros. Discovery, CNN’s parent company, to $31 per share, and now the WBD board says it is extending the window for talks with Paramount about a possible deal.\n\nIn addition to the higher price per share, Paramount has also sweetened its proposal in several other ways, including by promising “a $7 billion regulatory termination fee” to WBD “in the event the transaction does not close due to regulatory matters.”\n\nSo the talks with Paramount will continue, as WBD strives to land the best deal possible. But the WBD merger agreement with Netflix “remains in place,” the company emphasized, and analysts say Netflix is likely to match the competing bid.\n\nUntil now, Paramount has been offering $30 per share, which WBD rejected as “inferior” to the company’s deal to sell its studio and streaming assets to Netflix. Paramount has been appealing directly to WBD shareholders in what is commonly known as a hostile takeover bid.\n\nLast week, Netflix granted WBD a seven-day waiver to hold talks with Paramount while calling Paramount’s push an “ongoing distraction” for the entertainment industry.\n\nThe goal, from WBD’s perspective, was to find out Paramount’s “best and final” offer so that shareholders had some clarity about the situation.\n\nOn Tuesday morning the WBD board said it was “reviewing” the proposal” but did not release the price details.\n\nThat changed on Tuesday afternoon when the WBD board said it had determined that Paramount’s proposal “could reasonably be expected to lead to a ‘Company Superior Proposal’ as defined in WBD’s merger agreement with Netflix.”\n\nIn some ways the announcement was just a legally-worded preview of coming attractions, since the WBD board said it “has not made a determination” about whether the new $31 per share proposal is actually “superior to the merger with Netflix.”\n\nBut if and when the board makes that determination, Netflix will have four days to counter. Netflix doesn’t have to wait for that announcement, however, to match Paramount’s bid.\n\nLast month, amid the pressure from Paramount, Netflixrevised its offerto all cash.\n\nNetflix has already invested significant capital into its pursuit of Warner Bros and HBO, and thus is unlikely to walk away suddenly, though Netflix co-CEO Ted Sarandos said last weekend that his company has a “reputation for willing to walk away and let someone else overpay for things.”\n\nNetflix has also blasted Paramount’s hostile takeover bid for WBD, asserting that Paramount’s “financing challenges and rapid deleveraging plans pose tremendous risk to the entertainment industry.”\n\nThe Netflix merger is predicated on Warner Bros. Discovery’s plans to break itself into two publicly traded pieces this summer.\n\nAfter the split takes effect, Warner Bros will be the name of the company to be acquired by Netflix, while WBD’s cable channels, including CNN, will be part of a separate company called Discovery Global.\n\nWBD CEO David Zaslav said in an internal memo Tuesday morning, “Our work continues on separation efforts and integration planning with Netflix, and our priorities as a business remain unchanged.”\n\nWBDwill hold a special shareholder meetingon March 20 and will recommend voting to approve the Netflix deal, which values the studio and streaming assets at $27.75 per share.\n\nOver the weekend, themerger caught the ireof President Donald Trump, who told Netflix to remove board member Susan Rice or “pay the consequences.”\n\nNetflix co-CEO Ted Sarandostold the BBCthat Trump “likes to do a lot of things on social media” when asked about his comments. He reiterated that it’s a “business deal” and “not a political deal.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/media/netflix-all-cash-offer-warner-bros-discovery",
      "text": "revised its offer"
    },
    {
      "url": "https://ir.wbd.com/news-and-events/financial-news/financial-news-details/2026/Warner-Bros--Discovery-Sets-Special-Meeting-Date-of-March-20-2026-and-Unanimously-Recommends-Shareholders-Vote-FOR-Netflix-Merger-Warner-Bros--Discovery-to-Initiate-Discussions-with-Paramount-Skydance-for-Their-Best-and-Final-Offer/default.aspx",
      "text": "will hold a special shareholder meeting"
    },
    {
      "url": "https://www.cnn.com/us/live-news/trump-administration-tariffs-iran-news-02-22-26?post-id=cmly0kpy5002s3b6qxc9ntpya",
      "text": "merger caught the ire"
    },
    {
      "url": "https://www.bbc.com/news/articles/c20jn073gj4o",
      "text": "told the BBC"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/media/paramount-new-offer-warner-brothers-discovery-netflix",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/media/paramount-new-offer-warner-brothers-discovery-netflix",
      "text": "Cookie Settings"
    }
  ],
  "hash": "dbca06a63cc7e0adce5644ee34a337f1596d3d6fa352f38d1bb825a61c41e85c",
  "scraped_at": "2026-02-25T07:31:58.518359+00:00"
}