{
  "url": "https://lite.cnn.com/2026/02/09/sport/charles-bediako-ruled-ineligible-alabama",
  "title": "Judge rules 7-foot center Charles Bediako is no longer eligible to play for Alabama | CNN",
  "date": "2026-02-11T16:40:46.861684+00:00",
  "author": "Unknown",
  "text": "Source: AP\n\nAn Alabama circuit judge on Monday deniedAlabama basketball player Charles Bediako’smotion for a preliminary injunction, ending the 7-foot center’s collegiate eligibility and his season with the Crimson Tide.\n\nCounty Circuit Court Judge Daniel Pruet cited that Bediako “failed to demonstrate that he is entitled to the injunctive relief that he seeks,” according to court documents.\n\nBediako was playing under a temporary restraining order that allowed the former NBA G League player to join Alabama in the middle of the season despite questions regarding hiscollegiate eligibility.\n\nNCAA President Charlie Baker said in a statement that he was glad the court “upheld the rules of our members.”\n\n“Common sense won a round today,” Baker said. “The court saw this for what it is: an attempt by professionals to pivot back to college and crowd out the next generation of students. College sports are for students, not for people who already walked away to go pro and now want to hit the ‘undo’ button at the expense of a teenager’s dream. While we’re glad the court upheld the rules our members actually want, one win doesn’t fix the national mess of state laws. It’s time for Congress to stop watching from the sidelines and help us provide some actual stability.”\n\nThe 23-year-old Bediako was averaging 10 points, 4.6 rebounds and 1.4 blocks in five games Alabama went 3-2 in those games.\n\nAttorneys for both sides — Bediako and the NCAA — argued their cases Friday. Bediako sued college basketball’s sanctioning body in an effort to regain eligibility despite leaving Alabama for the NBA draft in 2023, signing a two-way NBA contract and playing the last three seasons in the developmental G League.\n\nBediako spent two seasons (2021-23) at Alabama, averaging 6.6 points, 5.2 rebounds and 1.7 blocks, and helped the Crimson Tide make the NCAA Tournament twice. He wasn’t selected in the 2023 draft, but he played for the Motor City Cruise in the NBA’s G League as recently as mid-January.\n\nHis lawyers argued that Bediako remains within his five-year college eligibility window. The NCAA denied Alabama’s initial petition, and NCAA President Charlie Baker and SEC Commissioner Greg Sankey have made it clear they are opposed to Bediako’s reinstatement.\n\nCrimson Tide coach Nate Oats said Friday that, regardless of the outcome of the case, Bediako will be allowed to remain on scholarship and work toward a college degree.\n\nAlabama (16-7, 6-4 Southeastern Conference), which faces Mississippi on Tuesday, did not immediately comment on the court decision.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/sport/ncaa-basketball-latest-college-sports-absurdity",
      "text": "Alabama basketball player Charles Bediako’s"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/sport/basketball-ncaa-meeting-alabama",
      "text": "collegiate eligibility"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/sport/charles-bediako-ruled-ineligible-alabama",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/sport/charles-bediako-ruled-ineligible-alabama",
      "text": "Cookie Settings"
    }
  ],
  "hash": "dd7fff03e89e92d5cf5a3559ac47d2be552b5459ef82a95744a79a385c6170b2",
  "scraped_at": "2026-02-11T16:40:46.861696+00:00"
}