{
  "url": "https://lite.cnn.com/2026/02/21/middleeast/huckabee-israel-us-land-intl",
  "title": "Middle East states condemn US envoy’s comments appearing to support ‘expansionist’ Israel | CNN",
  "date": "2026-02-23T07:36:25.664856+00:00",
  "authors": [
    "Tim Lister, CNN"
  ],
  "text": "Source: CNN\n\nThe US ambassador to Israel Mike Huckabee has said it would be “fine” if Israel took control of a vast swathe of the Middle East, drawing a swift rebuke from regional and other majority-Muslim states.\n\nSuggesting even nominal support for Israeli sovereignty over much of the Middle East is an unprecedented departure from American foreign policy. It also goes well beyond what much of Israel’s far-right is willing to call for publicly.\n\nNearly every Middle Eastern country aside from Israel condemned Huckabee’s comments ina joint statementon Sunday.\n\nIn an interview with US conservative commentator Tucker Carlson, the ambassador was asked about his understanding of a biblical verse suggesting that land including parts of Egypt, Syria and Iraq had been divinely promised to the Jewish people.\n\nCarlson said that according to the Old Testament, the boundaries would be “basically the entire Middle East.”\n\nHe continued: “Does Israel have the right to that land?”\n\n“Not sure we’d go that far,” Huckabee said in reply. “It would be a big piece of land.”\n\nCarlson then pressed him: “Does Israel have the right to that land?”\n\n“It would be fine if they took it all,” Huckabee responded, before adding: “I don’t think that’s what we’re talking about here today.”\n\nCarlson asked: “You think it would be fine if the state of Israel took over all of Jordan?”\n\n“They’re not trying to take over Jordan. They’re not trying to take over Syria. They’re not trying to take over Iraq or anywhere else, but they do want to protect their people,” Huckabee responded.\n\n“I think you’re missing something because they’re not asking to go back to take all of that, but they are asking to at least take the land that they now occupy, they now live in, they now own legitimately, and it is a safe haven for them,” Huckabee added.\n\nA statement led by the United Arab Emirates and backed by Saudi Arabia, Egypt, Jordan, Qatar and others denounced Huckabee’s comments as “dangerous and inflammatory.” Muslim-majority countries outside the region, such as Turkey, Indonesia and Pakistan, also signed on to the denunciation.\n\nThe Arab and Islamic states statement added that Huckabee’s remarks were a “flagrant violation of international law” that jeopardized US President Donald Trump’s plans for Gaza, some of which wereoutlinedearlier this week at the Board of Peace meeting in Washington.\n\nThey said “the continuation of Israel’s expansionist policies and unlawful measures will only inflame violence and conflict in the region and undermine the prospects for peace and called for an end to these incendiary statements.”\n\nThe Palestinian foreign ministry said Saturday that Huckabee’s remarks “contradict religious and historical facts, international law, and the position expressed by US President Donald Trump rejecting the annexation of the West Bank.”\n\nIn November 2024, shortly after Trump announced Huckabee as his pick for ambassador to Israel, Huckabee made clear that he supports Israel’s annexation of the occupied West Bank.\n\nHe told Israel’s Army Radio: “I won’t make the policy, I will carry out the policy of the president. But (Trump) has already demonstrated in his first term that there’s never been an American president that has been more helpful in securing an understanding of the sovereignty of Israel.”\n\nBut last SeptemberTrump said: “I will not allow Israel to annex the West Bank. Nope, I will not allow it. It’s not going to happen.”\n\nCNN has reached out to the State Department for comment on Huckabee’s remarks.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.mofa.gov.ae/en/MediaHub/News/2026/2/22/UAE-Arab-countries-US",
      "text": "a joint statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-launches-his-board-of-peace-with-lofty-pledges-but-questions-remain",
      "text": "outlined"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/politics/trump-says-he-wont-allow-israel-to-annex-west-bank",
      "text": "Trump said"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/middleeast/huckabee-israel-us-land-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/middleeast/huckabee-israel-us-land-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "dde835cf6a2d009efd9bb6ecfdc60f727dde00d0b5cfdf8daa49998f9f253f26",
  "scraped_at": "2026-02-23T07:36:25.664870+00:00"
}