{
  "url": "https://lite.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
  "title": "What we know about the arrest of Andrew Mountbatten-Windsor | CNN",
  "date": "2026-02-20T07:28:31.919958+00:00",
  "authors": [
    "Christian Edwards",
    "Lauren Said-Moorhouse",
    "Issy Ronald",
    "CNN"
  ],
  "text": "Source: CNN\n\nBritain’s formerPrince Andrew, now known asAndrew Mountbatten-Windsor, was arrested Thursday morning, becoming the first senior British royal in modern history to be arrested.\n\nLater in the day, he was pictured leaving the police station. Police said he was “released under investigation.”\n\nIt represents an extraordinary development in the ongoing scandal surrounding King Charles III’s brother, which has intensified ever since the US Department of Justice released documents providing new insights into his ties to the late convicted sex offender Jeffrey Epstein.\n\nSo, what do we know about the former prince’s arrest?\n\nMountbatten-Windsor was arrested on suspicion of misconduct in public office, Thames Valley Police said.\n\nThis allegation means wilfully abusing or neglecting the power held by a public office. Police have not said what led to the arrest but Andrew spent a decade as a UK trade envoy between 2001-2011.\n\nDocuments released by the US Department of Justice last month showed that the former prince, who was bound by the same confidentiality guidelines as UK government ministers, was in contact with Epstein during his time as trade envoy.\n\nThames Valley Police had previously said it is assessing whether Mountbatten-Windsor shared confidential material with Epstein during this time, as well as allegations that a woman was trafficked to the UK by Epstein to have a sexual encounter with the former prince.\n\nPolice have not charged Mountbatten-Windsor with any sexual offenses.\n\nThe former prince has denied all accusations against him and insisted he never witnessed or suspected any of the behavior of which Epstein is accused. He has not commented publicly on these more recent allegations of misconduct in public office that emerged after the DOJ releases.\n\nUnmarked police cars were seen arriving at Mountbatten-Windsor’s home on his brother’s Sandringham estate in Norfolk on Thursday, the day of his birthday.\n\nHe only moved to this house earlier this month, after Charles evicted him from the royal estate at Windsor amid the fallout from an earlier set of Epstein files.\n\nUniformed police officers were also seen behind the gates of the Royal Lodge, Andrew’s former residence, on Thursday.\n\nThe Norfolk Constabulary, whose jurisdiction extends over Sandringham, has said it is supporting Thames Valley Police’s investigation.\n\nPolice said their searches in Norfolk have concluded. Officers were searching Wood Farm, Andrew’s home on Sandringham estate in Norfolk.\n\nThe arrest of Mountbatten-Windsor is the latest development in the yearslong controversy over his ties to Epstein.\n\nHe stepped down from his royal duties in 2019 in the aftermath of a disastrous BBC interview during which he attempted to bat away any allegations of wrongdoing.\n\nHe said he had “no recollection of ever meeting” Virginia Giuffre, who would later accuse the royal of having sex with her three times when she was a teenager.\n\nShe sued Mountbatten-Windsor in a New York court in 2021, accusing him of sexual assault. Despite claiming never to have met her, the royal reportedlypaid millions of dollarsto Giuffre in 2022 to settle the case, without admitting any responsibility of wrongdoing.\n\nFurther humiliation followed last year when Charles stripped his brother of his title as prince and cast him out of the Windsor estate, marking the most public relegation of a British senior royal since the abdication crisis in 1936.\n\nCharles expressed his “wholehearted” support for the continuing investigations into his brother, stressing in a swiftly released statement that “the law must take its course.”\n\nHe added that he learned of Mountbatten-Windsor’s arrest “with the deepest concern” and reiterated that the police can count on the “cooperation” of Buckingham Palace in any investigations. The Prince and Princess of Wales support Charles’ statement, CNN understands.\n\nSeveral UK and US lawmakers and former politicians also issued statements following Andrew’s arrest.\n\nFormer British Prime Minister Gordon Brownsubmitted a“five-page memorandum” to relevant police forces regarding the Epstein files, he said Thursday, according to the UK news agency PA Media.\n\nMeanwhile, Democratic Rep. Jake Auchincloss from Massachusettstold CNN, “Great Britain is holding its powerful and privileged to account. The United States of America should do the same.”\n\nUS President Donald Trump called the arrest a “shame” while avoiding mention of Andrew’s connections to Epstein.\n\n“I think it’s a shame. I think it’s very sad. I think it’s so bad for the royal family. It’s very, very sad. To me, it’s a very sad thing,” Trump told reporters aboard Air Force One as he traveled to Georgia.\n\nThe US president lamented how Andrew’s predicament would affect King Charles.\n\n“It’s a very sad thing to see it and to see what’s going on with his brother, (the king is) obviously coming to our country very soon, and he’s a fantastic man, the king,” Trump said. Charles is said to be planning a state visit to the US, likely in April.\n\nThe family of Virginia Giuffre extendedtheir “gratitude”to Thames Valley Police for their investigation and arrest of the former prince Thursday.\n\n“Today, our broken hearts have been lifted at the news that no one is above the law, not even royalty,” the family said in a statement. “He was never a prince. For survivors everywhere, Virginia did this for you,” the statement added.\n\nSeparately, Spencer T. Kuvin, an attorney for Epstein’ssurvivors saidMountbatten-Windsor’s arrest may “restore some faith for those who believed justice was unreachable.”\n\nThe development is unprecedented in modern times.\n\nPrincess Anne, Andrew’s sister, had a brush with the law in 2002 when she was prosecuted and fined after her dog attacked two children. But she was not arrested over the offense.\n\nYou have to go back to the 17th Century and the execution of King Charles I to find the last time a senior royal was arrested.\n\nThere is still lots of information that is unknown, both regarding the details of the allegations and the procedure of the case.\n\nFor example, it is still unclear what specific information led the police to make an arrest Thursday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?t=1771503379820",
      "text": "Prince Andrew"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/uk/uk-police-stansted-airport-epstein-intl",
      "text": "Andrew Mountbatten-Windsor"
    },
    {
      "url": "https://cnn.com/2022/03/08/us/prince-andrew-virginia-giuffre-settlement",
      "text": "paid millions of dollars"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltirxvk0004356p4on1apfg",
      "text": "submitted a"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltjry070007356rhn8ikx3v",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltdqnr400003b6ps4ki4z61",
      "text": "their “gratitude”"
    },
    {
      "url": "https://www.cnn.com/world/live-news/andrew-mountbatten-windsor-arrested-uk-police-02-19-26?post-id=cmltl3smx0000356pdcox4p7p",
      "text": "survivors said"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/uk/andrew-mountbatten-windsor-arrest-what-we-know-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "de08ad648084937667231151418c6a7622b3d4808dd18049276ce393dd98e7d5",
  "scraped_at": "2026-02-20T07:28:31.919973+00:00"
}