{
  "url": "https://lite.cnn.com/2026/02/09/politics/fisa-section-702-renewal-classified-hearing-frustration",
  "title": "Classified hearing erupted in frustration as officials refused to say whether Trump wants to renew powerful surveillance law | CNN Politics",
  "date": "2026-02-11T16:33:58.674636+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nFor two hours inside a classified Congressional hearing last week, Republican and Democrat Senators grew increasingly exasperated as officials from the FBI, the National Security Agency and other agencies refused to say whether the Trump administration wants Congress to renew apowerful foreign surveillance lawthat is expiring soon, according to two people briefed on the hearing.\n\nThat law, Section 702 of the Foreign Intelligence Surveillance Act, allows authorized US officials to gather phone calls and text messages of foreign targets, but can also scoop up the data of Americans in the process.\n\nThat is a fact that irks some on the political left and right, but has yet to stop a renewal because of the widespread understanding that it’s a necessary national security tool.\n\nThe recent lack of answers from the Trump administration, however, has left some lawmakers with deep concerns about the administration’s national security policy priorities, and whether President Donald Trump’s push for retribution against the national security establishment is taking precedence over a core national security program.\n\nThe hearing should have been a routine stop for US officials to urge Congress to renew the 2008 statute. Senior national security officials have for years said Section 702 is critical to thwarting terror attacks, stemming the flow of fentanyl into the US and stopping ransomware attacks on critical infrastructure.\n\nBut Trump and his allies have longrailed against FISAas a tool used to target his political campaigns and some of his political allies. And the FBI has admitted to misusing Section 702, including through the search for information on suspects in theJanuary 6, 2021, US Capitol riotand people arrested at2020 protestsafter the police killing of George Floyd.\n\nThe FBI declined to comment for this story. The White House and the Office of the Director of National Intelligence didn’t respond to requests for comment.\n\nSection 702 has faced many obstacles to renewal before. It took the House of Representatives multiple tries to vote to reauthorize the statute in 2024 amid a fight over privacy measures.\n\nThe recent Senate intelligence committee hearing showed Republicans urging the Trump administration to take a stance on the surveillance tool, the people briefed told CNN.\n\nArkansas Sen. Tom Cotton, the Republican national security hawk who chairs the committee, pushed the agency representatives to take an official position, noting that for some members of Congress reauthorizing the law is a tough vote. Republican Sen. John Cornyn of Texas expressed frustration as he tried multiple ways to squeeze an answer from the officials testifying, but ultimately could not get an answer, according to the people briefed.\n\n“Chairman Cotton does not comment on closed SSCI hearings, but he always welcomes the administration’s views on any matter,” a Cotton spokesperson said in a statement.\n\nSen. Mark Warner, the top Democrat on the committee, told CNN: “Section 702 has been upheld by successive administrations from both parties as a critical national security tool. With just two months until it expires, the absence of any position or strategy from this administration is nothing short of a dereliction of duty.”\n\nIn their confirmation hearings, FBI Director Kash Patel and Director of National Intelligence Tulsi Gabbard expressed support for Section 702. (Gabbard’s previous opposition to the statute as a congresswomanrisked imperilingher nomination with Republicans).\n\nPatel told lawmakers intelligence collected through FISA helped rescue American hostages overseas.\n\n“The issue for me is not with FISA and 702. The issue has been those that have been in government service and abused it in the past,” Patel said during his January 2025 confirmation hearing in response to questions from Cornyn. “So we must work with Congress to provide the protections necessary for American citizens.”\n\nFollowing FBI abuses of Section 702, the bureau tightened restrictions on searches of the database. Lawmakers like Cornyn have touted Section 702 reforms like increased penalties for FISA violations involving a US person.\n\nStill, the surveillance law remains a point of heated debate in Congress, where new bills to reform the statute could be introduced prior to its lapse in April.\n\nSection 702 is “by far the more important single operational statute in the national security area,” Glenn Gerstell, former general counsel of the NSA, told CNN.\n\nGerstell said he was concerned that reforms to the statute may have gone too far in restricting officials’ ability to search the database.\n\n“Maybe we’ll miss something, perhaps some hint about a terrorist’s plans,” he said. “The Trump administration and Congress should take a good look at how well the recent reforms appear to have worked, make any tweaks necessary – and fully and permanently reauthorize the statute.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/04/11/politics/fisa-explained-what-matters",
      "text": "powerful foreign surveillance law"
    },
    {
      "url": "https://www.cnn.com/2023/05/19/politics/fbi-database-january-6-george-floyd-protests",
      "text": "railed against FISA"
    },
    {
      "url": "https://www.cnn.com/politics/january-6-insurrection",
      "text": "January 6, 2021, US Capitol riot"
    },
    {
      "url": "https://www.cnn.com/2020/05/29/us/minneapolis-george-floyd-friday/index.html",
      "text": "2020 protests"
    },
    {
      "url": "https://www.cnn.com/2025/02/12/politics/tulsi-gabbard-confirmation-vote-senate",
      "text": "risked imperiling"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/fisa-section-702-renewal-classified-hearing-frustration",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/fisa-section-702-renewal-classified-hearing-frustration",
      "text": "Cookie Settings"
    }
  ],
  "hash": "deb53114b9ff78452af3b89dfc25ab5e0e23157aa17b3f37a57a42d279e56b6c",
  "scraped_at": "2026-02-11T16:33:58.674649+00:00"
}