{
  "url": "https://lite.cnn.com/2026/02/22/europe/skiing-deaths-europe-avalanches-intl-scli",
  "title": "Why have there been so many skiing deaths in Europe this year? | CNN",
  "date": "2026-02-23T07:36:10.669180+00:00",
  "authors": [
    "Issy Ronald, CNN"
  ],
  "text": "Source: CNN\n\nThe whole mountain rumbles when anavalancherolls off it. The swirling, whirling mass approaches like a steam train, picking up thousands of tons of matter on its descent, throwing clouds of snow into the air as its gathers speeds of up to 130 kph (80 mph).\n\nThey are one of the most dangerous phenomena in the mountains.An avalanche in Californiakilled nine skiers on Tuesday, including six close friends.\n\nAnd this winter inEuropehas proven particularly deadly.\n\nAccording to the European Avalanche Warning Services (EAWS), at least 99 people have died since October 2025, mostly in the Alps — the mountain range that serves as the continent’s skiing hub and sprawls across several countries including France, Italy, Switzerland and Austria.\n\nIn the French Alps alone, avalanches have killed 28 people since the first fatal accident of the winter on December 26, according to EAWS. That is a huge increase from the average eight deaths typically seen at this point in the season, according to France’s National Association for the Study of Snow and Avalanches (ANENA). In Italy and Switzerland, the avalanche death tolls are also much higher than normal.\n\nAnd, showcasing their awesome, frightening power, one avalanche derailed a train in Switzerland on Monday, injuring five on board, while another swept through a refuge on a French mountainside earlier this month, shattering windows and dumping snowdrifts inside the building’s kitchen.\n\nAvalanches require a combination of three things – snow, a slope steeper than 30 degrees and a trigger, such as fresh or melting snow, a person, an animal or wind.\n\nOf course, these are present in the Alps every winter but specific conditions have made this winter more dangerous than others, explained Stéphane Bornet, director of ANENA.\n\nAfter the first snowfall in November, he said, there was a long period of atmospheric high pressure where the snow on the ground evolved into “angular grains” — which look a bit like large sugar crystals and don’t bond effectively with surrounding layers.\n\nOn its own, this type of snow isn’t dangerous. But, if covered by fresh snow, “these fragile layers can now be triggered and act a bit like ball bearings, like a conveyor belt that allows the avalanche to slide quite easily,” Bornet said.\n\nAnd, over the last few weeks, several meters of fresh snow have fallen across Europe, part ofa weather patterndriven by an unusual southerly jet stream that has dumped huge amounts of precipitation across the continent, causing flooding in lower altitude areas.\n\nAt the same time, “the snowpack is being fed by the wind, which means we have a large accumulation of snow on the ground,” Bornet added.\n\nSuch conditions prompted several regional avalancheforecast servicesto issue a severe level 4 warning for much of the last two weeks, with some areas even reaching the most severe level 5 warning, at least for a few days.\n\nStill, these dangerous conditions are unusual, but “not extraordinary,” noted Christine Pielmeier, an avalanche forecaster at the WSL Institute for Snow and Avalanche Research SLF in Switzerland.\n\nThey can occur roughly every five to 15 years, she told CNN, emphasizing that this number is only a statistical guide, so the conditions could hypothetically occur over two consecutive winters or not at all over a longer period of time.\n\nMeasuring how the climate crisis affects the frequency of these avalanches is difficult, scientists say. Weather is transient by its very nature — a similar weather pattern might affect an environment differently depending on the preexisting conditions — and comprehensive datasets aren’t really available.\n\n“It’s difficult to draw a direct link,” said Bornet. “We know that the climate is evolving; that is undeniable.”\n\nOne effect we can clearly attribute to the changing climate is a fluctuating rain-snow line, meaning “we will have weather patterns bringing snow at very low altitudes and the next day, it might rain at 2,000 or 2,500 meters,” he said.\n\nIn some cases, this will cause the “snowpack to consolidate through settling and bonding,” making it less prone to avalanches, “while in other cases, it could make the snowpack heavier,” he added.\n\nMountains, even as they seem tamed by tourist infrastructure, remain wild and dangerous, particularly in these conditions.\n\nFor many, that represents the appeal of backcountryskiing — a chance to test yourself against the terrain and to roam freely across the pristine snow, unbounded by groomed runs.\n\nEven with this temptation, most advanced skiers stick to marked slopes during dangerous conditions. But some, especially tourists who might have spent thousands of dollars on their week-long skiing holiday, are less likely to heed avalanche warnings.\n\n“You invest time and money, you can’t retrieve it, so you’d like to have some return for that investment and then that pushes the boundaries,” Audun Hetland, who studies decision-making in avalanches at The Arctic University of Norway, told CNN.\n\nAnd expert guides and skiers can take days to assess the terrain in challenging conditions — time that tourists simply don’t have, Hetland added.\n\nSeveral of those killed in recent weeks have been tourists.\n\nBackcountry skiing has become increasingly popular over the past few years, causing more and more people to venture into the back country. Yet, this shift in itself “doesn’t necessarily lead to more fatal avalanche accidents,” said Pielmeier.\n\nThat’s because more of these people are often snowshoe hikers who normally avoid steep terrain.Meanwhile,backcountry skiers are being better educated about avalanches, have better equipment and enjoy better organized mountain rescue, she added.\n\nWhile conditions remain dangerous, experts advise reading the avalanche forecast, skiing with local expert guides and choosing shallower slopes to ski off-piste.\n\nThe snow won’t remain this dangerous forever.\n\nPielmeier expects the conditions to subside in much of Switzerland over the course of next week, once the new snow has stabilized, except in the south of the country where less snow has fallen.\n\nIn some parts of France, however, Bornet expects the danger to persist for several weeks while the snow is still unstable.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/11/02/europe/italian-alps-avalanche-intl",
      "text": "avalanche"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/us/california-avalanche-skiers-lake-tahoe-thursday",
      "text": "An avalanche in California"
    },
    {
      "url": "https://www.cnn.com/2026/01/17/europe/skiers-killed-avalanche-austria-salzburg-intl-latam",
      "text": "Europe"
    },
    {
      "url": "https://www.avalanches.org/fatalities/fatalities-2025-26/",
      "text": "EAWS"
    },
    {
      "url": "https://www.metoffice.gov.uk/blog/2026/met-office-weather-forecast-deep-dive-february-4",
      "text": "a weather pattern"
    },
    {
      "url": "https://avalanche.report/bulletin/2026-02-11",
      "text": "forecast services"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/europe/skiing-deaths-europe-avalanches-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/europe/skiing-deaths-europe-avalanches-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ded103a59c7727d76c876f794272db016a79eca469c26ff4189b16c4ac49fb33",
  "scraped_at": "2026-02-23T07:36:10.669193+00:00"
}