{
  "url": "https://lite.cnn.com/2026/02/23/travel/st-francis-assisi-bones-display-scli-intl",
  "title": "Skeleton of St. Francis of Assisi goes on public display for first time | CNN",
  "date": "2026-02-24T07:32:18.769022+00:00",
  "authors": [
    "Christopher Lamb",
    "Lianne Kolirin",
    "CNN"
  ],
  "text": "Source: CNN\n\nThe remains of St. Francis of Assisi have gone on public display for the first time, marking 800 years since the saint’s death.\n\nThe skeleton of the saint was exhumed from its sarcophagus in the crypt of the Basilica of St. Francis of Assisi, in the central Italian town of Assisi, on Saturday morning.\n\nThe bones were then arranged on a table in the crypt before being transferred to the lower church of the basilica. Later that day, around 300 friars attended a solemn celebration of Vespers in the lower church, the basilica said in astatement.\n\nA 13th-century Italian friar, Francis is the patron saint of Italy and was the founder of the Franciscan order of the Friars Minor.\n\nNicknamed thePoverello(“Poor Little Man”), he is one of the most venerated figures in Roman Catholic history and is also commemorated by many Anglican and some Lutheran churches. Thousands of followers were drawn to the saint by his charisma, his evangelical zeal and his commitment to poverty and charity.\n\nIn 1979, Francis was recognized by Pope John Paul II as the patron saint of ecology, and he is also revered as the patron saint of animals. The late Pope Francis adopted his name because of his commitment to poverty, peace and nature, and he used a poem by the saint as the title of his landmark teaching documenton the environment. The late pope also took inspiration from the saint’s peacemaking efforts. In 1219, during the crusades, St. Francis met Sultan al-Kamil of Egypt in an attempt to bring peace.\n\nFollowing St. Francis’ death in 1226, attempts were made to keep his body away from the public amid fears it would be stolen. It was placed in an iron cage and buried beneath the basilica and was only discovered during excavations in 1818. The remains were briefly put on display back in 1978, with viewing restricted to a very limited audience.\n\nSt. Francis’ remains will be on show until March 22, with guided tours for visitors. The exhibition will give visitors the chance to “rediscover the legacy of Francis, a man whose message of peace and brotherhood continues to speak to the heart of humanity,” according to the basilica’s website.\n\nBorn in Assisi in 1181 or 1182, Francis was the son of a rich cloth merchant who enjoyed a carefree adolescence and youth. He went to war at age 20 and was taken prisoner for almost a year. He was released and became seriously ill — a catalyst for a major turning in his life.\n\nWhen Francis returned to Assisi, he underwent a spiritual change, renouncing worldliness and his family’s wealth. He famously stripped off his garments in the public square in Assisi and embraced a life of radical poverty.\n\n“The Saint of Assisi is still a gift for everyone today,” Brother Giulio Cesareo, spokesman for the Franciscans in Assisi, said in anannouncementonline. “But even for those who are not believers, St. Francis is good news: the concrete possibility, historically proven, of a human life that is not based on competition but on collaboration and mutual service.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.sanfrancescoassisi.org/html/ita/shownews.php?idNews=1039&zone=WEBnotizie",
      "text": "statement"
    },
    {
      "url": "https://www.britannica.com/biography/Saint-Francis-of-Assisi",
      "text": "Poverello"
    },
    {
      "url": "https://www.vatican.va/content/francesco/en/encyclicals/documents/papa-francesco_20150524_enciclica-laudato-si.html",
      "text": "andmark teaching document"
    },
    {
      "url": "https://www.sanfrancescopatronoditalia.it/notizie/eventi/la-basilica-ospita-la-storica-venerazione-delle-spoglie-mortali-di-san-francesco-53808",
      "text": "announcement"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/travel/st-francis-assisi-bones-display-scli-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/travel/st-francis-assisi-bones-display-scli-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "df363d3caf17f8e4d7ed89af20ff25e556618fde5a3d18b53c4d61a6e6bbe95e",
  "scraped_at": "2026-02-24T07:32:18.769034+00:00"
}