{
  "url": "https://lite.cnn.com/2026/02/19/politics/trump-refugees-memo-detain-immigration-hnk",
  "title": "Trump administration expands ICE’s ability to detain legal refugees in latest memo | CNN Politics",
  "date": "2026-02-20T07:28:46.036386+00:00",
  "authors": [
    "Matthew Rehbein, CNN"
  ],
  "text": "Source: CNN\n\nThe Department of Homeland Security is broadening federal immigration authorities’ ability to detain legal refugees who have not yet obtained green cards, citing national security concerns and the need to ensure refugees undergo additional screening, according to a DHS memo obtained by CNN.\n\nImmigration officers may “arrest and detain” refugees “who have failed to adjust” to lawful permanent resident status one year after being admitted to the US, according to the Wednesday memo, which was submitted by Justice Department attorneys as part of a federal court filing.\n\n“When a refugee is admitted to the United States, the admission is conditional and subject to a mandatory review after one year,” the memo reads, noting refugees who are detained may remain in custody “for the duration of the inspection and examination process.”\n\nThe memo, issued by US Citizenship and Immigration Services Director Joseph Edlow and Acting US Immigration and Customs Enforcement Director Todd Lyons, rescinds previous government policy regarding refugees who have been in the country for one year.\n\nFailure to obtain a green card after one year was not grounds for detention or removal from the US under previous policy, and refugees who were arrested had to either be released within 48 hours or the DHS was required to initiate removal proceedings.\n\n“Refugees may be considered to have voluntarily returned to custody” by submitting application paperwork and appearing at scheduled appointments with immigration services, according to the new memo.\n\nPrevious department policy “created a population of conditional refugees who had not been fully re-screened, with associated public safety and national security risks,” the memo says, and the new “detain-and-inspect requirement ensures that refugees are re-vetted after one year.”\n\nRefugee resettlement groups promptly decried the new policy.\n\n“This memo was done in secret, with zero coordination with the organizations that serve refugees,” said Beth Oppenheim, CEO of refugee agency HIAS. “This policy is a transparent effort to detain and potentially deport thousands of people who are legally present in this country, people the US government itself welcomed after years of extreme vetting,” she added.\n\nThe government court filing that included the DHS memo is part of a federal case in Minnesota in which a judge has temporarily blocked the Trump administration from targeting an estimated 5,600 lawful refugees in the state who are awaiting green cards. A hearing in that case is scheduled for Thursday afternoon.\n\nThe International Refugee Assistance Project, one of the plaintiffs in the federal Minnesota case, says it ischallenging the new refugee policy.\n\n“This memo is part of a broad and concerted effort to strip refugees of their legal status and render them deportable,” said Laurie Ball Cooper, vice president of US Legal Programs at IRAP. “This government will clearly stop at nothing to terrorize refugee communities, and really all immigrants, while trampling over our constitutional rights.”\n\nA USCIS spokesperson told CNN, “the media is sensationalizing long established immigration law” and that the agency is “implementing the law as written by Congress,” citing astatute of US Code.\n\n“Aliens, admitted as refugees are REQUIRED to be subject to a full inspection after a year within the United States. The statute expressly says that they shall ‘return or be returned to … custody.’” the spokesperson wrote via email. “This is not novel or discretionary; it is a clear requirement in law. The alternative would be to allow fugitive aliens to run rampant through our country with zero oversight. We refuse to let that happen.”\n\nCNN has reached out to DHS and ICE for comment.\n\nPresident Donald Trump has largely halted refugee admissions during his second term – with the narrow exception ofWhite South Africans– amid his administration’sbroader crackdownon illegal immigration. Last fall, the Trump administration set the number of annual refugee admissions at 7,500 – a fraction of what the US has historically allowed. In 2024, more than 100,000 refugees were admitted.\n\nIn November, the administration moved toreinterview some refugeesadmitted under President Joe Biden, and the killing of two National Guard members in Washington, DC, by an Afghan national that month prompted the administration tore-examine green cardsissued to people from Afghanistan and 18 other countries “of concern.”\n\nThis story was updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/IRAP/status/2023841028273590631?s=20",
      "text": "challenging the new refugee policy"
    },
    {
      "url": "https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title8-section1159&num=0&edition=prelim",
      "text": "statute of US Code"
    },
    {
      "url": "https://www.cnn.com/2025/10/30/politics/trump-7-500-refugees-limit-white-south-africans",
      "text": "White South Africans"
    },
    {
      "url": "https://www.cnn.com/2025/12/03/politics/trump-immigration-crackdown-asylum-green-cards",
      "text": "broader crackdown"
    },
    {
      "url": "https://www.cnn.com/2025/11/24/politics/trump-refugee-program-interviews-biden",
      "text": "reinterview some refugees"
    },
    {
      "url": "https://www.cnn.com/2025/11/27/politics/us-reexamining-green-card-holders-19-countries",
      "text": "re-examine green cards"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/trump-refugees-memo-detain-immigration-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/trump-refugees-memo-detain-immigration-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "df66022f9c9e025ba5c91751b8f9b3110156ee3b883f4377422b0bbecfa6d64d",
  "scraped_at": "2026-02-20T07:28:46.036402+00:00"
}