{
  "url": "https://lite.cnn.com/2026/02/09/us/rumeysa-ozturk-immigration-detention-terminated",
  "title": "Rümeysa Öztürk: Immigration judge terminates removal proceedings against Tufts student detained by Trump administration, attorneys say | CNN",
  "date": "2026-02-11T16:40:34.676305+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAn immigration judge terminated removal proceedings againstTufts University doctoral student Rümeysa Öztürk, who was detained for over a month last year as part of the Trump administration’s effort to target and deport international students and activists involved in pro-Palestinian advocacy, her lawyers said Monday.\n\nThe Department of Homeland Security hadn’t met its burden to prove Öztürk’s removability, prompting the immigration court to end removal proceedings against her, according to a letter from her attorneys submitted in court and a federal appeals court docket.\n\nThe move comes after recentlyunsealed court documents showedthe federal government didn’t have any evidence that Öztürk had been supporting terrorist activity when she was arrested, and that her visa revocation and arrest were because of an opinion article she wrote containing criticisms of Israel.\n\n“Today, I breathe a sigh of relief knowing that despite the justice system’s flaws, my case may give hope to those who have also been wronged by the U.S. government,” Öztürk wrote in a statement Monday. “Though the pain that I and thousands of other women wrongfully imprisoned by ICE have faced cannot be undone, it is heartening to know that some justice can prevail after all.”\n\nHer immigration attorney said the judge’s decision was “a powerful affirmation of fairness and the rule of law.”\n\n“We are grateful that the Judge carefully considered the facts and the law, and we hope this decision serves as a reminder that immigration enforcement must always be guided by justice,” Mahsa Khanbabai said in a statement to CNN.\n\nÖztürk was detained outside her home in March 2025 as the administration sought to deport her after revoking her student visa.\n\nChilling videoof the PhD student’s arrest showed a swarm of officers encircling her near her home in Somerville, Massachusetts, as she shrieked in fear, sparking national outrage.\n\nThat same month, Secretary of State Marco Rubio posted on X that the Trump administration “will be revoking the visas and/or green cards of Hamas supporters in America so they can be deported.”\n\nHomeland Security spokeswoman Tricia McLaughlin told CNN at the time that DHS and Immigrations and Customs Enforcement investigations had found that Öztürk had “engaged in activities in support of Hamas, a foreign terrorist organization that relishes the killing of Americans.”\n\nA DHS spokesperson called the immigration judge’s ruling “judicial activism” to “keep a terrorist sympathizer in this country.”\n\n“We are under no obligation to admit them or let them stay here. Sec. Noem has made it clear that anyone who thinks they can come to America and hide behind the First Amendment to advocate for anti-American and anti-Semitic violence and terrorism – think again,” the spokesperson said.\n\nÖztürk’s arrest came a year after she co-authored a campus newspaper op-ed that was critical of Tufts University’s response to the war in Gaza, and her attorneys have said that she was targeted by the administration in an attempt to chill pro-Palestinian speech in violation of her constitutional rights.\n\nThe PhD student, originally from Turkey and on a valid F-1 student visa, was shuttled through multiple states following her arrest and suffered a series of asthma attacks without adequate medical care, according to her attorneys.\n\nA State Department memo said Öztürk’s visa was revoked following an assessment that her actions “‘may undermine U.S. foreign policy by creating a hostile environment for Jewish students and indicating support for a designated terrorist organization’ including co-authoring an op-ed that found common cause with an organization that was later temporarily banned from campus.”\n\nÖztürk wasone of several international university studentsfacing deportation as part of the Trump administration’s efforts last spring. The arrests of scholars and students at the hands of masked law enforcement officers, who have taken them into custody by ambushing them on city streets and near their homes, sent a chill across the international student community.\n\nThe Trump administration was ordered last May to release Öztürk, with the judge saying that “continued detention potentially chills the speech of the millions and millions of individuals in this country who are not citizens.”\n\nFollowing weeks of grueling detainment,Öztürk returnedto her home state a day after US District Judge William K. Sessions III ordered her immediate release.\n\nA federal judge ruled in December thatÖztürk could resume research and teachingwhile she addresses the consequences of her visa revocation.\n\nCNN’s Jake Tapper and Jennifer Hansler contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/03/27/us/rumeysa-ozturk-detained-what-we-know",
      "text": "Tufts University doctoral student Rümeysa Öztürk"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/politics/court-documents-student-israel-op-ed",
      "text": "unsealed court documents showed"
    },
    {
      "url": "https://www.cnn.com/2025/03/29/us/rumeysa-ozturk-tufts-university-arrest-saturday",
      "text": "Chilling video"
    },
    {
      "url": "https://www.cnn.com/2025/03/20/us/universities-trump-immigration-international-students/index.html",
      "text": "one of several international university students"
    },
    {
      "url": "https://www.cnn.com/2025/05/09/us/rumeysa-ozturk-tufts-bail-release",
      "text": "Öztürk returned"
    },
    {
      "url": "https://www.cnn.com/2025/12/09/us/immigration-tufts-student-detained",
      "text": "Öztürk could resume research and teaching"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/us/rumeysa-ozturk-immigration-detention-terminated",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/us/rumeysa-ozturk-immigration-detention-terminated",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e24ad7bf07ef8600315589ef5accb130fff9a32b24909a6b0dd24622b82342d8",
  "scraped_at": "2026-02-11T16:40:34.676318+00:00"
}