{
  "url": "https://lite.cnn.com/2026/02/13/politics/veterans-affairs-disabilities-benefits-pay-companies-louisiana",
  "title": "Do these companies help veterans— or are they cheating them? | CNN Politics",
  "date": "2026-02-14T07:08:27.136490+00:00",
  "authors": [],
  "text": "Source: CNN\n\nAn Army combat veteran now living in the Midwest was dealing with multiple injuries by the time he finished his military service. He’d suffered a traumatic brain injury after his vehicle struck an IED during his deployment to Afghanistan in the late 2000s.\n\nBut when the veteran, who CNN is identifying as Adam, filed his disability compensation claims with the Department of Veterans Affairs, he felt he was failed on two fronts.\n\nFirst, the VA process was confusing, he said, and it took the department four months to get back to him – to say he didn’t qualify for any benefits. Then he sought help from a company that promised to guide him through the process for a fee, only to still end up with no benefits and a bill for thousands of dollars.\n\n“They pretty much did jack sh*t for me,” said Adam, referring to the outside company. He asked to be identified by a pseudonym to protect his privacy.\n\nAdam’s story is one that has played out with veterans for decades.\n\nVeterans are supposed to be able to get these payments by filing for their benefits directly through the VA, and to get help filling out the paperwork for free from non-profit and government-affiliated groups called veterans service organizations (VSOs), which are accredited by the government to aid them.\n\nInstead, frustrated by cumbersome paperwork and VSOs that are often too inundated with work for timely help, many veterans instead turn to private companies that charge a fee.\n\nCritics call these consultants “claims sharks” – for-profit consultancies that say they help veterans get higher compensation while also taking a cut for themselves. These consultancies operate without accreditation from the VA, a process that includes taking assessments and passing a background check, which is meant to ensure a level of oversight into the process.\n\nAt the same time, some for-profit consultancies have been accused of using dishonest tactics to obtain higher fees, whether by overcharging veterans directly, or misrepresenting their clients to the VA to get a bigger cut from higher compensations that are paid out.\n\nThe for-profit consultants contend they help veterans get more benefits – which some veterans agree with – and that most veterans come to them because they didn’t get the compensation they believe they were owed from the VA. These companies contend that they are not preparing paperwork for veterans, but simply helping them navigate a complex system, and therefore are not in breach of federal requirements.\n\nBill Taylor, the co-founder of claims consultant Veterans Guardian, argues that companies like his should be allowed to operate within a legal framework, which would also bring more regulation to the industry and cut down on what he described as “predatory practices” from some “bad actors.”\n\n“Not only do we want to protect a veteran’s right to choose, but we can do that while also providing protections,” Taylor said.\n\nSome states have sought to regulate the industry. Last year, Louisiana became the first state to pass a law to regulate unaccredited claims consultants by capping their fees and requiring certain disclosures from them. The bill was modeled after a version that stalled in Congress.\n\nSome for profit consultancies have welcomed these state laws, but VSOs have not.\n\nBut last week, a federal court struck down the Louisiana law as unconstitutional. John Wells, a lawyer and director of a veterans’ group that sued the state over the law, argued states shouldn’t be allowed to interfere in the regulation of federal benefits.\n\n“If other states try to institute laws like this, we will take action,” Wells said.\n\nFor its part, the “VA continues to examine this issue, and in the meantime, we are working to make it easier for Veterans to access the VA benefits and services they have earned,” spokesman Peter Kasperowicz told CNN.\n\n“When VA sees signs of fraud or suspicious behavior, it works with the appropriate law enforcement authorities to protect Veterans, families, caregivers and survivors,” he said. “But we also want to make sure Veterans have choices, particularly if they aren’t happy with whatever options might be available to them for free.”\n\nHe added that the VA has put in efforts to make access to claims easier for veterans, including through faster, more direct communications and quicker ways to retrieve their medical records.\n\nThe number of claims consultants has skyrocketed since 2006 when Congress removed criminal penalties against those charging fees to assist veterans with VA claims in an effort to get veterans help in navigating the sometimes-byzantine process.\n\nTwo decades later, veterans and lawmakers alike are divided over whether these companies provide a legitimate service to fill an unmet need – or take advantage of vulnerable veterans.\n\nBillions of dollars are at stake, with some 6.7 million veterans receiving benefits from the VA in the 2024 fiscal year.\n\nClaiming veterans benefits through the government “can be a complicated process, depending on the type of claim you’re making,” according to Michael Missal, who served as VA inspector general from 2016 until January 2025.\n\nWhile he does not endorse the for-profit firms, “I was familiar with veterans getting frustrated with the complicated process at VA to get benefits,” he said. “And what some unaccredited agents would do is say, ‘We can cut through the red tape. We can make this go quicker.’”\n\nBut the industry that has sprung up to do this is rife with problems, opponents say.\n\n“When you have a business whose business model is predicated on a veteran getting a higher disability claim, that just leads to nefarious things,” said Jeremy Villanueva of the veteran’s advocacy group Paralyzed Veterans of America when testifying at a congressional roundtable last month.\n\nIt’s hard to even estimate how many such companies currently operate in the US, according to Missal, because of their unregulated nature, but the largest ones operate in multiple states, bringing millions of dollars in claims.\n\nIn the past, the VA has questioned the work of some private claims companies. Previous VA administrations have sent cease-and-desist letters to some claims consultants, warning that they were likely breaching federal laws for working with veterans to fill out claims forms and charging them fees.\n\nBut these letters were often ineffective and not followed up upon by the VA, limiting their effect, according to Missal.\n\nVSOs, which maintain their accreditations and relationships with the VA in part by showing that they are providing these services, object to the for-profit consultancy companies.\n\n“We find it morally reprehensible that these companies are going around and taking money from veterans that they have no right to take money from,” said Andrew Tangen, president of the VSO National Association of County Veterans Service Officers.\n\nA pending whistleblower lawsuit has accused Veterans Guardian, one of the largest claims consultancies in the country, of manipulating medical assessments, coaching veterans to present symptoms in specific ways, and steering applicants toward diagnoses that could yield higher benefits compensation – allegations Veterans Guardian has denied.\n\nIn a statement to CNN, Veterans Guardian said the “complaint was filed by a former employee who was terminated for toxic behavior and has since been accused of harassment and cyberstalking other Veterans Guardian employees. We will continue to defend ourselves against these inaccurate claims.”\n\nIn December, a judge ruled that a separate lawsuit against the company brought by veterans who said they were charged illegal fees could move forward after Veterans Guardian tried to have the case dismissed.\n\n“We categorically deny the allegations and will vigorously defend our company against these meritless claims while continuing our important work for our veteran clients,” the company said in a statement.\n\nA veteran himself, Taylor said his own experience with VSOs led him to establish his company in 2017. When he was getting out of the military, he had a hard time finding someone who could help him for free at Fort Bragg in North Carolina – one of the largest bases in the country.\n\n“There was only one VSO available,” Taylor said. “Good luck getting an appointment.”\n\nTaylor said Veterans Guardian often hires other veterans and military spouses – people who can relate to other veterans. He said that he uses “specialists at every step of the process,” including those who can meet with veterans about PTSD or those who can advise about responding to correspondence from the VA. He said the company has also developed an AI system to streamline some steps and get veterans faster results.\n\nTaylor said that the North Carolina-based Veterans Guardian helped 45,000 veterans last year and claimed close to a 90% “success rate” in getting veterans more benefits. He added that more than 70% of Veterans Guardian clients came to the company after already trying free alternatives.\n\n“So the question is, why are we doing so well?” Taylor said. “Why are people referring folks to us? And why are so many veterans coming to us after having utilized one of the free services?”\n\nFor-profit consulting companies often advertise that they can get veterans a higher “disability rating” – the VA’s rating system on a scale of 0 to 100 percent based on the combined severity of the veteran’s injuries and illnesses. The higher the rating, the more compensation.\n\nSamuel Shade, a Navy veteran from Michigan, told CNN he tried for years to upgrade his VA disability rating and apply for better benefits for his heart problems. Shade said he first tried to work with the VA on his own, then solicited the help of a local VSO.\n\n“They didn’t get anywhere,” Shade said.\n\nThe VSO would take information from him and would check on his claim every 3-4 months, he said. But then it would take the VA at least six months to respond.\n\n“You couldn’t get the VA in Detroit to even answer” when you called, Shade said, adding that it took about a year for the VA to even acknowledge that he’d requested an increase in his benefits.\n\nAfter eight years of trying to use the VSO and VA, he finally went to a private company for help in 2023. “They tell you straight out, ‘If we don’t get anything, you’re not paying’, and they don’t over-charge either,” he said, describing the consultancy as “a very good company to deal with.”\n\nThrough them, Shade was able to improve his benefits rating, he said.\n\nAdam’s experience turned out to be almost completely opposite from Shade’s. After his poor experience with the for-profit company he had dealt with, Adam says, he went to a local VSO. With the VSO’s help, he says, he correctly submitted his claims and received his benefits within six months – all at no charge.\n\nIn addition to Louisiana, Alabama, Florida, Oklahoma, Tennessee and South Dakota have passed legislation to regulate these companies, while other states, such as Maine, New Jersey and New York, have passed laws banning unaccredited companies.\n\nLast week, Louisiana’s law was struck down after a district court judge found that it interfered with the purview of the federal law – a decisionapplauded by the VFW, but which the Louisiana attorney general intends to appeal.\n\nAnd this week, California Gov. Gavin Newsom signed into law a measure that would empower the state attorney general to prosecute unaccredited consultants who charge veterans excessive fees for claims assistance.\n\nTaylor, the co-founder of Veterans Guardian, said regulation could address the main criticisms the VSOs have had about consulting firms.\n\n“There were complaints that veterans don’t know their options, so require us to notify the veteran in writing,” Taylor said. “I mean, shoot, some of the bills even dictate it has to be done in a certain type of font.”\n\nIn 2025, Veterans Guardian spent more than $2.6 million on lobbying, including for state legislation to allow the industry to operate,according todata compiled by the nonprofit OpenSecrets. Taylor said he expects up to 20 more states to eventually enact legislation his group has lobbied in support of.\n\nTaylor said that every veteran who contacts Veterans Guardian is told that there are free services available to them through the VA and VSOs, and many go that route first.\n\n“And we wish them well, and we hope we never see them again,” he continued. “Because frankly, we’re barely scratching the surface of the demand for assistance out there.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.vfw.org/media-and-events/latest-releases/archives/2026/2/vfw-applauds-federal-court-decision-striking-down-louisiana-plus-act",
      "text": "applauded by the VFW"
    },
    {
      "url": "https://www.opensecrets.org/federal-lobbying/clients/summary?id=D000089168",
      "text": "according to"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/veterans-affairs-disabilities-benefits-pay-companies-louisiana",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/veterans-affairs-disabilities-benefits-pay-companies-louisiana",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e313c412219493e50277340bb4aff78880a9317c2b45215bac008a0f42e6c5f5",
  "scraped_at": "2026-02-14T07:08:27.136505+00:00"
}