{
  "url": "https://lite.cnn.com/2026/02/13/europe/norway-pm-jagland-charged-epstein-ties-intl-hnk",
  "title": "Thorbjørn Jagland: Norwegian ex-prime minister charged after probe into alleged Epstein ties, lawyers say | CNN",
  "date": "2026-02-13T07:30:37.035393+00:00",
  "authors": [],
  "text": "Source: CNN\n\nNorway’s former Prime Minister Thorbjørn Jagland has been charged with “aggravated corruption” after a police probe into his alleged ties to the late sex offender Jeffrey Epstein, according to the law firm representing him.\n\nElden Law Firm confirmed to CNN on Thursday that Jagland is “charged with aggravated corruption,” adding that he “denies all charges.”\n\nØkokrim, Norway’s investigative agency for economic and environmental crime, said it will now question Jagland as part of its ongoing investigation, Norwegian public broadcaster NRK reported Thursday.\n\nIt comes as Norway’s royal familybattles scandals on multiple fronts, with charities this week moving to cut or review ties to the crown princess due to her past contact with Epstein, who died in 2019.\n\nLast week, Økokrim said Jagland was under investigation “on suspicion of aggravated corruption” based on information in the latest batch of Epstein documents released by the US Justice Department.\n\nInvestigators said they were looking into “whether gifts, travel and loans were received in connection with his position.” Jagland – who was prime minister from 1996 to 1997, as well as serving as foreign minister and secretary-general of the Council of Europe – has denied any wrongdoing related to Epstein.\n\nEarlier Thursday, Jagland’s lawyer said that searches carried out at the former prime minister’s “home and leisure properties” are“a normal part of an investigation of this type.”\n\n“As an automatic consequence of the search, Jagland now has formal status as a suspect,” his lawyer Anders Brosveet said in a statement.\n\n“Jagland wants to contribute to the case being thoroughly investigated, and the next step is that he will appear for questioning at Økokrim.”\n\nCNN has reached out to Økokrim for further comment.\n\nThe newly released Epstein files also revealed extensive correspondence between Norway’s Crown Princess Mette-Marit and Epstein – something the princess has since expressed regret over – years after the financier pleaded guilty to soliciting sex from a minor.\n\nLast week Norway’s royal house said Mette-Marit “strongly disavows Epstein’s abuse and criminal acts” and is sorry for “not having understood early enough what kind of person he was.”\n\nThe controversy has sparked an open public discussion in Norway about whether Mette-Marit should become queen, experts say.\n\nIt also raises uncomfortable questions about her position within the royal clan, particularly given the advanced age of King Harald V, who at 88 is Europe’s oldest monarch.\n\nHarald’s physical health hasdeteriorated in recent years, requiring his son, the Crown Prince Haakon, to act as regent on occasion.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/europe/norway-royal-family-scandals-intl",
      "text": "battles scandals on multiple fronts"
    },
    {
      "url": "https://www.cnn.com/2024/03/02/europe/norway-king-harald-pacemaker-intl",
      "text": "deteriorated in recent years"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/europe/norway-pm-jagland-charged-epstein-ties-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/europe/norway-pm-jagland-charged-epstein-ties-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e32e067dbbaa1d95463f80fd5452fe56a8c56be18b9ecbfdffe78a791dff1af2",
  "scraped_at": "2026-02-13T07:30:37.035406+00:00"
}