{
  "url": "https://lite.cnn.com/2026/02/26/politics/dan-crenshaw-ted-cruz-maga",
  "title": "How Dan Crenshaw’s feuds with Ted Cruz and MAGA threaten his political future | CNN Politics",
  "date": "2026-02-27T07:15:35.160208+00:00",
  "authors": [
    "Sarah Ferris",
    "Manu Raju",
    "Adam Cancryn"
  ],
  "text": "Source: CNN\n\nAs GOP Rep. Dan Crenshaw and Sen. Ted Cruz prepared to board the same flight from Houston to Washington in recent months, the two famously brash Republicans had a tense exchange that now looms large over Crenshaw’s battle for political survival.\n\nCrenshaw accused Cruz of working against him in his House primary. According to three people with direct knowledge of their interaction, Cruz responded: “If I’m working against you, you’re gonna know it.”\n\nThis week, Cruz made it known.\n\nThe junior Texas senator endorsed Steve Toth, a Texas state representative and a former megachurch pastor who is facing Crenshaw in Tuesday’s Republican primary. And he taped an ad that a pro-Toth super PAC is now airing in the Houston area.\n\n“You deserve an unwavering fighter, a Republican who walks the walk,” Cruz says inthe ad, which doesn’t mention Crenshaw.\n\nCrenshaw, the Navy SEAL who has rocketed to national fame for his confrontational style, has spent years fighting with “Make America Great Again” allies who see him as insufficiently loyal to President Donald Trump. Now, days before his primary, Crenshaw’s previously unreported feud with Cruz reflects how the congressman is facing major enemies in his already tough reelection bid.\n\nTrump has not endorsed a candidate in the race, making Crenshaw the only House Republican from Texas not to get the president’s backing.\n\n“He told me he would — it’s up to him, he doesn’t owe me anything,” Crenshaw told CNN.\n\nTexas Gov. Greg Abbott, too, endorsed 27 House Republicans for Congress this cycle without backing Crenshaw. And now Cruz is backing Toth.\n\nThe nasty primary between Crenshaw and Toth has mostly been out of the public eye. But it’s been increasingly ringing alarm bells in Washington as GOP leaders now believe Crenshaw could lose or at least be forced into a May 26 runoff.\n\nCrenshaw has succeeded in close primary fights before. But those were against poorly funded opponents who still came close to unseating him. (His opponent in 2024 raisedless than $30,000but won 40% of the vote.)\n\nIn an interview, Crenshaw predicted he would win reelection in the Houston suburbs seat, telling CNN: “I see myself winning.”\n\nCrenshaw’s allies note that Cruz had initially endorsed his opponent in 2018. But over the years, tensions rose between the two Republicans – partly, according to multiple Texas GOP sources, as some Cruz allies feared that Crenshaw was preparing a primary bid against the senator in 2024.\n\nCrenshaw denied such ambitions in a fiery call with Cruz in 2021, according to two people with knowledge of the conversation. Cruz began the call by thanking Crenshaw fordefending him publiclyshortly after the January 6 violence at the Capitol, when Cruz was facing national backlash for fundraising off the riot, those people told CNN.\n\nAhead of Cruz’s 2024 reelection run, the senator’s team privately and repeatedly asked Crenshaw for an endorsement for his reelection bid, according to two people familiar with the exchange.\n\nBut the two Texans were unable to connect by phone at the time, those people said, and an endorsement never happened.\n\nA spokesperson for Cruz’s campaign denied that the senator ever asked for Crenshaw’s endorsement but declined to offer further detail.\n\nCruz stayed out of Crenshaw’s primary until last week, after Crenshawunloaded on a businessmanwho’s also a close Cruz ally and longtime donor. The same day, hours later, Crenshaw helped to tank Cruz’s single biggest legislative priority on the House floor, an air safety bill spurred by last year’s deadly plane crashin Washington.\n\nCruz was asked Thursday at the US Capitol why he backed Toth.\n\n“I think his principles and values reflect the values of the voters in the district,” he said.\n\nToth is no stranger to competing against established incumbents; he challenged former Rep. Kevin Brady in 2016 for Texas’ 8th District.\n\nThis time around, he has questioned Crenshaw’s loyalty to Trump over the 2020 presidential election and support for Ukraine aid.\n\nThere’s another factor that has Toth and his allies even more confident they can win: Crenshaw is running in a newly drawn seat that includes thousands of new voters. And they argue that Toth, who’s represented much of the area in the Texas statehouse since 2019, will feel more like the incumbent to some in the district.\n\nCrenshaw insists that voters will back him over Toth, who’s considered one of the most conservative Republicans in the legislature.\n\n“I’m going up against a guy who’s got the worst possible voting record and we’ve just got to get that information out to people,” Crenshaw told CNN. “We’ve got a very strong history of work. He’s got a very strong history of passing zero bills in the Texas legislature.”\n\nIn response to Crenshaw’s remarks, Nick Maddux, a consultant for Toth’s campaign, criticized the congressman for voting against his own constituents’ interests and reacting to “any ounce of criticism with hubristic rage and anger.”\n\n“After alienating not only his voters, almost the entire Texas delegation and all of Congress along the way, it’s no surprise that he finds himself with few friends helping him down the stretch,” Maddux told CNN on Thursday.\n\nIf Crenshaw loses on Tuesday or in an eventual runoff, he would be the first Texas House incumbent to go down in a primary since 2014.\n\nA loss would be the latest warning sign for congressional Republicans seen as out of line with MAGA. Longtime Sen. John Cornyn, running for reelection and facing similar questions about his loyalty to Trump, is in the toughest test of his career from Texas Attorney General Ken Paxton and US Rep. Wesley Hunt.\n\n“Crenshaw’s kinda got a Cornyn problem, in that he wasn’t a devout Trumpy the whole time. And now he’s paying for it,” Reb Wayne, a longtime Texas GOP strategist who is neutral in the race, told CNN.\n\nOne person close to Crenshaw put it another way: “He admits he doesn’t just tell people what they want to hear.”\n\nWhile Crenshaw’s voting record is firmly pro-White House, Republicans in Texas and Washington say he has been increasingly alienating himself from the party. People close to Crenshaw insist he has maintained a cordial relationship with the president but acknowledge he’s detested by plenty of Trump’s closest advisers.\n\n“There were some votes that he cast incorrectly in the eyes of a lot of conservatives. The other thing that’s hurt him is he’s one of these politicians that just can’t stay off Twitter,” Wayne added.\n\nThat animosity stems from Crenshaw’s positions like his support for Ukraine, his vote to certify the 2020 election and his support for resettling Afghan allies in the US. But it’s also some of his personal conduct, like his bitter feud with Tucker Carlson or hisveiled attackscalling Congress’s MAGA hardliners “grifters.” (Then there are the allegations of public drunkenness while on a work trip to Mexico City, which Crenshaw has denied.)\n\nCrenshaw’s allies say he simply doesn’t care to pander for endorsements and would rather win a race on his merits. They say he’s always disdained politics and that he achieved his sole mission in life by becoming a Navy SEAL. He received a Purple Heart after losing his right eye in Afghanistan.\n\n“He is not someone who just follows the party talking points and he has prided himself on telling the truth, including to Republican base voters, and sometimes they don’t like that,” anotherperson familiar with Crenshaw’s thinking told CNN.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://adm0.page.link/aBNj",
      "text": "the ad"
    },
    {
      "url": "https://communityimpact.com/houston/conroe-montgomery/election/2024/03/05/update-crenshaw-wins-republican-primary-for-texas-2nd-congressional-district/",
      "text": "less than $30,000"
    },
    {
      "url": "https://www.youtube.com/watch?app=desktop&v=XUP30p_mUV8",
      "text": "defending him publicly"
    },
    {
      "url": "https://www.facebook.com/CrenshawforCongress/posts/follow-the-money-steve-toths-super-pac-is-almost-entirely-funded-by-a-colony-rid/1486551489495501/",
      "text": "unloaded on a businessman"
    },
    {
      "url": "https://x.com/RonFilipkowski/status/1468201562019352576",
      "text": "veiled attacks"
    }
  ],
  "hash": "e34750c5106f535170df69f20352a2087d5f828f444591ca2c22b3490c2b4e7c",
  "scraped_at": "2026-02-27T07:15:35.160221+00:00"
}