{
  "url": "https://lite.cnn.com/2026/02/13/business/epstein-files-bin-sulayem-friendship-intl",
  "title": "Sultan Ahmed Bin Sulayem: Powerful Dubai tycoon replaced after DOJ reveals sexually explicit emails with Epstein | CNN Business",
  "date": "2026-02-14T07:07:34.554332+00:00",
  "authors": [],
  "text": "Source: CNN\n\nA tycoon from the United Arab Emirates whose intimate friendship with the late sex offender Jeffrey Epstein was revealed in the latestrelease of filesby the US Justice Department hasbeen replacedin his post as head of one of the world’s largest port operators.\n\nSultan Ahmed bin Sulayem emerged as a powerful force in global trade as the former chairman and CEO of Dubai’s DP World, which has a footprint in more than 80 countries, over the past three decades.\n\nWithout naming bin Sulayem, Dubai’s Government Media Office announced Friday that DP World had appointed a new chairman and group CEO, positions previously held by bin Sulayem. DP World confirmed the new appointments to CNN.\n\nEpstein affectionately described bin Sulayem, whose name appears thousands of times in the latest batch, as“funny,”“educated,”“a master”and a“best and trusted friend.”\n\nThe messages between Epstein and bin Sulayem reveal an intimate, yearslong friendship replete with misogynistic descriptions of women and girls, sexually explicit material, business proposals and a reference to an alleged torture video that has drawn scrutiny in the US Congress.\n\nOn Tuesday the DOJ un-redactedmore namesin the documents, highlighting six men, including bin Sulayem. A name appearing in the files is not on its own evidence of wrongdoing, and bin Sulayem has not been accused by authorities of any wrongdoing or charged with any crimes in connection with the late Epstein.\n\nTheir communication spanned at least a decade, including after September 2009, when Epstein was releasedfrom prisonhaving pled guilty to child prostitution charges. Epstein died in 2019, awaiting trial on additional charges of sexual abuse of underage girls and running a sex trafficking ring. He plednot guilty.\n\nA prominent Emirati business figure, bin Sulayem regularly makes appearances with Dubai’s ruler, and has been pictured with US President Donald Trump.\n\nHe attended the World Economic Forum in Davosin January, appeared at CNN International’s Global Perspectives live eventlast Novemberand has featured in trophy presentations for the prestigious DP World Tour Championship golf tournament in Dubai.\n\nAt least two companies — a British investment platform and Canada’s second largest pension fund — reportedly halted future deals with DP World in the wake of the latest release of files. The Quebec-based hub La Caisse told CNN that it expects DP World to “shed light on the situation and take the necessary actions.” But after Sulayem was replaced, La Caisse told CNN that DP World “took the appropiate measures” and that the pension fund will “move quickly” to work with the port operator’s new leadership to continue their partnership.\n\nBin Sulayem’sglossy profile matches those of numerous other influential men whose appearances in the Epstein files reveal how the financier presented himself as a stealthy networker – leveraging his ties with wealthy businessmen, tech entrepreneurs, politicians and academics to connect the global elite.\n\nBin Sulayem is not a household name in the United States. But a newly published memo has propelled him into the spotlight in Washington.\n\nIn 2009, Epstein wrote a short email to a recipient that the DOJ had initially redacted. “Where are you? are you ok I loved the torture video,” he said at the time.\n\nUS Republican Congressman Thomas Massie of Kentucky, who was given access by the DOJ to the unredacted version, said this week on social media that the recipient was “a Sultan.” Later, US Deputy Attorney General Todd Blanche said the recipient’s name appeared in a separate unredacted file and linked to an email from bin Sulayem.\n\nIt is unclear what “torture video” Epstein is referring to in the email Blanche linked to. DP world declined to comment on the matter when reached by CNN before he was replaced in his position. CNN tried to call a number for bin Sulayem several times this week.\n\nAccording to the newly released tranche of documents, Epstein and bin Sulayem traded regional contacts anddiscussed visitsto Epstein’sCaribbean island– where survivorsrepeatedly testifiedthat Epstein sexually abused them.\n\nBin Sulayem told Epstein about meetings with world leaders, including Russian President Vladimir Putin and former British Prime Minister David Cameron, inearly September 2015, according to the files.\n\nEpstein also offered bin Sulayem advice on how to approach the United Kingdom government to secure financing for a massive DP World project in London. In September, 2009, bin Sulayem forwarded Epstein a letter addressed to Peter Mandelson, then-British Secretary of State for Business, Innovation and Skills, requesting loan guarantees.\n\nEpstein responded to binSulayem’s draftproposal with suggested edits. Two years later, when bin Sulayem sent him a press release announcing the project’s construction,Epstein wrote, “Im (sic) proud of you.”\n\nMandelson, who later became the UK ambassador to the US, is now the subject of a Britishpolice investigationover his ties to Epstein. He previously said he was “wrong to believe (Epstein) following his conviction and to continue my association with him afterwards.”\n\nCNN has tried to contact Mandelson this week for comment.\n\nThe emails between bin Sulayem and Epstein also show attempts at brokering relations between UAE and Israeli officials began several years before Abu Dhabi normalized ties with Israel under the US-brokeredAbraham Accords in 2020. Epstein appeared to initiate contact between bin Sulayem and then Israeli Defense Minister Ehud Barak as early as 2012.\n\nBarak previously acknowledged his personal relationship with Epstein, but has said he never witnessed or participated in any improper behavior.\n\nOnMarch 22, 2012, Epstein told bin Sulayem he was in Berlin “with the Israeli defense minister” adding, “I have told him about you and sheik (sic) Mohamed. He would like to meet you both.”\n\nInJune, 2013, Epstein told Barak, who was no longer serving in government, “My friend sultan bin sulaiman (sic) is in st pete, I tnk (sic) you should meet, he is the right hand of maktoum,” apparently referring to Sheikh Mohammed bin Rashid Al Maktoum, UAE prime minister and ruler of Dubai. At the time, world leaders were gathering at a Russian economic forumin St Petersburg.\n\nA month later, Epstein appeared to pitch bin Sulayem’s DP World as a potential candidate to buy Israeli ports amid a privatization campaign. He sent Barak aFox News storyabout Israel inviting international bids, asking, “is this something for sultan?” Barak replied, “Probably once (and IF) we’ll start getting deeper into a sincere peace process,” on theJuly 4, 2013 emailchain, adding “we have to think harder on how to leverage this acquaintance.”\n\nTwo summers later, bin Sulayemasked Epstein, “Can you please arrange for me to meet Ehud.” Epstein forwarded the request to Barak, who replied, “Yes, of course” and asked him to share his phone number and contact information.\n\nThat diplomatic bridge extended as far as the White House.\n\nOn January 6, 2017, bin Sulayemasked Epsteinwhether he should “accept” an invitation to US President Donald Trump’s first inauguration. “Do you think it will be possible to shake hand (sic) with Trump?” Epstein, who didn’t attend the inauguration, said “unlikely.”\n\nA year later, bin Sulayem asked to meet former Trump strategist Steve Bannon during a potential May 2018 trip to the UAE. “I will arrange picking you up,” the Emirati businessman said to Bannon, laying out details of a sky tour of Dubai and discussed future “meetings in Washington.” Epstein, who is cc’d in those emails, tells Bannon he“will have fun”with Sulayem.\n\nEpsteinshared ideaswith bin Sulayem about how he should organize Bannon’s tour of the region. “Show him the scale of what you have done,” he said.\n\nThe files also appear to show how bin Sulayem shared detailed sexual accounts and graphic photos with Epstein – including inmid-August, 2015, when he apparently sent links to porn sites during a trip to Santa Fe with his “wife, three kids and a nanny,” according to the correspondence.\n\nOnJune 13, 2013, bin Sulayem told Epstein, “I am off to sample a fresh 100% female Russian at my yacht.” Twoyears later, he told Epstein about a “girl” he knows from an American university in Dubai. “The best sex I ever had amazing body,” bin Sulayem said.\n\nFurther correspondence shows bin Sulayem and Epstein objectifying women and criticizing their physical appearances.\n\nBin Sulayem also appearedto facilitatetraining for Epstein’s “personal masseuse,” identified as a Russian national, to work at a hotel resort in Antalya, Turkey, “so she gains better experiences,” inJune, 2017.\n\nIt is unclear if the individuals were sent to Antalya.\n\nSurvivors of Epstein’s abuse have repeatedly relayed testimony of being forced toperformmassagesand sex acts on him.\n\nMore emails indicate that Epstein positioned himself as an information monger – parlaying intimate details about his contacts’ private lives to strengthen their relationships.\n\nIn correspondence from August 2013, Epstein told the Japanese entrepreneur Joichi Ito that bin Sulayem “speaks perfect English,” consumes “no alcohol in public” and “prays five times a day.” In thesame thread, Epstein said the Dubai tycoon “has many viagra type connoctions (sic).”\n\nWhile discussing a potential meeting with bin Sulayem, Ito said, “Assume I should meet him alone and not with my little punk girl sidekick right?”\n\nIto,who resignedas the head of the MIT Media Lab in 2019 after his financial ties to Epstein were made public,previously saidhe was “never involved in, never heard (Epstein) talk about, and never saw any evidence of the horrific acts that he was accused of.” He added that he was “deeply sorry to the survivors” for “bringing such a person into our network.”\n\nCNN has reached out to the Chiba Institute of Technology in Japan, where Ito is president, for comment.\n\nBarely a month later, Epstein told bin Sulayem in a separate memo, “Joi, is the most connected to the tech world person in the states. He runs the MIT media lab, he is one of us.”\n\nBin Sulayem replied, “I look forward to meet (sic) him I will take good care of him.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "release of files"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/business/dp-world-sultan-sulayem-epstein-intl",
      "text": "been replaced"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01961884.pdf",
      "text": "“funny,”"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01961884.pdf",
      "text": "“educated,”"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01962012.pdf",
      "text": "“a master”"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA01052341.pdf",
      "text": "“best and trusted friend.”"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/epstein-files-unredacted-names",
      "text": "more names"
    },
    {
      "url": "https://www.cnn.com/2019/07/06/us/jeffrey-epstein-arrest-sex-trafficking-indictment",
      "text": "from prison"
    },
    {
      "url": "https://www.cnn.com/2019/08/16/us/jeffrey-epstein-autopsy",
      "text": "not guilty."
    },
    {
      "url": "https://www.weforum.org/stories/authors/sultan-ahmed-bin-sulayem/",
      "text": "in January"
    },
    {
      "url": "https://www.cnn.com/2025/11/05/world/video/global-perspectives-supply-chains-that-deliver",
      "text": "last November"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01771601.pdf",
      "text": "discussed visits"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02334646.pdf",
      "text": "Caribbean island"
    },
    {
      "url": "https://www.cnn.com/2020/01/15/us/jeffrey-epstein-virgin-islands-lawsuit",
      "text": "repeatedly testified"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00846825.pdf",
      "text": "early September 2015"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00886137.pdf",
      "text": "Sulayem’s draft"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00921627.pdf",
      "text": "Epstein wrote"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/uk/morgan-mcsweeney-resigns-mandelson-epstein-intl",
      "text": "police investigation"
    },
    {
      "url": "https://www.cnn.com/2025/11/06/politics/abraham-accords-kazakhstan-trump",
      "text": "Abraham Accords in 2020"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA02012988.pdf",
      "text": "March 22, 2012"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00963620.pdf",
      "text": "June, 2013"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/politics/epstein-putin-russian-officials-connections",
      "text": "in St Petersburg"
    },
    {
      "url": "https://www.foxnews.com/world/israel-invites-international-bids-for-new-private-ports-to-bust-unions-reduce-cost-of-imports",
      "text": "Fox News story"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00662690.pdf",
      "text": "July 4, 2013 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00854099.pdf",
      "text": "asked Epstein"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02663514.pdf",
      "text": "asked Epstein"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00815979.pdf",
      "text": "“will have fun”"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00815790.pdf",
      "text": "shared ideas"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01618624.pdf",
      "text": "mid-August, 2015"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01969759.pdf",
      "text": "June 13, 2013"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01791345.pdf",
      "text": "years later"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00693228.pdf",
      "text": "to facilitate"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00693228.pdf",
      "text": "June, 2017"
    },
    {
      "url": "https://www.cnn.com/2021/12/06/us/ghislaine-maxwell-trial",
      "text": "perform"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/trump-epstein-maxwell-clemency-analysis",
      "text": "massages"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01963132.pdf",
      "text": "same thread"
    },
    {
      "url": "https://www.bbc.co.uk/news/world-us-canada-49623084",
      "text": "who resigned"
    },
    {
      "url": "https://www.media.mit.edu/posts/my-apology-regarding-jeffrey-epstein/",
      "text": "previously said"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/business/epstein-files-bin-sulayem-friendship-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/business/epstein-files-bin-sulayem-friendship-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e36b9cc4d7a8ee971e8416f0222cda858e9f22bf265a681045786d710aee17ac",
  "scraped_at": "2026-02-14T07:07:34.554346+00:00"
}
