{
  "url": "https://lite.cnn.com/2026/02/14/world/bannon-epstein-take-down-pope-francis-latam-intl",
  "title": "Steve Bannon courted Epstein in his efforts to ‘take down’ Pope Francis | CNN",
  "date": "2026-02-15T07:11:17.221415+00:00",
  "authors": [],
  "text": "Source: CNN\n\nSteve Bannon, a former White House adviser to US President Donald Trump, discussed opposition strategies with convicted sex offender Jeffrey Epstein against Pope Francis, with Bannon saying he hoped to “take down” the pontiff, according to newly released files from the US Department of Justice.\n\nMessages sent between the pair in 2019, released in the massive document dump last month, reveal Bannon courted the late financier in his attempts to undermine the former pontiff after leaving the first Trump administration.\n\nBannon had been highly critical of Francis whom he saw as an opponent to his “sovereigntist” vision, a brand of nationalist populism which swept through Europe in 2018 and 2019. The released documents from the DOJ appear to show that Epstein had been helpingBannon to build his movement.\n\n“Will take down (Pope) Francis,” Bannon wrote to Epstein in June 2019. “The Clintons, Xi, Francis, EU – come on brother.”\n\nPope Francis was a significant obstacle to Bannon’s brand of nationalist populism. In 2018, the former Trump aide described Francis to The Spectator as“beneath contempt,”accusing him of siding with “globalist elites” and, according to “SourceMaterial,” urged Matteo Salvini, now Italy’s deputy prime minister, to“attack” the pontiff.For his part, Salvini has used Christian iconography and language when pursuing his anti-immigrant agenda.\n\nRome and the Vatican have been important for Bannon. He set up a Rome bureau when he ran Breitbart News and has been involved in trying to establish a political training “gladiator school” to defend Judaeo-Christian values not far from the Eternal City.\n\nFrancis, meanwhile, was a counterweight to the Trumpian worldview, strongly critiquing nationalism and making advocacy for migrants a hallmark of his pontificate.\n\nThe recently released DOJ files reveal Bannon messaged Epstein on several occasions in his efforts to undermine the late pope.\n\nIn his messages with Epstein, Bannon references “In the Closet of the Vatican,” a 2019 book by French journalist Frédéric Martel that lifted a lid on secrecy and hypocrisy at high levels of the church. Martel created a storm with his book by claiming 80% of the clergy working in the Vatican are gay, while exploring how they keep their sexuality secret.\n\nThe whole question of homosexuality in the church has been a lightning rod for some conservatives, who see it as evidence of a deeper, systemic crisis in the church, with some linking it to the wider sexual abuse scandals. Most experts and researchers view any conflating of sexual orientation with abuse as scientifically inaccurate.\n\nBannon showed an interest in turning Martel’s book into a film after meeting the author in Paris at a five-star hotel. In the messages, Bannon appears to suggest that Epstein could be the film’s executive producer. “You are now exec producer of ‘ITCOTV’ (In the closet of the Vatican),” Bannon wrote.\n\nIt is not clear how serious the proposal from Bannon to Epstein was, and, in the exchange, Epstein doesn’t mention the offer and asks about Bannon filming Noam Chomsky, the philosopher and public intellectual. Martel said when he met Bannon at the Hotel Le Bristol he told him that he could not agree to any film deal as his publishers controlled the film rights and had already signed a deal with another corporation. He told CNN that he thinks Bannon wanted to “instrumentalize” the book in his efforts against Pope Francis.\n\nThe Epstein files show Epstein, on April 1, 2019, emailed himself “in the closet of the vatican,” and later sent Bannon an article titled “Pope Francis or Steve Bannon? Catholics must choose” to which Bannon replies “easy choice.”\n\nAusten Ivereigh, a biographer of the late pope, said Bannon thought he could use Martel’s book to embarrass and damage Pope Francis, while claiming to “purify” the church. “I think he badly misjudged the nature of the book – and Pope Francis,” Ivereigh told CNN.\n\nYet, as it now turns out, it appears that Bannon was messaging Epstein several years after his 2008 conviction for child sex offenses and just before he was arrested for the sex trafficking of minors.\n\nRev. Antonio Spadaro, a Vatican official who collaborated closely with Pope Francis, told CNN Bannon’s messages show a desire to fuse “spiritual authority with political power for strategic ends.”\n\nThe late pope, Spadaro explains, resisted such a link: “What those messages reveal is not merely hostility toward a pontiff, but a deeper attempt to instrumentalize faith as a weapon – precisely the temptation he sought to disarm.”\n\nThe period of 2018 to 2019 saw intense opposition to Francis, which culminated in an August 2018 dossier released by Archbishop Carlo Maria Viganò, the former papal ambassador to the US, accusing him of failing to deal with abuse committed by Cardinal Theodore McCarrick.A Vatican inquiry later cleared Francis.\n\nBut Bannon’s desire to make a film out of Martel’s book saw him lose an ally in the Vatican. Cardinal Raymond Burke, a prominent conservative critic of Francis, said: “I am not at all of the mind that the book should be made into a film.”\n\nBurke was also portrayed in an unflattering way in Martel’s book. Burke’s split with Bannon came when he cut ties with Dignitatis Humanae, a conservative institute founded by Benjamin Harnwell, a British political adviser and a close associate of Bannon’s based in Italy.\n\nHarnwell had been working with Bannon to set up an academy to train nationalist-populist leaders in an 800-year-old former monastery called “Certosa di Trisulti” in the province of Frosinone, 47 miles south-east of Rome. Harnwell is engaged in an ongoing legal battle with Italy’s culture ministry over the monastery’s conversion, with a hearing taking place on February 11.\n\nIn 2019, the Italian government revoked a lease given to Harnwell’s institute for the monastery, stating irregularities, non-payments and misrepresentations by Harnwell. In 2024, however, a Roman court cleared him, and he is seeking to win back the lease.\n\nThe Epstein files also reveal that Bannon forwarded an email to Epstein in July 2018 with an article from Italian newspaper “La Repubblica” headlined “Bannon the European: He’s opening the populist fort in Brussels.” Bannon was forwarding an English translation of the article, which had originally been sent by Harnwell.\n\nHarnwell told CNN that Epstein was “not involved in Trisulti.”\n\nElsewhere in the files, Epstein jokes with his brother, Mark, about inviting Pope Francis to his residence for a “massage” during the US papal visit in 2015. Three years later, he messages Bannon to say he’s trying to “organize a trip for the pope to the Midde East,” adding “headline – tolerance.”\n\nWhen Bannon shares with Epstein an article about the Vatican condemning “populist nationalism,” Epstein quotes John Milton’s biblical poem “Paradise Lost,” when Satan has been cast out of heaven.\n\n“Better to reign in Hell, than serve in Heaven,” Epstein tells Bannon.\n\nCNN has contacted a representative of Bannon for comment. Trump has consistently denied any wrongdoing in relation to Epstein or any allegation of sexual misconduct.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/steve-bannon-jeffrey-epstein-global-populism",
      "text": "Bannon to build his movement."
    },
    {
      "url": "https://spectator.com/article/steve-bannon-goes-to-war-with-the-pope/?set_edition=en",
      "text": "“beneath contempt,”"
    },
    {
      "url": "https://www.source-material.org/the-heretic-in-the-vatican-how-pope-francis-became-a-hate-figure-for-the-far-right/",
      "text": "“attack” the pontiff."
    },
    {
      "url": "https://www.cnn.com/2025/04/21/europe/pope-francis-obituary-intl",
      "text": "A Vatican inquiry later cleared Francis"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/world/bannon-epstein-take-down-pope-francis-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/14/world/bannon-epstein-take-down-pope-francis-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e479a29265803c1800e3a7e3b3e2183ce769acb3a4a1abe2354e5b4e91517859",
  "scraped_at": "2026-02-15T07:11:17.221429+00:00"
}