{
  "url": "https://lite.cnn.com/2026/02/11/europe/gisele-pelicot-rape-takeaways-interview-latam-intl",
  "title": "Gisèle Pelicot’s first televised interview: 5 takeaways from the woman who launched a rallying cry against sex abuse | CNN",
  "date": "2026-02-12T21:30:18.243816+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nGisèle Pelicotemerged as a globalfeminist heroin 2024 by transforming her horrific, personal story into a public battle against rape culture.\n\nOn December 19, 2024, her former husband, Dominique Pelicot, was convicted of orchestrating herrapedozens of times by various men over nearly a decade after a trial that shocked France and pushed the country to examine systemic sexual assault.Fifty menwere found guilty of rape or sexual assault that day.\n\nOutside the southern French courtroom where her rapists were convicted and sentenced, Pelicot said: “Shame must change sides.” It became a rallying cry that helped shift the narrative around sexual violence in France and beyond.\n\nAs her new memoir, “A Hymn to Life: Shame Has to Change Sides,” is set to hit the shelves next week, Pelicot, 73, is speaking out and revealing what she had so far shared only in court. On Wednesday, she gave her first televised interview since that trial to public channel France 5.\n\nHere are the top takeaways.\n\nPelicot described her shock when police officers summoned her and delivered the bombshell that her husband of 50 years had been crushing sleeping pills into her food and drink, then inviting strangers to rape her while he recorded the assaults.\n\n“I don’t recognize myself in those photos. I said, ‘That’s not me,’” she said of the images investigators showed her. “Then I put on my glasses, and there I discovered this lifeless woman with a man she doesn’t know on her bed. I think my brain disassociated.”\n\nLooking back, Pelicot said, there were warning signs, but at the time she didn’t allow herself to confront them.\n\nShe remembers noticing a yellow stain on a pair of trousers shortly after she and Dominique Pelicot moved to the southern French village of Mazan. “I asked him whether he might be drugging me, and then he started crying.Was it my subconscious? I don’t know.”\n\nAnother incident involved a white beer that appeared to change color after Dominique Pelicot added what he claimed was mint syrup. When she questioned it, he poured the contents down the sink. “At the time I didn’t think anything of it,” she said.\n\nDespite the harrowing ordeal Pelicot endured, she said she still intends to visit her ex-husband in prison as part of her “healing process.”\n\nDuring the trial, she never addressed him directly, she said. Now, she wants “to look him directly in the eye and ask him, ‘Why did you do that?’”\n\nHer view of their 50-year marriage is complex. While she described feelings of betrayal and indignation, she said she still wants to hold on to happy memories, because they are all she has from her life.\n\nPelicot’s interview was an opportunity for her to address the cracks that have formed within her family since the revelations. She said it’s wrong to think that “a tragedy brings a family together.” Her relationship with her daughter Caroline is slowly healing, but her son David “needs more time,” she said.\n\n“I chose to live with Mr. Pelicot,” she explained. “They didn’t choose their father, so they’re in a different position, and I think the journey will take longer.”\n\nPelicot never imagined she would fall in love again, nor even want to. Yet in 2023, she met a man she identified only as Jean-Loup. “Meeting him was incredible,” she said. “I met this man who’s also been through difficult times, and it’s changed our lives.”\n\nCamille Knight contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2024/09/14/europe/hundreds-gather-france-giselle-pelicot-rape-victims-intl",
      "text": "Gisèle Pelicot"
    },
    {
      "url": "https://www.cnn.com/2024/12/19/europe/pelicot-trial-consent-analysis-intl",
      "text": "feminist hero"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/europe/german-pelicot-case-verdict-latam-intl",
      "text": "rape"
    },
    {
      "url": "https://www.cnn.com/2024/12/19/europe/pelicot-rape-trial-france-verdict-intl",
      "text": "Fifty men"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/europe/gisele-pelicot-rape-takeaways-interview-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/europe/gisele-pelicot-rape-takeaways-interview-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e4c5f0d40677a45edf8324432bc94938cacc205c30998c817157f03652bb0e11",
  "scraped_at": "2026-02-12T21:30:18.243829+00:00"
}