{
  "url": "https://lite.cnn.com/2026/01/09/politics/2026-election-calendar",
  "title": "CNN’s guide to the most important elections of 2026 | CNN Politics",
  "date": "2026-02-11T16:34:17.281773+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThis year’s midterms will not only shape the final two years of Donald Trump’s presidency; they’ll determine what politics after Trump might start to look like.\n\nA series of races that starts with primaries on March 3 will either preserve Republican majorities in Congress, helping Trump to push through his agenda, or give Democrats control of either the US House or Senate and the ability to stop his legislative priorities and open investigations into him.\n\nAlong the way, candidates and party leaders will dissect the results as they prepare for the 2028 presidential race, which will be the first national election in 16 years without Trump’s name on the ballot.\n\nHere are the key dates and contests they – and we – will be watching over the course of the next year:\n\nTexas is home to blockbuster Senate primaries on both sides that will tee up one of the year’s most high-profile contests – a race that is poised to offer clues about the types of candidates voters are looking to lead their parties – where tone and tactics might shape the outcomes more than policy proposals or ideology.\n\nIncumbent GOP Sen. John Cornyn is beingchallengedby state Attorney General Ken Paxton and Rep. Wesley Hunt. The Democratic contest featuresRep. Jasmine Crockettandstate Rep. James Talarico. Democrats will also choose a nominee for governor to run against incumbent GOP Gov. Greg Abbott, who is seeking a fourth term.\n\nThere’s seemingly less drama in the outcome of the Senate primaries in North Carolina, where formerDemocratic Gov. Roy Cooperandformer RNC chair Michael Whatleyappear headed toward a key general election clash.\n\nIllinois Sen. Dick Durbin’sretirementhas sparked a crowded field of Democrats seeking to replace the veteran lawmaker. Among the top contenders: Lt. Gov. Juliana Stratton, who is backed by Gov. JB Pritzker, and a pair of Chicago-area House members, Reps. Robin Kelly and Raja Krishnamoorthi.\n\nThe Ohio Senate race is effectively set, with GOP Sen. Jon Husted and former Democratic Sen. Sherrod Brown on a collision course for the November general election. Ohio has shifted from a perennial battleground to a reliably red state, but Brown is key toDemocrats’ hopesof flipping the Senate.\n\nThe Buckeye State also has an open contest for governor with GOP Gov. Mike DeWine ineligible to run again because of term limits. On the Republican side, former 2024 presidential candidate Vivek Ramaswamy is the favorite while former Ohio health director Amy Acton is the top Democratic contender.\n\nRepublican Sen. Bill Cassidy is facing a challenge from Rep. Julia Letlow, wholaunched a primary bidin January after receiving Trump’s endorsement.\n\nCassidy has largely supported the president’s second-term agenda but has voiced concerns about the administration’s moves on vaccines and was one of seven GOP senators who voted to convict Trump during his second impeachment trial in 2021 following the attack on the US Capitol. State Treasurer John Fleming and Public Service Commissioner Eric Skrmetta are also seeking the GOP nomination, while state Sen. Blake Miguez dropped his bid to run for Letlow’s US House seat.\n\nLouisiana’s switch to a partisan primary system could also be a factor. If no candidate receives a majority of the primary vote, the top two finishers would advance to a June runoff.\n\nGeorgia Republicans will pick a Senate nominee to challengeJon Ossoff, the lone Senate Democrat seeking reelection this year in a state Trump won in 2024. A contest that will offer clues about the GOP’s future direction features Reps. Buddy Carter and Mike Collins as well as former college football coach Derek Dooley, who is endorsed by Gov. Brian Kemp.\n\nBoth parties also have gubernatorial primaries in the race to succeed Kemp, who is term-limited. The Republican field includes Brad Raffensperger, the secretary of state who resisted Trump’s pressure campaign to overturn the results of the 2020 election in Georgia, and Lt. Gov. Burt Jones, who served as afake elector seeking to falsely certify Trumpas the winner that year. Trump has endorsed Jones. State Attorney General Chris Carr and health care executive Rick Jackson are also running in the GOP primary, setting up the potential for a June runoff if no candidate wins a majority of the vote in May.\n\nDemocratic contenders include former Atlanta Mayor Keisha Lance Bottoms, former GOP Lt. Gov. Geoff Duncan and former state Sen. Jason Esteves.\n\nLoyalty to Donald Trump andthe legacy of Mitch McConnellare the political forces that have shaped the Republican Senate primary in Kentucky, where Rep. Andy Barr, former state Attorney General Daniel Cameron and businessman Nate Morris all have ties to the retiring GOP senator but have instead touted their pro-Trump credentials.\n\nKentucky Rep. Thomas Massie will also face Trump-backed primary challenger Ed Gallrein. The president’s allies have made it a priority to knock out Massie as he’s become a thorn in Trump’s side on several issues, notably overthe release of the Jeffrey Epstein files.\n\nThere’s a crowded field to replace California Gov. Gavin Newsom. Democratic candidates include former Health and Human Services Secretary Xavier Becerra, San Jose Mayor Matt Mahan, former Rep. Katie Porter, billionaire and climate activist Tom Steyer, Rep. Eric Swalwell and former Los Angeles Mayor Antonio Villaraigosa. On the Republican side are Riverside County Sheriff Chad Bianco and conservative media personality Steve Hilton.\n\nUnder California’s primary system, all candidates run on the same primary ballot and the top two, regardless of party, advance to the general election.\n\nIowa could offer clues about whether Democrats are able tomake inroadsin more rural states. Democrat Rob Sand, the state auditor, is seeking to succeed outgoing GOP Gov. Kim Reynolds. The Republican field includes Rep. Randy Feenstra and farmer Zach Lahn.\n\nThe state also has an open Senate contest following GOP Sen. Joni Ernst’s decision not to seek reelection, with Rep. Ashley Hinson the favorite on the Republican side and a full field of Democratic contenders that includes state Sen. Zach Wahls; state Rep. Josh Turek, a two-time Paralympic gold medalist in wheelchair basketball; and Marine Corps veteran Nathan Sage.\n\nDemocrats are hoping that 2026 is the year they finally defeat Maine GOP Sen. Susan Collins, who has a proven track record of outperforming her party in the blue-leaning state. The question facing Democrats this year is whether Gov. Janet Mills, the favorite of the party establishment, or progressive Graham Platner, an oyster farmer and combat veteran, represent the best chance of accomplishing that goal.\n\nSome in the party worry Platner’s past controversial social mediapostscould jeopardize the party’s chances against Collins, while others on the left see Mills – who would be the oldest freshman senator ever elected – as unlikely to excite base voters.\n\nIn South Carolina, the GOP primary for governor will be closely watched as a gauge of the mood of Republican voters in a key early state ahead of the 2028 nominating process. Lt. Gov. Pamela Evette, state Attorney General Alan Wilson and Reps. Nancy Mace and Ralph Norman are among the contenders to succeed Gov. Henry McMaster.\n\nRep. Elise Stefanik’sdecisionto end her gubernatorial bid left Nassau County Executive Bruce Blakeman as the sole major Republican vying to challenge Democratic Gov. Kathy Hochul, who is facing a primary from Lt. Gov. Antonio Delgado.\n\nThe star power in the Empire State may be in the 12th Congressional District, where a wide field is seeking to succeed longtime Rep. Jerry Nadler. The Democratic primary includes state assembly members Alex Bores and Micah Lasher, longtime Republican lawyer turned Trump critic George Conway and Jack Schlossberg, the grandson of former President John F. Kennedy.\n\nIn Arizona, there is a crowded GOP primary for governor battling to challenge Democratic Gov. Katie Hobbs in a crucial battleground state. Trump has endorsed both business executive Karrin Taylor Robson and Rep. Andy Biggs – while Rep. David Schweikert has also launched a bid, opening up a key House seat. The state moved up its primaries from August 4.\n\nMichigan is a state that has it all. There is an open race for governor that features rising stars in both parties: Secretary of State Jocelyn Benson on the Democratic side and Rep. John James on the Republican side. A potential wildcard in the race is Detroit Mayor Mike Duggan, who left the Democratic Party to run as an independent. Democratic Lt. Gov. Garlin Gilchrist ended his bid for governor in January and launched a run for secretary of state.\n\nWith Democrat Gary Peters retiring, the state also has an open Senate race that Democrats must hold if they stand a chance of winning the majority. The top contenders in that primary are Rep. Haley Stevens, seen as the favorite of the party establishment, state Sen. Mallory McMorrow, and Abdul El-Sayed, a progressive who is a former executive director of the Detroit Health Department. Former GOP Rep. Mike Rogers, who lost a 2024 bid for Senate against Democrat Elissa Slotkin, is running again.\n\nThis day will serve up two big tests of the Democratic Party’s direction with an ideological clash in the Minnesota Senate race and a wide-open contest for governor in Wisconsin.\n\nIn Minnesota, moderate Rep. Angie Craig and progressive Lt. Gov. Peggy Flanagan are facing off for the Democratic nomination and the chance to succeed retiring Sen. Tina Smith. The GOP field includesformer sportscaster Michele Tafoya. The state will also host an open race for governor after Democrat Tim Walz’s decision not to seek reelection to a third term. Democratic Sen. Amy Klobuchar launched a bid in January, pledging to unify the state as it finds itself at the center of the Trump administration’s immigration crackdown. GOP contenders include state House Speaker Lisa Demuth and MyPillow CEO Mike Lindell.\n\nIn Wisconsin, the decision by Democratic Gov. Tony Evers to not seek reelection has drawn a large field of contenders that includes former Lt. Gov. Mandela Barnes, who narrowly lost a 2022 Senate bid, current Lt. Gov. Sara Rodriguez and Milwaukee County executive David Crowley. The GOP primary is less crowded, with Trump-endorsed Rep. Tom Tiffany seen as the leading contender.\n\nMassachusetts marks the fourth “M” state with a Democratic Senate primary highlighting the party’s divisions over some combination of age, ideology and/or tactics. In this instance, Rep. Seth Moulton, 47, has centered his challenge to Sen. Ed Markey, 79, around an argument forgenerational change.\n\nThe GOP primary in New Hampshire features two former senators seeking comebacks with John E. Sununu and Scott Brown. Trump has endorsed Sununu, solidifying his status as the favorite in the race. The winner will likely face off against Democratic Rep. Chris Pappas. The open seat created by the retirement of Sen. Jeanne Shaheen represents one of the GOP’s best pickup opportunities outside Georgia and Michigan.\n\nIn the House, Democrats need a net gain of three seats to win control of the chamber. During the 2018 midterms, during Trump’s first term, the party was able to gain 41 seats, although the universe of competitive races is smaller than it was eight years ago.\n\nWith the president’s dismal approval ratings and historical winds blowing against Republicans, Trump pressured GOP-led states to redraw congressional maps mid-decade to help preserve the party’s narrow majority. It sparked aredistricting arms raceacross the country as Democratic-run states followed suit to offset some of those potential gains.\n\nDemocrats face more of an uphill climb to win control of the Senate, where they face a difficult map with limited offensive opportunities. Given the balance of power in the Senate is currently split 53 to 47 in favor of Republicans, with Vice President JD Vance serving as a tiebreaker, Democrats would need to gain four seats to win the majority. Among their potential targets, Maine is the only state carried by former Vice President Kamala Harris in the 2024 election.\n\nThere are currently 27 Republican governors and 23 Democratic governors. Thirty-six seats are up for grabs on November 3, including a half-dozen that are likely to be premier presidential battlegrounds in 2028. Other statewide races for attorney general and secretary of state will also draw attention amid an intensifying focus on how elections are run.\n\nBeyond those contests, more than 6,000 legislative races and dozens of ballot measures will also be decided by voters.\n\nThis story has been updated with additional information.\n\nCNN’s Ethan Cohen and Molly English contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/09/politics/paxton-cornyn-texas-redistricting-fight",
      "text": "challenged"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/jasmine-crockett-colin-allred",
      "text": "Rep. Jasmine Crockett"
    },
    {
      "url": "https://www.cnn.com/2025/09/05/politics/james-talarico-senate-texas",
      "text": "state Rep. James Talarico"
    },
    {
      "url": "https://www.cnn.com/2025/07/23/politics/roy-cooper-democrats-us-senate",
      "text": "Democratic Gov. Roy Cooper"
    },
    {
      "url": "https://www.cnn.com/2025/07/24/politics/rnc-michael-whatley-senate",
      "text": "former RNC chair Michael Whatley"
    },
    {
      "url": "https://www.cnn.com/2025/04/23/politics/dick-durbin-senate-retirement",
      "text": "retirement"
    },
    {
      "url": "https://www.cnn.com/2025/08/12/politics/sherrod-brown-senate-ohio-2026",
      "text": "Democrats’ hopes"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/politics/julia-letlow-bill-cassidy-louisiana-senate",
      "text": "launched a primary bid"
    },
    {
      "url": "https://www.cnn.com/2025/03/30/politics/ossoff-trump-outrage-reelection-georgia",
      "text": "Jon Ossoff"
    },
    {
      "url": "https://www.cnn.com/2024/09/13/politics/burt-jones-georgia-2020-election",
      "text": "fake elector seeking to falsely certify Trump"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/politics/mitch-mcconnell-kentucky-senate-primary",
      "text": "the legacy of Mitch McConnell"
    },
    {
      "url": "https://www.cnn.com/2025/11/18/politics/video/jeffrey-epstein-donald-trump-thomas-massie-ro-khanna-jena-lisa-jones-congress-department-of-justice-mike-johnson",
      "text": "the release of the Jeffrey Epstein files"
    },
    {
      "url": "https://www.cnn.com/2025/09/02/politics/democrats-iowa-rural-revival-2026",
      "text": "make inroads"
    },
    {
      "url": "https://www.cnn.com/2025/10/16/politics/kfile-graham-platner-maine-senate-candidate-deleted-reddit-posts",
      "text": "posts"
    },
    {
      "url": "https://www.cnn.com/2025/12/19/politics/elise-stefanik-governor-us-house",
      "text": "decision"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/politics/michele-tafoya-us-senate-minnesota",
      "text": "former sportscaster Michele Tafoya"
    },
    {
      "url": "https://www.cnn.com/2025/10/15/politics/seth-moulton-launches-senate-primary-ed-markey",
      "text": "generational change"
    },
    {
      "url": "https://www.cnn.com/politics/state-redistricting-maps-vis",
      "text": "redistricting arms race"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/politics/2026-election-calendar",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/01/09/politics/2026-election-calendar",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e4c8d03b8b39bb3f77707afa01aad2061402135fdab71ad425e2dd8eaa0172a4",
  "scraped_at": "2026-02-11T16:34:17.281786+00:00"
}