{
  "url": "https://lite.cnn.com/2026/02/21/asia/yoon-suk-yeol-martial-law-insurrection-democracy-intl-hnk-dst",
  "title": "Yoon Suk Yeol: South Korea punishes former president who thought he could unravel democracy | CNN",
  "date": "2026-02-23T07:36:32.124030+00:00",
  "authors": [
    "Helen Regan",
    "Yoonjung Seo",
    "Gawon Bae",
    "CNN"
  ],
  "text": "Source: CNN\n\nIt took just 11 days for South Korean lawmakers to impeach former PresidentYoon Suk Yeolafter hedeclared martial lawand threatened to unravel decades of hard-won democracy.\n\nNow, 14 months after thatill-fated announcement,which led to lawmakers forcing their way past soldiers and police to enter parliament and security forces deployed to the election commission’s offices, Yoon has been convicted of leading an insurrection and sentenced to life in prison.\n\nYoon’s reckoning is the result of South Korea’s mammoth push to hold a head of state accountable for almost tearing up his nation’s democratic institutions.\n\nThough his snap decree only lasted six hours, the crisis threw the country into months of political chaos. Investigators have since alleged the depth of the brazen plot extended tosending secret drone flightsinto North Korea to try to provoke a conflict with arch-rival Kim Jong Un and justify martial law.\n\nIndeed, when news of Yoon’s address began pinging across her group chats at about 10:40 p.m. on December 3, 2024, Song Hwa said she prepared for the worst.\n\n“At first, I thought there was a war,” Song, 35, who runs an online apparel business, told CNN Wednesday. Her husband Heo Woojin said, “As soon as I saw the news, I just felt this huge, invisible pressure that I had to do something.”\n\nYoon was accusing the country’s main opposition party of sympathizing with Pyongyang and of “anti-state” activities. The military decree meant all political activities and protests were banned, troops could arrest people without a warrant, and news media was muzzled.\n\nThose draconian measures were never fully enforced. But for older South Koreans the decree brought back dark memories from years of terror underoppressive military rule.\n\nOn the night of the decree, the couple, who live in Seoul, hastily fed their cat Mango and jumped in the car with one aim: get to the National Assembly – South Korea’s parliament and seat of democracy in the heart of the capital.\n\n“I had screenshotted the constitution,” Song said. Specifically, the part where it says the National Assembly can request the lifting of martial law with a quorum vote.\n\nHeo said they took a longer route than normal, thinking the major highways across the Han River that snakes through the capital, or leading to the state broadcaster, would be blocked by security forces.\n\nBut their path was clear. At about 11:30 p.m. they parked their car near the legislature as helicopters buzzed overhead.\n\n“The chopper noise was really loud and it was sleeting. It felt like a scene in a movie,” Heo said.\n\nHundreds of people were already gathered at the front gate of parliament in the freezing December night, they said. Meanwhile, on the steps of the assembly building, protesters and lawmakers were facing off against troops who had blocked the entrance.\n\nLawmakers forced their way inside to reach the inner chamber, where they could vote down the military decree. Outside, one politiciangrabbed a soldier’s riflein what became one of the defining images from that night, saying that she felt like the “last line” of defense preventing security forces from accessing parliament.\n\nOthers piled up furniture to barricade the doors.\n\nAt around 1 a.m., 190 lawmakers, including several from Yoon’s own conservative party, voted unanimously to lift martial law. Yoon lifted the decree about three hours later.\n\nSong said she believes it was the people of South Korea who stopped martial law that night.\n\n“I think it was the citizens… who came together to protect our democracy,” she said.\n\n“There’s a quote I really like,” said Heo. “‘Courage isn’t the absence of fear, but acting in spite of it.’ The strength of the citizens who acted even when they were afraid was truly incredible.”\n\nYoon’s extraordinary decree was the first time a South Korean leader had imposed martial law in 44 years, sinceChun Doo-hwanseized power in a military coup, inaugurating an eight-year period of iron-fisted rule.\n\nChun was similarly convicted of insurrection, though he was later pardoned.\n\nSouth Korea has spent the four decades since shaping itself into a robust and scrappy democracy, with a political system that in many ways mirrors that of the United States: a presidential system with a strong executive branch. The presidential residence is even called the Blue House.\n\nCertain alleged parallels between Yoon and the current US president have also been noted by South Korean academics and even Yoon’s conservative die-hard supporters, whose American flags and“Stop the steal” signs– inspired by Donald Trump’s MAGA base – remain permanent fixtures at pro-Yoon rallies.\n\n“Both have very little regard for the truth. Both have little respect for long-standing customs and traditions that underpin democratic institutions. Both have little time for political cooperation,” said Cho Hee-koung, a law professor at Hongik University in Seoul.\n\n“(And) both have touted stolen elections and have spread fake news,” added Cho.\n\nA former prosecutor, Yoon was a political newcomer when he took office in 2022, winning the presidential election by a razor-thin margin. He was a conservative firebrand and staunch US ally, tough on China and North Korea.\n\nBut he faced plummeting approval ratings over economic issues and a series of scandals involving his wife and political appointments that prompted calls for him to resign. Months before the martial law order, his party suffered a bruising defeat in elections and opposition parties took control of the National Assembly. Yoon later claimed electoral fraud, but the allegations were never substantiated.\n\nYoon said martial law was the only way he could break a months-long political stalemate in which the main opposition Democratic Party had used parliament to impeach key cabinet members and hold up legislation.\n\n“The National Assembly brought about the national crisis and there was no other way but to awaken the people,” he said in closing statements during his trial, arguing that as president he was exercising his constitutional authority.\n\n“At the time, many thought that Yoon had failed in his auto-coup attempt because he was incompetent,” said Cho. “But we are now finding out that this had been in the planning for much longer and in much more detail than we had thought and it was by the skin of the teeth and much luck, bravery of ordinary citizens, civil disobedience by some members of the military that saved us.”\n\nPresiding judge Ji Gwi-yeon ruled Yoon’s deployment of troops to parliament and attempt to arrest political opponents, including current President Lee Jae Myung, who was then head of the opposition, were acts of insurrection.\n\nYoon has fought every legal action against him and his lack of remorse was part of the prosecution’s push for the death penalty – a largely symbolic move as South Korea hasn’t executed anyone in decades.\n\nThroughout proceedings, Yoon refused to answer summonses by investigators and engaged in a weeks-long showdown with authorities trying to detain him at his residence, telling supporters he would “fight to the end.”\n\nThough it’s not uncommon for former South Korean presidents to face legal trouble, Yoon’seventual arrestwas the first time such an action has been taken against a sitting leader.\n\nYoon described the insurrection charge as “a delusion and a work of fiction” and a political conspiracy. Following the verdict, his legal team said, “we will never yield to distortion and lies.”\n\nFormer defense minister Kim Yong-hyun was sentenced to 30 years in prison, and four other leaders in the military and police received sentences of between three and 18 years for aiding the insurrection. Former Prime Minister Han Duck-soo is already serving a23-year sentence.\n\nYoon has the right to appeal, though he still faces multiple othercriminal trials.\n\n“By and large, our democratic institutions have withstood a full-frontal attack,” said Cho. “At the same time, this real-life stress testing has really shown where the weak links are and what needs to be repaired.”\n\nSong and Heo say South Korean democracy was ultimately safeguarded by the power of its citizens.\n\n“To people who wonder, ‘Does doing this really change anything?’ I want to say that if you fight the world does change,” said Heo.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/04/03/asia/south-korea-yoon-profile-post-impeachment-intl-hnk",
      "text": "Yoon Suk Yeol"
    },
    {
      "url": "https://www.cnn.com/2024/12/03/asia/south-korea-martial-law-explainer-intl-hnk",
      "text": "declared martial law"
    },
    {
      "url": "https://www.cnn.com/2024/12/03/asia/south-korea-martial-law-intl/index.html",
      "text": "ill-fated announcement,"
    },
    {
      "url": "https://www.cnn.com/2025/11/13/asia/south-korea-yoon-drone-charges-intl-hnk-dst",
      "text": "sending secret drone flights"
    },
    {
      "url": "https://www.cnn.com/2024/12/04/asia/south-korea-yoon-impeachment-presidents-fate-intl-hnk",
      "text": "oppressive military rule."
    },
    {
      "url": "https://www.cnn.com/2024/12/05/asia/an-gwi-ryeong-south-korea-martial-law-intl-hnk",
      "text": "grabbed a soldier’s rifle"
    },
    {
      "url": "https://www.cnn.com/2021/11/23/asia/chun-doo-hwan-dies-intl-hnk",
      "text": "Chun Doo-hwan"
    },
    {
      "url": "https://www.cnn.com/2025/01/07/asia/south-korea-stop-the-steal-yoon-intl-hnk",
      "text": "“Stop the steal” signs"
    },
    {
      "url": "https://www.cnn.com/2025/01/14/asia/south-korea-yoon-suk-yeol-residence-intl",
      "text": "eventual arrest"
    },
    {
      "url": "https://www.cnn.com/2026/01/21/asia/south-korea-han-yoon-jailed-intl-hnk",
      "text": "23-year sentence."
    },
    {
      "url": "https://www.cnn.com/2025/02/24/asia/south-korea-yoon-suk-yeol-impeachment-trial-intl-hnk",
      "text": "criminal trials"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/asia/yoon-suk-yeol-martial-law-insurrection-democracy-intl-hnk-dst",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/asia/yoon-suk-yeol-martial-law-insurrection-democracy-intl-hnk-dst",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e4eaaaaec82fee96a809c175aadc587fba3bbedfb27f90e9e0ccb034e002c16a",
  "scraped_at": "2026-02-23T07:36:32.124043+00:00"
}