{
  "url": "https://lite.cnn.com/2026/02/13/health/rfk-jr-american-healthcare-public-trust",
  "title": "Trump promised RFK Jr. would ‘restore faith in American health care.’ A year in, trust has plummeted | CNN",
  "date": "2026-02-14T07:08:14.577969+00:00",
  "authors": [],
  "text": "Source: CNN\n\n“Our public health system has squandered the trust of our citizens,” President Donald Trumpsaidon February 13, 2025, the day his nominee to run the nation’s health agencies, Robert F. Kennedy Jr., was sworn in. “They don’t trust us. They don’t trust anybody, frankly. They’ve gone through hell.”\n\nTrump promised that Kennedy would “lead our campaign of historic reforms and restore faith in American health care.”\n\nA year later, polling shows that RFK Jr.’s tenure atop the US Department of Health and Human Services has had the opposite effect. Trust in government health agencies has plummeted,accordingto health policy and research group KFF, with declines across the political spectrum. And experts told CNN that they fear things could get worse.\n\n“Today, the federal government’s public health agencies and leaders represent the greatest threat to efforts to prevent measles, whooping cough and other vaccine-preventable diseases,” said Dr. Jason Schwartz, an associate professor at Yale School of Public Health. It’s “a scenario that would have been inconceivable a few years ago.”\n\nHHS spokesperson Andrew Nixon said that trust in public health was damaged by the Biden administration’s “inconsistent guidance and a message to Americans to ‘trust the experts’ without showing the evidence.”\n\n“Secretary Kennedy’s mandate is to restore transparency, scientific rigor, and accountability to restore the trust the Biden administration squandered,” Nixon continued. “Secretary Kennedy is leading the most transparent HHS in history, with unprecedented disclosure and openness aimed at restoring public trust in federal health agencies.”\n\nKennedy’s strategy has at times involved gutting organizations; after he fired all 17 experts on the US Centers for Disease Control and Prevention’s vaccine advisory panel in June, he published anopinion piecein the Wall Street Journal headlined, “HHS Moves to Restore Public Trust in Vaccines.”\n\nAnd he’s moved to dramatically reshape the makeup of HHS.\n\nThe day after Kennedy’s swearing-in, Valentine’s Day,thousandsof employees were fired from their jobs at the CDC, the US Food and Drug Administration, the US National Institutes of Health and other health agencies, part of a Department of Government Efficiency purge. It would precede an even biggerreorganizationof HHS just six weeks later that aimed to shrink its ranks by nearly a quarter – a total of about 20,000 employees.\n\nMeanwhile, public health emergencies were already on his doorstep.\n\nTwo weeks after Kennedy was sworn in, health officials in Texas announced that a school-age child haddiedin the fast-growing measles outbreak centered in the western part of the state. Kennedy, asked about it in a Cabinet meeting later that day, called measles outbreaks “not unusual.” It was the first death in the US from measles in a decade.\n\nThe year that followed would bringtwomoredeaths from measles, an evenbiggeroutbreak in South Carolina and more simmering in other states. Kennedy’s first year also brought dramatic upheavals ofvaccine policyandexpert panels, the cancellation ofthousandsofscientific research grantsand acontinuedpurgeof leadership from federal health agencies.\n\n“I worry that there are entire domains of knowledge that are no longer well-represented at CDC,” said Dr. Caitlin Rivers, an associate professor at the Johns Hopkins Bloomberg School of Public Health.\n\nShe pointed out that the agency has been a source of expertise that local health departments count on.\n\n“If you are facing a case ofpneumonic plagueor ahemorrhagic fever virus, you’re not going to have that in most state or local health departments,” Rivers said. “You’re going to look to CDC to provide that expertise and support. And a lot of those people aren’t there anymore.”\n\nThe CDC is also still without a confirmed director; the White Housewithdrewits nomination for Trump’s first pick, Dr. David Weldon, a former Florida congressman and Kennedy ally, hours before his confirmation hearing in March amid concerns that he wouldn’t win sufficient votes.\n\nWeldon subsequently released a lengthy statement in which he attributed the scuttling of his nomination to his past focus on vaccine safety, including the preservativethimerosal, which was removed from most childhood vaccines decades ago despite no evidence of harm. He also defended Andrew Wakefield, the British physician whomadedebunked claims of a link between the measles-mumps-rubella vaccine and autism in 1998.\n\nTrump’s next pick, Dr. Susan Monarez, was confirmed andsworn inin July, only to be ousted less than a month later after aclashwith Kennedy over what she described as her refusal to sign off on vaccine policy regardless of scientific evidence and to dismiss career vaccine officials without cause. Kennedy latertold Congressthat Monarez was lying. Several high-level veteran CDC officials also resigned after Monarez’s departure.\n\nAll of this happened just weeks after a shooter fired nearly 500 rounds at CDC headquarters in Atlanta, killing a local police officer and leaving windows pockmarked with bullet holes. The Georgia Bureau of Investigationsaidthe shooter had expressed discontent with the Covid-19 vaccine in written documents and “wanted to make the public aware of his public distrust.”\n\nIn aletterafter the shooting, hundreds of current and former HHS employees implored Kennedy to “stop spreading inaccurate health information,” noting that the attack at CDC “was not random.”\n\nIn response, a statement from the department said that Kennedy was “standing firmly with CDC employees” and that “for the first time in its 70-year history, the mission of HHS is truly resonating with the American people.”\n\nPolling suggests that’s not the case.\n\nIn April 2025, trust in the CDC as a source of reliable health information stood at 59%, according to KFF. There was a large divide between political parties: 70% for Democrats and 51% for Republicans.\n\nNow, overall trust in the CDC has fallen to 47%, according to KFF pollresultsreleased last week. Trust was down 15 percentage points to 55% among Democrats and down 8 percentage points to 43% among Republicans, although that’s a slight rebound from a low in September.\n\nTrust in Kennedy himself as a source of health information was also low, with 37% of those polled in January saying they trust him a great deal or a fair amount. Only Trump scored lower, at 30%.\n\nThe poll was conducted weeks after HHS announced anoverhaulof the US vaccine schedule for children to align it more closely with other countries’, and in particular, Denmark’s – a country with a population of about 6 million and free universal health care. The result was a reduction in routinely recommended vaccines from 17 to 11, a move decried by public health experts as lacking evidence and putting children at risk.\n\n“HHS has largely abandoned the process of evidence gathering and evaluation that guided the recommendations process for decades and helped save countless lives,” said Dr. Michael Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota. “In its place, decisions are being made based on ideology and politics.”\n\nOsterholm cited the overhaul of the vaccine schedule as well as the CDC’s decision to stop universally recommending a dose of the hepatitis B vaccine at birth, a move that modelingsuggestedcould lead to more infections, long-term health complications and deaths.\n\n“The doubt and distrust federal health authorities continue to sow in vaccines will result in fewer people being vaccinated and more people getting seriously ill from vaccine-preventable diseases,” Osterholm said. “We’re already seeing the results of declining measles vaccinations, as measles outbreaks in the U.S. grow larger and larger.”\n\nIn December, Kennedyswore inDr. Ralph Abraham as principal deputy director of the CDC. Abraham had served as surgeon general in Louisiana, where hereduced supportfor some mass vaccination campaigns.\n\nLast month, faced with the prospect that the US could lose measles elimination status after 26 years, Abrahamtoldreporters that it would be “the cost of doing business” with the nation’s porous borders.\n\nOn Sunday, Dr. Mehmet Oz, administrator of the US Centers for Medicare and Medicaid Services,toldCNN’s Dana Bash that he didn’t believe US health officials’ posture toward vaccines was contributing to the growing outbreaks, a statement that beggared belief among many who’ve heard Kennedy equivocate on vaccine safety and championunproven treatmentsfor measles.\n\n“We’ve advocated for measles vaccines all along,” Oz told Bash. “Secretary Kennedy’s been at the very front of this.”\n\nSupporters of Kennedy, of course, argue that he’s transforming health care for the better.\n\nDr. Kevin Roberts, president of the conservative think tank the Heritage Foundation, last week celebrated “one year of winning at the Department of Health and Human Services,” calling Kennedy “the most consequential public health official leading that agency in modern American history.”\n\nHe cited moves including the release of new dietary guidelines “that are going to get Americans eating real food again,” including “a revolution in protein”; “increasing transparency and ensuring scientific integrity across all health agencies”; and the overhaul of the CDC’s childhood immunization recommendations.\n\n“You’re a popular guy at Heritage, Mr. Secretary,” Roberts said.\n\nNixon, the HHS spokesperson, said the agency “is exercising its full authority to deliver results for the American people,” citing removal of the “black box” warning from hormones used to treat menopause symptoms, efforts to lower drug prices and streamline prior authorization, and increased scrutiny of organ transplants, among other efforts.\n\nThe White House is leaning into issues like Trump’s “most favored nation” deals that aim to lower drug prices, as well as its focus on healthier eating, as the midterms approach.\n\nThat includespersonnel movesannouncedThursday that restructure Kennedy’s senior-most ranks, enabling the White House to exercise tighter control over key areas of HHS, an administration official told CNN.\n\nAnd though nutrition and drug pricing are broadly more popular issues, outside health experts said that even moves in those areas can’t compete in impact with the damage done in the past year to public health systems.\n\n“Everything else pales in significance,” said Dr. Marion Nestle, an emerita professor of nutrition, food studies and public health at New York University.\n\nNestle had initially expressedoptimismabout some of Kennedy’s food policy goals as he laid them out before the presidential election. And she noted a few accomplishments: apromisefrom food companies to remove artificial dyes by the end of 2027, adefinitionof ultraprocessed foods being worked on at the FDA, and onreformingthe procedure for chemicals to be considered GRAS, or Generally Recognized as Safe.\n\nBut she wished more progress had been made there, too.\n\n“One big disappointment is the lack of progress on removing industrial and agricultural chemicals from the food supply, as promised,” Nestle said. “MAHA,” Kennedy’s Make America Healthy Again movement, “has so much momentum behind it; it’s a shame more couldn’t be accomplished.”\n\nLast month’sreleaseof the new US Dietary Guidelines did garner support from groups including theAmerican Medical Association, particularly for spotlighting concerns about highly processed foods and sugar-sweetened beverages.\n\nAnd Dr. Jerold Mande, an adjunct professor of nutrition at the Harvard T.H. Chan School of Public Health who worked in food policy under Presidents George H.W. Bush, Bill Clinton and Barack Obama, pointed toeffortsto improve diet quality through Supplemental Nutrition Assistance Program, or SNAP, benefits as potentially particularly impactful.\n\nBut he gives HHS an F grade when it comes to investing in nutrition research, which he argues has been historically significantlyunderfundedby the NIH and hasn’t improved under Kennedy. Moreover, he said, the administration’s messaging even on popular issues is unlikely to fulfill its promise to restore trust.\n\nLast month, Kennedy posted a clip to his social media feeds of a version of a “South Park” episode from 2014. In theoriginal, the joke is that the food pyramid has been upside-down the whole time; flipping it put butter, meat and dairy in the biggest places at the top.\n\n“Nutrition is stabilizing!” a scientist at the US Department of Agriculture declares, and the then-secretary of agriculture says the president should be told to “have some steak with his butter.”\n\nIn Kennedy’sversion, he’s the one declaring that the pyramid is upside-down. When it flips, it reveals HHS’s newversion, which does indeed feature steak and cheese at the top.\n\nAnd though it’s funny, Mande said, “It’s kind of this scene where what was right was wrong, what was wrong was right – this whole thing that somehow we’ve been all told the wrong things all along.”\n\nIt’s a common theme in messaging from Kennedy and his health officials. But, Mande said, “that is not a way to regain trust, to suggest that everything you’ve been told your whole life was somehow a conspiracy, and now you should trustus.”\n\n“Obviously,” he said, “most people will take from that: ‘Gee, we shouldn’t trust anybody.’”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.presidency.ucsb.edu/documents/remarks-during-swearing-ceremony-for-robert-f-kennedy-jr-secretary-health-and-human",
      "text": "said"
    },
    {
      "url": "https://www.kff.org/health-information-trust/trust-in-cdc-and-views-of-federal-childhood-vaccine-schedule-changes/",
      "text": "according"
    },
    {
      "url": "https://www.wsj.com/opinion/rfk-jr-hhs-moves-to-restore-public-trust-in-vaccines-45495112?gaa_at=eafs&gaa_n=AWEtsqfOlbFbLypLjCS3y22tJw3V5OaL5fuT0OBNsIw6CmeQtjrlZTxDrpN6Q8egde8%3D&gaa_ts=698e60da&gaa_sig=L7UkYCxz5BFY4ghoXY6o69sUmZSVXPtQjkJyRRJh_vuDq19c2nsbntpmprg8OsvzVCJw2pmuOONYtNF77XqEtg%3D%3D",
      "text": "opinion piece"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/politics/probationary-federal-employees-agencies-firings-doge",
      "text": "thousands"
    },
    {
      "url": "https://www.cnn.com/2025/04/01/health/staff-cuts-at-federal-health-agencies-have-begun",
      "text": "reorganization"
    },
    {
      "url": "https://www.cnn.com/2025/02/26/health/texas-measles-death",
      "text": "died"
    },
    {
      "url": "https://www.cnn.com/2025/04/06/health/measles-texas-second-child-dies",
      "text": "two"
    },
    {
      "url": "https://www.cnn.com/2025/03/06/health/measles-death-new-mexico",
      "text": "more"
    },
    {
      "url": "https://www.cnn.com/2026/01/27/health/largest-us-measles-outbreak-south-carolina",
      "text": "bigger"
    },
    {
      "url": "https://www.cnn.com/2025/05/27/health/covid-vaccine-pregnant-women-children-recommendation",
      "text": "vaccine policy"
    },
    {
      "url": "https://www.cnn.com/2025/06/09/health/rfk-cdc-vaccine-advisers-removed",
      "text": "expert panels"
    },
    {
      "url": "https://grant-witness.us/",
      "text": "thousands"
    },
    {
      "url": "https://www.cnn.com/2025/05/13/health/trump-administration-nih-funding-sanders-report",
      "text": "scientific research grants"
    },
    {
      "url": "https://www.cnn.com/2025/03/28/health/fda-vaccine-peter-marks-resigns",
      "text": "continued"
    },
    {
      "url": "https://www.cnn.com/2025/02/23/health/public-health-job-cuts",
      "text": "purge"
    },
    {
      "url": "https://www.cnn.com/2025/07/18/health/pneumonic-plague-bacteria-infection-wellness",
      "text": "pneumonic plague"
    },
    {
      "url": "https://www.cnn.com/2024/10/28/health/lassa-fever-case-iowa",
      "text": "hemorrhagic fever virus"
    },
    {
      "url": "https://www.cnn.com/2025/03/13/health/cdc-weldon-nomination-withdrawn",
      "text": "withdrew"
    },
    {
      "url": "https://www.cnn.com/2025/06/25/health/thimerosal-controversy-rfk-explained",
      "text": "thimerosal"
    },
    {
      "url": "https://www.cnn.com/videos/title-2573118",
      "text": "made"
    },
    {
      "url": "https://www.hhs.gov/press-room/secretary-kennedy-swears-in-susan-monarez-cdc-director.html",
      "text": "sworn in"
    },
    {
      "url": "https://www.cnn.com/2025/09/16/health/monarez-cdc-senate-testimony",
      "text": "clash"
    },
    {
      "url": "https://www.cnn.com/2025/09/04/health/video/rfk-jr-hearing-monarez-digvid",
      "text": "told Congress"
    },
    {
      "url": "https://www.cnn.com/2025/08/12/us/cdc-atlanta-shooting-shots-windows",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2025/08/20/health/rfk-congress-misinformation-letter-cdc",
      "text": "letter"
    },
    {
      "url": "https://www.kff.org/public-opinion/kff-polling-on-health-information-and-trust/?entry=trusted-sources-of-health-information-who-parents-trust-for-childhood-vaccine-information",
      "text": "results"
    },
    {
      "url": "https://www.cnn.com/2026/01/05/health/childhood-vaccine-schedule-overhaul",
      "text": "overhaul"
    },
    {
      "url": "https://www.cnn.com/2025/12/16/health/cdc-hepatitis-b-vaccines",
      "text": "suggested"
    },
    {
      "url": "https://www.cdc.gov/media/releases/2025/2025-principal-deputy-director.html",
      "text": "swore in"
    },
    {
      "url": "https://www.cnn.com/2025/02/13/health/louisiana-mass-vaccination",
      "text": "reduced support"
    },
    {
      "url": "https://www.cnn.com/2026/01/20/health/cdc-south-carolina-measles-briefing",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/politics/video/cms-dr-oz-measles-trumprx-vaccine-lower-drug-prices",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/2025/03/06/health/kennedy-measles-texas-doctor-treatment",
      "text": "unproven treatments"
    },
    {
      "url": "https://www.cnn.com/videos/title-2573118",
      "text": "most favored nation"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/politics/kennedy-hhs-change-control-vaccine",
      "text": "personnel moves"
    },
    {
      "url": "https://www.hhs.gov/press-room/secretary-kennedy-enhances-management-team-accelerate-president-trumps-priorities-maha-agenda.html",
      "text": "announced"
    },
    {
      "url": "https://www.cnn.com/2024/10/30/health/rfk-jr-health-policy",
      "text": "optimism"
    },
    {
      "url": "https://www.cnn.com/2025/08/04/business/maha-rfk-food-artificial-colors",
      "text": "promise"
    },
    {
      "url": "https://www.fda.gov/news-events/press-announcements/hhs-fda-and-usda-address-health-risks-ultra-processed-foods",
      "text": "definition"
    },
    {
      "url": "https://www.cnn.com/2025/03/11/health/gras-reform-kennedy-wellness",
      "text": "reforming"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/maha-midterms-rfk-tony-lyons",
      "text": "MAHA"
    },
    {
      "url": "https://www.cnn.com/2026/01/07/health/dietary-guidelines-rfk-maha",
      "text": "release"
    },
    {
      "url": "https://www.ama-assn.org/press-center/ama-press-releases/ama-applauds-dietary-guidelines-announces-commitments-nutrition",
      "text": "American Medical Association"
    },
    {
      "url": "https://www.cnn.com/2025/12/30/health/snap-restrictions-begin",
      "text": "efforts"
    },
    {
      "url": "https://report.nih.gov/funding/categorical-spending#/",
      "text": "underfunded"
    },
    {
      "url": "https://southpark.cc.com/video-clips/qcl2i8/south-park-flip-the-pyramid",
      "text": "original"
    },
    {
      "url": "https://x.com/SecKennedy/status/2009030101426426219",
      "text": "version"
    },
    {
      "url": "https://realfood.gov/",
      "text": "version"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/health/rfk-jr-american-healthcare-public-trust",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/health/rfk-jr-american-healthcare-public-trust",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e5285a2c61688668b912398af910d6c932e5c7ccb162832e9e251bc754743f08",
  "scraped_at": "2026-02-14T07:08:14.577983+00:00"
}