{
  "url": "https://lite.cnn.com/2026/02/25/politics/tony-gonzales-late-staffer-husband",
  "title": "Late staffer’s husband calls Rep. Tony Gonzales a ‘predator’ amid affair allegations | CNN Politics",
  "date": "2026-02-26T07:31:06.160118+00:00",
  "authors": [
    "Piper HudspethBlackburn"
  ],
  "text": "Source: CNN\n\nThe husband of a late staffer to Rep. Tony Gonzales called the congressman a “predator” on Wednesday, and said that the Texas Republican has “continued to lie to the American people” amid affair allegations.\n\n“You know, the guy’s a predator. You know, he’s continued to lie to the American people, his constituents,” Adrian Aviles told CNN’s Erin Burnett on “OutFront” in an interview where he explained why he released alleged text messages between Gonzales and his wife, Regina Ann Santos-Aviles.\n\nGonzales hasdeniedthat he had an affair with Santos-Aviles, who died by suicide last year, and has said he’s being blackmailed. But the allegations have gained new traction in the final days leading up to the congressman’s primary election next week. Gonzales is also facing calls from some of his fellow congressional Republicans to resign.\n\nCNN has reached out to Gonzales’ office for comment.\n\nThe congressmantold CNNon Tuesday that he would not resign.\n\n“There will be an opportunity for all the details and facts to come out,” Gonzales said. “What you’ve seen is not all the facts. And there will be ample time for all of that to come out.”\n\nAn attorney who represents Avilestold CNNlast week that his client’s spouse had confessed that she had been having an affair with Gonzales in June 2024 and had shown text messages to her husband that revealed the extent of the affair.\n\nSantos-Aviles, a former staffer in Gonzales’ district office in Uvalde, Texas, died in September,according to CNN affiliate KENS.The county medical examiner ruled that she died of self-immolation and listed her manner of death as suicide.\n\nAviles insisted during the interview Wednesday that he did not go public with his claims with a political motive.\n\n“This is not a political thing for me. I want everybody to know that. I don’t care two cents about the whole political matter behind it,” he said. “I care about facts. I care about what he has done and how he’s continued to lie on on Regina’s name.”\n\n“This is you know, this is this is not only about her, but this is also about my son and showing my son that, you know, we stand up to cowards. This guy is a coward,” Aviles said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
      "text": "denied"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/politics/tony-gonzales-affair-allegations",
      "text": "told CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/politics/tony-gonzales-denies-affair-allegations",
      "text": "told CNN"
    },
    {
      "url": "https://www.ksat.com/news/ksat-investigates/2026/02/19/i-will-not-be-blackmailed-rep-gonzales-accuses-former-aides-husband-of-trying-to-profit-from-wifes-death-affair/",
      "text": "according to CNN affiliate KENS."
    }
  ],
  "hash": "e585dde41086142c1113f90066900ebcf1a1ee91373e1c94640fc4fca3be5781",
  "scraped_at": "2026-02-26T07:31:06.160130+00:00"
}