{
  "url": "https://lite.cnn.com/2026/02/17/sport/benfica-goalkeeper-anatoliy-trubin-looks-for-more-champions-league-magic-against-real-madrid",
  "title": "Anatoliy Trubin: Benfica goalkeeper looks for more Champions League magic against Real Madrid | CNN",
  "date": "2026-02-19T07:32:47.386071+00:00",
  "authors": [
    "Patrick Snell, CNN"
  ],
  "text": "Source: CNN\n\nWhen Benfica and Ukraine goalkeeperAnatoliy Trubincomes to one day look back on his playing career, there’s one moment he’ll likely never ever forget.\n\nThe time he was sent forward by As Águias manager José Mourinho to score a crucial 98th minute header against the mighty, 15-time European championReal Madrid.\n\nTrubin’s goal that night in Lisbon’s Estádio da Luz last month had major ramifications. The Portuguese giant had been heading out of the Champions League on goal difference until the 6-foot-6-inch keeper rose superbly to head home a free kick and seal a dramatic 4-2 victory which put Benfica into the playoffs for the last 16.\n\nLos Blancos also ended up in the playoffs where, it just so happens, the two teams will meet again over two legs.\n\n“It was something, I don’t know, unbelievable. It’s stuck in my mind, I think, for all my life,” Trubin toldCNN Sportsas he reflected on his first professional goal. “I will tell this to my children, of course. It’s something unique. Something special. I have never had this before.\n\n“I’m not emotional as a person. But in that moment, it was something crazy. All of my emotion was out. I do just what comes to my head. Running, screaming, and after sliding on my knees. And you know I still have some wounds on my knees.”\n\nBefore joining Benfica, the 24-year-old played for Shakhtar Donetsk in his homeland, where his thoughts quickly turned after scoring his famous goal, one that he dedicates to the people of Ukraine.\n\n“It’s a difficult time right now. No electricity, no water. So maybe this goal brings some light to Ukrainian people. Some of the Ukrainians also wrote to me after this goal, saying some good words. So also in this way, maybe they stop to think about all of the problems in the country for one beautiful moment,” Trubin said.\n\nDuring his time with Shakhtar, Trubin and his teammates would raise money for victims of the war with Russia and the goalkeeper has been proactive in using his platform to send messages of hope to those faced with the brutal reality of the conflict.\n\n“My people don’t have too much,” he said. “They try to catch every good moment, and this goal was one of these moments, so I’m really happy about it. I hope the war will stop as soon as possible.”\n\nIn finding the back of the net, Trubin now becomes the fifth goalkeeper to score in the Champions League, but don’t think for one moment he’s getting carried away by his goalscoring exploits.\n\nNext up for Benfica is the first leg of the playoff encounter with Los Merengues on Tuesday as the two teams once again go head-to-head in the Portuguese capital.\n\nTrubin’s aim this time around is less about scoring and more a case of trying to stop Madrid superstar Kylian Mbappé who put two past him in the league phase.\n\n“It’s actually difficult to stop him because he’s probably one of the best players in the world. And actually, I played against him also with the national team, and he also scored on me twice. And for me, I think he has the best finishing probably in the world right now,” Trubin said.\n\n“I think it will be completely different games because this is the playoffs. More difficult, of course, because now they will be motivated (and) more angry because they lost to us and dropped the top-eight spot.”\n\nWhatever the outcome of the playoffs, Trubin’s focus will soon be fully on the national team as Ukraine looks to qualify for its first World Cup in two decades. The Ukrainians face Sweden toward the end of March in a playoff semifinal with history on the line.\n\n“It’s probably one of the most important moments maybe in our history because the last time Ukraine played in the World Cup was 20 years ago in 2006,” Trubin said.\n\n“This is a good chance (and) good opportunity to go to the World Cup and bring the nation some happiness. Some bright moments in this difficult time, so it will be really important and (some) really difficult matches (both) on the pitch and also I think mentally, so again we need to be ready.\n\n“Everyone – and I think with the help of our people in Ukraine – we can do it.”\n\nBut for now, it’s another Champions League showdown with the 15-time European Cup winner that’s top of Trubin’s agenda.\n\nBut as far as finding the back of the net again is concerned, don’t expect more goals from Benfica’s goalkeeper any time soon: Trubin says he’s leaving that to the strikers.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/sport/soccer-champions-league-playoffs-round",
      "text": "Anatoliy Trubin"
    },
    {
      "url": "https://www.cnn.com/2025/09/30/sport/soccer-champions-league-almaty-kazakhstan-real-madrid-intl",
      "text": "Real Madrid"
    },
    {
      "url": "https://www.cnn.com/sport",
      "text": "CNN Sports"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/sport/benfica-goalkeeper-anatoliy-trubin-looks-for-more-champions-league-magic-against-real-madrid",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/sport/benfica-goalkeeper-anatoliy-trubin-looks-for-more-champions-league-magic-against-real-madrid",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e60f366b13a218087274ee6838ba4f103617470617ad26afc2361dab5db30865",
  "scraped_at": "2026-02-19T07:32:47.386084+00:00"
}