{
  "url": "https://lite.cnn.com/2025/11/17/style/met-gala-2026-theme",
  "title": "The 2026 Met Gala theme, revealed | CNN",
  "date": "2026-02-25T07:32:58.648361+00:00",
  "authors": [
    "Rachel Tashjian",
    "Leah Dolan"
  ],
  "text": "Source: CNN\n\nWhat’s the best dressed painting of all time?\n\nIt’s a question the Metropolitan Museum of Art hopes to answer with its next Costume Institute exhibition, which it revealed on Monday morning will be“Costume Art.” Opening May 10, the showcase will pair almost 200 artworks with around 200 garments and accessories in an effort to join the dots between fashion and fine art once and for all. “Costume Art” is also the show that will animate what is arguably fashion’s splashiest, starriest night: the Met Gala.\n\nThe dress code for the Met Gala itself is even broader: simply, “Fashion is Art.”\n\n“The title ‘Costume Art’ refers to the history of the Costume I﻿nstitute,” said Andrew Bolton, the Costume Institute’s curator, who selects each year’s theme, at a press conference. Fashion, he explained, has “the status of art because of, and not in spite of, its relation to the body.”\n\nWhile fashion exhibitions at museums tend to divorce a garment from its life on the human form, here the Met will emphasize that connection as the quality that puts clothing on the same pedestal as a Greek statue or Albrecht Dürer engraving.\n\nRecently retired ballerina Misty Copeland was on hand to explain how Bolton plans to use garments and artworks to push against the notion of an idealized body: “What struck me most was his belief in fashion as an embodied art. Something deeply connected to who we are,” Copeland said. “The show makes a powerful case for the body in all its forms as a work of art, worthy of being seen, elevated and celebrated.”\n\nWhile the theme may strike some as sleepy — “fashion is art!” is well-trodden territory — it is the space, not the show’s theme, that may be the biggest news. Twelve-thousand square-feet of exhibition space will be newly dedicated to the Costume Institute, just off the museum’s Great Hall. “It really recognizes the central role of fashion not just within the Met, but within culture,” Bolton told CNN after the the press conference.\n\nThe galleries carry an august name: Condé M. Nast, the late founder of the business that publishes Vogue, the style bible synonymous with the Met Gala, as well as The New Yorker, Vanity Fair and GQ. The new space was made possible via a donation of an undisclosed size from the company. That will likely raise eyebrows: Condé Nast is in the news more frequently for its fading fortunes and disagreements with its union, than its financial wins.\n\nAlso in attendance was Anna Wintour (sat next to Michael Kors), who earlier this yearrelinquished her title as Vogue US’s editor-in-chiefbut remains as Vogue’s global editorial director, as well as chief content officer for Condé Nast, meaning she retains her position supervising the annual Met Gala, which she transformed from a quiet society event into a global spectacle of celebrity and high octane fashion.\n\nThe fashion sponsor is the French luxury label Saint Laurent, along with Condé Nast and, in another surprising fashion play, Jeff Bezos and Lauren Sánchez Bezos. Typically, the sponsoring brand will bring a few tables’ full of guests, all dressed in their clothes. Bezos and Sánchez Bezos’s financial support marks the couple’s latest move in their quest to evolve from mere cartoon zillionaires to style cognoscenti: In addition to attending the gala in 2024 and posing for the cover of Vogue US,Sánchez’s Earth Fund recently announced a $6.25 million partnership with the CFDA to promote sustainability in fashion.\n\nThe Met Gala, and its less influential though no less opulent exhibition, has become a red carpet machine that is arguably more anticipated and dissected than the Oscars. In a good year, the show and gala inspire the public to think more critically about the purpose and possibility of clothes. Designers jockey for months to dress stars like Rihanna, Zendaya and supermodels in boundary-pushing designs. Some of the museum’s most influential exhibitions, like2019’s Camp-themed show, or 2011’s tribute to the late Alexander McQueen, have played a hand in making streetstyle and red carpets more outrageous or convincing the public that fashion is a craft on the level of fine art. With its upcoming exhibition and new space, Bolton and the museum are clearly keen to ensure that no one forgets fashion can demand the effort and genius required of a Renaissance masterpiece.\n\nAt other times, confusing or milquetoast themes have made the event feel out of touch.2024’s “Sleeping Beauties,”which used AI to celebrate the fragility and transient nature of fashion, was too riddled by gimmicky scientific ambitions to illuminate its gowns and flower-trimmed hats, andthe previous year’s tribute to Karl Lagerfeldneglected to account for the late designer’s controversial reputation.\n\nLast year, the Met theme was “Superfine: Tailoring Black Style,” and marked the first time the museum had focused specifically on the style and designs of Black Americans, and the first to highlight menswear since 2003.\n\nThe gala, for which tickets reportedly cost some $75,000, typically raises record funds for the museum: Last year, it brought in a whopping $31 million. The gala is the sole fundraiser for the Costume Institute’s exhibitions, acquisitions and maintenance; unlike other curatorial departments at the Met, the Costume Institute receives no money from the museum’s budget.\n\nAs for more gala details and predictions? The content machines at Vogue have their work cut out for them over the next five months.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2025/09/02/style/american-vogue-chloe-malle-anna-wintour",
      "text": "relinquished her title as Vogue US’s editor-in-chief"
    },
    {
      "url": "https://cfda.com/news/cfda-and-bezos-earth-fund-join-forces-on-the-next-thread-initiative/",
      "text": "Sánchez’s Earth Fund recently announced a $6.25 million partnership with the CFDA to promote sustainability in fashion"
    },
    {
      "url": "https://www.cnn.com/style/article/met-gala-2019-what-is-camp",
      "text": "2019’s Camp-themed show"
    },
    {
      "url": "https://cnn.com/2024/05/06/style/met-gala-2024-theme-hosts-guests",
      "text": "2024’s “Sleeping Beauties,”"
    },
    {
      "url": "https://cnn.com/style/article/karl-lagerfeld-explainer-met-gala-intl-scli",
      "text": "the previous year’s tribute to Karl Lagerfeld"
    },
    {
      "url": "https://cnn.com/2025/05/03/style/black-dandyism-met-gala-theme",
      "text": "Superfine: Tailoring Black Style"
    },
    {
      "url": "https://www.cnn.com/2025/11/17/style/met-gala-2026-theme",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2025/11/17/style/met-gala-2026-theme",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e62822d4d5e5363f3610dbfa7dc4d6354ac2e20a1a1aef93bf8d4a811b4ab168",
  "scraped_at": "2026-02-25T07:32:58.648373+00:00"
}