{
  "url": "https://lite.cnn.com/2026/02/19/politics/kevin-stitt-donald-trump-national-governors-association",
  "title": "He drew a line with Trump. Now Oklahoma’s governor is drawing the president‘s ire | CNN Politics",
  "date": "2026-02-20T07:29:16.311250+00:00",
  "authors": [
    "Eric Bradner, CNN"
  ],
  "text": "Source: CNN\n\nOklahoma Gov. Kevin Stitt arrived in Washington this week with invitations to two White House meetings from an angry President Donald Trump.\n\nTrump and Stitt, chair of the National Governors Association, were at odds over whether all the nation’s governors should be invited to the White House for what’s typically a bipartisan annual event. Trump’s administration initially had only invited Republicans, leading Stitt to tell governors that the NGA wouldn’t play a role in facilitating the Friday morning event.\n\nTrump also took to his social media website, Truth Social, to declare that he wouldn’t invite two Democratic governors — Maryland’s Wes Moore and Colorado’s Jared Polis — to Saturday’s White House dinner. TrumpsaidMoore and Polis “are not worthy of being there.”\n\nBecause all governors weren’t invited, Stitt initially told NGA members in a letter that the association would not play a role in facilitating the White House business meeting. Days later, Stitt told governors the White House had reversed course and invited all governors to the Friday morning meeting. “President Trump said this was always his intention, and we have addressed the misunderstanding in scheduling,” Stitt said inthe letter to governors.\n\nBut the damage was done. Eighteen Democratic governors saidthey were boycottingSaturday’s dinner, and some also said they wouldn’t go to the Friday morning meeting.\n\nAnd it ultimately rekindled the long-simmering conflict between Trump and Stitt, one of just a few Republican elected officials willing to publicly challenge the president.\n\nBehind closed doors, Trump was incensed that Stitt, whose state voted overwhelming for Trump, would “defend two Democratic governors,” a White House official told CNN.\n\nTrump called Stitt directly to vent his frustration, telling him that it was his White House and he could invite or not invite whoever he wanted, the official said. The call was followed by a litany of social media posts taking aim at the Oklahoma governor.\n\nStitt told CNN’s Dana Bash at an event hosted by the Milken Institute on Wednesday that he told Trump the president was free to “invite whoever you want to the White House,” but that if all governors weren’t invited, it couldn’t be an NGA event.\n\n“This ability to talk about issues, I think, is really important, and I think the American people want to see it happen,” Stitt said.\n\nThe unraveling of the governors’ White House visits was the latest example of Trump battling with Democratic state leaders.\n\nHowever, Stitt is a conservative, two-term Republican governor from a deep-red state that Trump won handily in three consecutive presidential elections.\n\nTrumpendorsedStitt in 2018 and 2022, when he faced conservative opposition in his run for reelection. But Stitt did not return the favor in the lead-up to the 2024 Republican presidential primary. Instead, he endorsed Florida Gov. Ron DeSantis. In a statement, Stitt called DeSantis a candidate who “can win and keep winning as a two-term president.” Trump is constitutionally barred from seeking another term after his current second one.\n\nMultiple sources close to Trump said that the president’s disdain for Stitt began long before this latest episode. One source said that Trump blamed Stitt for alackluster campaign rallyin Tulsa, Oklahoma, in 2020, during the Covid-19 pandemic. It is unclear how Stitt was responsible for the unexpectedly small crowd – with some key Trump allies at the timeblaming the campaign manager, Brad Parscale – or the resulting negative headlines.\n\nAnother adviser to the president said that Trump has brought up Stitt’s DeSantis endorsement.\n\n“He just thinks he’s a RINO, and that he’s never had his back,” the official said, referring to Stitt as a “Republican in name only.”\n\nOklahoma Republican Sen. Markwayne Mullin said on CNN last weekend that there has been “definitely a rub” between Trump and Stitt “for quite some time.”\n\n“This has to do with a personality difference between both of them in who … Gov. Stitt endorsed during the presidential election,” Mullin said.\n\nHe said he considers both men friends but will “let them work it out.”\n\nStitt has also been a rare example of a prominent Republican to break with Trump on policy matters after Trump’s return to the White House last year.\n\nHe was the first Republican governor to criticize Trump over his deployment of the Texas National Guard to Illinois.\n\n“We believe in the federalist system — that’s states’ rights,” hetoldThe New York Times. He also said Oklahoma residents “would lose their mind” if the governor of Illinois, Democrat JB Pritzker, had sent guard troops to Oklahoma while former President Joe Biden was in office.\n\nHe also lambasted Trump for his administration’s immigration crackdown in Minnesota after two US citizens were killed by with federal agents.\n\nStitt said Trump was getting “bad advice” on the issue.\n\n“I think the death of Americans, what we’re seeing on TV, it’s causing deep concerns over federal tactics and accountability,” Stittsaidon CNN. “Americans don’t like what they’re seeing right now.”\n\nTrump’s latest conflict with Stitt began ahead of what’s traditionally a bipartisan meeting at the White House including all of the nation’s governors during their annual trip to Washington.\n\nAfter Stitt informed governors that the White House wasn’t inviting Democrats to the Friday morning business meeting, Trump called the Oklahoma governor. Two days later, Stitt told governors that all governors were being invited.\n\nHowever, in the same post, Trump acknowledged he had not invited Moore or Polis, criticizing the Colorado governor fornot granting clemencyto Tina Peters, the former Republican clerk of Mesa, Colorado, who was found guilty last year on state charges of participating in a scheme to breach voting systems that hoped to prove Trump’s false claims of mass voter fraud in 2020.\n\nMoore said at a joint event Wednesday with Stitt that he “will not be at the White House” on Saturday night. He also credited Stitt for his handling of the conflict.\n\n“Kevin had our backs,” Moore said at the Economic Club of Washington, DC, event.\n\n“There are certain traditions that are being broken right now,” Moore said. He added that he’d learned in the Army, “if you ever want to understand somebody’s mettle, watch them when it was hard. Watch them when it was tough. Watch how they led, watch how they made decisions. And Kevin was very clear from Jump Street when he said that you are not going to pick which governors can and cannot attend.”\n\nStitt, for his part, sought to downplay his conflict with Trump, saying that he will be at the White House on Saturday night.\n\nAs for his role telling other governors that the events would not be bipartisan, Stitt said, “I basically just simply said, the NGA is not the facilitator if not all governors are invited.”\n\n“You can invite whoever you want to the White House, but it can’t be an NGA event if it’s not inclusive of all … governors,” he said. “We’re going to go and have a great time.”\n\nKentucky Democratic Gov. Andy Beshear, speaking Sunday on CNN, was less certain.\n\n“This meeting is an annual bipartisan tradition where we try to push our differences aside and talk about how we move forward in those areas, yet the president has just turned it into drama, inviting and disinviting others,” Beshear said. “It no longer looks like it’s going to be productive at all.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116054089500353661",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/politics/white-house-governors-trump-stitt-moore-polis",
      "text": "the letter to governors"
    },
    {
      "url": "https://democraticgovernors.org/updates/joint-statement-from-democratic-governors-on-not-attending-white-house-events/",
      "text": "they were boycotting"
    },
    {
      "url": "https://www.oklahoman.com/story/news/2022/03/14/donald-trump-endorses-oklahoma-gov-kevin-stitt-2nd-term/7041746001/'",
      "text": "endorsed"
    },
    {
      "url": "https://www.cnn.com/2020/06/21/politics/trump-campaign-trail-coronavirus",
      "text": "lackluster campaign rally"
    },
    {
      "url": "https://www.cnn.com/2020/06/21/politics/jared-kushner-ivanka-trump-brad-parscale",
      "text": "blaming the campaign manager"
    },
    {
      "url": "https://www.nytimes.com/2025/10/09/us/politics/oklahoma-governor-national-guard.html",
      "text": "told"
    },
    {
      "url": "https://www.cnn.com/2026/01/25/politics/video/oklahoma-governorkevin-stitt-on-minneapolis-ice-activity-fatal-shooting",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2025/12/11/politics/trump-pardons-tina-peters-election-denier",
      "text": "not granting clemency"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/politics/kevin-stitt-donald-trump-national-governors-association",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/politics/kevin-stitt-donald-trump-national-governors-association",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e6ce6d495de1c8d0677cd420d615c07cbf3f44a0c42f029bc354b72321c3e19c",
  "scraped_at": "2026-02-20T07:29:16.311265+00:00"
}