{
  "url": "https://lite.cnn.com/2026/02/23/health/tourette-syndrome-explained-intl-scli",
  "title": "What is Tourette’s syndrome? Understanding the condition after man’s involuntary BAFTAs outburst | CNN",
  "date": "2026-02-24T07:32:16.689581+00:00",
  "authors": [
    "Billy Stockwell, CNN"
  ],
  "text": "Source: CNN\n\nTourette’s syndrome, a neurological condition that causes involuntary sounds or movements known as tics, has come under the spotlight after a man with the condition shouted a racist slur during theBAFTA award ceremonyin London on Sunday.\n\nJohn Davidson, who shouted the word, is the subject of the British indie film “I Swear,” about his life with Tourette’s syndrome. The actor Robert Aramayo, who plays Davidson in the film, won Sunday night’s award for best actor.\n\nTourette’s syndrome cannot be cured, but potential triggers can be identified, and treatment can help manage the symptoms.\n\nIn an interview with CNN before the ceremony, Davidson — who has long campaigned for awareness of the condition — pointed to the number of people at the event as a potential trigger for his tics.\n\n“Certain things — like today, lots of people around, I’m feeling very, you know, motor tics, in case I lash out. Different situations can trigger different emotions and tics,” he said.\n\nOther famous figures have spoken in recent years about their experience of living with the condition, including singersBillie EilishandLewis Capaldi.\n\nBAFTA host Alan Cumming reminded the audience after the incident that the condition was a disability. “We apologize if you are offended tonight,” he said.\n\nHere’s what you need to know about the condition:\n\nTics are the symptom most commonly associated with Tourette’s syndrome.\n\nThese are two types of tics: vocal tics, which can include whistling, repeating a word or, in rare cases, swearing; and motor tics, which can include movements such as twitching or shrugging your shoulders.\n\nMaking inappropriate remarks can be a rare symptom of the condition.\n\n“John (Davidson) wouldn’t have known that was the tic that he was about to do,” Edward Palmer, the vice chair of UK-based charity Tourettes Action, told Times Radio on Monday.\n\n“Some people will find they can be, kind of, stimulated or triggered by things in the environment. But for some people, they are completely random. But whatever the circumstances, they are involuntary. They don’t choose the words,” he said.\n\nApproximately 10% to 15% of people with Tourette’s syndrome have tics that result in offensive or rude language, Palmer said.\n\nIt is estimated that around 1.4 million people in the United States are affected by Tourette’s syndrome or a persistent tic disorder, according to the Centers for Disease Control and Prevention (CDC).\n\nIn the US, this number equates to around 1 in 50 children between the ages of 5 and 14, CDC data show, although the exact number is not known. The condition is more common in boys than girls.\n\nIn the UK, more than 300,000 people live with the condition, Tourettes Action said.\n\nThe cause of the condition has not yet been fully established, but it can often run in families, Tourettes Action said. It is also possible that environmental factors, such as infection or inadequate weight gain of the mother during pregnancy, could increase the risk, the charity said.\n\nSymptoms typically start around age 6 and can become more noticeable around age 10, according to Britain’s National Heath Service (NHS).\n\nThere is currently no known cure for the condition. But several options are available to help manage the symptoms and improve the person’s quality of life.\n\nThe first step is to get a professional diagnosis. For the condition to be diagnosed, multiple motor tics and at least one vocal tic must be present for at least 12 months, according to Tourettes Action.\n\nOnce a diagnosis is made, behavioral therapy can provide “tools to help a person learn ways to change certain behaviours,” the charity said.\n\nLifestyle changes can help reduce symptoms, as tics can be triggered by factors such as stress, tiredness or excitement, according to the NHS.\n\nMedical experts say it can help to have a good sleep routine, avoid stressful situations where possible and incorporate plenty of physical activity into your day.\n\nThe effectiveness of medication varies depending on the person, Tourettes Action said, but it can help to target associated conditions that sometimes accompany Tourette’s syndrome, such as attention deficit hyperactivity disorder (ADHD).\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/videos/entertainment/2019/04/15/billie-eilish-coachella-tourette-orig.cnn",
      "text": "Tourette’s syndrome"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/entertainment/baftas-2026-tourettes-racist-slur",
      "text": "BAFTA award ceremony"
    },
    {
      "url": "https://www.cnn.com/2022/05/23/entertainment/billie-eilish-tourette-syndrome",
      "text": "Billie Eilish"
    },
    {
      "url": "https://www.cnn.com/2022/09/07/entertainment/lewis-capaldi-diagnosed-tourettes",
      "text": "Lewis Capaldi"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/health/tourette-syndrome-explained-intl-scli",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/health/tourette-syndrome-explained-intl-scli",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e6d23ebf9a3443356abb44a30798d82649892305e56a62f3f343fe556cd591f7",
  "scraped_at": "2026-02-24T07:32:16.689595+00:00"
}