{
  "url": "https://lite.cnn.com/2026/02/16/uk/amazon-delivery-van-stuck-mudflat-scli-intl",
  "title": "Amazon delivery van gets stuck after following GPS onto ‘dangerous’ mudflats | CNN",
  "date": "2026-02-17T07:30:37.245361+00:00",
  "authors": [
    "Lianne Kolirin, CNN"
  ],
  "text": "Source: CNN\n\nAnAmazondelivery van had to be recovered after its driver followed aGPSroute onto “extremely dangerous” mudflats.\n\nEnglish coastguards received a call on Sunday morning about the incident the previous evening, according to a Facebookpostby HM Coastguard Southend.\n\nThey said the van had driven onto The Broomway, a six-mile path dating back 600 years that is not intended for vehicles.\n\nThe driver had been“following a GPS route” trying to reach Foulness Island, off the east coast of the county of Essex, according to the coastguard Facebook post.\n\nFoulness Island is owned by the UK Ministry of Defence (MoD) and is managed by global defense and security firm QinetiQ. The correct route onto the island, which is home to an MoD firing range, is via a barrier by QinetiQ’s security office.\n\nThe Facebook post said: “The Broomway route is not for vehicles and should only be walked on with a guide who knows the mud flats.\n\n“It is an extremley (sic) dangerous area and is on MOD property only free to access when the firing ranges are not active and barrier is open.”\n\nAccording to guidance available onQinetiQ’swebsite, The Broomway “requires both caution and specialist knowledge to negotiate safely.” The websiteadds that it is illegal to drive a motorized or e-powered vehicle along the full length of The Broomway.\n\n“Neither MOD or QinetiQ accepts any responsibility for the recovery of any vehicle which may become stranded in the sands, this is the sole responsibility of the vehicle owner,” it states.\n\nAccording to the coastguard’s Facebookpost, the driver was able to get free from the van and report the incident to Amazon, which had “arranged with a local farmer to extract the vehicle.”\n\nThe coastguard added: “HM Coastguard’s primary concern was for the safety of the occupants and any possible pollution. With the occupants confirmed to be safe and the vehicle to be removed later today, Coastguard Officers were stood down.”\n\nAccording to the website of Thames Estuary Man, a local who runs guided walks of The Broomway, the path “is often referred to as the deadliest footpath in Britain because of parish records which attribute one hundred drownings” to it.\n\n“There are areas of extremely soft mud, and the possibility of stumbling across unexploded ordinance if you stray from the path. The tide here comes in quickly and not always from the direction you expect so caution is essential,” it adds.\n\nA spokesman for Amazon told CNN “the driver is safe and the van retrieved,” adding the company is “investigating” the incident.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/02/13/tech/amazon-ring-flock-partnership-ice",
      "text": "Amazon"
    },
    {
      "url": "https://cnn.com/2025/09/05/travel/south-korea-google-maps-intl-hnk-dst",
      "text": "GPS"
    },
    {
      "url": "https://www.facebook.com/southend.coastguard/?locale=en_GB",
      "text": "post"
    },
    {
      "url": "https://www.qinetiq.com/en/shoeburyness/public-access/public-right-of-way-routes",
      "text": "QinetiQ’s"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/uk/amazon-delivery-van-stuck-mudflat-scli-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/uk/amazon-delivery-van-stuck-mudflat-scli-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e73494f4d85908c9399f925cf88a8264a994e2e5ff48d03998e4d1283891ad72",
  "scraped_at": "2026-02-17T07:30:37.245373+00:00"
}