{
  "url": "https://lite.cnn.com/2026/02/23/us/nancy-guthrie-masked-suspect-video-details",
  "title": "Nancy Guthrie: Savannah Guthrie offers up to $1 million for information about her mother in new Instagram video | CNN",
  "date": "2026-02-25T07:31:37.440862+00:00",
  "authors": [
    "Taylor Romine",
    "Lauren Mascarenhas",
    "Randi Kaye"
  ],
  "text": "Source: CNN\n\nThe family of Nancy Guthrie is offering up to $1 million for information leading to her recovery, a tearful “Today” host Savannah Guthrie said in a video posted toher Instagram on Tuesday— more than three weeks after her mother vanished from her desert home in the middle of the night.\n\nSavannah Guthrie acknowledged her 84-year-old mother, who has been missing since February 1, “may already be gone.”\n\n“But we need to know where she is. We need her to come home. For that reason we are offering a family reward of up to $1 million for any information that leads us to her recovery,” she said.\n\nThe reward is in addition to the FBI’s $100,000 reward for information about Guthrie, theagency said Tuesday.There is another separate reward of $102,500 for information leading to an arrest in the case from 88-Crime, the Pima County and Tucson affiliate of the national Crime Stoppers organization.\n\n“So please, if you hear this message, if you’ve been waiting and you haven’t been sure, let this be your sign to please come forward, tell what you know and help us bring our beloved mom home so that we can either celebrate a glorious, miraculous homecoming or celebrate the beautiful, brave and courageous and noble life that she has lived,” Savannah Guthrie said in the emotional vi﻿deo, her first since February 15.\n\nShe also posted the videoon X, the first time she has used the account since her mother’s disappearance.\n\nThe reward announcement ends more than a week of silence from the Guthrie family, who had been posting regular video updates. Investigative updates from authorities have also slowed as the search enters its fourth week, though the case continues to draw national interest.\n\nSavannah Guthrie’s announcement generated 750 credible tips Tuesday for the FBI in Arizona, according to the agency, which has received more than 22,000 calls overall since the beginning of this investigation.\n\nThe Guthries decided to release the video offering the $1 million reward Tuesday after careful consultation and coordination with law enforcement, a source close to the family told CNN. The family first raised the idea early in the investigation and had been ready to move forward, but was advised by those involved that making such an offer earlier could overwhelm the infrastructure set up to handle the thousands of leads coming in, the source added.\n\nThe “Today” host said that if her mother is in heaven with loved ones who have passed, “then we will accept it,” but the family still wants answers.\n\n“We still believe. We still believe. We still believe that she can come home. Hope against hope, as my sister says, we are blowing on the embers of hope,” Savannah Guthrie added in the video.\n\nSavannah Guthrie also announced a $500,000 donation to the National Center for Missing and Exploited Children, saying she hopes the attention given to her family will extend to all those missing loved ones.\n\nMichelle DeLaune, the CEO of the organization, saidin a statement,“Their donation is rooted in a simple but powerful belief: when a family is in crisis, they deserve someone to stand with them.” She added, “Our hearts remain with the Guthrie family” in their search.\n\nNew details have emerged about the masked person seen on doorbell camera footage at Nancy Guthrie’s Arizona home. The suspect visited her doorstep on multiple occasions, not just the morning she is believed to have been kidnapped, a source told CNN.\n\nThe photos and video of the masked person on Guthrie’s doorstep — released by the FBI on February 10 — were taken on two different days, rather than just on February 1, when authorities believe she was abducted, the source said. That’s because the masked suspect is not wearing a backpack in one of them, according to the source.\n\nABC Newsfirst reportedthe suspect appears to have been at her door before February 1.\n\nMaking multiple trips to Guthrie’s front door fits with “the investigative assumption” that the abduction was planned in advance and may have involved some “pre-operational surveillance, reconnaissance,” CNN Chief Law Enforcement and Intelligence Analyst John Miller said Tuesday.\n\nThe Pima County Sheriff’s Department said ina statementMonday “there is no date or time stamp associated with these images” and “any suggestion that the photographs were taken on different days is purely speculative.” It added the investigation is ongoing and “conclusions will be guided by verifiable evidence and established facts.” CNN reached out to the FBI Phoenix office for comment.\n\nPima County Sheriff Chris Nanos said the images recovered from the doorbell camera did not provide dates or timestamps, the “Today” show reported.\n\n“It is all speculative. For someone to suggest that that photo is from a different day, that’s all it is, is speculation. We understand the thinking behind it, but right now, we have no evidence to suggest that that occurred that day or days before,” Nanos told “Today” in a phone call.\n\nLocal and federal investigators on the ground in Arizona searching for Nancy Guthrie were surprised by the video and photos posted on social media by the head of the FBI depicting her suspected abductor, another law enforcement source involved in the investigation told CNN.\n\nFBI Director Kash Patel posted on February 10 chilling video of a man at Guthrie’s front door before her disappearance, including a follow-up post announcing and releasing “additional recovered images from the same camera at Nancy Guthrie’s front door the morning of her disappearance.”\n\nBut investigators in Tucson believed one of the images Patel posted — showing the man without a backpack or gun — was not actually from the date of her abduction, but possibly from weeks before as the man appeared to surveil her home, the source said. Authorities had hoped to keep specific details of that image confidential while they worked to identify the suspect and a motive, the source said. Local investigators were also puzzled by the fact FBI headquarters insisted the new imagery would be tweeted from Patel’s own X account rather the general FBI account.\n\n“It would have been nice to know what (FBI) headquarters was planning to release,” the source said.\n\nThe FBI has not responded to CNN’s request for clarity on Patel’s social media post.\n\nResidents in Guthrie’s neighborhood were previously asked by the sheriff’s departmentto submit video as far back as January 1, but specificallyfocusing on two dates– January 11 between 9 p.m. and midnight, and January 31 between 9:30 a.m. and 11 a.m. The sheriff’s department specifically requested footage that includes cars, traffic, people or pedestrians, or anything that feels out of the ordinary or important.\n\nThe FBIreleased video and photosof a masked, armed man tampering with Guthrie’s doorbell camera the morning of her disappearance, producing thousands of tips in the process. The suspect is described as male, approximately 5’9” - 5’10” tall and having an average build, according to the FBI.\n\nFrom that video, investigators were able to identify the man was wearing an Ozark backpack, according to the Pima County Sheriff’s Department, but are still trying to identify other items and where they might have been purchased.\n\nSome investigators have visited gun shops in the Tucson area as the suspect in the video is seen wearing a gun holster that the sheriff said “had some pretty unique characteristics.”\n\nIn addition to the request to those living in the area, authorities have canvassed residences, businesses and government agencies for surveillance video to identify any possible indication of where Guthrie may have been taken, a law enforcement official familiar with the case says.\n\nInvestigators continue to review “thousands of hours” of video obtained from the greater Tucson area, the source added.\n\nThey also continue to run lab analysis on DNA found at Guthrie’s house, Nanos said Thursday. DNA onglovesfound 2 miles from the home, one of approximately 16 gloves found in the search to comb the area surrounding Guthrie’s home, did not return any matches in the national database known as CODIS, and doesn’t matchDNA foundat the house, either, Nanossaid.\n\nLaw enforcement has also detained, and later released, two people as part of the investigation, the sheriff’s department previously said.\n\nDespite these developments, investigators haveno leading theoryabout a motive, according to a source. But authorities say they believe Guthrie was removed from the home against her will, and the sheriff said authorities have not ruled out the possibility more than one person may have been involved.\n\nThe FBI will be shifting its investigative command post from Tucson to Phoenix, FBI Phoenix Public Information Officer Kevin Smith told CNN Tuesday, while emphasizing that everyone who is working on the ground with the sheriff’s department will stay and it is not a reduction in resources.\n\nBut the search persists.\n\nThe volunteer-based United Cajun Navy is offering its assistance with the search, incident commander Josh Gill told CNN. Gill said the additional reward offered by the Guthrie family will likely bring in a wave of new tips, adding that if his group were offered the reward, they would turn it down.\n\n“We’re not money driven. We’re driven on providing some closure for the family,” Gill said.\n\nAs recently as Saturday, detectives and agents were back canvassing in Guthrie’s neighborhood, the Pima County Sheriff’s Department said, although it didn’t share details of what spurred the return.\n\nHer children, including Savannah Guthrie, have repeatedly pleaded for her return. They have taken to social media in several videos in an attempt to address purported ransom notes sent to several media outlets, as well as asking the public for help in her search. Despite the reports of the ransom, neither the family nor law enforcement have confirmed if they were real or if they made contact with the sender.\n\nThe sheriff has said that none of the family members, including siblings and spouses, are possible suspects in the case.\n\nIf you have information that could help investigators, you can call 1-800-CALL-FBI or 520-351-4900. You can also submit information attips.fbi.gov.\n\nThis story has been updated with additional information.\n\nCNN’s Ed Lavandera and Josh Magness contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.instagram.com/p/DVJKU2wADV3/",
      "text": "her Instagram on Tuesday"
    },
    {
      "url": "https://x.com/FBIPhoenix/status/2026296993211994352",
      "text": "agency said Tuesday."
    },
    {
      "url": "https://x.com/SavannahGuthrie/status/2026456868768592142",
      "text": "on X"
    },
    {
      "url": "https://www.ncmec.org/blog/2026/standing-with-families-in-their-hardest-moments?fbclid=IwY2xjawQK7gVleHRuA2FlbQIxMABicmlkETF1cHAzUWR1OHR0TjlXYWY4c3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHvfb68-PjzvWe5f6bdoFsAtMUYIUMJAYdbBGZigH791ygImKCOcDgjMoQ6Rb_aem_YyRfEyWgF7HmEwbxqJfRMg",
      "text": "in a statement,"
    },
    {
      "url": "https://abcnews.com/US/masked-suspect-nancy-guthrie-abduction-appeared-visit-house/story?id=130427336",
      "text": "first reported"
    },
    {
      "url": "https://x.com/pimasheriff/status/2026133346506666410?s=46",
      "text": "a statement"
    },
    {
      "url": "https://neighbors.ring.com/n/ZyP8or0spO",
      "text": "to submit video as far back as January 1"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-12-26?post-id=cmljf96md00003b6p1bcyd18p",
      "text": "focusing on two dates"
    },
    {
      "url": "https://x.com/FBIDirectorKash/status/2021281103454072983",
      "text": "released video and photos"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-news-updates-02-16-26?post-id=cmlp5jx3e00003b6r0fl2i78k",
      "text": "gloves"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-savannah-missing-mom-02-13-26?post-id=cmllg8qzf000h356r0ur5bzje",
      "text": "DNA found"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-search-update-02-17-26?post-id=cmlqx582z00003b6py3nhtlrq",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/us/live-news/nancy-guthrie-news-updates-02-15-26?post-id=cmlom18s200003b6rgicohos8",
      "text": "no leading theory"
    },
    {
      "url": "https://tips.fbi.gov/home",
      "text": "tips.fbi.gov"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/nancy-guthrie-masked-suspect-video-details",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/us/nancy-guthrie-masked-suspect-video-details",
      "text": "Cookie Settings"
    }
  ],
  "hash": "e83b33cbef7ef62b64658de55f790315e08d5d35e78541bf91be70c9d0fcd3ca",
  "scraped_at": "2026-02-25T07:31:37.440872+00:00"
}