{
  "url": "https://lite.cnn.com/2026/02/18/style/youtube-first-video-victoria-and-albert-museum",
  "title": "V&A Museum acquires YouTube’s earliest video from 2005 | CNN",
  "date": "2026-02-19T07:31:32.933375+00:00",
  "authors": [
    "Gareth Harris"
  ],
  "text": "Source: CNN\n\nA new exhibit at the Victoria and Albert Museum (V&A) in London captures the moment YouTube was born more than 20 years ago.\n\n“The V&A has acquired a reconstructed early webpage and the first video ever uploaded to the platform by co-founder Jawed Karim,” a V&A spokesperson said.\n\nThe reconstruction of the early YouTube watch page features the first-ever upload entitled “Me at the zoo,”showing then-25-year-old YouTube co-founder Karim at San Diego Zoo talking about elephants. The 19-second clip has been viewed 382 million times and received more than 18 million likes since it was first posted to the platform on April 23, 2005.\n\n“The cool thing about these guys is that they have really really really long trunks,” Karim said in the clip.\n\n“Our digital conservation team have spent the last 18 months rebuilding the design and experience of the platform from 8 December 2006, the oldest timestamp documented online,” the V&A spokesperson added. The V&A team collaborated with YouTube’s user experience team and the London-based interaction design studio oio on the project.\n\nThe inaugural YouTube work is on display in the Design 1900-Now gallery at V&A South Kensington, while the process involved in creating the reconstruction will be explored in a mini display at V&A East Storehouse in Stratford.\n\nNeal Mohan, the chief executive of YouTube, said in a statement: “By reconstructing an early watch page, we aren’t just showing a video; we are inviting the public to step back in time to the beginning of a global, cultural phenomenon.” Corinna Gardner, a senior curator of design and digital at the V&A, added: “This snapshot of YouTube during the early days of web 2.0 marks an important moment in history of the internet and digital design.”\n\nYouTube continues to be an important platform for arts and culture, with original content from museums and galleriesoften outperformingstreaming services.\n\nRead more stories from The Art Newspaperhere.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.theartnewspaper.com/2020/02/11/when-will-the-art-tv-binge-begin-platforms-like-netflix-and-amazon-are-slow-to-show-original-cultural-content",
      "text": "often outperforming"
    },
    {
      "url": "https://www.theartnewspaper.com/?utm_source=CNN&utm_medium=editors",
      "text": "here"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/style/youtube-first-video-victoria-and-albert-museum",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/style/youtube-first-video-victoria-and-albert-museum",
      "text": "Cookie Settings"
    }
  ],
  "hash": "eaea95fe806dec56beffa013d6af88f408629a5212fbac499aa5cba42fd89aee",
  "scraped_at": "2026-02-19T07:31:32.933389+00:00"
}