{
  "url": "https://lite.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
  "title": "FAA lifts El Paso airspace closure, citing ‘no threat,’ but there’s widespread confusion about what prompted it | CNN",
  "date": "2026-02-11T16:38:28.240731+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThe Federal Aviation Administration hasliftedthe temporary shutdown of airspace over El Paso, Texas, just a few hours after it was imposed.\n\nLate Tuesday, the FAA had abruptly issued a temporary flight restriction that immediately grounded all flights up to 18,000 feet around the city for 10 days, effectively shutting down El Paso International Airport.\n\nThe sudden pause over El Paso, along with an area of southern New Mexico, was due to “special security reasons,” according to the FAA’s website. The FAA did not provide additional details.\n\nBut there was broader confusion Wednesday morning about what led to the closure.\n\nAn administration official told CNN that Mexican cartel drones had breached US airspace. “The Department of War took action to disable the drones. The FAA and DOW have determined there is no threat to commercial travel,” the official said.\n\nA source familiar with the restriction who was briefed by the FAA saidthe sweeping flight ban was driven by military operations from nearby Biggs Army Airfield, located on Fort Bliss. Drones, helicopters and other aircraft operate from the facility. The source said the FAA acted after the Department of Defense could not assure the safety of civilian aircraft in the area.\n\nBut a source briefed by the FAA also told CNN the military activity near El Paso involved unmanned aircraft operations and laser countermeasure systems. The source said the issue is that those operations are occurring in airspace immediately adjacent to civilian flight paths serving El Paso International Airport.\n\nThe Drug Enforcement Administration and other US security agencies have used facilities at the Biggs Army Airfield for years as part of efforts to monitor Mexico based drug cartel operations, current and former US officials said.\n\nOne source with knowledge said cartel drones are often found near US airspace, mostly on the Mexico side of the border, but sometimes they come over to the US side. However, they rarely result in an airspace closure.\n\nBy the time the FAA had lifted the flight restrictions, airlines had already issuedtravel waiversand notified customers of potential changes.\n\nIn the initial flight restrictions, the FAA classified the area around El Paso﻿ as “(National) Defense Airspace” and said pilots who violated the restriction could be intercepted, detained and questioned by law enforcement.\n\nIt warned that additional actions could be taken for pilots who don’t adhere to the restrictions, including suspension of flight certifications, criminal charges, and that the US government “may use deadly force” if an aircraft poses an “imminent security threat.”\n\nAudio from LiveATC.net includes the moment pilots were made aware of the grounding.\n\n“Just pass it on to everybody else, at 06:30 for the next 10 days, we’re all at a ground stop,” a controller said.\n\nA pilot replies, “OK, ground stop 06:30 for how long?”\n\n“Ten days,” the controller replies.\n\n“So the airport is totally closed?” the pilot says, chuckling.\n\nThe controller replies, “Apparently, we just got informed about 30 minutes to an hour ago.”\n\n“So for 10 days you guys are not open,” the pilot says, in disbelief.\n\n“Well, we’ll be here, but no air traffic,” the controller said.\n\n“OK,” laughs the pilot.\n\nThe agency issued the restriction “on short notice,” and airport staff have reached out for further guidance, the airport said in another statement toCNN affiliate KFOX. El Paso International Airportsaidall commercial, cargo and general aviation flights would be grounded until February 20.\n\n“It’s a complete ground stop … not even medevac are allowed to fly,” an air-traffic controller was heard telling flight crews of the imminent airspace closure Tuesday night.\n\n“Wow,” a flight crew member is heard responding in the LiveATC.net audio.\n\nEl Paso, with a population of nearly 700,000, is the sixth-largest city in Texas and one of the 25 largest in the United States. It is a hub of cross-border commerce alongside neighboring Ciudad Juárez in Mexico.\n\nNearly 3.5 million passengers passed through El Paso International Airport in the first 11 months of 2025, according to its website. The airport describes itself as the gateway to West Texas, southern New Mexico and northern Mexico.\n\nSamuel, a traveler in El Paso, told CNN affiliate KFOX he was doing a book tour with a client and didn’t get any notification from his airline.\n\n“I just kind of saw all the cops here and the news cameras,” he said. “I gotta figure out what’s going on if there’s another airport that’s not in El Paso, and try to figure out and rent a car out.”\n\nThe airspace closure is expected to be extremely disruptive for El Paso, a major industrial hub, Robert Moore, the founder and CEO of news siteEl Paso Matters, told CNN.\n\n“We’ve never seen anything like this here at least since 9/11, when everything was grounded,” he said.\n\nThis closure was unique, however, since it was over a specific city and there was no immediate reason apparent.\n\nThis is a developing story and will be updated.\n\nThe Associated Press and CNN’s Toni Odejimi contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://x.com/FAANews/status/2021583720465969421?s=20",
      "text": "lifted"
    },
    {
      "url": "https://tfr.faa.gov/tfr3/?page=detail_6_2233",
      "text": "special security reasons"
    },
    {
      "url": "https://www.united.com/en/us/fly/travel/trip-planning/travel-alerts.html",
      "text": "travel waivers"
    },
    {
      "url": "https://kfoxtv.com/news/local/faa-grounds-all-flights-to-and-from-el-paso-until-feb-20",
      "text": "CNN affiliate KFOX"
    },
    {
      "url": "https://www.instagram.com/p/DUm9yAPFsCf/?utm_source=ig_embed&ig_rid=444ab7fa-e509-468e-a02b-f80706413a17",
      "text": "said"
    },
    {
      "url": "https://elpasomatters.org/",
      "text": "El Paso Matters"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/us/faa-el-paso-texas-flight-restrictions-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "eb5d8375b32cfb351017d6dafda644826ecfed2e4be2f1688f68e6b54bcf6efb",
  "scraped_at": "2026-02-11T16:38:28.240743+00:00"
}