{
  "url": "https://lite.cnn.com/2026/02/23/us/colin-gray-trial-georgia-shooting-mother",
  "title": "Colin Gray trial: Mother of teenage school shooter testifies his father ‘didn’t want to deal with’ son’s mental health issues | CNN",
  "date": "2026-02-24T07:31:36.436812+00:00",
  "authors": [
    "Eric Levenson, CNN"
  ],
  "text": "Source: CNN\n\nMarcee Gray, the mother ofthe Apalachee High School shooter, testified Monday that her estranged husband,Colin Gray, was not supportive of getting their son into crisis counseling in the weeks before the shooting.\n\nAfter a stint in jail and rehab, Marcee Gray lived with Colin and their three children in July and August 2024 and noticed their oldest,Colt Gray, then 14, was riddled with anxiety, easily agitated and had a panic attack.\n\n“It was very obvious that he needed some professional help, especially with the anxiety,” she said.\n\nShe said Colin Gray didn’t have much to say about it.\n\n“I think in general the defendant just didn’t want to deal with it. He just wanted to not pay attention to it and hope it would go away,” Marcee Gray said.\n\n“My personal opinion is that he was afraid Colt would go in and start talking about the emotional mental abuse that he was suffering at the hands of the defendant,” she added.\n\nThe defense objected to that comment as speculation and moved for a mistrial. The judge denied the mistrial request but advised the jury to disregard the comment.\n\nThe mother’s testimony Monday offered key insights into what Colin Gray knew about their son and what he did about that knowledge in the months before Colt Gray brought an AR-15-style rifle to Apalachee High in Winder, Georgia, andopened fireon September 4, 2024. Four people were killed and nine were injured before he surrendered to police.\n\nColin Gray has pleaded not guilty to nearly 30 charges, including two counts each of second-degree murder and involuntary manslaughter.\n\nProsecutors allege he bought Colt the rifle as a Christmas gift and allowed him access to it despite previous warnings that his son was a danger to others, actions that constitute criminally reckless conduct. His defense attorney said in opening statements he was unaware his son was planning the shooting and had taken steps to try to get him help.\n\nColin Gray’s trial is part of a broader push to hold more people accountable for a school shooting, including the shooter’sparentsandresponding law enforcement officers. This case bears close similarities to the trials ofJames and Jennifer Crumbley, whose then-15-year-old son killed four students in 2021 at his high school in Oxford, Michigan.\n\nThe trial began last week and has featuredemotional testimony from students and teacherswho survived the shooting,police interviewswith Colin Gray, Colt Gray’s spotty school attendance records andphotos showing unsecured firearms and ammoin Colin Gray’s home.\n\nMost notably, the jury sawbody-camera footagefrom May 21, 2023, when deputies with the Jackson County Sheriff’s Office visited Colt and Colin Gray’s home after receiving an FBI tip about an online threat to shoot up a school. Law enforcement was ultimately not able to substantiate the tip.\n\nMarcee’s mother –the shooter’s grandmother– testified on Friday, saying Colin Gray bought his son an AR-15-style rifle for Christmas nine months before the shooting and left the gun in Colt’s room, even though the father knew about his son’s mental health struggles.\n\nColt Gray hasadmitted to the shooting, according to authorities. Now 16, he has pleaded not guilty to55 felony counts, including four counts of malice murder. A trial date has not been set.\n\nMarcee Gray’s testimony Monday laid out a timeline of thefamily’stumultuous life, which featured investigations by the Department of Family and Children Services, visits from police, an eviction and repeated moves.\n\nIn July 2024, Marcee Gray testified she lived with Colin and the kids for about five weeks and noticed Colt Gray’s increasing mental health issues.\n\nHe had shown an interest in his gun and in true crime shows about serial killers, and he even made an apparent joke about school shooters, Marcee Gray testified.\n\n“(Colt) said, ‘I’ve gotta finish my school shooter outfit,’ or something like that,” she said. He then said he was kidding, she testified.\n\nIn one incident, she and Colt Gray got into a physical altercation over the firearm at the home, she testified. She told him to give her the gun, but he refused, she said. He then knocked her backward into a nearby doorframe, where she hit her head and was left dazed, she testified.\n\nShe said she spoke to Colin Gray multiple times about securing the multiple firearms in the home, advising him to lock them in his truck. He initially said he would, she testified – but other evidence in the trial has shown he did not actually do so.\n\nShe also helped enroll Colt Gray at Apalachee High, as he had not attended any school the entire previous year, she testified.\n\nOn August 29, 2024, a week before the shooting, Marcee Gray searched on Google “school shooter parents charged with manslaughter,” according to search records. She said she and Colt Gray had watched a documentary about theCrumbley parents in Michiganand were searching for more information about the case. She also searched “safe storage gun laws in Georgia,” the records show.\n\nShe spoke to her husband on the phone multiple times that afternoon and again told him to secure the guns in the home, but he declined, she testified.\n\n“He said that if he went in Colt’s room and tried to take his gun to try to put it up, that it would basically cause a sh*tstorm, indicating he basically didn’t want to take his gun away because he didn’t want to deal with it,” she testified.\n\nOn the morning of September 4, Colt Gray sent his father a strange text message that he then forwarded to Marcee Gray, concerning them both. She said she called the school and asked them to urgently check on him, but by the time they found him, he had already begun shooting.\n\nIn November 2022, the two younger children went to live with Marcee Gray, while Colt stayed with Colin Gray. In August 2023, Colt then came to live with her, and when the parents met up at a midway point for the exchange, Colin Gray was “very aggressive” toward Colt, she testified.\n\nShe said Colt’s behaviorat her home was “alarming” and he repeatedly damaged the house, broke TVs and cut slits into furniture.\n\n“He had a lot of anger inside. He was very aggressive and unpredictable,” she said.\n\nIn October 2023, she failed a drug test and lost custody of all her children, who then went to live with Colin Gray. She tried to set up visits, but he blocked her phone and refused to communicate with her, she testified.\n\n“I basically had a complete nervous mental breakdown, I think as any good mother would,” she said. “My kids were and still are my entire world, and to go from being in constant contact – with the two younger children for sure – to nothing, I felt like they had been kidnapped almost.”\n\nThe next month, when she was “messed up,” she tied her mother down to a chair and drove to Colin Gray’s house to try to see the kids, she testified. He refused, and she then keyed his truck, she testified.\n\nAccording to court records, she pleaded guilty in December 2023 to criminal damage to property, criminal trespass-family violence and use of a license plate to conceal identity. She was incarcerated from November 2023 to April 2024 and then spent three months in rehab, she testified.\n\nDefense attorneys had said in opening statements they planned to challenge the credibility of Marcee Gray’s statements.\n\nOn cross-examination Monday, when asked about her comments to law enforcement after the shooting, she said she did not remember what she had said. She also testified she did not call 911 in the days before the attack and did not believe there was an imminent risk of violence.\n\n“I did not see a mass school shooting coming, no way,” she testified. “Maybe I was just not wanting to face it because I was his mother, I don’t know. It was the last thing that I would have guessed.”\n\nFurther, she said she “did not disapprove” of Colt’s interest in going to the shooting range and hunting with his father, saying it was like a hobby.\n\nThe defense alleged in opening statements Colt Gray had told his mother that he had sent commissary money toNikolas Cruz, the imprisoned Florida school shooter, but Marcee did not share that information with Colin Gray, the school or police. She testified she barely remembered that, saying he wasn’t talking about it in a serious way.\n\nLisa Butler, Colt Gray’s guidance counselor at Apalachee High, testified Monday afternoon that she and other school employees had made plans to get Colt counseling services at the time of the shooting.\n\nOn August 26, 2024, Colt went to the counselor’s office and appeared “fragile” and “scared,” she testified. She said she spoke on the phone with his father, who said Colt had anxiety, depression and other mental health issues. She asked him to come to the school to pick Colt up, but Colin Gray said he had work and declined to do so, she testified.\n\nButler and other school employees emailed Colin Gray to set up counseling services for Colt, and he filled out forms to grant permission, according to emails shown in court. A school therapist said in an email she would work with Colt “early next week” after the Labor Day weekend.\n\nOn the following Tuesday, September 4, 2024, Butler said she received a phone call at 9:50 a.m. from a concerned Marcee Gray. At the end of that call, Marcee Gray said Colt had access to multiple guns and had become obsessed with school shootings, Butler testified.\n\nButler said she called a school administrator and alerted people to try to locate Colt – and then she heard gunshots.\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "Colin Gray"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/colin-gray-trial-apalachee-shooting-testimony",
      "text": "opened fire"
    },
    {
      "url": "https://www.cnn.com/2024/03/03/us/james-crumbley-trial-mass-shooting-accountability",
      "text": "parents"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/school-shooting-trials-police-officers",
      "text": "responding law enforcement officers"
    },
    {
      "url": "https://www.cnn.com/2024/03/16/us/james-jennifer-crumbley-trials-differences/index.html",
      "text": "James and Jennifer Crumbley"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/us/colin-gray-trial-apalachee-shooting-georgia",
      "text": "emotional testimony from students and teachers"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "police interviews"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "photos showing unsecured firearms and ammo"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "body-camera footage"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/us/colin-gray-trial-georgia-shooting-testimony",
      "text": "the shooter’s grandmother"
    },
    {
      "url": "https://www.cnn.com/2024/10/22/us/apalachee-school-shooter-colt-gray-has-waived-arraignment-and-entered-a-not-guilty-plea",
      "text": "admitted to the shooting"
    },
    {
      "url": "https://www.cnn.com/2024/10/17/us/colt-colin-gray-apalachee-school-shooting",
      "text": "55 felony counts"
    },
    {
      "url": "https://www.cnn.com/2024/09/05/us/colt-gray-suspect-georgia-shooter",
      "text": "family’stumultuous life"
    },
    {
      "url": "https://www.cnn.com/2024/03/16/us/james-jennifer-crumbley-trials-differences/index.html",
      "text": "Crumbley parents in Michigan"
    },
    {
      "url": "https://www.cnn.com/2022/11/02/us/parkland-shooter-nikolas-cruz-sentencing-wednesday",
      "text": "Nikolas Cruz, the imprisoned Florida school shooter"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/us/colin-gray-trial-georgia-shooting-mother",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/us/colin-gray-trial-georgia-shooting-mother",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ebb4dce8b30aaec9a0a0bba6d0e95b2ff90cd14e1d520541a79d33a35b56ef3a",
  "scraped_at": "2026-02-24T07:31:36.436825+00:00"
}