{
  "url": "https://lite.cnn.com/2026/02/26/entertainment/d4vd-target-murder-investigation",
  "title": "Singer d4vd named as ‘target’ in death and dismemberment of teen girl | CNN",
  "date": "2026-02-27T07:15:49.829190+00:00",
  "authors": [
    "Kyung Lah",
    "Rachel Clarke"
  ],
  "text": "Source: CNN\n\nSinger d4vd has been named as the “target” in a murder investigation surrounding the death and mutilation of a 14-year-old girl.\n\nd4vd, whose legal name is David Burke, “may be involved in having committed the following criminal offenses against the laws of the State of California, to wit: One Count of Murder,” according to the court papers obtained by CNN.\n\nThe young victim, Celeste Rivas Hernandez, was found in a black Tesla registered to Burke on September 8, 2025. The car, apparently abandoned in the Hollywood Hills neighborhood of Los Angeles, had been towed to a police impound yard.\n\nDetectives opened the front trunk of the car and saw a cadaver bag covered with insects, the documents say. There was also a “strong odor of decay,” according to the statement from Los Angeles Deputy District Attorney Beth Silverman.\n\nAccording to Silverman, the officers unzipped the bag and saw a decomposed head and torso.\n\nSpecialists from the medical examiner’s department were then called in to process the remains.\n\n“Upon removing the cadaver bag from the front storage compartment, it was discovered the arms and legs had been severed from the body,” the court papers detailed.\n\n“A second black bag was discovered under the cadaver bag. Upon opening the second bag, the dismembered body parts were discovered.”\n\nThe records of the medical examiner have now been sealed. The Los Angeles District Attorney’s Office has not responded to CNN inquiries about the case.\n\nThe court papers are contained in records from Texas, requesting multiple members of Burke’s family appear for questioning by a Los Angeles grand jury. A Texas judge ordered them to attend.\n\nCNN twice contacted Burke’s attorney, who declined to comment. We have also reached out to Burke’s management company Mogul Vision multiple ways but have not heard back.\n\nA US tour by d4vd had continued last September after the discovery of the girl’s remains, but dates were thencanceled. CNN understands from a source that Burke has left the rental home in the Hollywood Hills where he had been living.\n\nBurke, 20, became well-known in 2022 on TikTok and in Fortnite and then on more mainstream media, with songs including “Romantic Homicide.”\n\nCeleste’s body was discovered the day after her 15th birthday, but the court documents say she was killed when she was 14.\n\nThe Associated Pressreportedthat she had been listed as missing in 2025.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2025/09/20/entertainment/d4vd-tour-removed-discovery-girls-body",
      "text": "canceled"
    },
    {
      "url": "https://apnews.com/article/celeste-rivas-missing-body-found-d4vd-b7a4d8291cd29e1ebfeb7ae87d0cc2d5",
      "text": "reported"
    }
  ],
  "hash": "ebe15b525343178a06d68ca3940bf2cb64eb1df43dbdd4ef8284972e95c549a0",
  "scraped_at": "2026-02-27T07:15:49.829205+00:00"
}