{
  "url": "https://lite.cnn.com/2026/02/16/asia/thailand-election-anutin-thaksin-intl-hnk",
  "title": "The house always wins, how the establishment finally came out on top in Thailand | CNN",
  "date": "2026-02-17T07:29:51.681346+00:00",
  "authors": [
    "Helen Regan, CNN"
  ],
  "text": "Source: CNN\n\nA billionaire former owner of English soccer giants Manchester City who dominated politics in his homeland now watches his dynasty fade from inside prison.\n\nFormer policemanThaksin Shinawatrareshaped Thailand’s politics. He served twice as the kingdom’s prime minister and commanded such a huge and loyal following that parties associated with him have won almost every election since 2001.\n\nNow, Thaksin is behind bars and his political party just had its worst ever performance in general elections earlier this month that saw the conservative order he once challenged returning firmly to power for the first time in a quarter of a century.\n\nAnalysts say the result could mean more stability for modern day Thailand, which has had three prime ministers in as many years and a 20-year cycle of military coups, violent street protests and paralyzing political instability.\n\nMuch of that instability was triggered by the battle between Thaksin and his allies, versus Thailand’s conservative establishment, a small but powerful network of military, royalist, and business elites threatened by his populist policies.\n\nIt’s been a bruising fight for Thaksin, with his opponents unleashing military coups, legal challenges and the courts to undermine and even topple elected governments – including four Shinawatra premiers.\n\n“Since the Thaksin challenge burst onto the scene in the early 2000s, the whole Thai political game has been about resisting this juggernaut, and resisting progress and reform of the establishment,” said Thitinan Pongsudhirak, a professor of political science at Chulalongkorn University.\n\nThaksin’s promise to improve the lives of the rural working classes, implement universal healthcare and subsidies for farmers earnt him a millions-strong following, particularly among his home base in the northeast.\n\nBut his popularity made him a threat to the establishment, who saw him as a corrupt populist.\n\nIn 2006 he was ousted in a military coup, convicted of graft and went into self-imposed exile for 15 years. His die-hard Red Shirt supporters took to the streets of Bangkok in 2010 in protests that were violently put down.\n\nYet even from abroad, he remained a central force in Thai politics, guiding allied parties that continued to win elections despite repeated dissolutions by the courts.\n\nThaksin’s dramatic return to Thailand from self-imposed exile in 2023 came at a pivotal moment.\n\nThe establishment had a new threat to contend with: a wildly popularprogressive movementthat was not afraid to break longstanding taboos around talking openly about the royal family or calling for fundamental changes to how Thailand is run.\n\nThe progressive party Move Forward had won that year’s election by promising those reforms. But the Thaksin-backed Pheu Thai party joined up with its former enemies in the military to form a governing coalition in a shock move that relegated the progressive movement to the opposition.\n\nAnalysts believe Thaksin made a deal to return and allow his party to take up the reins of government once again. Thaksin has denied there was such a deal.\n\nUpon his arrival, Thaksin was sentenced to eight years in prison on earlier corruption convictions, a term swiftly reduced to one year following a royal pardon.\n\nHe served much of that time in a VIP hospital suite, prompting accusations of preferential treatment. A court later ordered him to serve out his sentence in prison.\n\nBy then, many supporters had become disillusioned and felt the party had sold out.\n\nReflecting those sentiments, last Sunday, Pheu Thai failed to win any seats in the northern city of Chiang Mai, Thaksin’s birthplace and the Shinawatra heartland.\n\n“He used his party as a bargaining chip with the Thailand conservative establishment, and to get himself out of a prison sentence – which is he is now serving,” said Napon Jatusripitak, political scientist and Coordinator of the Thailand Studies Programme at the ISEAS – Yusof Ishak Institute.\n\n“He treated Pheu Thai as a family vehicle, and… I think people have realized that he was using his party all along as a vehicle for personal interest.”\n\nThe final nail in the coffin came when Thaksin’s daughter and prime minister Paetongtarn Shinawatra wasremoved from officelast year for a breach of ethics over aleaked phone callwith Cambodia’s former leader Hun Sen in which she appeared to criticize her own military in border clashes between their two countries.\n\nThe recent election has Pheu Thai is now a mid-size party, no longer the mighty political machine it once was.\n\n“It’s very clear that these legacies are all gone, that people are no longer willing to support a party based purely on nostalgia,” said Napon.\n\nAnd Thailand heads in a different political direction.\n\n“The royalist conservative establishment have a way of seeing off challenges,” said Thitinan. “The Thaksin challenge was about populism and redistribution. The next challenge was not just about income redistribution; it was about structural reforms of institutions that run Thailand.”\n\nAnutin Charnvirakul, who is known internationally for hislegalization of cannabiswhile serving as health minister, will lead a new coalition with a mandate, with Pheu Thai as a junior coalition partner.\n\nThe Bhumjaithai party leader is staunch royalist who is firmly against any amendments to lese majeste, Thailand’s strict royal defamation law. His party successfully capitalized on rising nationalism fueled by a deadly border conflict between Thailand and Cambodia last year, economic woes and uncertainty over Thailand’s trade relationship with the United States, and built up a strong local support base.\n\nThat progressive movement will remain in the opposition.\n\n“Whenever you align yourself with the progressives, you must understand that you are attempting to change an entire society,” said Chalit Ratapana, an IT worker who was active during the 2020 youth led protests. “So, if it doesn’t happen today, it’s not that big of a deal. I’ll just keep supporting them.”\n\nThe new Anutin-led government may be more stable, but “I don’t think necessarily more democratic,” said Napon.\n\n“Those instruments can still be weaponized against the opposition as well.”\n\nIt appears they already are.\n\nA day after the election, the National Anti-Corruption Commission found 44 progressive opposition lawmakers guilty for trying to amend lese majeste. Ten of them were newly elected in Sunday’s ballot, but they face a lifetime ban from politics if the Supreme Court rules against them.\n\nYet few in Thailand’s volatile political arena are ever entirely finished. Thaksin could be eligible for parole in May, his nephew is the party’s prime ministerial candidate.\n\n“Thaksin is a newsmaker, a dealmaker, with an ego, and always thinks he’s got another card up his sleeve,” said Thitinan.\n\n“The Shinawatra brand will still be around. It just will not be potent and decisive like it used to be.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2023/08/21/asia/thaksin-shinawatra-return-thailand-parliament-vote-intl-hnk",
      "text": "Thaksin Shinawatra"
    },
    {
      "url": "https://www.cnn.com/2023/05/15/asia/thailand-opposition-parties-military-election-analysis-intl-hnk",
      "text": "progressive movement"
    },
    {
      "url": "https://www.cnn.com/2025/08/29/asia/thailand-paetongtarn-shinawatra-court-hnk-intl",
      "text": "removed from office"
    },
    {
      "url": "https://www.cnn.com/2025/06/19/asia/thailand-cambodia-border-dispute-paetongtarn-intl-hnk",
      "text": "leaked phone call"
    },
    {
      "url": "https://www.cnn.com/2022/06/09/asia/thailand-cannabis-legal-minister-interview-intl-hnk",
      "text": "legalization of cannabis"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/asia/thailand-election-anutin-thaksin-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/asia/thailand-election-anutin-thaksin-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ec61cd6bd7c8206a21ea0ead59434590bee6880c5877dab725fe77f2cfdc1c2c",
  "scraped_at": "2026-02-17T07:29:51.681360+00:00"
}