{
  "url": "https://lite.cnn.com/2026/02/13/us/harvard-admissions-documents-trump-lawsuit",
  "title": "Trump administration files new lawsuit against Harvard University in long-running funding battle | CNN",
  "date": "2026-02-15T07:12:01.976138+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe Trump administration has fired another shot in its nearly year-long battle withHarvard Universityover federal funding to the institution, filing a new lawsuit Friday against the Ivy League school.\n\nThe Department of Justice claims Harvard has refused to provide documentation the government has requested in an investigation into whether the university discriminated against students in its admissions decisions, violating the terms of its government grants.\n\n“Harvard has failed to disclose the data we need to ensure that its admissions are free of discrimination — we will continue fighting to put merit over DEI across America,” Attorney General Pam Bondisaidin a statement.\n\nHarvard, meanwhile, “has been responding to the government’s inquiries in good faith and continues to be willing to engage with the government according to the process required by law,” it told CNN on Friday.\n\nThe larger dispute dates to February 2025, when Harvard was firstnotified in a letterthe DOJ w﻿as “aware of allegations that your institution may have failed to protect Jewish students and faculty members from unlawful discrimination.”\n\nThe Trump administration froze billions of dollars in federal funding to Harvard, a decision that was overturned by a federal judge intwolawsuitsfiled by Harvard now being appealed by the government.\n\n“The University will continue to defend itself against these retaliatory actions which have been initiated simply because Harvard refused to surrender its independence or relinquish its constitutional rights in response to unlawful government overreach,” Harvard said in its Friday statement.\n\nThe Justice Department is demanding seven years’ worth of detailed information about all of the applicants to Harvard’s undergraduate programs, law school and medical school. The government’s request also includes information on race and gender, citizenship status and grades, along with how “Diversity, Equity, and/or Inclusion initiatives and programs” were used.\n\nThelawsuitacknowledges Harvard has already turned over about 2,300 pages of documents in response to the request but says the school did not provide details on individual students as the government requested.\n\n“It has slow-walked the pace of production and refused to provide pertinent documents relating to applicant-level admissions decisions,” the Trump administration says in its lawsuit.\n\nThe suit also notes the landmark2023 Supreme Court decision, involving Harvard and the University of North Carolina, that ruled out the consideration of race in student admissions at most colleges and universities.\n\nIn recent years, Harvard has acknowledged problems with discrimination on campus, releasing lengthytask force reportson antisemitism and anti-Muslim bias.\n\nBut the Justice Department says it needs more proof showing the university is treating applications fairly.\n\n“Providing requested data is a basic expectation of any credible compliance process, and refusal to cooperate creates concerns about university practices,” said Assistant Attorney General Harmeet K. Dhillon in a statement. “If Harvard has stopped discriminating, it should happily share the data necessary to prove it.”\n\nIn its new lawsuit, the government does not ask for any damages at all, instead asking a judge to force the university to turn over more admissions documents.\n\nThe ongoing legal battle with the White House has put Harvard under a cloud of financial uncertainty.\n\nAs other prominent universities, includingColumbiaandBrown, agreed to settlements putting an end to federal investigations and funding cuts, Harvard reported a$113 million operating deficitin its most recent fiscal year.\n\nThe new lawsuit follows President Donald Trump’s repeatedly assertions his administration was on theverge of an agreementwith Harvard to settle the government’s discrimination claims.\n\nBut White House pledges that a deal would soon be completed have come and gone, reportedly over debates regarding Harvard’s academic freedom and whether any of the money would be paid directly to the government.\n\n“We are now seeking One Billion Dollars in damages, and want nothing further to do, into the future, with Harvard University,” Trumpwroteon February 2 after aNew York Times reportsuggested the president would back down on a key demand for $200 million in cash.\n\nThis story has been updated with additional reporting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/us/harvard-university-trump-settlement-hnk",
      "text": "Harvard University"
    },
    {
      "url": "https://www.justice.gov/opa/pr/justice-department-sues-harvard-university-withholding-race-related-admissions-documents",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2025/04/26/us/harvard-university-trump-timeline#:~:text=February%2027%3A,signed%20by%20Terrell.",
      "text": "notified in a letter"
    },
    {
      "url": "https://www.courtlistener.com/docket/69921962/president-and-fellows-of-harvard-college-v-us-department-of-health-and/",
      "text": "two"
    },
    {
      "url": "https://www.courtlistener.com/docket/70349156/president-and-fellows-of-harvard-college-v-united-states-department-of/",
      "text": "lawsuits"
    },
    {
      "url": "https://storage.courtlistener.com/recap/gov.uscourts.mad.296123/gov.uscourts.mad.296123.1.0.pdf",
      "text": "lawsuit"
    },
    {
      "url": "https://www.cnn.com/2023/06/29/politics/affirmative-action-supreme-court-ruling",
      "text": "2023 Supreme Court decision"
    },
    {
      "url": "https://www.cnn.com/2025/04/29/us/harvard-reports-antisemitism-anti-muslim-bias",
      "text": "task force reports"
    },
    {
      "url": "https://www.cnn.com/2025/07/23/politics/columbia-trump-administration-settlement-federal-funding",
      "text": "Columbia"
    },
    {
      "url": "https://www.cnn.com/2025/07/30/politics/brown-university-trump-administration-agreement",
      "text": "Brown"
    },
    {
      "url": "https://news.harvard.edu/gazette/story/2025/10/harvard-reports-operating-deficit-amid-federal-funding-cuts/",
      "text": "$113 million operating deficit"
    },
    {
      "url": "https://www.cnn.com/2025/07/24/politics/harvard-columbia-trump-administration-mcmahon",
      "text": "verge of an agreement"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116004776659519984",
      "text": "wrote"
    },
    {
      "url": "https://www.nytimes.com/2026/02/02/us/politics/trump-harvard-payment.html",
      "text": "New York Times report"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/us/harvard-admissions-documents-trump-lawsuit",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/us/harvard-admissions-documents-trump-lawsuit",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ecff0ca4a409d6b1e4178dc8fe72ffd42023e4a134161b1f23f34f60c828d396",
  "scraped_at": "2026-02-15T07:12:01.976151+00:00"
}