{
  "url": "https://lite.cnn.com/2026/02/12/media/david-ellison-trump-paramount-netflix-wbd",
  "title": "Trump met with David Ellison days before saying he’s ‘not involved’ in Paramount’s Netflix battle | CNN Business",
  "date": "2026-02-12T21:29:44.046995+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA version of this article first appeared in the Reliable Sources newsletter. You cansign up for free right here.\n\nParamount CEO David Ellison returned to the White House last week to meet privately with President Donald Trump, amid Paramount’s ongoing hostile takeover bid for CNN and the rest of Warner Bros. Discovery.\n\nEllison and Trump had two wide-ranging conversations, according to two sources with knowledge of the meetings.\n\nThe timing of the meetings — early last week — is notable because Trump was asked by NBC’s Tom Llamas on Wednesday aboutParamount and Netflix’s battle, and he said, “I haven’t been involved.”\n\nThat was a major shift for Trump, who hadpreviously saidhe would be involved and signaled his preference for Paramount.\n\nTrump administration regulators are currently reviewing WBD’s deal to sell the Warner Bros. studio and HBO to Netflix. Paramount is trying to stop that deal by going straight to shareholders with its own bid for all of WBD, including CNN.\n\nIn the NBC interview, Trump seemed to marvel at the attention he’s been getting from both Ellison and Netflix co-CEO Ted Sarandos, who has also met with Trump in recent months. “I must say, I guess I’m considered to be a very strong president,” he said. “I’ve been called by both sides. It’s the two sides, but I’ve decided I shouldn’t be involved. The Justice Department will handle it.”\n\nIn Trump’s comments to NBC, he also alluded to the Paramount side’s argument that Netflix’s acquisition of Warner Bros. would be monopolistic: “There’s a theory that one of the companies is too big and it shouldn’t be allowed to do it, and the other company is saying something else. They’re beating the hell out of each other — and there’ll be a winner.”\n\nTwo days after the NBC interview, The Wall Street Journalreportedthat the Justice Department is investigating whether Netflix “has engaged in anticompetitive tactics,” citing a copy of a subpoena.\n\nNetflix responded by saying the company “is not aware of any investigation into our business outside of the standard merger review process.”\n\nA Paramount spokesperson declined to comment on the White House meetings. The White House press office did not respond to a request for comment.\n\nEllison has been a repeated visitor to the White House during Trump’s second term, as has his father, Oracle’s billionaire co-founder Larry Ellison, a close Trump ally.\n\nLast December, the Journal reported that David Ellison “offered assurances to Trump administration officials that if he bought Warner, he’d make sweeping changes to CNN.” A few days after that story hit,Trump publicly said, “It’s imperative that CNN be sold” and called the news organization’s current leaders a “disgrace.”\n\nThe Netflix-Warner deal does not involve any change of ownership for CNN. WBD plans to split itself into two separate publicly traded companies later this year. Once that happens, CNN and other channels will become part of Discovery Global, and HBO and Warner’s movie studio will be positioned for Netflix’s takeover.\n\nParamount argues that the Netflix deal is inferior to the $30-per-share offer that it has publicly made for WBD. But to date, there has been little evidence that WBD shareholders are rushing to side with Paramount.\n\nOne of Paramount’s key arguments has centered on the Trump administration and whether regulators will block the Netflix deal.\n\nEllison has promoted what he calls “a clear regulatory path” for Paramount’s takeover bid — which many analysts have connected to his family’s close relationship with the president.\n\nLarry Ellison is one of the key investors in the new Trump-arranged investor consortium that is now operating TikTok in the United States.\n\nAnd Trump complimented both Larry and David Ellison after the family took control of Paramount last year, saying, “They’re friends of mine. They’re big supporters of mine. And they’ll do the right thing. They’ll make CBS — they called it the Tiffany Network, and it’s got great potential. CBS has great potential.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/newsletters/reliable-sources",
      "text": "sign up for free right here"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/netflix-paramount-trump-warner-bros-future",
      "text": "Paramount and Netflix’s battle"
    },
    {
      "url": "https://www.cnn.com/2025/12/10/media/trump-cnn-sold-paramount-warner-bros-netflix",
      "text": "previously said"
    },
    {
      "url": "https://www.wsj.com/business/media/justice-department-casts-wide-net-on-netflixs-business-practices-in-merger-probe-fd30d7f8",
      "text": "reported"
    },
    {
      "url": "https://www.cnn.com/2025/12/10/media/trump-cnn-sold-paramount-warner-bros-netflix",
      "text": "Trump publicly said"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/media/david-ellison-trump-paramount-netflix-wbd",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/media/david-ellison-trump-paramount-netflix-wbd",
      "text": "Cookie Settings"
    }
  ],
  "hash": "edd05f947d4573b4fa18a91e862791da55054ea845ce6937e92bc75c28f096fd",
  "scraped_at": "2026-02-12T21:29:44.047010+00:00"
}