{
  "url": "https://lite.cnn.com/2026/02/11/americas/canada-mass-shooting-school-latam-intl",
  "title": "Jesse Van Rootselaar: What we know about the Canada shooting suspect and the victims of the attack | CNN",
  "date": "2026-02-15T07:11:36.489118+00:00",
  "authors": [],
  "text": "Source: CNN\n\nThe tiny Canadian mountain town of Tumbler Ridge, British Columbia, suffered one of the country’s worst school shootings in recent history on Tuesday, when an 18-year-old woman killed at least eight people and wounded dozens.\n\nPolice say they still don’t know the motive of the suspected shooter, who killed their mother and step-brother at a home before going to the school, but had previously dealt with them over mental health concerns.\n\nFlags across Canada were lowered to half-staff on Wednesday, and Prime Minister Mark Carney and other national political figures paid their respects  in Parliament with speeches and a moment of silence. British Columbia hasdeclared Thursday a day of mourning.\n\nHere’s what we know about the shooting, the alleged shooter, victims and the ongoing investigation.\n\nPolice confirmed the names and ages of the eight killed in the shootings on Thursday.\n\nThe Royal Canadian Mounted Police (RCMP) named the victims found in the school as Abel Mwansa, 12; Ezekiel Schofield, 13; Kylie Smith, 12; Zoey Benoit, 12; Ticaria Lampert, 12; and Shannda Aviugana-Durand, 39.\n\nAuthorities had earlier said that a 39-year-old educator was killed in the attack.\n\nTwo other victims were found at a house in Tumbler Ridge: Emmett Jacobs, 11, and Jennifer Jacobs, 39.\n\nThe two relatives found dead at the home were the suspected shooter’s mother and step-brother, police said Wednesday. Areviewby CNN found that Jennifer Jacobs went by a different name, Jennifer Strang, on social media.\n\nThe family of Kylie Smith had earlierconfirmed she was among those killed. Her father, Lance Younge, told Canadian network CTV she was a “beautiful soul” and urged other parents to tell their kids “you love them every day.”\n\n“Hold your kids tight, tell them you love them every day. You never know, you never know,” Younge told CTV, sobbing.\n\nOn Thursday, Smith’s family wrote in a statement released by the RCMP that Smith “was a talented artist and had dreams of going to art school in the big city of Toronto.”\n\nThe RCMP also shared a message from Zoey Benoit’s family on Thursday.\n\nBenoit was “the strongest little girl you could meet,” the statement read. “She brought so much laughter and smiles in her presence. She loved spending time with her family where she could show her love.”\n\n“Our family is devastated by this loss, but we will cherish her memories with us so close to our hearts forever. She will forever be loved and never forgotten. We miss you beautiful girl, Zoey we love you so much.”\n\nPolice did not share information beyond the ages and names of the others killed in the attack.\n\nIn an interview with CNN’s Canadian broadcast partnerCBC, the father of Abel Mwansa, Jr. identified his son as one of the two boys killed at the school. Originally from Zambia, the family had moved to Tumbler Ridge for a mining job.\n\n“It happened that we had a boy and I was just so excited,” Abel Mwansa, Sr. told CBC. “I ended up giving him my name.”\n\nMwansa, Sr. said his son always had a smile on his face.\n\n“Just such a good boy,” he said.\n\nOne of those seriously wounded was Maya Edmonds, 12, who is in a critical condition in Vancouver Children’s Hospital after being shot in the head and neck, according to a note from her mother on a GoFundMe page verified by CNN.\n\n“My 12 year old daughter is fighting for her life while they try to repair the damage,” Maya’s mother Cia Edmonds wrote in an update, adding that she was clinging to a “shred of hope.”\n\nAverified fundraising pagefor another victim, Paige Hoekstra, said she is recovering after suffering “one gunshot wound to the chest” and undergoing surgery.\n\nThe number of people killed in the massacre was revised down to eight on Wednesday, not including the shooter. Authorities initially said nine people were killed, but later said a seriously wounded person they thought had died had in fact survived.\n\nPolice identified the alleged shooter as Jesse Van Rootselaar, an 18-year-old Tumbler Ridge woman who they said had dropped out of school approximately four years ago.\n\nPolice had visited Van Rootselaar’s “residence on multiple occasions over the past several years, dealing with concerns of mental health with respect to our suspect,” said McDonald, the deputy police commissioner.\n\nThe most recent police visit was last spring and was over “concerns regarding mental health, self-harm.”\n\n“I can say that on different occasions, the suspect was apprehended for assessment and follow up,” McDonald said. Firearms were seized from the home, and later returned after the owner petitioned for them.\n\nOn Friday, McDonald said that neither the shotgun used in the attack at Van Rootselaar’s home nor “the main firearm believed to be used in the mass shooting at the school” had ever been seized by police. The shotgun was unregistered, and the RCMP is still investigating the origin of the firearm used at the school.\n\nAsked whether Van Rootselaar was transgender, McDonald said that police were identifying her “as they chose to be identified in public and in social media.”\n\n“I can say that Jesse was born as a biological male who approximately six years ago began to transition to female and identified as female, both socially and publicly,” McDonald said.\n\nThere is no information that suggests Van Rootselaar experienced “bullying” at school related to her transition, McDonald said.\n\nHe confirmed police had not found a note or any kind of communication that might indicate a motive.\n\nAt a press conference on Friday, McDonald told reporters that they did not believe Van Rootselaar targeted specific victims at the school.\n\n“There was no specific targeting of any individuals,” McDonald said. “This suspect was, for lack of a better term, hunting.”\n\nCanadian police believe the shooter initially killed her mother and step-brother in a residence inTumbler Ridgebefore heading to the school.\n\nPolice received a report of an active shooter at Tumbler Ridge Secondary School at 2:20 p.m. local time (4:20 p.m. ET) Tuesday. Within minutes, officers were on the scene.\n\nAt around 2:30 p.m., alarms began to sound in the school, announcing a lockdown and ordering that classroom doors be closed. Astudentsaid he and his classmates used tables to barricade themselves in.\n\nMeanwhile, a young female relative at the Tumbler Ridge home of the suspected shooter alerted a neighbor to the attack, who then phoned police at 2:47 p.m.\n\nPolice said the alleged shooter was found dead in the school with what appeared to be a self-inflicted injury.\n\nWhen police entered the school, they found one dead victim in a stairwell, and others in the library, Deputy Commissioner Dwayne McDonald of the RCMP said.\n\nTwo people were take to hospital with serious wounds and around 25 others required medical attention.\n\nHundreds of people gathered at a public square in Tumbler Ridge on Wednesday night, holding candles and laying flowers at a community vigil.\n\nMayor Darryl Krakowka said the town is “one big family,” as he choke﻿d back tears during a news conference following the vigil.\n\n“Everybody’s going to be grieving in Tumbler Ridge,” Krakowka said.\n\n“Lend your ear when somebody needs your ear, lend your shoulder when somebody needs your shoulder. Give somebody a hug,” he said.\n\nTumbler Ridge is small town, with just 2400 people, that lies at the foothills of the Rocky mountains in northeast British Columbia. It was founded in the 1980s as a coal mining community, but the two main coal mines later closed.\n\nPointing to the the town’s resilience in the face of adversity, Prime Minister Mark Carney said Tumbler Ridge is the kind of place that makes sure no one is left behind.\n\nThe timeline in this story has been updated following clarification from Canadian police.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/world/live-news/tumbler-ridge-canada-shooting-02-11-26?post-id=cmlih0yfx000e356qd4vdnutn",
      "text": "declared Thursday a day of mourning"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/americas/tumbler-ridge-shooting-suspect-online-posts-intl-hnk",
      "text": "review"
    },
    {
      "url": "https://www.cbc.ca/news/canada/british-columbia/livestory/active-shooter-alert-tumbler-ridge-secondary-school-bc-live-updates-9.7083740?ts=1770924067560",
      "text": "CBC"
    },
    {
      "url": "https://www.gofundme.com/f/donate-to-help-paige-and-her-road-to-recovery",
      "text": "verified fundraising page"
    },
    {
      "url": "https://www.cnn.com/world/live-news/tumbler-ridge-canada-shooting-02-11-26?post-id=cmlif6mi00005356qxnyzwsdd",
      "text": "Tumbler Ridge"
    },
    {
      "url": "https://www.cnn.com/world/live-news/tumbler-ridge-canada-shooting-02-11-26?post-id=cmlhuzkoj00003b6pt69l5u8d",
      "text": "student"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/americas/canada-mass-shooting-school-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/americas/canada-mass-shooting-school-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ee30393e300f9104b6d9aad31ca16e9b8512cbda825d65142a36c21254f8e079",
  "scraped_at": "2026-02-15T07:11:36.489133+00:00"
}