{
  "url": "https://lite.cnn.com/2026/02/22/politics/casey-wasserman-los-angeles-olympics",
  "title": "Calls grow for Casey Wasserman to resign as chair of 2028 LA Olympics | CNN Politics",
  "date": "2026-02-23T07:35:59.806226+00:00",
  "authors": [
    "Jeremy Herb",
    "Elex Michaelson",
    "Brian Stelter",
    "CNN"
  ],
  "text": "Source: CNN\n\nPressure is mounting publicly and privately for entertainment mogulCasey Wassermanto step down as chair of the 2028 Los Angeles Olympics following a series of embarrassing and salacious emails with Jeffrey Epstein associate Ghislaine Maxwell included in theEpstein filesreleased by the Justice Department.\n\nCalls for Wasserman to resign from the LA28 Olympics committee grew quickly after high-profile clients said they were leaving his sports and entertainment talent agency, leading him to announce thathe was selling his firmbecause he didn’t want to be a “distraction,” he wrote in a memo to staff.\n\nDozens of elected officials in California, including Los Angeles Mayor Karen Bass, have publicly said he should step down.\n\n“The Olympics and the Epstein files should not be in the same sentence, in the same conversation,” Democratic state Rep. Mark Gonzalez said on CNN’s “The Story Is with Elex Michaelson” this past week. “It’s become a distraction to the dollars that need to be raised to go into fundraising for these Olympics.”\n\nFor now, Wasserman appears to have dug in, and he has told friends and colleagues he won’t step down. But behind the scenes, sources told CNN the US and International Olympic committees have been engaged in backchannel conversations about the future of the 2028 LA Olympics and Wasserman’s role. Potential replacements have been floated, including outgoing Disney CEO Bob Iger, sources familiar with the discussion told CNN.\n\nThe Olympic chair is the public face of the Games, and sources familiar with LA28 are concerned that Wasserman won’t be able to do interviews, raise money or conduct other public-facing duties without controversy or distraction.\n\nOlympic officials and sponsors never like controversy, and according to one source, they always want the chair to be a “pristine brand ambassador.” A scathingcolumn in Sports Illustratedon Thursday calling for Wasserman to resign and laying out in detail his racy emails sparked renewed attention among people concerned about the LA Olympics’ brand.\n\nMembers of the Los Angeles Olympic Organizing Committee board agreed after a review to keep Wasserman in his position as chair. But sources said they were caught off guard by Wasserman’s subsequent announcement that he was selling his business.\n\nIn another sign of the backlash against Wasserman, the Wallis Annenberg Center for the Performing Arts was set to host a fundraising dinner honoring Wasserman later this month, according to an invitation obtained by CNN. But in the wake of the Epstein file revelations, that dinner was suddenly postponed to late May, and a website for the event no longer mentions Wasserman.\n\nThe fallout has been swift in the wake of theEpstein files releasethat revealed sexually suggestive emails from 2003 between Wasserman and Maxwell, who wasconvictedof sex trafficking in 2021. Wasserman has not been accused of any criminal wrongdoing in relation to Epstein, and the emails are from more than 20 years ago, before Epstein or Maxwell were charged with any crimes.\n\nDuring oneexchange in March 2003, Wasserman asked Maxwell: “So what do I have to do to see you in a tight leather outfit?”\n\nIn another email, datedApril 1, 2003, Wasserman, who was married at the time, said to Maxwell: “Where are you, I miss you,” before asking to book a massage.\n\nThe notable exchanges CNN reviewed between Wasserman and Maxwell do not include Epstein himself.\n\nIn Wasserman’s memo this month announcing he was selling his agency, he wrote that he regretted sending the messages, but said that he had only “limited interactions” with Epstein and Maxwell.\n\n“It was years before their criminal conduct came to light, and, in its entirety, consisted of one humanitarian trip to Africa and a handful of emails that I deeply regret sending,” Wasserman said. “And I’m heartbroken that my brief contact with them 23 years ago has caused you, this company, and its clients so much hardship over the past days and weeks.”\n\nRepresentatives for Wasserman did not respond to CNN’s requests for comment.\n\nMaxwell, Epstein’s former girlfriend, was convicted of sex trafficking and other crimes in 2021 and is serving a 20-year sentence. Epstein died in prison in 2019 while awaiting trial on federal sex-trafficking charges.\n\nWasserman expressed his “regret” about his correspondence with Maxwell in astatementreported by the Associated Press in January, saying the exchange “took place over two decades ago, long before her horrific crimes came to light.”\n\nStill, support for Wasserman has continued to erode.\n\nInan interview Mondayon CNN’s “The Lead,” Bass became the highest-profile elected official to call for Wasserman to step down.\n\n“I cannot fire him. My opinion is that he should step down,” Bass said, noting the LA Olympics Committee board makes that decision.\n\nDozens of California elected officials have said he should resign, including a 37-member LA-basedstate legislative delegation.\n\n“Either the Epstein files matter in terms of leadership or they don’t. I think survivors want there to be accountability,” Los Angeles County Supervisor Lindsey Horvath told CNN’s Michaelson this month, saying the LA28 board should step in.\n\nCalifornia Gov. Gavin Newsom, a potential 2028 Democratic presidential candidate, was noncommittal when asked about Wasserman this month. “I haven’t had a chance to sit down with him, and I’m looking forward to doing that,” he told reporters last week.\n\nThe LA28 board’s executive committee said this month that it conducted a review of Wasserman’s emails with Maxwell and a humanitarian trip he and his wife took on Epstein’s plane to Africa before the late financier was charged with any crimes. The executive committee said in a statement that after “reviewing any concerns related to the organization’s leadership,” it has determined that Wasserman “should continue to lead LA28 and deliver a safe and successful Games.”\n\nThe 35 members of the LA28 Olympics board have largely remained silent on Wasserman’s chairmanship beyond the statement from the executive committee. The board includes a mix of friends of Wasserman as well as local business leaders, athletes and Olympic officials, and politicians.\n\nThe Olympics broadcaster in the US, NBC, also has an influential voice, given that its parent company, Comcast, pays the IOC billions for the rights to televise the games.\n\nThe Wasserman controversy is “unwelcome and uncomfortable” for Comcast, a person involved in NBC’s Olympics relationship said. The person also pointed out that Comcast Chair and CEO Brian Roberts has both great pride in the Olympics and great aversion to scandal.\n\nComcast has not commented on the situation, though, and doesn’t have a vote in the matter. Roberts was seen with other media and sports executives at a party Wasserman hosted for NBA All-Star weekend this month in Beverly Hills.\n\nWasserman helped build the idea of the modern Hollywood powerbroker, drawing on the experience of his grandfather, prolific postwar talent agent Lew Wasserman, and the work of decades in the business.\n\nAt the age of 24, he bought the Arena Football League’s Los Angeles Avengers, his first sports organization. A few years later, he launched the Wasserman Media Group, which he built into one of today’s leading sports and entertainment talent agencies.\n\nThe agency has repped top-tier musicians including Billie Eilish, Coldplay, Ed Sheeran, Kendrick Lamar and Joni Mitchell, among hundreds of others, as well as athletes like Giancarlo Stanton, Derrick Rose and Alex Morgan.\n\nHe’s been a major donor to Democratic politicians, but he also developed a relationship with Trump as chair of the LA28 Olympics committee. Wasserman and Trump appeared together at an August event in Washington, where the president signed anexecutive orderdesignating himself chair of a new White House task force on the 2028 Olympics.\n\nSome Democrats have speculated whether Trump — who has long attacked California — could try to install a friendly chair if Wasserman stepped down.\n\n“I have heard the same thing,” Gonzalez told CNN’s Michaelson, adding that Wasserman’s supporters argue “he is a good person that is representing the Los Angeles [and] state needs that are at the forefront of these conversations.”\n\n“But again, we’re talking about the immediate, you know, ramifications that we are seeing right now with having to raise those dollars. There is zero government dollars that are going into this. It has to be all raised through corporations,” he added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/entertainment/casey-wasserman-epstein-files-ghislaine-maxwell",
      "text": "Casey Wasserman"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Epstein files"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/politics/casey-wasserman-talent-agency-epstein-maxwell",
      "text": "he was selling his firm"
    },
    {
      "url": "https://www.si.com/winter-olympics/casey-wasserman-must-resign-la-olympics-2028-ghislaine-maxwell",
      "text": "column in Sports Illustrated"
    },
    {
      "url": "https://www.cnn.com/politics/epstein-files",
      "text": "Epstein files release"
    },
    {
      "url": "https://www.cnn.com/2021/12/30/us/ghislaine-maxwell-thursday/index.html",
      "text": "convicted"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02335206.pdf",
      "text": "exchange in March 2003"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02332508.pdf",
      "text": "April 1, 2003"
    },
    {
      "url": "https://apnews.com/article/epstein-maxwell-wasserman-olympics-bf365cd5231304395af05abc3deb9cf7",
      "text": "statement"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/video/los-angeles-olympics-casey-wasserman-epstein-files-lead-tapper",
      "text": "an interview Monday"
    },
    {
      "url": "https://static1.squarespace.com/static/68b3580e728f33561b03b438/t/69963d1f02a9ed6fb6b7ca3b/1771453727909/LACD+2.18+Satement.pdf",
      "text": "state legislative delegation"
    },
    {
      "url": "https://www.whitehouse.gov/presidential-actions/2025/08/establishing-the-white-house-task-force-on-the-2028-summer-olympics/",
      "text": "executive order"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/politics/casey-wasserman-los-angeles-olympics",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/politics/casey-wasserman-los-angeles-olympics",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ef61e5d080d5760a4a7f4337137002daff5ccda005730de393cbaeee06b21751",
  "scraped_at": "2026-02-23T07:35:59.806239+00:00"
}