{
  "url": "https://lite.cnn.com/2026/02/22/business/car-emissions-regulations-trump",
  "title": "What to expect of your next car after Trump virtually eliminated emissions regulations | CNN Business",
  "date": "2026-02-23T07:36:19.356155+00:00",
  "authors": [
    "Julian Torres, CNN"
  ],
  "text": "Source: CNN\n\nWith the Trump administration effectivelydismantling automotive emissions regulations, cars on dealership lots could see some changes. Your next car could be bigger, with fewer fully electric options – but it also might be a hybrid.\n\nThe repeal of the Environmental Protection Agency’s 2009 endangerment finding effectively terminates the greenhouse gas standards that governed automakers for more than a decade and a half.\n\nThe repeal followed Congress’s zeroing out of penalties for violating Corporate Average Fuel Economy (CAFE) targets as part of the One Big Beautiful Bill Act.\n\nThe results of the drastic shift fall into two main categories: affecting the kinds of vehicles offered, as well as the technology inside them.\n\n“I definitely think the stop/start technology, stuff like that, will probably go away,” said Stephanie Valdez Streaty, director of industry insights at Cox Automotive, referring to technology that turns engines off when they’re idle in traffic and back on when it’s time to move.\n\nOther technologies that could be phased out include waste heat recovery systems that pull heat from the car’s engine to the interior, solar reflective surface coating and high efficacy exterior lights.\n\nBut those technologies aren’t going away instantly.\n\nTechnologies like start-stop systems “will continue to vary by vehicle and market as the company evaluates consumer preferences, regulatory requirements, and vehicle design,” Ann Marie Fortunate, a spokesperson for Stellantis, told CNN.\n\nAmericans could see a priority shift on dealership lots, too. Automakers couldchurn out the vehicles that aren’t just in demand, but those with the highest profit margins, such as big SUVs.\n\n“(Deregulation) gives the manufacturer some breathing room to really produce more of those more profitable vehicles.” Valdez Streaty said in reference to higher-margin combustion engine and hybrid options, as well as bigger trucks and SUVs thatare historically favored by Americans. “I think we’ll start to see more of those on the dealer lots.”\n\nAccording to Cox Automotive data, full-size trucks are up 14% year over year, full-size SUVs are up 23.9%, and midsize trucks are up 21.2%.\n\n﻿Even before the repeal, many automakers were scaling back their hybrid and EV ambitions over the last few years. Stellantis cancelled its line of Jeep plug-in hybrids earlier this year, and companies including Nissan and Tesla have halted or ended some EV models entirely.\n\nBut the regulatory changes do not mean a wave of radically different vehicles will hit dealerships overnight.\n\nThe long-term impact is likely to show up gradually in the types of vehicles that will be produced, rather than a complete abandonment of voluntary emissions standards, complete with redesigns.\n\n“The reality is that politics can move much faster than the auto industry. Policy changes tend to influence vehicle production gradually, over multiple model years, rather than triggering sudden price resets,” Valdez Streaty said.\n\nAnd when policy changes happen, car companies need time to figure out their plans for future products.\n\n“Ford is still evaluating the impacts of(repealing the EPA’s endangerment finding)on our business,” Benjamin Khoshbin, a spokesperson for Ford told CNN.\n\nAutomakers have also become wary of diving headfirst into major product line shifts, after electric car sales proved disappointing once the Trump administration eliminated federal tax credits for zero-emissions vehicles.\n\nDetroit’s big three automakers — Stellantis, Ford and General Motors — disclosed that they’ve taken billions of dollars worth in EV-related write-downs in recent quarters.\n\nBut electrification is not disappearing.\n\nFord recently announced its development of the next-generation F-150 Lightning EREV, as well as it’s budget-priced EV line of mid-sized electric trucks for 2027. Starting at $30,000, the line makes strides in efficiency with a slimmed down battery that improves driving range by nearly 50 miles.\n\nToyota is also staying committed to its electric goals. “TMNA’s (Toyota Motor North America’s) total electrified portfolio, including BEVs, will make up 70% of U.S. sales by 2030,” Leigh Anne Sessions, a spokesperson for Toyota, told CNN﻿in a statement.﻿\n\nAutomakers aren’t giving up on hybrids. Companies like Toyota have over a dozen hybrid options for its 2026 vehicles, which appeal to consumers who want improved fuel economy but have concerns about range and charging infrastructure.\n\nFor consumers, that makes the likely shift in car lots more gradual, with more trucks and SUVs, stronger hybrid emphasis, and a potentially slower EV ramp-up as automakers take time to recalibrate.\n\nEven if US regulations loosen, automakers still recognize the pressure from global markets that continue to push towards more affordable electrification.\n\n“There is no doubt that the US risks becoming an outlier market — building up capabilities for designing and building vehicles that literally do not sell anywhere else in the world,” John Paul MacDuffie, professor of management at the Wharton School of Business, said.\n\nAmerican automakers sell vehicles in Europe and other markets where emissions standards remain strict, and retreating too far from electrification could weaken global competitiveness.\n\n“If you talk with auto companies from around the world… they are quite convinced that the transition to electric is inevitable. They figure the US will just lag in that adoption,” MacDuffie said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/climate/trump-repeals-epa-endangerment-finding",
      "text": "dismantling automotive emissions regulations"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/business/car-emissions-regulations-trump",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/business/car-emissions-regulations-trump",
      "text": "Cookie Settings"
    }
  ],
  "hash": "eff364f69a2f16346dcb7250841ad37e8c3cc3ffb2625af6a3a14d2ff0a237c9",
  "scraped_at": "2026-02-23T07:36:19.356168+00:00"
}
