{
  "url": "https://lite.cnn.com/2026/02/10/us/ice-detain-irish-man-five-months-intl",
  "title": "ICE detention: Irish man detained by ICE in Texas for five months says he fears for his life | CNN",
  "date": "2026-02-11T16:32:31.877537+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAn Irish man who has been in US immigration detention for five months has said he fears for his life and is confined in appalling conditions, as international scrutiny grows over the treatment of immigrantsheld by US authorities.\n\nSeamus Culleton, originally from the Irish county of Kilkenny, has been held at an Immigration and Customs Enforcement (ICE) detention facility in Texas since early September.\n\nCulleton, who has lived in Boston for more than 15 years and runs a construction company,told Irish broadcaster RTEthat he was taken by ICE officers on his way home from Home Depot.\n\nCulleton said that he told ICE authorities that he is married to a US citizen, is in the process of applying for a green card, had no criminal record and had a valid work permit.\n\n“As far as I know I was covered,” he said, speaking from an ICE facility in El Paso, Texas where he is currently detained. “None of that mattered; they cuffed me and took me away,” he said.\n\nIn a statement to CNN, US Department of Homeland Security (DHS) spokesperson Tricia McLaughlin said that Culleton had entered the US in 2009 under the visa waiver program which allowed a 90-day stay, then failed to depart.\n\nCulleton said that he is being held in a large, overcrowded room with more than 70 other men and sleeping under constant artificial lighting in cold and damp conditions.\n\nDetainees are receiving limited food, have restricted access to medical care and are rarely allowed outside, he told RTE.\n\n“I’ve been locked in the same room now for four and a half months. I’ve had barely any outside time. No fresh air. No sunshine. I could probably count on both hands the amount of times I’ve been outside,” Culleton said, adding: “I’m just locked in this room all day every day.”\n\nCulleton described the conditions inside the facility, thousands of miles away from his home in Boston, as “filthy,” calling it a “nightmare.”“I’m in fear for my life down here, honestly,” he said.\n\nMcLaughlin said that after his arrest on September 9, Culleton “received full due process and was issued a final order of removal by an immigration judge on September 10, 2025. He was offered the chance to instantly be removed to Ireland but chose to stay in ICE custody, in fact he took affirmative steps to remain in detention.”\n\n“A pending green card application and work authorization does not give someone legal status to be in our country,” McLaughlin said.\n\n“These claim(s) that there are subprime conditions at ICE facilities are FALSE,” the statement added.\n\nCNN has also reached out to ICE, which falls under DHS, for comment.\n\nCulleton said ICE officials originally tried to persuade him to sign paperwork agreeing to his deportation, but that he refused, choosing instead to fight his case based on his pending green card application through his wife, Tiffany Smyth.\n\nSmyth said the shock of her husband’s sudden detention was “awful,” and spoke of the difficulty of navigating the immigration system, describing it as opaque and stacked against families.\n\nSmyth told RTE that she went nearly a week without knowing where he was or whether he was safe.\n\n“I didn’t know if he got deported, I didn’t know if he was back in Ireland. I had no idea if he was safe… And there’s no one that helps you to get this information,” she said.\n\n“There’s a tracker online that you can track somebody that’s in ICE custody, so that’s what I did, and then I saw he was moved to El Paso, Texas,” Smyth said, adding that she hasn’t been able to visit her husband yet.\n\n“They say that visits are feasible, but when you try to set one up it’s almost impossible,” she said.\n\nCulleton’s case has prompted outrage in Ireland and the Irish government has publicly addressed it.\n\nSpokespeople from both the Department of Foreign Affairs and the office of the prime minister, or Taoiseach, told CNN that they are aware of the case, that consular assistance is being provided and that the Irish Embassy in Washington, DC, is “engaging directly” with the Department of Homeland Security.\n\nTaoiseach Micheál Martintold reportersTuesday: “Every country has migration policies, but those ICE facilities are a concern.”\n\nWhile Irish nationals remain a small minority within ICE detention,Irish government figuresshow a 330% increase last year in the number of its citizens seeking consular assistance related to deportation by US immigration enforcement, to 65.\n\nIrish Minister for Foreign Affairs Helen McEnteetold reportersTuesday that she is aware of less than a dozen similar cases of Irish citizens being detained at the present.\n\nHis case also lays bare a US immigration system that routinely subjects migrants to prolonged detention underharsh conditions– one that human rights organizations say overwhelmingly ensnares Black and brown people far from the public spotlight.\n\nImmigration advocacy groups have said there are longstanding racial disparities in US immigration enforcement that result in mistreatment of migrants from Latin America, the Caribbean and African countries.\n\nICE is currently holding around 70,000 people in custody, the highest number since the agency’s founding and significantly above typical levels in prior administrations. The vast majority of those detainees – 74%– have no criminal conviction, according to the most recent data.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/08/24/us/immigration-disappearing-migrants-ice-cec-vis",
      "text": "held by US authorities"
    },
    {
      "url": "https://www.rte.ie/news/ireland/2026/0209/1557514-seamus-culleton-us/",
      "text": "told Irish broadcaster RTE"
    },
    {
      "url": "https://x.com/christinafinn8/status/2021152063955034620?s=20",
      "text": "told reporters"
    },
    {
      "url": "https://www.oireachtas.ie/en/debates/question/2026-02-05/57/",
      "text": "Irish government figures"
    },
    {
      "url": "https://www.rte.ie/video/id/30670/",
      "text": "told reporters"
    },
    {
      "url": "https://www.cnn.com/2025/12/09/politics/migrant-families-ice-detention-facility-texas",
      "text": "harsh conditions"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/us/ice-detain-irish-man-five-months-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/10/us/ice-detain-irish-man-five-months-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f10823a5206f05f379f0025f5e2aa73d8018f4a55f1b5fb3adea6aed2afde141",
  "scraped_at": "2026-02-11T16:32:31.877550+00:00"
}