{
  "url": "https://lite.cnn.com/2026/02/21/europe/russia-putin-ukraine-war-intl",
  "title": "Four years on, Russia is still paying for a fatal miscalculation in Ukraine | CNN",
  "date": "2026-02-22T07:09:51.101521+00:00",
  "authors": [
    "Matthew Chance",
    "Chief Global Affairs Correspondent",
    "CNN"
  ],
  "text": "Source: CNN\n\nIn the early hours of February 24 2022, standing on the freezing roof of a hotel in Kyiv, the idea that Russia would launch a full-scale assault onUkraine, despite a troop buildup on the border, still seemed almost impossible to imagine.\n\nYes,Vladimir Putin, the Kremlin strongman, had developed a taste for wielding Russia’s hard power. Putin’s wars in Chechnya, Georgia and Syria, as well as military action in Crimea and eastern Ukraine, had delivered him success at a relatively low cost.\n\nBut invading the second biggest country in Europe, after Russia itself, would be a potentially catastrophic prospect which would, surely, give a cold strategist like Putin pause for thought.\n\nApparently not, I remember thinking, as I grappled with my flak jacket while missiles rained down on the Ukrainian capital.\n\nThe past four years of conflict have exposed more than one faulty assumption, not least the previously widespread belief even among Kyiv’s allies that Ukraine would be too weak, too disorganized, to resist a full-scale invasion.\n\nLikewise, the reputation of invincibility surrounding Russia’s vast military has also been dented.\n\nAccording to research by one think tank, The Royal United Services Institute (RUSI), when the Kremlin launched what it dubbed its “Special Military Operation,” it expected its forces to take control of Ukraine within just 10 days.\n\nMore than 1450 days later, that timeframe looks hopelessly naïve and has proved to have been a fundamental miscalculation that has taken a devastating toll in pain, destruction and bloodshed.\n\nThe true cost is, of course, carefully suppressed in a Russia where information is under increasingly tight control. Official casualty figures are kept strictly out of the public gaze, although estimates from multiple sources indicate losses that are eye-wateringly high.\n\nLatest research from the US-based Center for Strategic and International Studies (CSIS), for example, puts the number at nearly 1.2 million Russian dead and injured since the full-scale invasion was launched.\n\nThat appalling body count – which does not, of course, include the staggering Ukrainian toll, thought to be between 500,000 and 600,000 people – is higher than all casualties suffered by “any major power in any war since World War II”, the CSIS report says.\n\nOf that estimate, as many as 325,000 Russians, the report adds, have been killed in the past four years – for some context, that’s triple the combined losses inflicted on US forces in every war Washington has fought since 1945, including on the battlefields of Korea, Vietnam, Afghanistan and Iraq.\n\nAnd as the Ukraine conflict enters a fifth year, the military bloodbath – as President Donald Trump frequently points out – is only getting worse, climbing steadily upwards as every month passes.\n\nAgain, the Kremlin has not confirmed the figures, but Ukrainian officials recently boasted of killing 35,000 Russian troops in December alone. The stated aim of military planners in Kyiv is now to kill Russian soldiers faster than new recruits – who are for the moment mainly volunteers – can be trained and sent into battle.\n\n“If we reach 50,000, we will see what happens to the enemy. They view people as a resource and shortages are already evident,” Ukraine’s defense minister, Mykhailo Fedorov, told journalists at a recent news conference.\n\nIn more ways than one, this war has mutated into an ugly numbers game.\n\nWhenever I visit Moscow, a city so many friends and colleagues have now left, or been excluded from, it’s striking how distant the brutal war in Ukraine seems.\n\nOn the surface, at least, the glitzy Russian capital, with its shops and cafes and traffic jams, is well-insulated against the horrors of the frontlines, save the occasional interception of Ukrainian drones, about which few Muscovites, frankly, spare a passing thought.\n\nFollowing a brief sanctions shock after the 2022 invasion, Russian military spending surged, and its economy boomed.\n\nFueled by oil and gas exports, Russia defied Western predictions of economic collapse, instead becoming the 9th-biggest economy in the world in 2025, according to the International Monetary Fund, ahead of Canada and Brazil. That’s up from 11th place before the war in Ukraine began.\n\nBut there are growing signs of creeping financial pain, linked to a distorted war economy.\n\nOne problem is the increasingly expensive practice of offering large signing bonuses to Russians who agree to join the military, plus even bigger payouts if they are killed in action.\n\nIn addition, military recruitment and the prioritizing of military industrial production have led to what one Russian pro-Kremlin newspaper, Nezavisimaya Gazeta, has called a “severe labor shortage” in other essential industries.\n\n“The economy does not have enough machine operators or assembly workers. We need to find 800,000 blue-collar workers from somewhere,” the paper reported.\n\nThe spiraling cost of foodstuffs has been an increasing focus of consumer pain, with cucumbers becoming the most recent lightning rod for popular discontent.\n\nOfficial statistics show cucumber prices have doubled since December, while some shops are reported to be selling them at an even greater mark-up – wartime prices for a salad staple, as the Russian economy slows.\n\n“The prices for cucumbers and tomatoes are outrageous. Once, they said eggs were ‘golden’. Now it’s cucumbers,” a woman who called herself Svetlana posted online in one rare public rebuke of the authorities.\n\nElsewhere, stories of economic gloom – from galloping inflation to restaurant closures and the knock-on impact of severe tax increases – describe the many ways in which the prolonged war in Ukraine is now hitting Russians hard in the pocket at home.\n\nNeither has the war been much of a boon for the Kremlin abroad.\n\nStopping a further expansion of NATO was one of the main reasons Russian officials said the invasion in Ukraine was launched in the first place.\n\nThe fact that Sweden and Finland joined the alliance as a direct result of the full-scale invasion is a clear failure of that aim, Finland’s accession alone more than doubling the land border between Russia and NATO states.\n\nWhat’s more, Western sanctions and political isolation have forced Russia to pivot east, especially to China, on which it is now increasingly reliant for essential trade, from energy exports to imports of cars and electronics, all giving Beijing a whip hand over Moscow.\n\n“The relationship is unbalanced because Moscow is more dependent on Beijing than Beijing is on Moscow,” commented a recent report from the Center for European Policy Analysis (CEPA).\n\n“Russia has clearly become the junior partner, primarily due to its limited economic alternatives,” the CEPA report added.\n\nMoscow has also seemed unable to prevent the erosion of its traditional influence elsewhere.\n\nIn 2024, the Kremlin was forced to evacuate and grant asylum to its Syrian ally, Bashar al-Assad, as he was toppled by rebel forces. The new president of Syria, where Russia still has two military bases, has repeatedly called for Assad to be extradited from Moscow.\n\nLast summer, Russia stood by powerlessly as US and Israeli war planes struck Iran, another key Russian Kremlin partner in the Middle East,  targeting its nuclear facilities.\n\nIt was also unable to protect the Venezuelan president, Nicolás Maduro, a figure with close Kremlin ties, from being seized in a raid by US troops last month from his bedroom in Caracas.\n\nIt may be that Russia would never have been able to prevent these events from unfolding, even if it were not already stretched and bogged down in Ukraine.\n\nBut after four years of grinding war, that has taken a horrific toll on Ukraine, Russia has been left depleted at home and diminished on the international stage.\n\nBack on that hotel rooftop in Kyiv in February 2022, I was wrong – along with many others – about the likelihood of Putin ordering a full-scale invasion of Ukraine.\n\nBut we were unfortunately right about the catastrophic consequences of doing so – for Ukrainians, of course, and for Russians too – it was a prediction that has unfortunately proved all too accurate.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/20/world/zelensky-ukraine-war-last-four-years-intl",
      "text": "Ukraine"
    },
    {
      "url": "https://www.cnn.com/world/europe/vladimir-putin-fast-facts",
      "text": "Vladimir Putin"
    },
    {
      "url": "https://www.cnn.com/2026/02/21/europe/russia-putin-ukraine-war-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/21/europe/russia-putin-ukraine-war-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f15df3536d18978a115fac14afcf835b291b6b025166eb17471b232616dbd5e4",
  "scraped_at": "2026-02-22T07:09:51.101535+00:00"
}
