{
  "url": "https://lite.cnn.com/2026/02/13/politics/afghan-refugee-ice-deportation-veteran",
  "title": "His family fled Afghanistan facing threats for supporting US troops. Now he sits in ICE custody at risk of being sent back | CNN Politics",
  "date": "2026-02-15T07:12:47.421482+00:00",
  "authors": [],
  "text": "Source: CNN\n\nWhen Said Noor, a US Army veteran, picked up a phone call on December 2, he immediately knew something was wrong.\n\nHis brother Lal was in Laredo, Texas, several hours south of their home in Austin, nervously explaining that the commercial truck he drove had been stopped at a Customs and Border Protection checkpoint.\n\nWhen the agents asked if he was a US citizen, Lal, 28, answered honestly: He isn’t. He, his mother and five of his brothers and sisters had fled Afghanistan in the wake of the US’ military withdrawal, and he is currently awaiting a decision on an asylum claim he submitted years ago.\n\nAs Said stayed on the line with his younger brother, Said could hear someone aggressively demanding to know who Lal had called and why. Said told Lal to provide whatever the officials needed so he could go, but his brother sounded worried, so Said told him to pass the phone to the agent.\n\nHe tried to calm the agent down, he told CNN.\n\n“I told him ‘sir, let’s just talk to each other as adults, right?’ I was like, ‘you’re an officer and you took an oath to defend the Constitution.’ I said, ‘I have done the same thing, I was in the Army, I’m a veteran right now,’” he said.\n\nThat seemed to defuse the situation somewhat, Said recalled, but the man kept repeating that Lal is “not allowed to be here” in the US. Said tried to explain that Lal, who is married to a US citizen, was brought to the US legally through the US military’s evacuation of Afghanistan, an effort largely aimed at protecting families like his who had worked with American troops and faced threats from the Taliban. He tried to explain Lal’s pending asylum case, the legal process through which Lal was trying to gain permanent status in the US along with 80,000 other Afghan nationals who fled the country and have similarly looked to create new homes in America.\n\nBut soon the phone was handed to a second agent. He was told that they were working to verify Lal’s status.\n\nAfghan asylum cases had received bipartisan support until a sharp shift in tone after an Afghan refugee shot two members of the National Guard in Washington, DC in November days before Lal was stopped at the checkpoint.\n\nHours passed, with Said continuing to communicate with his brother while the agents waited for a response from the Department of Homeland Security. But then the communication stopped. Said could still see Lal’s location on the app Life360, but he couldn’t get in touch with him, and when he called a nearby border patrol station, no one seemed to be able to find him.\n\nFor two days, Said told CNN he couldn’t find his brother — he called several border checkpoints but found himself trapped in a cycle of transferred calls.\n\nOne officer even told Said to call the Afghan embassy; when he explained there was no Afghan embassy in the US because the Taliban was in control of the country, the officer said to call the Taliban, the same group that Said told CNN had detonated a bomb just outside of his family’s home in 2020, killing several people, in retaliation for his work with US troops.\n\nFinally, Said found Lal – he was being held at the Immigration and Customs Enforcement-run Webb County Detention Facility.\n\n“I came to America a legal way,” Lal told CNN from the detention facility in Laredo during a December interview, saying he and his family just want the chance to “live a good life.”\n\nDepartment of Homeland Security spokesperson Tricia McLaughlin confirmed Lal was detained on December 1, after he’d been referred for secondary inspection at a border patrol point of entry. McLaughlin called Lal a “criminal illegal alien” whose “criminal history includes previous arrests for assault and damage to property.”\n\nCourt documents shared by Lal’s family, however, show that a charge of “criminal mischief” against Lal, brought in 2023, was dismissed by a judge in Galveston, Texas, resulting in no conviction or finding of guilt. Said told CNN the incident revolved around an allegation that Lal had broken another person’s phone, which Lal denied. The charge was dismissed due to there being no witnesses, the motion to dismiss said, and the family said that it was Lal’s only run in with law enforcement.\n\nMcLaughlin also said Lal was told to pull over in December because his work authorization had expired, but Said explained that he had already applied for a renewal. Lal was issued a commercial driver’s license in Texas in August 2025, which expires in 2034.\n\nMcLaughlin did not respond to follow-up questions regarding the dismissed charge or his work authorization renewal.\n\nWhile Lal expected to have his final court hearing on February 12, a request by his lawyer to delay the hearing was granted as they seek to resolve the issue outside of court. Without an agreement, Lal will find out on March 10 if he is being deported back to the country he’d fled with his family nearly five years ago.\n\nLal and his family are among thousands of Afghans who were brought to the US as the country fell to Taliban rule in August 2021. The panic to flee materialized ina chaotic, frantic period of daysas men, women, and children begged US and allied military partners to get them on a plane — any plane — out of the country. Children were handed over barbed wire at Hamid Karzai International Airport to US troops in desperate attempts to get them to safety.\n\nThe monumental task of getting civilians out of the country — primarily focused on Afghans who worked with the US government and military, and their immediate family members — resulted in the evacuation of more than 124,000 people, the Air Force later said. Dubbed Operation Allies Refuge, it was the largest non-combatant evacuation in US history.\n\nLal’s family was evacuated ina daring rescueorganized by service members on the ground in coordination with Democrat Rep. Seth Moulton, a Marine veteran who traveled to Afghanistan with Republican Rep. Peter Meijer amid the withdrawal.\n\nLike many, the family was facing particular danger given Said’s work with the US military as a civilian interpreter and later service as a soldier. Said moved to the US in 2014, joined the US Army in 2016, and was honorably discharged in August 2020.\n\nAt the time of the US evacuation, and for several years afterwards, there was strong bipartisan support for providing refugee status for Afghan families that had aided the US during the twenty years of operations in that country.\n\nIn 2022, now-Ambassador to the United Nations Mike Waltzcriticized the Biden administrationfor “abandoning” Afghan allies and called for officials to be held accountable for the “unkept promises of security for their safety.” Republican Sen. Tom Cotton, an Army veteran,called onformer President Joe Biden to keep troops in Afghanistan “until we have rescued every American citizen and those Afghans who risked their lives for American troops.” In August 2021, abipartisan group of 55 senatorsurged Biden in a letter to expedite the evacuation of Afghan Special Immigrant Visa recipients and their families.\n\nBut that support has faded, especially in the wake of a November shooting of two National Guard members in Washington, DC. One soldier, Spc. Sarah Beckstrom, died. The suspect was identified as a 29-year-old Afghan man who came to the US in the wake of the US withdrawal from Afghanistan, further fueling criticism from Trump administration officials about vetting of refugees.\n\nCNNpreviously reportedthat the man, Rahmanullah Lakanwal, underwent numerous rounds of vetting starting in 2011 as he worked with US military and intelligence agencies. He was ultimately approved for permanent asylum by the Trump administration last year.\n\nIn the wake of the shooting, the Trump administration announced thatthe processing of all immigration casesfor Afghan immigrants was being “stopped indefinitely” pending further review.\n\nPresident Donald Trump said at the time that he planned to pause asylum applications for “a long time.”\n\n“We don’t want those people,” Trump said aboard Air Force One.\n\nIn the wake of November’s shooting, detentions and efforts against Afghan immigrants have “definitely ramped up,” Jordan Weinberg, Lal’s attorney at Atlas Immigration Law, told CNN.\n\n“We are seeing a much higher difficulty for Afghans,” Weinberg said.\n\nAfter the attack, US Citizenship and Immigration Servicesannouncedit would be undertaking a “full scale, rigorous reexamination” of green cards issued to people from 19 countries “of concern,” including Afghanistan.\n\nMcLaughlin previouslysaid in a statementthat DHS was “indefinitely” stopping the processing of all immigration requests related to Afghan nationals “pending further review,” including asylum cases approved under the Biden administration.\n\nMcLaughlin told CNN this week that Operation Allies Welcome and Operation Allies Refuge “let thousands of unvetted Afghan nationals including terrorists, sexual predators, pedophiles, domestic abusers, and kidnappers into our country.”\n\n“Under Secretary (Kristi) Noem, DHS has been going full throttle on identifying and arresting known or suspected terrorists and criminal illegal aliens that came in through Biden’s fraudulent parole programs and working to get the criminals and public safety threats OUT of our country,” McLaughlin said.\n\nThe year before he helped his family flee, Said was visiting them at their family home in Khost Province in Afghanistan. He’d just left the US Army as a sergeant, deciding to depart the service because he was not authorized to travel to Afghanistan as an off-duty US soldier, he said, and he wanted to help them with their immigration paperwork.\n\nFor years, even before Said moved to the US and joined the military, his family had been targeted by the Taliban, he said. His work with the US as a civilian interpreter had not gone unnoticed by the militant group, and he’d hoped to bring his family to the safety of the US.\n\nHe’d been home in Afghanistan for roughly a week when his family held a gathering at their home, giving him a chance to talk to friends and family he hadn’t been able to see in years: school friends, cousins, other distant relatives and neighbors that he’d missed after moving to the US.\n\nSaid recalled noticing a motorcycle outside the door to his family’s home; he and others assumed it belonged to one of the guests. Said was walking some friends out the front door when the motorcycle detonated.\n\nDust was everywhere, making it difficult to breath, Said and Lal recalled. Windows were shattered, injured survivors were calling out for help, and the dead bodies of friends torn apart by the blast were now strewn across the ground.\n\nLal had been on the roof of the house. The blast “literally picked him up and threw him onto the ground,” Said said. The family thought he’d been killed. When Lal regained consciousness, he thought he was dreaming, he told CNN from the detention facility in Texas, until he saw the dead.\n\n“I can’t sleep, I get nightmares when I’m sleeping,” he told CNN, his voice cracking. “The people there, they died in front of me, in our home.”\n\nLal’s asylum claim paperwork, submitted in 2022, says six people were killed and more than a dozen others injured. The Taliban ultimately claimed responsibility, Said told CNN.\n\nThe family had been targeted because of his service, Said believes, both for helping the American forces while he was a civilian in Afghanistan and later when he put on the US Army uniform.\n\n“There’s no future for them, no safety. There’s no mercy at all from the Taliban,” Said said of the threats against his family. “Lal’s fear is not based on imagination; his fear is based on memories.”\n\nLal and Said’s father and brother-in-law have faced detention by the Taliban in recent years, both brothers told CNN, weighing heavily on their mother who is now in the US.\n\nSaid  felt strongly about supporting the US, he said, feeling that America “believed in human rights,” and that he would do “whatever it takes” to help the Americans prevail.\n\nOfficial military records show Said joined the US military in October 2016 and served as an interpreter, deploying back to Afghanistan as a soldier for eight months in 2018. While deployed there, Said worked with senior military officers and even worked with local media, he recalled — a job that made him recognizable to the Taliban. He attended senior-level meetings alongside US officials as a translator, and appeared in photos with senior Afghan and US officials, including now-retired Gen. Austin “Scott” Miller, the last senior commander overseeing US and NATO forces in Afghanistan.\n\nLal and Said have a brother currently serving in the US Army and a younger sister who wants to join the US Air Force, Said said. He describes theirs as a US military family who care deeply about service and simply wanted a safer life for themselves.\n\n“We believed in this country, right?” Said told CNN. “I risked my life for this country. I never imagined that I would be begging one day just to keep my brother alive, here in America, while he hasn’t done anything wrong.”\n\nOn the official DHS document provided to Lal, outlining the reason for his detention and saying he is subject to removal from the US, the allegations listed say only that he is not a citizen of the US and that he was paroled into the US after arriving through Operation Allies Refuge.\n\n“You are immigrant not in possession of a valid immigrant visa, reentry permit, border crossing identification card, or other valid entry document as required by the Immigration and Nationality Act,” the document says.\n\nLal’s detention happened just days after the November shooting, as the Trump administration was rapidly closing doors for Afghan refugees — and refugees from several other countries — to find ways to stay in the US.\n\nIn 2025, the Trump administrationrevoked 85,000 visasof all categories as part of a broader attempt to limit who can come to the US. Last month, the administration institutedan indefinite suspensionof immigrant visa processing for people from 75 countries, including Afghanistan. Lawmakers have also fiercely debated the topic of visas for Afghans, and just this month Congress declined to authorize any additional special immigrants visas for Afghans who worked with the US.\n\nTop White House aide Stephen Miller railed against asylum seekers at the southern border ina post on Xearlier this month, saying there is a “multibillion dollar fraudulent industry” to file “fake asylum applications.”\n\n“Federal law requires illegal aliens to be detained pending a hearing for their (fake) asylum claim,” Miller said.\n\nHeather Hogan, policy and practice counsel at American Immigration Lawyers Association, said Miller’s assertion that it is required to detain immigrants awaiting their asylum claim is “definitely not accurate.”\n\n“In the past, asylum seekers were largely left to pursue their cases and work and live, and their kids could go to school while they were going through the motions of their cases because what is the utility of detaining them?” Hogan said. “When they could otherwise be and want to be working and participating in their communities and providing for their families and themselves?”\n\nHogan also said lawyers with AILA have reported seeing a more “aggressive” stance from the government toward Afghans in particular, including those who previously worked with the US government in Afghanistan.\n\nPeople who worked with the US and are still in Afghanistan have faced revenge killings by the Taliban, according to human rights groups.Amnesty International, for example, reported Taliban officials beating, killing or disappearing Afghans who worked with the former government or served in the Afghan National Security Forces. In the weeks after the US’ withdrawal, Human Rights Watchalso reportedthe killing or disappearance of at least 47 former members of the ANSF.\n\nLal has already gone to extraordinary lengths for a chance at a new life in the US.\n\nHe and his sisterwere shepherding her five young childrento the gates of the Kabul airport, part of the desperate crowd attempting to flee, when a suicide bomber attacked Abbey Gate, killing 13 US troops and roughly 170 Afghan civilians.\n\nSaid recalled speaking to his brother right after the attack, asking him if he was sure he still wanted to try to escape with their family, knowing what danger they could face.\n\n“Lal clearly said, ‘Yes, (it would be) better to die here than be in the hands of the Taliban,’” Said told CNN. “Just think about it — you saw people die in front of you, but you still want to take that risk for your entire family to get into the base, to come to the United States. Lal did not want to give up.”\n\nThis story has been updated.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2021/08/16/middleeast/kabul-afghanistan-withdrawal-taliban-intl",
      "text": "a chaotic, frantic period of days"
    },
    {
      "url": "https://www.cnn.com/2022/02/05/politics/afghan-refugees-us",
      "text": "a daring rescue"
    },
    {
      "url": "https://www.cnn.com/2025/01/27/politics/afghans-lose-access-to-critical-resources-trump",
      "text": "criticized the Biden administration"
    },
    {
      "url": "https://www.cotton.senate.gov/news/press-releases/cotton-statement-on-august-31st-deadline-for-afghanistan-withdrawal",
      "text": "called on"
    },
    {
      "url": "https://www.shaheen.senate.gov/imo/media/doc/2021-08-19%20-%20SIV%20Evacuation%20and%20Implementation%20Letter%20(2).pdf",
      "text": "bipartisan group of 55 senators"
    },
    {
      "url": "https://www.cnn.com/2025/11/28/politics/afghan-vetting-process-scrutiny",
      "text": "previously reported"
    },
    {
      "url": "https://www.cnn.com/us/live-news/shooting-washington-dc-national-guard-11-26-25?post-id=cmigvet790005356qltq2bixx",
      "text": "the processing of all immigration cases"
    },
    {
      "url": "https://www.cnn.com/2025/11/27/politics/us-reexamining-green-card-holders-19-countries",
      "text": "announced"
    },
    {
      "url": "https://www.cnn.com/2025/11/27/politics/us-reexamining-green-card-holders-19-countries",
      "text": "said in a statement"
    },
    {
      "url": "https://www.cnn.com/2025/12/08/politics/visa-revocations-state-department",
      "text": "revoked 85,000 visas"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/politics/us-suspending-immigrant-visa-processing-75-countries",
      "text": "an indefinite suspension"
    },
    {
      "url": "https://x.com/StephenM/status/2018170822762823946?s=20",
      "text": "a post on X"
    },
    {
      "url": "https://www.amnesty.org/en/latest/news/2022/08/afghanistan-one-year-of-the-talibans-broken-promises-draconian-restrictions-and-violence/",
      "text": "Amnesty International"
    },
    {
      "url": "https://www.hrw.org/news/2021/11/30/afghanistan-taliban-kill-disappear-ex-officials",
      "text": "also reported"
    },
    {
      "url": "https://www.cnn.com/2022/02/05/politics/afghan-refugees-us",
      "text": "were shepherding her five young children"
    },
    {
      "url": "https://www.cnn.com/2026/02/13/politics/afghan-refugee-ice-deportation-veteran",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/13/politics/afghan-refugee-ice-deportation-veteran",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f1ab72cd5daa377284ac4de13c652121f5577913a912a73cbae700da490b9327",
  "scraped_at": "2026-02-15T07:12:47.421495+00:00"
}