{
  "url": "https://lite.cnn.com/2026/02/18/weather/ranger-road-wildfire-wind-forecast-climate",
  "title": "Ranger Road megafire spans Oklahoma and Kansas with more dangerous weather to come | CNN",
  "date": "2026-02-20T07:27:43.378383+00:00",
  "authors": [
    "CNN Meteorologists Mary Gilbert",
    "Briana Waxman",
    "CNN's Amanda Musa"
  ],
  "text": "Source: CNN\n\nDangerous fire weather conditions are impacting the Plains for a fourth consecutive day Friday as firefighters deal with more than a dozen wildfires that have torched tens of thousands of acres andforced evacuations in the region.\n\nThe Ranger Roadmegafireis the largest. It exploded in size and has burned more than 283,000 acres in Oklahoma and Kansas since starting early Tuesday afternoon. That’s nearly twice the size of Chicago.\n\nIts first bout of extreme growth happened in just eight hours Tuesday, during which the fire on average consumed an area equal to three to four football fields every second. The blaze then nearly doubled in size on Wednesday. It’s at 20% containment as of Thursday evening, according to theOklahoma Forestry Service.\n\nThe Ranger Road Fire started in Beaver County, Oklahoma, then spread for about 60 miles to reach southern Kansas. It forced the evacuations of thousands of people in Englewood and Ashland, Kansas, on Tuesday, according to CNN affiliateKAKE.\n\nBeaver County EMS told CNN on Wednesday “there have been homes and buildings lost to the fires,” but could not confirm how extensive the damage is yet because it is still actively fighting fires. No lives have been lost and that has been confirmed.”\n\nAt leastfour firefighters were injuredin Beaver County and taken to local hospitals, according to a Tuesday news release from Oklahoma’s Department of Emergency Management. Another four firefighters were injured Tuesday in Kansas, a Kansas Adjutant General’s Department spokesperson told CNN on Wednesday.\n\nAnother wildfire that broke out in Woodward, Oklahoma — a city of about 12,000 residents in northwestern part of the state — forced several thousand people to evacuate, emergency manager Matt Lehenbauer told CNN affiliate KOCO. Most evacuation orderswere liftedby late Tuesday.\n\nThe fire destroyed a few structures in Woodward, the state emergency management department said. It also prompted evacuations at Northwestern Oklahoma State University’s Woodward campus.\n\nIn Texas County, Oklahoma, separate fires have destroyed multiple structures and prompted evacuations in the panhandle town of Tyrone, according to the emergency management release. Heavy smoke caused a multi-vehicle crash on Highway 54 near Tyrone, according to Guymon Fire Department Chief Grant Wadley, who is overseeing the response.\n\nOklahoma Gov. Kevin Stitt declareda disaster emergencyfor Beaver, Texas and Woodward counties on Wednesday to activate state emergency management resources.\n\n“The Woodward fires are about 20% contained, and we were very fortunate to keep most neighborhoods safe. A few homes were lost,” Stitt said in anews releaseWednesday.\n\nMultiple fires have also burned thousands of acres in the Plains and Rockies since Tuesday, including two in the Texas Panhandle called the Lavender and 8-Ball fires.\n\nAs ofThursday evening, the Lavender Fire was an estimated 18,300 acres and 40% contained, according to the Texas A&M Forest Service.\n\nMore than 750,000 people in the Plains sawLevel 3 of 3 extremely critical fire weatherconditions on Tuesday. Friday’s Level 2 of 3 critical fire threat shifts westward to eastern New Mexico and west Texas.\n\nDry air and gusty winds continue to challenge fire crews on Friday, especially in the southern Rockies and Plains. Windy conditions will spur fire growth — especially in New Mexico and Texas — through tinder-dry fuels like grasses.\n\nPast wildfires sparked in similar conditions have been devastating:2024’s Smokehouse Creek Firein the Texas Panhandle, the state’s largest wildfire, burned through more than 500 structures.\n\nThis dangerous setup has been brewing all winter. Nearly 200 locations across the West, Rockies and portions of the Plains are experiencing their warmest winter to date, according todata from NOAA. This includes where the worst fires are burning this week in Kansas, Oklahoma and Texas.\n\nThe persistent heat coupled with less precipitation than normal has created dry to drought-stricken soils in the region and crispy fuels. It’s a situation that will likely only becomemore common as the world warmsdue to fossil fuel pollution.\n\nTuesday’s high winds made travel hazardous. In Colorado, at least five people were killed in a pileup amid “brown out” conditions, the state patrol said.\n\nThe pileup on Interstate 25 south of Pueblo, Colorado, involved over 30 vehicles and occurred after winds gusted up to 61 mph.\n\n“Visibility was next to nothing,” Colorado State Police Maj. Brian Lyons said.\n\nAt least 29 people were taken to the hospital with injuries, and one person later died from their injuries, according to the state patrol.\n\nIn Thomas County, Kansas, that day, a person was killed in a vehicle crash after the same winds caused a dust storm, state officials told CNN.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/weather/fire-oklahoma-texas-kansas-colorado-climate",
      "text": "forced evacuations in the region."
    },
    {
      "url": "https://www.cnn.com/2025/08/01/weather/grand-canyon-dragon-bravo-fire-climate",
      "text": "megafire"
    },
    {
      "url": "https://www.facebook.com/OklahomaForestry/posts/pfbid02W1fRPE8jSQUap1jWW9ZpGmkiYQhEQNU7CVcAzgL5tVVcpSgseBZMtwxYN3YKNad4l",
      "text": "Oklahoma Forestry Service"
    },
    {
      "url": "https://www.kake.com/home/live-updates-ashland-being-evacuated-as-large-wildfire-crosses-into-kansas/article_143ef2c7-bd1e-4001-8f8e-272c138785c0.html",
      "text": "KAKE"
    },
    {
      "url": "https://oklahoma.gov/oem/news/newsroom/wildfire-situation-update-1---february-17--2026.html",
      "text": "four firefighters were injured"
    },
    {
      "url": "https://www.facebook.com/woodwardpolicedepartment/posts/pfbid0M8X8ATwykWa9fd9ZjoXX1Hw9tDGnwTtRUNf2fMB4dwi8gsJaiMhrGvBq9gDE9BHRl?rdid=6wq41JgvItAm2GNX",
      "text": "were lifted"
    },
    {
      "url": "https://www.sos.ok.gov/documents/executive/2170.pdf",
      "text": "a disaster emergency"
    },
    {
      "url": "https://oklahoma.gov/governor/newsroom/newsroom/2026/governor-declares-state-of-emergency.html",
      "text": "news release"
    },
    {
      "url": "https://x.com/AllHazardsTFS/status/2024636370497548718?s=20",
      "text": "Thursday evening"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/weather/fire-oklahoma-texas-kansas-colorado-climate",
      "text": "Level 3 of 3 extremely critical fire weather"
    },
    {
      "url": "https://www.cnn.com/2024/03/01/us/texas-panhandle-smokehouse-creek-fire-oklahoma-friday",
      "text": "2024’s Smokehouse Creek Fire"
    },
    {
      "url": "https://sercc.oasis.unc.edu/Map.php?region=us",
      "text": "data from NOAA"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/climate/snow-drought-west-water-colorado-river",
      "text": "more common as the world warms"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/weather/ranger-road-wildfire-wind-forecast-climate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/weather/ranger-road-wildfire-wind-forecast-climate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f1da2d98a19a47b91049e90d605e35fe6251243fa62b4c614a62351d1ac6431d",
  "scraped_at": "2026-02-20T07:27:43.378397+00:00"
}