{
  "url": "https://lite.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
  "title": "The Epstein files are rocking Britain from the palace to Parliament | CNN",
  "date": "2026-02-18T07:32:37.192672+00:00",
  "authors": [
    "Christian Edwards, CNN"
  ],
  "text": "Source: CNN\n\nThe US government’s release of more than3 million documentsrelated to Jeffrey Epstein has raised further questions about the ties of three prominent figures in British public life to the disgraced financier, who appears to have been granted access to the heart of Britain’s government and royal family.\n\nThe formerPrince Andrew, his ex-wife Sarah Ferguson and Peter Mandelson, the former British ambassador to the United States, are all listed multiple times in the latest trove of Epstein files, ramping up pressure on the trio to explain their ties to the late sex offender and further distance themselves from British institutions.\n\nBritish Prime Minister Keir Starmer has urged the former prince, now Andrew Mountbatten-Windsor, to testify before the US Congress, while Mandelson, who resigned from the Labour Party on Sunday, is set to quit the House of Lords on Wednesday.\n\nHere’s how the US Justice Department’s latest drop of files is scandalizing Britain.\n\nThe former Prince Andrew has for years attempted tobat awayquestions about his links to Epstein. In a now-infamous interview with the BBC in 2019, Mountbatten-Windsor claimed that he had severed all ties with Epstein in 2010, following the financier’s 2008 conviction for soliciting prostitution from an underage girl.\n\nEmails uncovered last year called Mountbatten-Windsor’s claim into question. The British media reported that Mountbatten-Windsor appeared to contact Epstein again in 2011, telling him to “keep in close touch” and that they were “in this together.” Soon after, King Charles III stripped Mountbatten-Windsor, his brother, of his royal titles in October and began the process to evict him from the royal estate at Windsor.\n\nBut the latest trove of Epstein files has heaped further scrutiny on the disgraced royal. Three undated photos appear to show the former prince kneeling over what appears to be a woman or girl who is lying fully clothed and supine on the floor. Her face has been redacted. In two photos, Mountbatten-Windsor touches her stomach and waist; in a third, he looks at the camera while on all fours, leaning over her body.\n\nIt is unclear when or where the images were taken; no captions or context for the photographs were provided with the document release. Neither the photographs nor the email messages suggest any wrongdoing.\n\nMountbatten-Windsor previously faced pressure to explain a 2001 photograph that showed him standing with Ghislaine Maxwell, then Epstein’s girlfriend and now a convicted child sex trafficker, and Virginia Giuffre, a prominent accuser of Epstein who died by suicide in April.\n\nIn her posthumous memoir, Giuffre once again accused Mountbatten-Windsor of sexually abusing her when she was 17. She wrote that Mountbatten-Windsor “believed that having sex with me was his birthright.” Despite claiming never to have met her, Mountbatten-Windsor reportedly paid millions of dollars to Giuffre in 2022 to settle a civil case she brought against him. He has repeatedly denied all allegations of wrongdoing and said he never witnessed or suspected any of the behavior that Epstein was accused of.\n\nThe latest Epstein documents also contain an emailexchangebetween Epstein and Mountbatten-Windsor in August 2010, in which the financier invites the royal to meet a “friend” — whose name was redacted — for dinner in London. Mountbatten-Windsor replied that he would be “delighted to see her” and told Epstein to pass on his contact details. Epstein then describes the woman as a 26-year-old Russian who is “clevere (sic) beautiful, trustworthy,” and confirms that she has Mountbatten-Windsor’s email.\n\nThames Valley Police said Tuesday that they are aware of “reports about a woman said to have been taken to an address in Windsor in 2010 for sexual purposes,” and that they are assessing the information. It is unclear if police are referring to the same woman referenced in the email exchange.\n\n“We take any reports of sexual crimes extremely seriously and encourage anyone with information to come forward,” police said. “At this time, these allegations have not been reported to Thames Valley Police by either the lawyer or their client.”\n\nIn November, Democrats on the House Oversight Committee requested that Mountbatten-Windsor come to Washington to give evidence as part of the panel’s investigation into Epstein. Although Mountbatten-Windsor did not respond to the request at the time, Starmer on Saturday urged the former prince to submit himself to questioning.\n\n“Anybody who has got information should be prepared to share that information in whatever form they are asked to do that,” Starmer said. “You can’t be victim-centered if you’re not prepared to do that.”\n\nThe royal family has not issued a statement on the latest revelations. At a summit in Dubai on Tuesday, Prince Edward, the brother of Charles and Mountbatten-Windsor, told CNN, “It’s all really important always to remember the victims.” He did not comment further.\n\nMountbatten-Windsor’s ex-wife Sarah Ferguson, known as “Fergie,” is also mentioned several times in the latest tranche of files, although this does not indicate any wrongdoing. Ferguson was dropped last year as the patron or ambassador to several British charities after earlier documents showed she had called Epstein her “supreme friend.” At the time, a spokesperson for Ferguson said she regretted her association with Epstein.\n\nBut the latest documents are further evidence of the depth of their relationship. In August 2009, Ferguson, then the Duchess of York,sentan email thanking Epstein, touting fashion and media outlets that she said now wanted to work with her.\n\n“In just one week, after your lunch, it seems the energy has lifted. I have never been more touched by a friends (sic) kindness,” she wrote. “Thank you Jeffrey for being the brother I have always wished for.”\n\nIn January 2010, shewrote: “You are a legend. I really don’t have the words to describe, my love, gratitude for your generosity and kindness. Xx I am at your service. Just marry me.”\n\nThe emails also appear to suggest that Epstein wanted to use Ferguson to help clear his name. In one undatedemail, Epstein wrote to Mike Sitrick, chair of the crisis management firm Sitrick and Company, which was retained by Epstein’s law firm. “I would like you to draft a statement that in an ideal world fergie would put out,” he wrote. Sitrick told CNN that he had never contacted Ferguson or her representatives directly.\n\nIn a March 2011 email to Sitrick and two others, Epstein wrote: “I think Fergie can now say, I am not a pedo.” Inreply, Sitrick said there is a “strategy” to “get newspapers to stop calling you a pedophile and get the truth out,” and that one tactic was to “get Fergie to retract.”\n\nThe next month, Fergusonwrotein an email to Epstein and James Henderson, her spokesperson at the time, saying she “did not” and “would not” call him a “P.”\n\nIn October 2009, shewroteto Epstein saying that she “urgently” needed £20,000 for rent, and that her landlord had “threatened to go to the newspapers if I don’t pay.”\n\nIt was not clear if Epstein sent that money. However, in 2001, years before Ferguson’s request, newly released documents appeared to show that Epsteinwiredthe former duchess $150,000 after helping her to cash in the share options she earned from her work for Weight Watchers. CNN has asked a spokesperson for Ferguson for comment.\n\nOn Monday evening, Ferguson’s charitable foundation “Sarah’s Trust” announced it would close “for the foreseeable future” after “some months” of discussion, according to the United Kingdom’s PA Media news agency.\n\nMandelson, widely known in political circles as the “Prince of Darkness” for his Machiavellian approach to power, was fired as the UK’s ambassador to Washington in September over the deepening scandal surrounding his ties to Epstein. That month, US lawmakers had released a “birthday book,” compiled for Epstein’s 50th birthday in 2003, in which Mandelson penned a handwritten note describing the financier as “my best pal.”\n\nThe latest tranche of documents has revealed that Mandelson appeared to leak sensitive UK government tax plans to Epstein. They also show that his partner, Reinaldo Avila da Silva, regularly received undisclosed payments from him.\n\nIn September 2009, da Silva — who married Mandelson in 2023 after three decades together —emailedEpstein to ask for £10,000 to help fund his osteopathy course. Epsteinreplied: “I will wire your loan amount immediated’y (sic).”\n\nIn April 2010, da Silva emailed Epstein again, sharing his bank details. Epstein forwarded the message to his accountant, Rich Kahn,adding: “send 13k dollars.”\n\nThat same month, Epstein told Kahn to “send 2k per month to reinaldo.” When Kahnaskedif this was in addition to the original $13,000, Epsteinreplied: “no after rethinkoing (sic) send 4000 dollars only.”\n\nIn October that year, MandelsonaskedEpstein, jokingly: “Have you permanently stopped the reinaldo sub?! I may have to put him out to work on the streets.”\n\nFinancial records newly released by the DOJ also appear to show that Mandelson himself may have received payments totaling $75,000 from Epstein between2003and2004. A spokesperson for Mandelson told British media that neither the former ambassador nor da Silva “has any record or recollection of receiving payments in 2003 and 2004 or know whether the documentation is authentic.”\n\nThe latest files also revealed that Mandelson appeared to leak a sensitive UK government document to the financier while he was business secretary in 2009. Thememo, written for then-Prime Minister Gordon Brown, advocated £20 billion of asset sales to help relieve Britain’s debt burden following the 2008 financial crisis, and revealed Labour’s tax policy plans.\n\nIn December 2009, Mandelson and Epstein alsoexchangedemails about Britain’s plans to impose an additional tax on bankers’ bonuses — a punitive one-off measure following the crash. An email from Epstein asked if “jamie” — possibly referring to Jamie Dimon, who was then and still is CEO of JP MorganChase — should call “darling,” likely Alistair Darling, then Britain’s finance minister, “one more time.” In reply, Mandelson appears to suggest that Epstein should call Darling again and “mildly threaten” him. The BBCreportedthat Darling later had a “painful and angry” phone call with Dimon.\n\nIn another exchange, in May 2010, Mandelson appeared to tip off Epstein that the European Union was planning a €500 billion bailout to save the euro. Epsteinwrote: “sources tell me 500 b euro bailout, almost compelte (sic).” Soon after, Mandelson replied: “Sd be announced tonight.” Mandelson had previously served as European commissioner for trade between 2004 and 2008.\n\nOn Sunday, Mandelson, who also sits in the House of Lords, announced his resignation from Labour, saying he did not want to cause the party “further embarrassment.” He also apologized “to the women and girls whose voices should have been heard long before now.” CNN was unable to contact Mandelson for further comment.\n\nLondon’s Metropolitan Police said Monday it had received a number of reports relating to alleged misconduct in a public office following the latest release.Mandelson will face a criminal investigation into allegations that he leaked market sensitive information from Downing Street to Epstein, PA Media reported Tuesday.\n\nFormer British prime minister Gordon Brown, whose government Mandelson had served in as business secretary, wrote to London’s Metropolitan Police to provide information relating to the alleged disclosure of sensitive information, according to PA.\n\n“The reports will all be reviewed to determine if they meet the criminal threshold for investigation,” police commander Ella Marriott said.\n\nMandelson will also resign from the House of Lords on Wednesday, the speaker of the British Parliament’s upper chamber said Tuesday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2026/01/31/politics/new-documents-trump-epstein",
      "text": "3 million documents"
    },
    {
      "url": "https://cnn.com/2025/10/31/uk/andrew-mountbatten-windsor-what-next-intl",
      "text": "Prince Andrew"
    },
    {
      "url": "https://cnn.com/2019/11/18/opinions/prince-andrew-bbc-interview-disaster-maltby",
      "text": "bat away"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01816811.pdf",
      "text": "exchange"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02440870.pdf",
      "text": "sent"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00764381.pdf",
      "text": "wrote"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01989052.pdf",
      "text": "email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00638080.pdf",
      "text": "reply"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01791145.pdf",
      "text": "wrote"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00770958.pdf",
      "text": "wrote"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01484186.pdf",
      "text": "wired"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02436676.pdf",
      "text": "emailed"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01818446.pdf",
      "text": "replied"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01826888.pdf",
      "text": "adding"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02426483.pdf",
      "text": "asked"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01825605.pdf",
      "text": "replied"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02421420.pdf",
      "text": "asked"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01487808.pdf",
      "text": "2003"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01482503.pdf",
      "text": "2004"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00750065.pdf",
      "text": "memo"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00886693.pdf",
      "text": "exchanged"
    },
    {
      "url": "https://www.bbc.co.uk/news/articles/cx2kzmnr14lo",
      "text": "reported"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00759919.pdf",
      "text": "wrote"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/02/uk/epstein-files-britain-mandelson-andrew-ferguson-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f21a7cd25e8dfbafa65cf658eb34326c4b73c330b0b8667d96ab3dfccf2fda4c",
  "scraped_at": "2026-02-18T07:32:37.192686+00:00"
}