{
  "url": "https://lite.cnn.com/2026/02/26/us/missing-person-tucson-arizona-guthrie",
  "title": "As Nancy Guthrie’s disappearance nears one month, other Tucson families have been waiting decades for answers | CNN",
  "date": "2026-02-28T07:01:52.102801+00:00",
  "authors": [
    "Elise Hammond"
  ],
  "text": "Source: CNN\n\nJune 12, 1991, is a day Tammy Tacho will never forget. It was the last day she ever saw her 12-year-old little brother before he disappeared as she and her mother pulled out of the driveway.\n\nJames Hendrickson – known as Jimmy to his family – had reached into the car to kiss his mother goodbye, Tacho recalled.\n\n“To me and my mom, that’s a horror movie to us, because that’s the last peck, or that’s the last kiss, and that’s the last hug, and that’s the last touching his hair that she got to do,” she told CNN.\n\nMore than three decades later, Jimmy has never been found, with his missing person case still open and cold.\n\nJimmy is just one of several people in theTucson areawho have been missing for over a decade without answers.\n\nA more recent disappearance in the area hasdrawn national attention: that of Nancy Guthrie, the 84-year-old mother of “Today” anchor Savannah Guthrie.\n\nNancy Guthrie vanished from her affluent neighborhood in theCatalina FoothillsonFebruary 1, and nearly a month after she disappeared, officials have yet to find the missing woman or charge someone in connection to her apparent kidnapping.\n\nPresident Donald Trump posted on Truth Social he was “deploying all resources” to find her, and the Pima County Sheriff said he had “over 400 cops out here working every minute of the day” on the case. Her family on Tuesday announced they are offering up to $1 million for information leading to her recovery, and Savannah Guthrie also announced a $500,000 donation to theNational Center for Missing and Exploited Children, saying she hopes the attention given to her family will extend to others still in limbo.\n\nAs the search for Nancy Guthrie stretches into its fourth week, families like Jimmy’s have been waiting years for any new information about their loved ones.\n\nOn that summer day in Tucson, Tacho and her mother were heading to Douglas, Arizona, to meet her then-boyfriend’s family, she said. Jimmy didn’t want to go.\n\n“He was at that age. It was summer, he wanted to be out there playing and doing what boys do, and so he stayed behind,” she said.\n\nTacho remembers her brother as a “mama’s boy” who loved going to church, playing outside and was usually sporting red sweatpants — his favorite color.\n\n“The worst thing is to drive out and watch him just wave at us,” Tacho said.\n\nThey left him with a family friend they had known since they moved to Tucson in 1987, Tacho said, and their two-day trip stretched into three after the car broke down.\n\nWhen they finally got back into town, that’s when “the nightmare begins,” Tacho said.\n\nJimmy’s mother filed a police report immediately when she found out her son was missing, but Tacho said the case wasn’t taken seriously right away. She recalled police thought Jimmy was just a runaway, but she said her family knew that wasn’t true. It took several weeks for her brother to be recognized as a missing person, she said.\n\n“It’s been brought up during the initial investigation and subsequent theories, and that was that Jimmy walked away of his own free will and just was a runaway. That’s absolutely not what happened in this case. He didn’t leave his family of his own free will. He had no money to provide for himself, no transportation,” Tucson Police Department Detective David Millertold CNN affiliate KOLDlast year.\n\nThere are several stories about what happened the night of June 11 and the next morning, Tacho said, which has left her family with more questions than answers.\n\nThe family friend watching Jimmy let him and another child go to her relative’s house to fix a fence, Tacho said. The other child told police that Jimmy was playing video games when he went to bed and heard noises during the night, but didn’t think anything of it, according to Tacho. The adult at the house said Jimmy left in the morning to go eat breakfast at a nearby school, she said, which was not unusual for her and her siblings to do.\n\nNow, nearly 35 years later, Tacho is still pushing for answers. She still calls the police department and has hosted vigils and events to bring attention to her brother’s case, she said.\n\n“I worked at the job my mom worked at and hope that one day Jimmy would walk in there,” Tacho said. “I’ve come to accept … I’m not going to find him alive, but we need to find him.”\n\nWhen her mother died a few years ago, she “left not knowing” what happened to Jimmy. “I don’t want to leave this world not knowing,” Tacho said.\n\nShe said she still lives in Tucson, just in case Jimmy ever comes back.\n\nIt’s a heavy burden the family of Karen Grajeda, who was 7 years old when she disappeared from her apartment complex in Tucson in 1996, is bearing too: The balancing of hope and trying to grieve.\n\n“I still hang our Christmas picture every year,” her younger sister, Alejandra, wrote in a message to Karen posted by theNational Center for Missing and Exploited Children. “My daughter is named after you. If you’re out there, if you’re alive, we’re here. Your whole family loves you and if you can come home, please do. We’ll always be waiting for you.”\n\nKaren was last seen playing outside her home on January 11, 1996, according toCNN affiliate KOLD.\n\nThe FBI and Tucson Police Department began searching for her right away, and family and community members joined the effort, but after months with few leads, there is still no trace of what happened, the NCMEC said. The organization works with law enforcement and other officials to find missing children, including publishing age-progression images.\n\n“She was just an innocent child. That’s the memory I have of her, an innocent child who was always smiling. As her father, that’s the image I hold onto,” Karen’s father, Andres, told the organization.\n\nKaren’s case is “in long-term missing person status,” the Tucson Police Department told CNN, and law enforcement continues to investigate the case as a non-family abduction and asks people to come forward with information, according to NCMEC.\n\n“There’s nothing more innocent than a child, and they’re the most vulnerable people that had everything in front of them to be happy about, and it was all taken away from them, from their families,” Miller, the Tucson detective,told KOLDof the case in 2023. “Anybody who has kids probably feels the same way and that level of trust, I think, in a community when something like that happens, it diminishes it.”\n\nNearly 30,000 children were reported missing in 2024, according toNCMEC.\n\nAdults in the 20-39 age group are also at risk for abductions and kidnappings in the United States,according to data from the FBI. From February 2025 to February 2026, 53% of all abductions were of people in that age range. Nearly half of all abductions happened between current or former romantic partners, the data shows.\n\nMarlana McElvaine’s family believes she’s no longer alive but is still asking the public to come forward to help them lay her to rest.\n\nThe 28-year-old and mother of two was in a relationship where she experienced domestic abuse when she went missing in 2010, her sister toldCNN affiliate KGUN. Her boyfriend, whom she was living with at the time of her disappearance, is in prison on unrelated charges,KOLD reported.\n\n“It’s a matter of someone coming forward and being brave and giving information. We ask that if it was their sister, their daughter, their child’s mother, that they put themselves in our shoes,” Janean McElvaine, her sister, told KOLD in 2023.\n\nMarlana McElvaine’s car was found abandoned, with her keys and work badge still inside, the station reported.\n\n“You have no closure and there’s just this void in our hearts. We go on, we do the things we have to do, but we have no answers and we’re just hoping that someday … we can give her the proper goodbye that she deserves,” her mother Dian McElvaine told KOLD.\n\nDian McElvaine said in 2023 the family was working on getting a death declaration to help with the grieving process. Tucson police told KOLD at the time that once it is signed, the case will change from a missing person case to homicide.\n\nTucson police told CNN that the case is still currently classified “in long-term missing person status.”\n\nPeople do go missing, Tucson Police Detective Doug Musicktold KOLD at the timeof her disappearance, but “it’s pretty rare for people to just abandon their children, their job, their family, their life.”\n\nMarlana McElvaine’s family thinks so, too.\n\n“I knew from that moment that I got that call, I knew she was gone. Because I knew she wouldn’t have walked away from her life, she wouldn’t have walked away from her kids, she wouldn’t have left us — we’re all so close. I knew from that moment, I started grieving from that point forward because you know what, there’s no way she would have just left,” Dian McElvaine told KOLD.\n\nHer family still talks about her and celebrates her birthday, her sister told KOLD. They also planted a tree in her honor.\n\nThe families, including the Guthries, are going through trauma that only other families who have been waiting for answers can understand, said Jimmy’s older sister Tacho, seeking some kind of closure.\n\n“Nobody knows how we feel unless we’re going through it,” she said. “It’s so much pain and ache.”\n\n“I look for answers like if it was the first day, the second day, six months, a year, you know — we’re just never going to give up. We’re never going to give up,” Tacho said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/americas/mexico-searching-mothers-nancy-guthrie-latam-intl",
      "text": "Tucson area"
    },
    {
      "url": "https://www.cnn.com/2026/02/25/us/nancy-guthrie-reward-strategy",
      "text": "drawn national attention"
    },
    {
      "url": "https://www.cnn.com/2026/02/04/us/tucson-arizona-nancy-guthrie-home",
      "text": "Catalina Foothills"
    },
    {
      "url": "https://www.cnn.com/us/timeline-nancy-guthrie-search",
      "text": "February 1"
    },
    {
      "url": "https://www.missingkids.org/blog/2026/standing-with-families-in-their-hardest-moments",
      "text": "National Center for Missing and Exploited Children"
    },
    {
      "url": "https://www.kold.com/2025/07/02/13-crime-files-disappearance-james-jimmy-hendrickson/",
      "text": "told CNN affiliate KOLD"
    },
    {
      "url": "https://www.missingkids.org/blog/2026/well-always-be-waiting-for-you-30-years-without-karen?fbclid=IwY2xjawP_PMtleHRuA2FlbQIxMABicmlkETJrRUpzWU1hZVIzTUVtTUh5c3J0YwZhcHBfaWQQMjIyMDM5MTc4ODIwMDg5MgABHgJNLZOJ7qWTeCQ7l7cnhpnuNnB6hHTGjyIgGofJEqYUG_ss2XVyePhZ-iEc_aem_ukj8UeprkxeQKtSO9pUC5w",
      "text": "National Center for Missing and Exploited Children"
    },
    {
      "url": "https://www.kold.com/story/30946093/tucsons-most-wanted-20-yrs-later-karen-grajeda-still-missing/",
      "text": "CNN affiliate KOLD"
    },
    {
      "url": "https://www.kold.com/video/2023/11/22/13-crime-files-disappearance-karen-grajeda/",
      "text": "told KOLD"
    },
    {
      "url": "https://www.missingkids.org/",
      "text": "NCMEC"
    },
    {
      "url": "https://cde.ucr.cjis.gov/LATEST/webapp/#/pages/explorer/crime/crime-trend",
      "text": "according to data from the FBI"
    },
    {
      "url": "https://www.kgun9.com/news/local-news/tucson-family-still-seeking-answers-on-12-year-anniversary-of-missing-daughter",
      "text": "CNN affiliate KGUN"
    },
    {
      "url": "https://www.youtube.com/watch?v=_ZyR_8ELKhE",
      "text": "KOLD reported"
    },
    {
      "url": "https://www.kold.com/story/15238880/police-suspect-foul-play-in-missing-woman-case/",
      "text": "told KOLD at the time"
    }
  ],
  "hash": "f31a8409c1761947e436e92e13363ba57af20299d2ff3376c898dae96d6cc29d",
  "scraped_at": "2026-02-28T07:01:52.102813+00:00"
}