{
  "url": "https://lite.cnn.com/2026/02/24/business/trump-immigration-banks-citizenship",
  "title": "Trump administration considers forcing banks to verify customers’ citizenship | CNN Business",
  "date": "2026-02-25T07:32:12.816941+00:00",
  "authors": [
    "Matt Egan",
    "Priscilla Alvarez"
  ],
  "text": "Source: CNN\n\nThe Trump administration is weighing a new requirement for US banks to verify citizenship information of current and future customers as part of the president’saggressive immigration crackdown, sources told CNN.\n\nThe potential action, which one source said could take the form of an executive order, has raised concern in the industry that banks could be compelled to ask customers for an unprecedented category of documents, including passports and other documents that verify citizenship status. The source cautioned that plans haven’t been finalized and that there are still considerations underway over other options and legal authorities.\n\n“It’s a bad idea. We are very alarmed,” a financial industry source told CNN.\n\nThe industry source added that bank executives worry the order is designed to force them to play a role in the administration’s pursuit to deport undocumented immigrants.\n\nIt’s not clear whether President Donald Trump will eventually sign an executive order, the possibility of which was first reported byThe Wall Street Journal.\n\nThe White House neither confirmed nor denied the potential executive order or other action.\n\n“Any reporting about potential policymaking that has not been officially announced by the White House is baseless speculation,” White House spokesperson Kush Desai said in a statement.\n\nWhile banks are required to adhere to anti-money-laundering and know-your-customer rules and list where a customer lives, they don’t collect or verify citizenship information.\n\nIf Trump signed such an executive order, it could require banks to retroactively get citizenship information from existing customers and collect it from new customers, the industry source said.\n\n“Verifying every bank customer’s citizenship status would be unworkable,” the source said.\n\nRepresentatives for major banks and industry groups declined to comment.\n\nThe Trump administration’s immigration crackdown efforts have at times raised concern in parts of the federal government.\n\nAsCNN previously reported, as many as 50 senior information technology professionals at the Internal Revenue Services — including some top cybersecurity experts — were placed on administrative leave last year as Trump officials finalized plans to share taxpayer data with federal immigration authorities. That effort was legally challenged andblocked by a federal judgelate last year.\n\nA Treasury Department spokesperson said at the time that employees were placed on leave but denied it had to do with accessing IRS data for immigration enforcement.\n\nThese discussions come as the Trump administration has moved to crack down on what it views as debanking of conservatives. Trump signed an executive order last year seeking to punish banks for restricting services to customers based on their religious or political beliefs.\n\nTrump recently filed a lawsuit against JPMorgan Chase for dropping him as a customer after the January 6, 2021, insurrection. JPMorgan has said the suit has no merit.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/interactive/2026/01/09/us/dhs-immigration-crackdown-ice-arrests-protests-vis/index.html",
      "text": "aggressive immigration crackdown"
    },
    {
      "url": "https://www.wsj.com/politics/policy/trump-administration-considers-action-requiring-banks-to-collect-citizenship-info-8e26f6d2?st=6aADSk&reflink=article_copyURL_share",
      "text": "The Wall Street Journal"
    },
    {
      "url": "https://www.cnn.com/2025/03/31/politics/irs-it-officials-immigration-enforcement-data-sharing",
      "text": "CNN previously reported"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/politics/irs-ice-data-sharing-ruling",
      "text": "blocked by a federal judge"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/business/trump-immigration-banks-citizenship",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/business/trump-immigration-banks-citizenship",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f3267a4b05582f9647a29feacde146560f04bf0335fb7f6d3ff5846088ae89e2",
  "scraped_at": "2026-02-25T07:32:12.816952+00:00"
}