{
  "url": "https://lite.cnn.com/2026/02/08/politics/hunter-hess-trump-olympics-skier",
  "title": "Hunter Hess: Trump insults Olympic skier who expressed ‘mixed emotions’ representing the US | CNN Politics",
  "date": "2026-02-11T16:41:19.368881+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nPresident Donald Trump called Olympic skier Hunter Hess a “real loser” on Sunday after the athlete expressed “mixed emotions representing the US right now” in theWinter Olympic Games.\n\n“U.S. Olympic Skier, Hunter Hess, a real Loser, says he doesn’t represent his Country in the current Winter Olympics,” Trump posted onTruth Socialon Sunday morning. “If that’s the case, he shouldn’t have tried out for the Team, and it’s too bad he’s on it. Very hard to root for someone like this.”\n\nHess, who hails from Bend, Oregon, said during a press availability last week that “just because I’m wearing the flag doesn’t mean I represent everything that’s going on in the US.”\n\n“It’s a little hard; there’s obviously a lot going on that I’m not the biggest fan of and I think a lot of people aren’t,” Hess said. “I think for me, it’s more I’m representing my friends and family back home, the people that represented it before me, all the things that I believe that are good about the US.”\n\nIn an Instagram post on Monday, Hess appeared to respond to the criticism, saying he could not wait to represent Team USA and emphasizing his right to speak out.\n\n“There is so much that is great about America, but there are always things that could be better. One of the many things that makes this country so amazing is that we have the right and the freedom to point that out,” Hess wrote. “The best part of the Olympics is that it brings people together, and when so many of us are divided we need that more than ever. I cannot wait to represent Team USA next week when I compete.”\n\nHess’ comments last week came as several freestyle skiers on Team USA fielded questions on the US political climate. Skier Chris Lillis was more direct in his comments, referencing tensionssurrounding federal immigration enforcementin the wake of two fatal shootings of US citizens in Minnesota.\n\n“A lot of times, athletes are hesitant to talk about political views and how we feel about things. I feel heartbroken about what’s happening in the United States,” Lillis said.\n\n“I’m pretty sure you’re referencing ICE and some of the protests and things like that,” he told reporters. “I think that as a country, we need to focus on respecting everybody’s rights and making sure that we’re treating our citizens as well as anybody, with love and respect.”\n\nAnother skier, Quinn Dehlinger, said: “The political divide in the United States is very prevalent, and competition and sports is always a way to bring people together.”\n\nA US Olympic and Paralympic Committee spokesperson said in a statement that “Our focus is on Hunter’s protection and on ensuring he has the support and resources in place to compete on the world’s largest stage.”\n\nThe committee issued a statement earlier this weekend after figure skater Amber Glenn was also asked about US politics andlater saidshe received hate messages.\n\n“It’s a sad reality that over the last several games, we’ve seen an uptick in abusive and harmful messages directed at athletes during competition,” a USOPC spokesperson said, adding the committee monitors public platforms and escalates threats to law enforcement as appropriate.\n\n“The USOPC stands firmly behind Team USA athletes and remains committed to their well-being and safety, both on and off the field of play,” the statement said.\n\nSome conservatives have weighed in on athletes’ comments, criticizing Hess before the president’s Truth Social post.\n\n“If you can’t say you love America while competing on behalf of our nation then you shouldn’t be at the Olympics,” Katie Miller, a Trump ally and the wife of top White House aide Stephen Miller, wroteon social mediaSaturday.\n\nWhite House chief of protocol Monica Crowley also chimed in and reposted the president, writing on X, “Represent America with pride or GTFO.”\n\nThe president’s remark, however, was met with pushback by Sen. Bernie Sanders, who called Hess a “proud American.”\n\n“Mr. President, this is not a monarchy,” the Vermont independent wrote on X. “This is the United States and no one is required to bow down to you.”\n\nTrump’s social media comment is only the latest example of the president criticizing those who speak out against his administration. He also voiced opposition toBad Bunnyperforming at the Super Bowl halftime show.\n\nMeanwhile, Vice President JD Vance and Secretary of State Marco Rubio were in Milan over the weekend to watch the Olympics, and Trump is attending a Super Bowl watch party in Florida.\n\nVance and second lady Usha Vance werenotably booedduring the opening ceremony.\n\nWhile Trump said it’s hard to root for Hess, Vance said in a speech last week to Team USA athletes that “The whole country, Democrat, Republican, independent, we’re all rooting for ya and we’re cheering for ya.”\n\nThis story has been updated with additional information.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/sport/live-news/milan-winter-olympics-results-highlights-medals-02-08-26",
      "text": "Winter Olympic Games"
    },
    {
      "url": "https://truthsocial.com/@realDonaldTrump/posts/116035760619414211",
      "text": "Truth Social"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/us/minneapolis-shootings-federal-officers-accountability",
      "text": "surrounding federal immigration enforcement"
    },
    {
      "url": "https://www.reuters.com/sports/figure-skating-glenn-limit-social-media-use-after-threats-over-lgbtq-comments-2026-02-08/",
      "text": "later said"
    },
    {
      "url": "https://x.com/KatieMiller/status/2020276797397709137?s=20",
      "text": "on social media"
    },
    {
      "url": "https://www.cnn.com/2026/01/25/politics/trump-super-bowl-lx-football",
      "text": "Bad Bunny"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-us-iran-02-06-26?post-id=cmlbk1jpn00003b6pp5e9ddkt",
      "text": "notably booed"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/politics/hunter-hess-trump-olympics-skier",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/08/politics/hunter-hess-trump-olympics-skier",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f3d427ce0c2ddecd146421435bb594543134cb83e8ee7f033ee805759ff2ce91",
  "scraped_at": "2026-02-11T16:41:19.368906+00:00"
}