{
  "url": "https://lite.cnn.com/2026/02/12/americas/venezuela-oil-wright-rodriguez-latam-intl",
  "title": "US energy secretary and Venezuela’s acting president tour oil facility in warming ties just weeks after Maduro ouster | CNN",
  "date": "2026-02-13T07:30:51.515876+00:00",
  "authors": [],
  "text": "Source: CNN\n\nIt’s a scenario that seemed impossible just 40 days ago: A high-ranking US official walking side by side with Venezuela’s leader to discuss investments in the country.\n\nYet that was the scene Thursday when US Energy Secretary Chris Wright toured oil producing facilities in the South American nation with its acting president Delcy Rodríguez.\n\nAs they walked through the sprawling tank farm of compressors, valves and hissing pipes, Wright was shown a small fraction of the enormous energy potential trapped under Venezuela’s soil, as the US moves to control sales of the country’s oil.\n\nDuring the tour, US and Venezuelan flags stood side by side at the facility the group visited, and Rodríguez held several conversations in English, a language she perfectly mastered after studying in the UK but that she declined to speak in public for years for political reasons.\n\nThursday’s visit was full of smiles, laughs and handshakes – a stunning reversal in international affairs less than two months after a US Delta Force operation captured Rodríguez’s predecessor,Nicolás Maduro, before detaining him in the US on drug-related charges.\n\nWright’s visit is part of a two-day trip to Venezuela that also included a formal reception at the Miraflores presidential palace in Caracas on Wednesday. Maduro’s name was only mentioned once on the first day, Wright told CNN, because the trip was to discuss business, not politics.\n\n“North of $100 million will be invested to upgrade and increase the throughput capacity of this facility,” Wright said live on CNN from Petropiar, an oil processing plant operated in a joint venture between US energy giant Chevron and the Venezuelan public oil company PDVSA.\n\n“They’re on target to double production in that particular field in the next 12 to 18 months and probably quintuple it over the next five years,” Wright added.\n\n“This is the way forward. This is the path of cooperation, and it is the agenda for a long-term productive partnership,” Rodríguez told CNN.\n\nUntil very recently, Rodríguez used to have a markedly different tone for the US administration, saying on January 26 that Venezuela would not accept mandates or orders coming down from Washington.\n\nOn Thursday, Wright was quick to point to the consequences Venezuela would face if the newly found cooperation was reverted: “The leverage we have is we control the flow of the dominant industry of Venezuela. We control the flow of funds from oil. (Rodríguez) wants to work with us.”\n\nThe group was joined by the new US Chargé d’Affaires to Venezuela Laura Dogu, who has moved to Caracas less than two weeks ago and is now working to build up on the relation.\n\n“We are working a fast-paced agenda to strengthen our bilateral cooperation,” Rodríguez told CNN, “Chevron has been here for a hundred years, and they are doing fantastic work,” she said.\n\nVenezuela is home tothe world’s largest reported oil reserves. Over the last 20 years, successive Venezuelan governments under Maduro and his predecessor Hugo Chávez almost brought the oil industry to a standstill by threatening foreign companies with expropriations.\n\nConoco Philips CEO Ryan Lance recently suggested the new government should pay back millions of dollars in unpaid debt if it was serious about a new business relation.\n\nVenezuela has operated a series of U-turns since Maduro’s ousting: As Wright and Rodríguez were visiting oil facilities, the National Assembly advanced plans togrant an amnestyto thousands of political prisoners after years of violent political confrontation.\n\nLast month, a reform to the hydrocarbon law to favor foreign investments in the sector was passed in a matter of days.\n\nThursday’s visit was the first time in eight years US media were allowed to visit the oil field, Chevron told CNN, a symptom of how acrimonious the relationship with Washington came to be. The two countries broke diplomatic ties in 2019 after the US threw its support behind the Venezuelan opposition, challenging Maduro’s rule after a contested election.\n\nThe task to bring the South American nation back into the number of free and democratic nation following Maduro’s removal remains enormous.\n\nUnder Maduro, the country regularly ranked among the lowest in the world for its democracy and rule of law, and over seven million Venezuelans fled the country to escape the humanitarian and political crisis of recent years, according to the US.\n\n“We are five weeks into the transition process; a lot remains to be done,” Wright told CNN Wednesday.\n\nUS President Donald Trump on Thursday hailed relations between both nations as “extraordinary” in a social media post, saying, “We are dealing very well with President Delcy Rodríguez, and her Representatives.”\n\nAsked whether Trump would visit Venezuela before his term ends, Wright said he didn’t know but “wouldn’t rule it out.”\n\nThe US does not recognize the legitimacy of Rodríguez’s government, Wright said, and students were marching in Caracas on Thursday morning calling for new elections.\n\nAsked about Rodríguez’s future and her repeated insistence that Maduro remains Venezuela’s legitimate president, Wright said the US is not “going to tell Delcy what her future role is. You know, that’s ultimately going to be up to the Venezuelan people.”\n\nWright defended the United States’ increasing investments in Venezuela’s oil industry despite the county’s unclear roadmap toward democracy. He told CNN’s Boris Sanchez on “CNN News Central” on Thursday that the US could not have waited until elections were held in Venezuela before starting to invest, insisting that the best way to improve conditions for ordinary Venezuelans is to allow oil income to flow back in after years of underinvestment and US sanctions.\n\nA Venezuelan oil worker at one of the facilities gleamingly told CNN she hoped former colleagues who fled the country in recent years would be able to return, before rapidly asking not to use her name for fear of political persecution if she was found to speak with the press.\n\nAnd yet, the feeling of a new beginning was palpable on Thursday. Standing in front of an inspection table during a photo-op, Wright picked up a glass flask filled with the thick, low-quality but incredibly abundant Venezuelan crude.\n\nInspecting it briefly, he nodded a smile at the cameras and kissed the glass.\n\nEveryone cheered.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/23/americas/venezuela-maduro-fort-tiuna-compound-operation-reconstruction-intl-invs",
      "text": "Nicolás Maduro"
    },
    {
      "url": "https://www.cnn.com/2026/01/03/business/oil-gas-venezuela-maduro",
      "text": "the world’s largest reported oil reserves"
    },
    {
      "url": "https://www.cnn.com/2026/01/30/americas/venezuela-amnesty-law-political-prisoners-latam-intl",
      "text": "grant an amnesty"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/americas/venezuela-oil-wright-rodriguez-latam-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/americas/venezuela-oil-wright-rodriguez-latam-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f4a5cc5d480daeff57820fcdfeeb906c3fadf4c58a971318409a5c9d703a918f",
  "scraped_at": "2026-02-13T07:30:51.515889+00:00"
}