{
  "url": "https://lite.cnn.com/2026/02/26/health/childrens-hospital-literacy-screening",
  "title": "As literacy rates lag, a pediatric hospital is screening for reading ability | CNN",
  "date": "2026-02-27T07:16:34.207564+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nFor some young children in Columbus, Ohio, reading assessments don’t start in the kindergarten classroom — they happen first in the doctor’s office.\n\nWith concerns rising about lagging childhood literacy rates across the country, Nationwide Children’s Hospital has begun screening children’s literacy skills starting at age 3 during pediatrician visits. The idea is to catchreading strugglesearly on and guide parents on how to help their kids.\n\n“They are all doing developmental screenings, they’re all talking to parents repeatedly,” said Sara Bode, the hospital’s medical director of school-based health. “So this is an opportunity.”\n\nThe pediatric hospital chose clinics to provide the literacy screenings largely based on their proximity to schools with lower performance scores onkindergarten readinessassessments. Across Columbus City Schools, more than 63% of kindergarteners were behind on language and literacy skills during the 2024-2025 school year, according to state kindergarten readiness assessment, or KRA, data.\n\nConcerns about childhood literacyextend far beyond Columbus. Nationally, the percentage of fourth graders considered proficient in reading sits just above 30%, according to the 2024 National Assessment of Educational Progress, known as the nation’s report card. Reading proficiencyhas dipped4 percentage points since 2019 as schools have struggled to make up forpandemic learning losses.\n\nLiteracy screenings are not typically conducted in medical settings, but several prominent pediatric care centers, including Boston Children’s Hospital, promote early literacy resources to families in recognition of reading’s importance for a child’s development.\n\nKids who enter kindergarten with lower reading abilityoften struggle to catch up in later grades. Almost three-fourths of kindergarteners who test in the bottom 20% of students for readiness exams remain in the bottom 20% of their class by fifth grade, according to The Children’s Reading Foundation, a nonprofit organization.\n\nPhysicians’ assessments of childhood development have often focused more on other milestones, such as walking or talking on time. But a child could ace a standard pediatric screening and still be behind in other areasneeded to be ready for kindergarten, Bode said.\n\nTo address that dilemma, the pediatric hospital implemented literacy screenings in about half of its 13 clinics, assigning a literacy coordinator to each. The program launched in 2022 and has since conducted more than 2,400 screenings. Many of the children come from high-needs populations, as Nationwide serves families that are uninsured or on Medicaid.\n\nScreeners aren’t meant to diagnose learning disabilities like dyslexia, but rather identify areas where kids could use additional support.\n\nHaving support outside the education system to flag early reading difficulties is a step in the right direction, but choosing the right screening tool is key, said Devin Kearns, an early literacy professor at North Carolina State University.\n\nCoordinators at Nationwide use a tool that assesses kids as they read through a book during primary care visits — either in English or Spanish. It took some practice to refine the timing — avoiding moments after vaccinations when children were upset, for example — but the reading assessments take only about 10 minutes.\n\nAfter a child completes a screening, the coordinator can create a personalized literacy plan that highlights the areas that need more practice.\n\nThe visit is also an opportunity to model activities that parents can do at home with their kids, such as reading a book aloud, said Carneshia Edwards, who leads the hospital’s kindergarten readiness team.\n\n“When we’re doing the screenings, families are kind of concerned that their kids don’t know certain things and it’s not necessarily about that piece of it,” Edwards said. “It’s just more so exposing them more than anything.”\n\nBefore Juri Sleet completed her literacy screening at age 3, her grandmother, Quintina Davis, worried Juri didn’t have enough opportunities for early learning. But meeting with the literacy coordinator at her clinic opened Davis’ eyes to all the activities she could do at home with Juri.\n\n“She didn’t know as much, but our coordinator was very patient with her,” Davis said.\n\nAfter each screening, coordinators put together literacy kits, a medley of tools and activities for at-home practice. Those materials are also influenced by Columbus City Schools teachers’ feedback on what students need help with when they enter kindergarten.\n\nThe kits’ contents largely depend on donations the program receives. There are often items such as dry-erase boards for writing letters and books to practice reading. But the kits can also have safety scissors or pencils with rubbery grippers to improve motor skills.\n\n“Parents are the first teachers, so we really try to encourage them to sit down with their child and just kind of work with them before going into kindergarten,” Edwards said.\n\nCoordinators stay in touch with the families they met with in the clinic, sometimes referring children to early education programs such as the federally-funded preschool program Head Start or the SPARK program, which does educational home visits.\n\nThen, when a child returns to the clinic a year later, the coordinator meets with them again. For Juri, now 4, the follow-up visit put into perspective how much she had progressed in a year, her grandmother said.\n\nOver the course of a year, Juri had made strides in recognizing letters, sounds and sight words. Juri also enrolled in preschool at a local YMCA with the help of her literacy coordinator, Davis said. She’s been doing “awesome” there, Davis said, and she can’t wait to watch her grow even more.\n\n“The goal is to make sure by the time she starts kindergarten, that she’s absolutely ready without having a lot of challenges,” Davis said. “So right now, I think she is heading towards that way.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://apnews.com/article/science-reading-threecueing-literacy-b9959cef32e264d8b05836f41bd214d8",
      "text": "reading struggles"
    },
    {
      "url": "https://apnews.com/article/kindergarten-registration-preschool-ready-for-school-fcf120a9c891c914810e039c25a35b4d",
      "text": "kindergarten readiness"
    },
    {
      "url": "https://apnews.com/article/naep-test-scores-nations-report-card-school-60150156e41b8518be3b6eabf77d0c66",
      "text": "Concerns about childhood literacy"
    },
    {
      "url": "https://apnews.com/article/naep-reading-math-scores-12th-grade-c18d6e3fbc125f12948cc70cb85a520a",
      "text": "has dipped"
    },
    {
      "url": "https://apnews.com/article/covid-school-closure-education-recovery-scorecard-c828144e18a02a1e45841c4dd07f05cb",
      "text": "pandemic learning losses"
    },
    {
      "url": "https://apnews.com/article/reading-third-grade-phonics-bd9a14dd348d88c2b11e2dce38829a8e",
      "text": "often struggle to catch up in later grades"
    },
    {
      "url": "https://apnews.com/article/kindergarten-readiness-preschool-poverty-san-antonio-2753bae4d8275d4d834be364c7d360a3",
      "text": "needed to be ready for kindergarten"
    }
  ],
  "hash": "f4b40c5b6c41638d27826f986a0267272d5cf96fd53440e8c6e7a13cd3b2e939",
  "scraped_at": "2026-02-27T07:16:34.207579+00:00"
}