{
  "url": "https://lite.cnn.com/2026/02/11/business/rare-earths-importance",
  "title": "This mineral makes your life run – and now it’s a trade issue | CNN Business",
  "date": "2026-02-12T21:31:04.862314+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nYou may not know what neodymium is (or even how to pronounce it). But you have plenty of it in your home.\n\nNeodymium is a rare earth, one of the minerals near the bottom of the periodic table that are crucial for everyday life. The element is among the most valuable of all the rare earths because it’s so widespread in so-called “permanent” magnets. And China has a near-monopoly on its processing.\n\nAs a result, neodymium and the other rare earths have become a major factor in trade tensions between the United States and China, the world’s number one and number two economy, respectively.\n\nMuch of US’s manufacturing base - autos, aircraft, appliance - would be crippled without access to neodymium. The element makes up about 30% of the mass of permanent magnets by weight, according to Rod Eggert, a professor at the Colorado School of Mines and an expert in the field.\n\nThe neodymium magnets are very small and very powerful.\n\nHow strong?\n\n“If you were to put them next to a fridge, the fridge would fall over,” said Gracelin Baskaran, director of the Critical Minerals Security Program at the Center for Strategic and International Studies.\n\nNeodymium-based magnets power all manners of motors. Unlike traditional magnets, they don’t lose magnetism when exposed to the constant electric current used to turn the motors on and off.\n\nThe makes them critical to American manufacturing of motors in automobiles, from the simple motors that move windshield wipers to the complex ones that move electric vehicles. They’re also found in many household goods, like power tools and air conditioners, as well as in jet engines and wind turbines.\n\nThe Trump administration says that neodymium and the other rare earths are so essential to the United States that access to them is a national security issue. But China dominates the processing of rare earths, giving it massive leverage in trade talks. China handles 90% of the processing capacity needed to turn raw ore into useable minerals.\n\n“Rare earths are not rare,” said Igor Hulak, an energy and resource partner at consultant Kearney. “They can be found in many countries and on a number of continents. But what is rare is the way the rock is separated, processed and refined.”\n\nProcessing, Hulak said, is an ordeal. It takes a lot of energy to heat the ore, which is then treated with chemicals to separate out the rare earths. The end result also produces toxic waste, some of which is radioactive.\n\n“So the rest of the world, well, simply allowed China to develop this high concentration (of processing),” said Hulak.\n\nOnce the neodymium (or a less pure but still useful version called neodymium-praseodymium oxide) is processed, the material is turned into magnets. That’s also typically done in China. (For some higher performance motors, such as those that power electric vehicles, another rare earth – dysprosium – is added to the mix.)\n\nThe combination of price, availability and widespread use means neodymium produces more revenue than any other rare earth element.\n\nThe United States is trying to wean itself away from China’s rare earth processing. President Donald Trump earlier this month announced plans to create a strategic rare earths reserve. And the US government has been subsidizing projects to increase domestic ore mining and processing. But it will take years to catch up with the availability from China, giving the country a continued chokehold on the elements.\n\n“It takes a number of years to bring any new mine or processing facility into production, even from the day that you make the decision to build a new mine or processing facility,” said Eggert.\n\nGiven China’s dominance of the market and the advantages that go with scale, there is no way an upstart processor can compete without significant government support, Hulak said.\n\nOnce the neodymium is turned into magnets, they are placed around a core inside of a motor and connected to an axle. The core is surrounded by an outer shell that includes a network of electrical wires. When a current is passed through that wire, it creates an electrical field that first attracts, then repels, the magnets, forcing them to spin and turn the axle.\n\nMany companies that depend on these magnets have been looking for alternatives, either a rare-earths-free magnet or a motor without magnets. The hope is to make their supply chain more secure and resilient, Hulak.\n\nBut so far there are no alternatives.\n\n“You trade off the performance, you trade off efficiency, you trade off the weight or the size, you trade off torque, and all of that has a big impact on the motors,” Hulak said. “There is no silver bullet.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/business/rare-earths-importance",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/business/rare-earths-importance",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f4ecfedd3fb3305a0e85092291e6619638ea9d59be9465b83c2a2a4c8ebb6939",
  "scraped_at": "2026-02-12T21:31:04.862328+00:00"
}