{
  "url": "https://lite.cnn.com/2026/02/17/politics/rubio-munich-trump-orban-hungary-analysis",
  "title": "Analysis: While MAGA faces challenges at home, Rubio seeks to export it abroad | CNN Politics",
  "date": "2026-02-17T07:29:49.603908+00:00",
  "authors": [
    "Analysis by Stephen Collinson, CNN"
  ],
  "text": "Source: CNN\n\nPresidentDonald Trumpoften seems frustrated that many Americans don’t appreciate that they are living in his “golden age.”\n\nBut that’s not stopping him from trying to export his ideology by intervening in politics and elections abroad to promote or preserve right-wing populist leaders. This explains Secretary of State Marco Rubio’s mission this week to bolster Hungary’s pro-Russia Prime Minister Viktor Orbán ahead ofApril’s general election.\n\nOrbán, a populist strongman, was MAGA before MAGA existed. His politicizing of the justice system, hardline immigration policies, empowerment of sympathetic oligarchs and attacks on the press are a blueprint for Trump’s second term. But he’s facing his biggest political challenge in 15 years of uninterrupted power.\n\nRubio’s visit to Orbán— who often seeks to undermine EU policy on Ukraine, regulating US tech giants and energy policy — is a rebuke to those Europeans who tried to convince themselves that his respectful tone at theMunich Security Conferenceat the weekend represented a taming of transatlantic tensions.\n\nIt is also the latest step in a personal evolution important to Rubio’s job security in the Trump administration and future political prospects in a changed GOP. In 2019, the then-Florida senator joined bipartisan colleagues in bemoaning “significantly eroded” democracy under Orbán. But on Monday, Rubio told Orbán, “We are entering this golden era of relations between our countries – and not simply because of the alignment of our peoples, but because of the relationship that you have with the president of the United States.”\n\nBut more than Rubio’s personal ambition is at stake. The Trump administration’s backing of Orbán in Hungary’s election is the latest sign of an institutionalized shift to the right in US foreign policy, and a rejection of traditional stances. Some Europeans now regard their longtime protector as a growing political threat.\n\nAnd it reflects the growing willingness of the White House — amid new Trump claims that the US election system is plagued by fraud ahead of themidterm elections— to insert itself into the domestic politics of foreign states. Trump has already tried to influence voters or shape elections in Argentina, Brazil, Honduras and Poland, and claims to be running Venezuela from the Oval Office after ousting President Nicolás Maduro.\n\nTrump isn’t acting on a whim. He’s codified his goals in thenew US national security strategy, which praises the “growing influence of patriotic European parties” in Europe. This refers to right-wing populist and anti-immigrant parties like the National Rally in France, Reform in the UK and the AfD in Germany, which are seeking to oust the global leaders with whom Trump deals every day.\n\nAt Munich last year,Vice President JD Vanceconjured an idealized view of Western Europe rooted in Christianity at risk of being destroyed by a wave of immigration from Muslim and majority non-White nations. This year,Rubio delivered a similar message, albeit cushioned with more diplomatic finesse.\n\nHe insisted that Washington doesn’t want “vassal” states but strong EU partners and that it is committed to ending the Ukraine war threatening the continent. But his speech was also a broad hint that unless the continent adopted MAGA’s view of Western civilization, America’s defense of Europe would be in question.\n\n“Mass migration is not, was not, isn’t some fringe concern of little consequence,” Rubio said in Munich. “It was and continues to be a crisis, which is transforming and destabilizing societies all across the West.”\n\nThe US secretary of state was not just speaking for Trump. He channeled supporters of populist parties rebelling against liberal establishments in European states using Trump’s model. Many such voters believe their social democratic or moderate leaders failed to secure the continent’s borders, just as Democrats failed to do in the US, and they blame globalization for wrecking blue-collar jobs and industrial production.\n\nBut mainstream European politicians warn populists are a threat to stability and democracy. Their people are also reminded of the dangers of right-wing populist nationalism by the battlefield cemeteries that dot their nations — which include thousands of American graves. They abhor Trump’s policies, and they regard US warnings on immigration as antithetical to European values on human rights and integration.\n\nLeaders such as French President Emmanuel Macron push back against US threats to retaliate for their attempts to stem the torrent of misinformation from American-owned social media networks. And they balk at the Trump administration’s claim that their society is sick. “Contrary to what some may say: Woke, decadent Europe is not facing civilizational erasure. In fact, people still want to join our club,” European Commission Vice President Kaja Kallas said in Munich at the weekend.\n\nThis widening ideological and philosophical disconnect shows that transatlantic tensions between Europe and the US go far beyond years of crimped defense budgets from many NATO members that have left them vulnerable to Trump’s lectures.\n\nAs is often the case with Trump, his policy is inconsistent and plagued by contradictions. He’s had good relations with British Prime Minister Keir Starmer, and sometimes Macron, despite being closer ideologically to Reform and the National Rally. And he’s friendly with Italy’s populist Prime Minister Giorgia Meloni despite her strong support for the European Union that he disdains.\n\nAnd there’s also irony in Trump’s relentless effort to spread his message abroad since he’s rarely been so unpopular at home. His approval ratings have plungedbelow 40%and Republican leaders feara midterm election rout. There are few signs that a majority in the US embraces his worldview, let alone in Europe. Given Trump’s unpopularity in polls of Europeans, there’s no guarantee his pressure for them to adopt MAGA values will work.\n\nBut this US political backdrop has Trump critics fearing the Trump-Orbán synergy is about more than shared ideology. The Hungarian prime minister has made it harder for opposition parties to beat him in elections while eroding legal protections that preserve the right to dissent and the right of voters to choose their leaders. There’s a strong echo in Trump’s recent rhetoric.\n\nHungary’s trajectory has long concerned Washington. Take it from Rubio himself. He raised the issue with senior Senate Foreign Relations Committee colleagues Republican Sen. Jim Risch and Democratic Sen. Jeanne Shaheen and former Sen. Robert Menendez in 2019. “Under Orbán, the election process has become less competitive, and the judiciary is increasingly controlled by the state,” the senators wrote. “Press freedom has declined as advertisers have been strongly discouraged from placing ads in independent outlets and ownership has been consolidated under a foundation that is exempt from antitrust regulation.”\n\nIn Trump’s second term, this reads less like an indictment of Orbán’s transgressions than a description of the president’s evident aspirations.  Still, Rubio on Monday made clear to Hungarian voters where he and Trump stand. “It’s in our national interest — especially as long as you’re the prime minister and the leader of this country — it’s in our national interest that Hungary be successful.”\n\nOn a trip that also featured a stop in Slovakia, which is led by another Trump-friendly government, Rubio did not just offer Orbán moral support. He also dangled the promise of US financial aid to convince voters their well-being depends on a prime minister who is a vehement internal critic of the European Union.\n\n“If you face financial struggles, if you face things that are impediments to growth, if you face things that threaten the stability of your country, I know that President Trump will be very interested because of your relationship with him and because of the importance of this country to us, to finding ways to provide assistance if that moment ever were to arise,” Rubio said.\n\nTrump has tried this before, and it worked. He used America’s economic power to warn voters in Argentina that a$20 billion economic bailoutwas contingent on his friend Argentine President and MAGA hero Javier Milei’s party remaining in power. “If he doesn’t win, we’re gone,” Trump said.\n\nThe US president has used his power in other ways to shift politics in foreign nations — including with his ouster of Maduro last month and his assumption of control overVenezuela’s vast oil reserves.\n\nLast year, he strongly backedNasry Asfura, the winner of the Honduran presidential election. He also wielded his pardon power to freeformer President Juan Orlando Hernándezfrom a 45-year drug trafficking sentence in the US, a move that was widely seen as an attempt to sway voters.\n\nLast week, he escalated his campaign for the lifting of the criminal threat over his friend Israeli Prime Minister Benjamin Netanyahu. In an extraordinary outburst,Trump lambasted President Isaac Herzogas “disgraceful” for not granting a pardon. “I think the people of Israel should really shame him,” Trump said in a stunning intervention into another country’s judicial process.\n\nThis was not the first time he’d pulled such a move. Last year, he slapped a50% tariff on Brazilian importsover the criminal prosecution of his friend and former President Jair Bolsonaro for an alleged coup.\n\nAnd the world is currently braced to see whether Trump will follow through on threats to bomb Iran as he builds up US forces while simultaneously seekinga new nuclear and missile deal. He had previously warned that the US was “locked and loaded” if Iran continued with a brutal crackdown on protesters. But a deal or military attacks that stopped short of the risky and legally questionable goal of regime change wouldleave demonstrators exposed.\n\nTrump’s supporters might rightfully argue Washington has always played politics abroad after launching foreign wars in Vietnam, Iraq and Afghanistan and starting coups and covert action across the Western Hemisphere and Middle East.\n\nBut the administration’s Europe policy is notable for openly siding with forces that could erode democratic standards and freedoms and that openly trade in racial politics and invoke a continent’s bloody past of rampant nationalism. Washington has traditionally seen European democracy as a great foreign policy triumph, having rebuilt the continent after liberating it from the Nazis. Trump has turned that victory and the subsequent one in the Cold War on its head.\n\nWithin living memory, American secretaries of state stood with dissidents against strongmen in Eastern Europe. In Budapest, Rubio did the opposite.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/president-donald-trump-47",
      "text": "Donald Trump"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/viktor-orban-eu-hungary-election-intl",
      "text": "April’s general election"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/business/hungary-russia-oil-orban-intl",
      "text": "Rubio’s visit to Orbán"
    },
    {
      "url": "https://www.cnn.com/2026/02/14/europe/marco-rubio-europe-partnership-munich-intl",
      "text": "Munich Security Conference"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/when-trump-makes-election-threats",
      "text": "midterm elections"
    },
    {
      "url": "https://www.cnn.com/2025/12/05/politics/trump-national-security-strategy",
      "text": "new US national security strategy"
    },
    {
      "url": "https://www.cnn.com/2025/02/14/europe/jd-vance-munich-speech-europe-voters-intl",
      "text": "Vice President JD Vance"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/europe/rubio-speech-us-europe-relations-latam-intl",
      "text": "Rubio delivered a similar message"
    },
    {
      "url": "https://www.cnn.com/polling/approval/trump-cnn-poll-of-polls",
      "text": "below 40%"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/politics/house-control-districts-vis",
      "text": "a midterm election rout"
    },
    {
      "url": "https://www.cnn.com/2025/10/14/politics/javier-milei-president-trump-argentina",
      "text": "$20 billion economic bailout"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/americas/venezuela-oil-wright-rodriguez-latam-intl",
      "text": "Venezuela’s vast oil reserves"
    },
    {
      "url": "https://www.cnn.com/2025/12/24/americas/honduras-presidential-election-results-latam-intl",
      "text": "Nasry Asfura"
    },
    {
      "url": "https://www.cnn.com/2025/12/02/politics/juan-orlando-hernandez-pardon",
      "text": "former President Juan Orlando Hernández"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/middleeast/netanyahu-trump-israel-elections-meeting-intl",
      "text": "Trump lambasted President Isaac Herzog"
    },
    {
      "url": "https://www.cnn.com/2025/07/30/politics/brazil-tariff-trump-executive-order",
      "text": "50% tariff on Brazilian imports"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/us-iran-military-buildup-pressure",
      "text": "a new nuclear and missile deal"
    },
    {
      "url": "https://www.cnn.com/2026/02/06/politics/iran-us-negotiations-trump-analysis",
      "text": "leave demonstrators exposed"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/politics/rubio-munich-trump-orban-hungary-analysis",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/politics/rubio-munich-trump-orban-hungary-analysis",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f4fbfc2f9b2bec36370d57b3aa4eff72785b33d3088d6ded4d6924ed90a8796c",
  "scraped_at": "2026-02-17T07:29:49.603920+00:00"
}