{
  "url": "https://lite.cnn.com/2026/02/12/asia/indonesia-freeways-fighter-jet-runways-intl-hnk-ml",
  "title": "Freeways as runways: Indonesia plans to turn its islands into cheaper ‘aircraft carriers’ | CNN",
  "date": "2026-02-12T21:30:24.378275+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nIndonesia is embarking on a plan to make toll roads across the country into emergency runways for its fighter jets, giving it the equivalent of multiple aircraft carriers across the vast archipelago.\n\nThe chief of staff of the Indonesian air forces, Marshal Tonny Harjono, said Wednesday that he hopes that eventually each of the country’s 38 provinces will have at least one toll road section usable as an emergency runway, though no timeline was given.\n\nIn a demonstration Wednesday, an Indonesian Air Force F-16 fighter and a Super Tucano attack plane performed successful landings and takeoffs from a toll road in Lampung province on the southern tip of the island of Sumatra.\n\n“This success marks an important milestone in strengthening the universal defense system,” Deputy Defense Minister Donny Ermawan Taufanto said.\n\nUsing highways for military landing strips isn’t a new concept. Militaries from the United States, Finland and Sweden among others have demonstrated it.\n\nAnd dispersing fighter jets across an array of islands in the Pacific is something the US military is pursuing as it looks to make its air forces harder to target in any possible conflict with China.\n\nIndonesia has had disputes with China in the South China Sea, but the new plan for runways on roadways isn’t seen as any being directed at any country.\n\n“The use of toll roads as situational alternative runways is expected to strengthen the operational readiness of the Indonesian Air Force in facing various potential threats, without reducing the primary function of toll roads as public transportation infrastructure,” an Indonesian Air Force statement said.\n\nIt’s also a cost-effective way to cover a sprawling country, analysts say.\n\nIndonesia is the world’s largest archipelago, with more than 6,000 inhabited islands across an east-west axis of 3,100 miles (5,000 kilometers).\n\nIt would be an extraordinary amount of territory to cover with an aircraft carrier, something the Indonesian Navy does not have, and which would be expensive to acquire and maintain.\n\nAircraft carriers can cost billions of dollars.\n\n“An aircraft carrier doesn’t seem that attractive as a cost-effective platform,” said Collin Koh, research fellow at the S. Rajaratnam School of International Studies in Singapore.\n\n“Having countless toll roads and highways earmarked as emergency military runways across the entire archipelago makes more strategic and operational sense,” Koh said.\n\n“The margin of risk is lower than an aircraft carrier,” Koh told CNN. “If you strike the aircraft carrier once, it’s gone.”\n\nMultiple roads-as-runways mean the loss of one leaves several others to pick up the slack, he said.\n\nRoadways can handle more and less-expensive aircraft than are needed for carrier operations.\n\nThe planes used in Wednesday’s demonstrations, the F-16 and the Super Tucano, cannot operate off carriers.\n\nHarjono, the air force chief of staff, said the plan was for roadways to have 3,000-meter-long (almost two miles) sections where the military aircraft could land and take off.\n\nDonny praised the skill of the Indonesian pilots for landing on roadways only half as wide as airport runways.\n\n“Toll roads are only about 24 meters (79 feet) wide, narrower than airport runways at 45 to 60 meters. It’s risky, but Air Force pilots are trained for these conditions,” he said, according to the government-run Antara news agency.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/asia/indonesia-freeways-fighter-jet-runways-intl-hnk-ml",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/asia/indonesia-freeways-fighter-jet-runways-intl-hnk-ml",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f5f5e6cbbeb9b35e2db0a6d713f073d925c8d031f31232968474a2ee392a2435",
  "scraped_at": "2026-02-12T21:30:24.378288+00:00"
}