{
  "url": "https://lite.cnn.com/2026/01/22/health/colon-cancer-young-adult-deaths",
  "title": "Colon cancer is now the deadliest cancer for young adults, new study says | CNN",
  "date": "2026-02-12T21:31:06.906113+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nJenna Scott remembers the joy of being pregnant with her first and only child. She also remembers the immense abdominal pain.\n\nDuring her pregnancy, she let her doctors know about the persistent discomfort. She was told it was normal, that the aches “came with the territory,” she said.\n\nBut after she delivered a healthy baby boy, the pain didn’t fade. It lingered.\n\nMore than a year later, Scott received a diagnosis that shook her sense of normalcy: stage 4 colon cancer. She was 31 years old at the time.\n\n“We did a colonoscopy and when I woke up, there was my husband, my doctor and four nurses in the room. The GI doctor said he didn’t need to send anything off to pathology to know that I had cancer,” Scott, now 39, said in an email.\n\nStage 4 cancer, also known as metastatic cancer, means the cancer has spread from its original location to other parts of the body. For Scott, she said the disease spread from her colon to her liver.\n\n“I’ve always been super fit and healthy. I’ve been an athlete all my life. I didn’t even grow up eating red meat. In an instant, my life changed completely and unexpectedly,” she said. “I was in a state of disbelief because that word ‘cancer’ didn’t live in my world. Cancer means death.”\n\nIn a concerning trend, colorectal cancer now appears to be the deadliest cancer for young adults.\n\nColorectal cancer has surpassed other cancer types to become the leading cause of cancer deaths among people under 50 in the United States, as of 2023, according tonew researchpublished in January in the medical journal JAMA.\n\nDeaths from colon and rectal cancers in the under-50 age group rose by 1.1% annually since 2005, the research found. Because of this rise, colorectal cancer went from being the fifth most common cause of cancer deaths among people younger than 50 in the early 1990s to becoming the top cause in 2023.\n\n“We don’t know why it is increasing,” said Dr. Ahmedin Jemal, senior vice president of surveillance, prevention and health services research at the American Cancer Society and senior author of the new study.\n\n“Mortality for the other major causes of cancer deaths in young adults under 50 is declining. It is only colorectal cancer mortality that is increasing, but we really don’t know fully what contributes to this rising burden,” he said.\n\nScott, an advocate for the nonprofit Colorectal Cancer Alliance, also finds the new research troubling.\n\nAfter years of treatment – which included chemotherapy medications, targeted therapy and surgery – she is now in stable condition, but she said that she must “continue chemotherapy and targeted therapy indefinitely,” because each time she has stopped treatment before, the cancer came back and spread further to other organs in her body.\n\nAs she now continues treatment, Scott said that her goal is to “become a grandmother one day.”\n\nFor the new research, Jemal and his colleagues at the American Cancer society analyzed the annual numbers and rates of cancer deaths among people under 50 in the United States from 1990 through 2023, based on data from the US Centers for Disease Control and Prevention’s National Center for Health Statistics.\n\n“It’s the most complete data we have,” Jemal said.\n\nThe researchers examined the five leading causes of cancer death among the under-50 age group. They found that overall, from 1990 through 2023, more than 1.2 million people died of cancer in the United States before age 50, and the death rate fell by 44% during that time.\n\nThe data also showed that deaths decreased for every leading cancer type, except for colorectal cancer.\n\nAmong the five leading causes of cancer death in people under 50, the average annual decline in deaths from 2014 through 2023 was 0.3% for brain cancer, 1.4% for breast cancer, 2.3% for leukemia and 5.7% for lung cancer, according to the data.\n\nThe research findings suggest that as of 2023, the top five causes of cancer deaths among people younger than 50 in the United States were:\n\n“We weren’t expecting colorectal cancer to rise to this level so quickly, but now it is clear that this can no longer be called an old person’s disease,” Jemal said in a news release.\n\n“We must double down on research to pinpoint what is driving this tsunami of cancer in generations born since 1950,” he added.“In the meantime, people 45-49 years make up fifty percent of diagnoses under 50, so increased screening uptake will prevent disease as well as death.”\n\nAs a young adult with colorectal cancer, Scott said that the research findings were “pretty disturbing” for her.\n\n“What has to happen to draw more awareness to this disease and the people who are mostly being affected by it today? Why are seemingly healthy adults and children continuing to die from this disease? Why are women becoming more and more affected? How do you prevent something when you nor your team of doctors know how you got it in the first place?” Scott said in the email. “We have to stop this increase in mortality.”\n\nThere are nearly 60 new colorectal cancer cases diagnosed in people under 50 each day in the United States, according to theColorectal Cancer Alliance— that’s a diagnosis about every 25 minutes.\n\nThe new research is an important reminder for people under 50 to stay up-to-date on their cancer screenings, Jemal said. It’s recommended for people at average risk of colorectal cancer tostart regular screening at age 45.\n\nYet “only 37% of adults ages 45 to 49 are up-to-date for their colorectal cancer screening,” Jemal said.\n\n“Colorectal cancer screening can not only detect cancer at the early stage, but also it removes the polyps before it becomes cancer,” he said. “So, it’s one of the two screening types that we have that not only detects cancer at early stage but also prevents it, the other being cervical cancer screening.”\n\nThe new research is “timely” and highlights a “red flag,” said Dr. Y. Nancy You, professor at the University of Texas MD Anderson Cancer Center and director of its Young-onset Colorectal Cancer Program, who was not involved in the new paper.\n\nBut while screening for colorectal cancer among healthy younger adults with no symptoms is critically important, “that’s only part of the story. I think there is a tremendous gap – and opportunity – in expeditiously diagnosing and treating people who are already symptomatic,” You said.\n\nCommonsymptoms of colorectal cancerinclude:\n\n“There is an unmeasurable group of young adults who have symptoms that may be consistent with colorectal cancer, but either sit on the symptoms because they are busy or are scared, or eventually access their health care system but encounter a provider who thinks it’s just a hemorrhoid and doesn’t trigger further investigations,” You said, referring to when patients’ symptoms sometimes get dismissed by their providers.\n\n“So, there are definitely delays in diagnosing young adults who are already symptomatic.”\n\nWhen there are delays in diagnosing cancer, it becomes more likely that the disease will be diagnosed at later stages, such as stage 3 or 4. When cancer is at an advanced stage, it may have spread beyond the tumor itself into surrounding regions or other parts in the body, making it more difficult to treat and the patient becomes less likely to survive, regardless of age.\n\nThat’s why the increase in colorectal cancer deaths appears to be happening at a time when more people under 50 are being diagnosed with advanced-stage disease, said Dr. Andrea Cercek, a gastrointestinal medical oncologist at Memorial Sloan Kettering Cancer Center, who was not involved in the new research.\n\nFor colorectal cancer, “those under 45 are not screened, so they’re not diagnosed until they have symptoms. In many of those, about three-fourths, those symptoms are actually because they have much more advanced disease, and then the outcomes are worse, regardless of their age,” Cercek said, adding that the new research highlights a greater need to diagnose young patients quickly and not dismiss their symptoms because of age.\n\nIt’s estimated thatmore than 60%of colorectal cancer patients under 50 are diagnosed after the disease has already advanced to stage 3 or 4.\n\n“In this younger group, when we do see later stage of diagnosis, that is highly associated with lower survival,” said Christine Molmenti, an associate professor and cancer epidemiologist at Northwell Health in New York, who was not involved in the new research.\n\n“I’ve met a lot of patients under 50 with this disease, and I think it is very heartbreaking,” she said. “Anecdotally, what we see a lot of times is that these patients are healthy. They’re fit. Sometimes they’re athletes. There were a couple of patients who had not survived the disease, but their parents told us that they ran a marathon four months before their stage 4 colon cancer diagnosis. And often times young people ignore symptoms, or their symptoms are dismissed. So, I think there needs to be awareness.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://jamanetwork.com/journals/jama/fullarticle/10.1001/jama.2025.25467?guestAccessKey=5eabd609-08b0-47c7-a738-916c7acdcc37&utm_source=For_The_Media&utm_medium=referral&utm_campaign=ftm_links&utm_content=tfl&utm_term=012226",
      "text": "new research"
    },
    {
      "url": "https://colorectalcancer.org/basics/facts-and-statistics#:~:text=Colorectal%20cancer%20is%20the%20fourth%20most%20common%20cancer%20in,among%20men%20and%20women%20combined.&text=Each%20year%2C%20about%20150%2C000%20Americans%20are%20diagnosed%20with%20colorectal%20cancer.&text=More%20than%2050%2C000%20people%20will%20die%20from%20colorectal%20cancer%20this%20year.&text=One%20in%2024%20people%20will,colorectal%20cancer%20in%20their%20lifetime.",
      "text": "Colorectal Cancer Alliance"
    },
    {
      "url": "https://www.cdc.gov/colorectal-cancer/screening/index.html",
      "text": "start regular screening at age 45"
    },
    {
      "url": "https://www.cancer.org/cancer/types/colon-rectal-cancer/detection-diagnosis-staging/signs-and-symptoms.html",
      "text": "symptoms of colorectal cancer"
    },
    {
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC7423740/",
      "text": "more than 60%"
    },
    {
      "url": "https://www.cnn.com/2026/01/22/health/colon-cancer-young-adult-deaths",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/01/22/health/colon-cancer-young-adult-deaths",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f67061588f4e89f493812b23ba74d19d8fd6f237641bcca918e4aa7dfdd2de41",
  "scraped_at": "2026-02-12T21:31:06.906127+00:00"
}