{
  "url": "https://lite.cnn.com/2026/02/16/politics/republican-election-officials-trump-voter-roll",
  "title": "Even Republican election officials are balking at Trump Justice Department’s voter roll crusade | CNN Politics",
  "date": "2026-02-17T07:30:06.188330+00:00",
  "authors": [
    "Tierney Sneed, CNN"
  ],
  "text": "Source: CNN\n\nAs the Trump administrationhas sued25 mostly Democratic state election chiefs for their voter rolls, it has also encountered quieter resistance from Republican officials who have balked at the Justice Department’s demands for confidential voter registration information.\n\nAt least a half-dozen Republican-led state election offices have declined the Justice Department’s request for non-public voter data, which can include a voter’s Social Security number, driver license ID number or current residence, according to interviews, local media reporting and records obtained by CNN and by the Brennan Center, a left-leaning think tank that researches election issues.\n\n“They can have the voter rolls. They’re gonna pay for it like everybody else,” West Virginia Secretary of State Kris Warner told CNN last month, referring to the public list that can be purchased in his state for $500. “They’re not going to get our personal information.”\n\nSeveral other Republican election administrators have provided the sensitive data but refused to sign an agreement proposed by the Trump administration that would require them to remove voters deemed ineligible by the Justice Department.\n\nIn interviews with CNN about the department’s voter data quest, GOP election officials expressed concerns about the administration’s approach even though they’re aligned with the president on other matters of election security. They said the requests conflicted with state laws prohibiting the disclosure of sensitive voter information. They questioned the reasons the administration was seeking the data. And they bristled at the idea of the federal government — rather than state or local officials — leading the task of removing ineligible voters from the rolls.\n\nThe Justice Department declined to comment.\n\nThe voter data crusade is one of several ways the Trump administration is trying to insert itself more directly into election-related tasks carried out by states.\n\nTrump has not let go of his unfounded fixation on mass voter fraud. He hascalled on Republicansto nationalize elections, installed fellow 2020 election deniers in the executive branch who are leading reviews of voting infrastructure, and the FBIrecently seized 2020 ballotsfrom Fulton County, Georgia.\n\nRepublicans’ objections to the department’s voter data project came to head at a mid-December meeting between GOP state election officials and Assistant Attorney General Harmeet Dhillon, the civil rights chief at DOJ who has been spearheading the data demands. DOJ officials rebuffed calls for adjustments to its plans for the voter information.\n\nAmong the biggest sticking points was a requirement in an agreement the DOJ proposed to govern the data production that would give states just 45 days to fix issues the administration identified in their voter rolls, according to Mississippi Secretary of State Michael Watson, who ultimately handed over the data but refused to sign the agreement.\n\n“We were adamant on the idea that maintaining voter rolls should be done on the state level,” Watson, who is also president of the National Association of Secretaries of State, told CNN.\n\nDhillon, in public remarks, has been dismissive of the state officials’ concerns.\n\n“Some of the goofy responses that I have gotten from secretaries of state have included, ‘Oh, my goodness, this is highly confidential Social Security information. We can’t possibly give that to the federal government,’” Dhillonrecently toldthe conservative journalist John Solomon. “That’s just silly because the federal government of course issues the Social Security numbers, and people routinely give it out on a daily basis when they go to the doctor or the DMV … that’s very silly.”\n\nDuring the February 2 appearance on Solomon’s show, Dhillon hinted that more lawsuits would be filed within one to two weeks against the recalcitrant states. No new voter roll cases have been filed since mid-January.\n\nElection officials have pointed to state privacy laws in explaining why they cannot turn over their voters’ personal information.\n\n“If we could legally comply, we would promptly do so,” Oklahoma State Election Board Secretary Paul Ziriaxsaid in a letterto the Department this month, first reported by Oklahoma News 4 and obtained by CNN. Inthe lawsuitsthat Dhillon brought to obtain the data, some judges have already rejected DOJ arguments that the federal laws the department is relying on trump those state privacy protections.\n\nMissouri Secretary of State Denny Hoskins, citing state privacy laws, told his state’s legislature this month that he did not intend to produce the data absent a court order.\n\nAlongside the legal questions about whether the department is entitled to the data are questions about its stated intentions for obtaining it. Dhillon has said the department wants to help the states “clean” their rolls, andaccording to a letterWarner sent the department Wednesday, the DOJ verbally communicated to his office that it wants to compare the states’ list with a federal system of immigrant data known the Systematic Alien Verification for Entitlements program.\n\nStates already have the option to voluntarily use the SAVE system to review their rolls for potential noncitizens, and many Republican officials have praised the administration for making the tool easier to use. But still, those comparisons have been rife with false positives,CNN previously reported, with naturalized citizens often wrongly identified as ineligible voters because the federal data is outdated.\n\nThat reality — along with the Constitution’s broader vision of elections being run at the state level — has made the 45-day removal requirement in the proposed agreement especially problematic for election officials.\n\n“You can’t expect to send me a 45-day window to get this done or else,” Watson told CNN, noting that in Mississippi, removals aren’t done by state officials but by county clerks. “We are going to go by Mississippi law and we are going to make sure our voter rolls clean.”\n\nOther election officials were wary that the administration might use the data for other purposes and have wondered whether the stated goal — compliance with the National Voter Registration Act mandate of “reasonable efforts” to remove voters who have died or moved — is just a pretext. The Kentucky State Board of Electionsasked the department in Augustto explain why it needed the data, in a letter that said the board was “unclear as to how providing Kentuckians’ driver’s license numbers to DOJ furthers the agency’s stated goal.”\n\n“They don’t need the driver’s license, Social Security number and date of birth to make sure that we’re making a reasonable effort at maintaining our voter rolls,” a Republican elections official in another state told CNN.\n\nThe official, who asked for anonymity to avoid drawing the White House’s ire, floated the possibility that the data would be used for immigration enforcement or as a “cudgel” to cast doubt on the midterms if they went badly for Republicans.\n\n“If states don’t give this information and then Republicans lose and they can go back and say, ‘See, it’s because they didn’t give us this information, so they cheated and all these illegal people that shouldn’t have been voting voted,’” the official said.\n\nInitially, state officials received letters from the Justice Department seeking information last spring and summer about their list maintenance practices and data from their rolls. Many provided the publicly available information, but as summer turned into fall, follow-up letters made clear that the department was demanding the confidential data as well.\n\nA handful of Republican-led states complied without objection, but as other officials raised privacy concerns, the administration drafted the Memorandum of Understanding that promised compliance with federal privacy law while laying out the list review process that would be driven by the feds.\n\nWhen the letters landed in election office inboxes in December, the DOJ gave states just seven days to respond and followed up with both emails and phone calls.\n\n“If do not hear anything end of day today, the DOJ will take that as refusal to comply,” Eric Neff, now the head of the department’s voting section, told Montana Secretary of State Christi Jacobsen on the day of the DOJ’s deadline, accordingto an emailobtained by the Brennan Center.\n\nAs it was ramping up pressure on Republicans, the Justice Department was rolling out new rounds of lawsuits against Democratic state officials for noncompliance.\n\n“You may have seen in the news that we have sued six states earlier this week for refusing to provide their voter registration lists,” another DOJ lawyer said in a December 4voicemail leftwith an official in the Idaho secretary of state’s office that was obtained by Idaho Capital Sun.\n\n“And we’re preparing additional lawsuits. I’d like to keep everyone out of that as much as possible. But I haven’t heard anything back from you all,” the DOJ attorney, who has since left the department, said.\n\nOnly two states — Alaska and Texas — have signed the memorandum, according to DOJ correspondence obtained by CNN, while about a dozen more are turning it over without entering the agreement, officials have said in court proceedings.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/politics/voter-rolls-lawsuits-civil-rights-act",
      "text": "has sued"
    },
    {
      "url": "https://www.cnn.com/2026/02/03/politics/trump-calls-on-republicans-to-nationalize-future-elections",
      "text": "called on Republicans"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/politics/2020-election-deniers-fbi-fulton-county-ballots-warrant",
      "text": "recently seized 2020 ballots"
    },
    {
      "url": "https://justthenews.com/videos/watch-just-news-no-noise-rep-tom-barrett-and-asst-ag-harmeet-dhillon?utm_source=mux&utm_medium=social-media&utm_campaign=social-media-autopost",
      "text": "recently told"
    },
    {
      "url": "https://www.documentcloud.org/documents/27008795-oklahoma-letter/",
      "text": "said in a letter"
    },
    {
      "url": "https://www.cnn.com/2026/01/14/politics/voter-rolls-lawsuits-civil-rights-act",
      "text": "the lawsuits"
    },
    {
      "url": "https://files.constantcontact.com/e949222d701/ed164568-7c31-48e6-a03f-89f082080313.pdf",
      "text": "according to a letter"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/trump-voter-roll-audit-push",
      "text": "CNN previously reported"
    },
    {
      "url": "https://www.documentcloud.org/documents/27008794-kentucky-state-board-of-elections-letter/",
      "text": "asked the department in August"
    },
    {
      "url": "https://www.brennancenter.org/media/15115/download/montana_12.09.2025_state-email-copy.pdf?inline=1",
      "text": "to an email"
    },
    {
      "url": "https://idahocapitalsun.com/2026/01/09/us-justice-department-wants-idahos-identifiable-voter-roll-public-records-show/",
      "text": "voicemail left"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/republican-election-officials-trump-voter-roll",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/politics/republican-election-officials-trump-voter-roll",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f6a288374038c7dc27143eac6491217c28d91d807c3e80a76808f3dce43e3f5d",
  "scraped_at": "2026-02-17T07:30:06.188342+00:00"
}