{
  "url": "https://lite.cnn.com/2026/02/25/americas/enrique-marquez-venezuela-political-prisoner-sotu-intl-hnk",
  "title": "Enrique Márquez: Freed Venezuelan political prisoner reunites with niece at State of the Union address | CNN",
  "date": "2026-02-26T07:32:18.563177+00:00",
  "authors": [
    "Alejandra Jaramillo",
    "Lex Harvey",
    "Rocio Munoz"
  ],
  "text": "Source: CNN\n\nA Venezuelan opposition leader recently freed from prison reunited with his niece Tuesday during theState of the Union address,as President Donald Trump touted theUS military operation that removed President Nicolás Maduro.\n\nIn his speech, Trump drew attention to Alejandra Gonzalez, who was in the audience, saying she shared a special bond with her uncle Enrique Márquez.\n\n“Alejandra, I’m pleased to inform you that not only has your uncle been released, but he is here tonight,” Trump announced, before Enrique Márquez walked into the House chamber where he embraced her as lawmakers applauded.\n\nThe heartwarming and surprise reunion came against the backdrop of major political changes in Venezuela following Maduro’s ouster on January 3. Since then, the US has put pressure on acting Venezuelan President Delcy Rodríguez, Maduro’s former deputy, to release hundreds of political prisoners jailed during almost three decades of authoritarian rule.\n\nMárquez, a 2024 presidential candidate for a centrist party, was among the first to walk free last month. He had been held in the notorious El Helicode prison since his arrest in January 2025. He was accused of being involved in an attempted coup after he questioned Maduro’s victory in the election.\n\n“Alejandra feared she would never see her uncle again,” Trump said.\n\n“Since the raid we have worked with the new leadership and they have ordered the closure of that vile prison and released hundreds of political prisoners already, with more to come.”\n\nTrump, who largely focused on domestic issues during his speech, called Venezuela a “new friend,” and a “partner.”\n\nVenezuela has released more than 400 political prisoners since the US dramatically removed Maduro, according to the country’s leading human rights organization Foro Penal.\n\nHundreds of political prisoners are still locked up, according to human rights groups, and many of those released so far have faced restrictions and conditions such as travel bans, periodic court appearances and gag orders.\n\nLast week, Venezuelan lawmakerspassed a new billgranting amnesty to people who were prosecuted or convicted for political reasons, paving the way for hundreds more releases.\n\nAfter signing the law, Rodríguez described it as “an extraordinary door for Venezuela to reunite, for Venezuela to learn to coexist democratically and peacefully, for Venezuela to rid itself of hatred, of intolerance, let it open up to human rights.”\n\nNational Assembly President Jorge Rodriguez said Venezuelan authorities had received more than 1,500 requests for amnesty by Saturday.\n\nDuring his Washington address on Tuesday, Trump awarded US helicopter pilot Chief Warrant Officer 5 Eric Slover a Medal of Honor for his involvement in the operation to capture Maduro.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/politics/takeaways-donald-trump-state-of-the-union-address",
      "text": "State of the Union address,"
    },
    {
      "url": "https://xn--alejandra%20feared%20she%20would%20never%20see%20her%20uncle%20again,%20trump%20said%20tuesday-9s14dze.xn--%20since%20the%20raid%20we%20have%20worked%20with%20the%20new%20leadership%20and%20they%20have%20ordered%20the%20closure%20of%20that%20vile%20prison%20and%20released%20hundreds%20of%20political%20prisoners%20already,%20with%20more%20to%20come-yg91n.xn--ivg/",
      "text": "US military operation that removed President Nicolás Maduro"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/americas/venezuela-political-prisoners-amnesty-law-latam-intl",
      "text": "passed a new bill"
    }
  ],
  "hash": "f6a36732b8345829404d3138a010fb2956751f920c4c836b2b893391019b25c1",
  "scraped_at": "2026-02-26T07:32:18.563188+00:00"
}