{
  "url": "https://lite.cnn.com/2026/02/12/science/solar-storm-richard-carrington-photo",
  "title": "Lost portrait surfaced of 19th century astronomer who changed the understanding of solar storms | CNN",
  "date": "2026-02-12T21:29:39.803152+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nWhen solar storms erupt from the sun and reach Earth, their intensity is measured against a historical benchmark: the Carrington Event. Now, a portrait of 19th century British solar astronomer Richard Carrington has been discovered — providing, at long last, an image of the man for whom the event was named.\n\nOn September 1, 1859, powerful electric current surges delivered electric shocks to operators in telegraph stations and even sparked fires in their offices. Some telegraph machines received messages that didn’t make sense, while others sent messages despite not being plugged in, according to theNational Oceanic and Atmospheric Administration.\n\nIncredibly bright auroras, typically seen in northern climes such as Norway and Alaska, danced across the sky as far south as Panama.\n\nThe event remains the most intense geomagnetic storm — a major disturbance of Earth’s magnetic field due to solar activity — ever recorded.\n\nAt the time, the effects of solar activity on Earth, called space weather, were not known.\n\nCarrington had observed a large solar flare erupt from the sun the day before — the first solar flare ever witnessed and recorded. He spotted the bright flare while using a telescope to project the sun’s image onto a screen.\n\nAlthough colleague Richard Hodgson also observed the flare, Carrington made what is considered the first direct link between solar and geomagnetic activity — the flare and the ensuing storm that arrived on Earth 17 hours later, said Mark Miesch, a research scientist at NOAA’s Space Weather Prediction Center.\n\n“That link later gave birth to the science of space weather,” Miesch said. “Richard Carrington witnessed the awesome power of the sun like nobody else before or since.”\n\nDespite his major contributions to solar physics, Carrington is not well-known, and researchers suspect that’s partly because there hasn’t been a face to go with his name.\n\nNow, the detective work of Kate Bond, an assistant archivist at the Royal Astronomical Society in London, has uncovered the first and perhaps only known photograph of Carrington 150 years after his death.\n\nThe Royal Astronomical Society archives contain Carrington’s original observations of sunspots from 1853 to 1861, which are some of the most requested for viewing because they contain his drawing of the 1859 solar flare.\n\nBut researchers wanting to see a photo of Carrington have been out of luck because none was on record, Bond said.\n\nBond became interested in Carrington after reading Stuart Clark’s “The Sun Kings.” In the book, Clark mentions that he wished he could see a portrait of Carrington. A2021 research paperauthored by Royal Astronomical Society fellows also mentioned the hunt for the astronomer’s picture.\n\nEven online searches didn’t turn up a likeness — except for an erroneous photo belonging to British mathematician Lord Kelvin taken around 1900, more than two decades after Carrington’s death.\n\nBond and Hisashi Hayakawa, assistant professor at Nagoya University’s Institute for Space-Earth Environmental Research in Japan, discussed what a lost Carrington portrait might look like during Hayakawa’s visit to the society’s library for separate research in June.\n\nLike other scientists at the time, Carrington was a member of the Literary and Scientific Portrait Club, Bond said. And all members were required to have a portrait taken at the Maull & Polyblank studio in London. The club operated between 1854 and 1865 when photography was in its infancy.\n\nThe National Portrait Gallery has a list of club members, which includes Carrington’s name as well as his title from 1857 to 1862 — secretary of the Royal Astronomical Society, Bond said.\n\nThe 2021 research paper also referenced an invitation letter sent to George Airy, the Astronomer Royal, to join the portrait club. Ten club members who had already had their photos taken signed the letter, including Carrington.\n\nHowever, exhaustive searches across museums and archives, including the UK’s National Portrait Gallery and the Royal Society, as well as the Getty Museum in Los Angeles and an impressive collection of Maull & Polyblank photos at the Harry Ransom Center in Austin, Texas, turned up nothing.\n\nDuring her conversation with Hayakawa, Bond decided to look up the frequency of sales of Maull & Polyblank photos or albums on auction sites. As a joke, she turned to eBay.\n\n“Up popped a photographic shop in the USA selling a group of these photographs and one of them had ‘the late Carrington’ written on it in pencil on the mount,” Bond said in a statement. “The seller simply listed it as ‘Photo of Mr Carrington’, but with no biographical detail. I couldn’t believe it.”\n\nStaring back at her was the photo of a young man, about 30 years old — the age Carrington would have been in 1856 when the portrait was taken. Next to the mention of Carrington on the photo  were the letters FRS, short for Fellow of the Royal Society.\n\nThe photo also matched the dimensions of all other photos associated with the portrait club.\n\nAfter ruminating all afternoon, Bond bought the photo that night, worried the opportunity might slip away.\n\nThe seller, Bruce Klein, had purchased an album of Maull & Polyblank photos from an auction in the early 2000s while searching for a specific photograph for his collection and decided to put the rest up for sale.\n\nBut more detective work was needed to confirm that it was indeed Carrington in the photo. The inscription of “the late Carrington” was concerning because it was written after his death in 1875, which means anyone could have added it, even if they didn’t know what the astronomer looked like.\n\nWhen the photo arrived, Bond spied what she calls the smoking gun, something that wasn’t visible online.\n\n“When I had the photograph in my hands, I could see some very faint writing on the image itself,” she said in a statement. “I couldn’t read it: it was completely unintelligible. When we put it on a light box it became clearer, but it was back to front.”\n\nBond took the photo to the John Rylands Library’s photographic department in Manchester, England, to ask if the writing was an inscription on the back of the print, or if it was smudged writing from a letter that had imprinted onto the photo.\n\nThe experts at the library concluded that it was an inscription on the back of the print that had been made before it was mounted.\n\n“This matters because it says: ‘R C Carrington, Esquire for C V Walker, Esquire,’” Bond said.\n\nCharles Vincent Walker nominated Carrington to be a Fellow of the Royal Society, and the two were friends who attended Royal Astronomical Society Dining Club events together. Walker was also a member of the Photographic Club, and the inscription suggests that he owned the photo at some point.\n\n“The mistake of the photographer’s assistant in writing on the back of the print — damaging what would have been an expensive photograph — made identification possible,” Bond said.\n\nNow, Walker’s keepsake of his friend has been added to theRoyal Astronomical Society’s archives. And Carrington’s photo already appears on his Wikipedia entry.\n\n“It is fitting that his photograph should also belong to the society — it feels like he is coming home,” Bond said. “The odds of this happening I cannot tell. I don’t know how many copies of this print exist. This could be the only one, but there is the possibility that there are others out there.”\n\nOver a nine-year period, Carrington made major discoveries about the sun — but the case of his missing image was unique among the most distinguished solar scientists of the last 400 years, said Dr. Ed Cliver, lead author of the 2021 paper and emeritus astronomer for the National Solar Observatory in Boulder, Colorado.\n\nCarrington was awarded a Royal Astronomical Society Gold Medal in 1859 for his catalog of circumpolar stars, or stars that never seem to dip below the horizon from certain viewpoints on Earth.\n\nIn 1857, Carrington presented Heinrich Schwabe with a gold medal for his discovery of the sun’s Schwabe Cycle of sunspots — otherwise known as thesolar cycle. The sun goes through an 11-year period of waxing and waning activity, which corresponds with sunspots and solar flares that occur on the sun’s surface.\n\nBut Carrington noticed that sunspots near the solar equator spin faster than those at higher latitudes, Miesch said. His observations were the first to suggest that the sun is more fluid than solid — specifically, plasma — with global currents that carry sunspots at different speeds based on latitude.\n\n“Carrington not only witnessed the awesome power of the sun; he saw deep into its very nature,” Miesch wrote in an email. “This image of Carrington, so delightfully acquired, shows the intensity of a scientist but there is boyish wonder there too. It reminds us that science is, and has always been, an intimately human endeavor.”\n\nAnd then there’s the event that bears his name. Solar storms such the Carrington Event happen about every 500 years, while those with half the intensity occur about every 50 years, according toNOAA.\n\nLyndsay Fletcher, one of the authors of the 2021 paper and a professor of astrophysics at Scotland’s University of Glasgow, called Bond’s discovery of the portrait an amazing stroke of luck and detective work.\n\nFor years, Fletcher has studied the sun’s so-called white-light flares that Carrington discovered.\n\n“I expect that Carrington would be astonished to know that 167 years later we still don’t fully understand their cause,” Fletcher said. “His paper about the observation is wonderfully written, with a lot of his personality coming through, and so it is quite something to now see the face of the dedicated and skillful scientist responsible.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.noaa.gov/heritage/stories/five-historically-huge-solar-events",
      "text": "National Oceanic and Atmospheric Administration"
    },
    {
      "url": "https://academic.oup.com/astrogeo/article/62/2/2.40/6173771?login=false",
      "text": "2021 research paper"
    },
    {
      "url": "https://academic.oup.com/astrogeo/article/67/1/1.11/8444359",
      "text": "Royal Astronomical Society’s archives"
    },
    {
      "url": "https://www.cnn.com/2023/07/14/world/solar-maximum-activity-2024-scn",
      "text": "solar cycle"
    },
    {
      "url": "https://www.nesdis.noaa.gov/about/k-12-education/space-weather/what-was-the-carrington-event",
      "text": "NOAA"
    },
    {
      "url": "https://www.cnn.com/2026/02/12/science/solar-storm-richard-carrington-photo",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/12/science/solar-storm-richard-carrington-photo",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f71cc67702e921689d7e2b11aa9856f4a2aad5c73b4f93501b73a957752296d3",
  "scraped_at": "2026-02-12T21:29:39.803165+00:00"
}