{
  "url": "https://lite.cnn.com/2026/02/27/tech/anthropic-pentagon-deadline",
  "title": "The clock is ticking down on a critical Pentagon deadline for Anthropic | CNN Business",
  "date": "2026-02-27T07:15:06.149886+00:00",
  "authors": [
    "Hadas Gold"
  ],
  "text": "Source: CNN\n\nAmerican AI companyAnthropic has until 5:01 pm ET to give in to the Pentagon’s demands or face being labeled a “supply chain risk,” a type of designation usually reserved for companies thought to be extensions of foreign adversaries.\n\nThe Pentagon, which uses Anthropic’s Claude AI system on its classified networks, wants to be able to use it for “all lawful purposes.” But Anthropic has two redlines for the Pentagon: that Claude will not be used in autonomous weapons, and that it will not be used in the mass surveillance of US citizens.\n\nAnthropic on Thursdayannouncedit has no intention of acquiescing.\n\n“Threats do not change our position: we cannot in good conscience accede to their request,” the company’s CEO said in a statement.\n\nThe Pentagon claims that it has no interest in using AI for either purpose and that it needs the freedom to use the technology it is licensing.\n\n“This is a simple, common-sense request that will prevent Anthropic from jeopardizing critical military operations and potentially putting our warfighters at risk,” Pentagon spokesperson Sean Parnell wrote on X. “We will not let ANY company dictate the terms regarding how we make operational decisions.”\n\nIt all came to a head on Tuesday at a high stakes meeting at the Pentagon between Defense Secretary Pete Hegseth and Anthropic CEO Dario Amodei.\n\nWhile a source familiar with the situation said the meeting was cordial, Pentagon officials did not just threaten to cancel Anthropic’s $200 million contract with them, but also a designation that could threaten their bottom line.\n\nAnthropic’s Claude was the first AI model to work on the military’s classified networks. The company struck a contract worth up to $200 million with the Pentagon last summer. Other major AI companies like OpenAI have only struck deals with the Pentagon on their unclassified networks.\n\nWithin Anthropic’s “acceptable use policy” in the contract are prohibitions against the use of Claude in mass surveillance and autonomous weapons.\n\n“This dispute comes at an awkward time because on the one hand, the user base within the Department of Defense loves Anthropic, loves Claude, and says that their restrictions on usage, at least from the conversations that I have been having, have never been triggered,” Gregory Allen, a senior advisor at the Center for Strategic and International Studies, said on Bloomberg Radio.\n\nBut the Pentagon doesn’t want to be constrained by a company’s policies. A Pentagon official told CNN: “You can’t lead tactical (operations) by exception,” and “legality is the Pentagon’s responsibility as the end user.”\n\nIn the Pentagon’s view, it doesn’t want to be in the middle of a national security situation, needing to ask a company for permission and guardrails to be dropped.\n\nCutting ties with Anthropic could be a headache for the Pentagon as well, considering they would need to replace any internal systems that use Claude. Though a Pentagon official said Elon Musk’s Grok AI system is “on board with being used in a classified setting,” Grok is not viewed as being as advanced as Claude.\n\nLosing a $200 million contract would not pose an existential threat for Anthropic, which was recently valued at around $380 billion. The bigger risk is that it gets labeled a supply chain risk, which means any company works with the US military would have to prove that they don’t touch anything related to Anthropic in their work with the Pentagon. Much of Anthropic’s success stems from its enterprise contracts with big companies – many of which may have contracts with the Pentagon.\n\n“It means that Anthropic’s existing customer base, some large portion of it might evaporate, either because they have government contracts or might want them in the future,” said Adam Connor, vice president for technology policy at theCenter for American Progress, a Washington think tank.\n\nJensen Huang, CEO of major AI chipmaker Nvidia, said that while he hopes the Pentagon and Anthropic can come to an agreement, “if it doesn’t get worked out, it’s also not the end of the world” since there are other AI companies the Pentagon can work with and Anthropic has other customers.\n\nEarlier this week, the Pentagon had said that it would also consider compelling Anthropic to work with them via the Defense Procurement Act, a 1950 law that “gives the president significant emergency authority to control domestic industries,” according to the Council on Foreign Relations. It’s not clear if or how the Pentagon would be able to both compel Anthropic to work with them via the DPA and deem them a supply chain risk.\n\nAnthropic isn’t the only company under threat from this dispute, said Connor. The Pentagon’s threat is a signal to other AI companies looking to make millions selling their services to the government.\n\n“I think in the broader sense, this sends a message to the other AI companies that they are negotiating with to make sure they do not attempt to put any sort of restrictions on AI’s uses,” said Connor.\n\nIf the Pentagon was simply unhappy with Anthropic’s conditions for its model, it could simply terminate the contract and get the AI model it wants from another company, said Alan Rozenshtein, a law professor at the University of Minnesota.\n\n“What the government really wants is it wants is to keep using Anthropic’s technology, and it’s just using every source of leverage possible,” he said. “This is a very powerful source of leverage.”\n\nThe Pentagon has said if Anthropic does not agree to the terms by 5:01pm, they will cancel the contract and deem the company a “supply chain risk”. It’s not clear if it will make a public announcement.\n\nIt’s also not clear whether Anthropic’s Claude AI system would immediately disappear from the military’s systems – and what it would be replaced by. There’s also the question of how other military contractors that work with Anthropic will act. In instances where foreign companies were deemed risks, businesses had some time to prove that they had cut ties with the risky company.\n\nBut if the Pentagon does follow through with its threat, it will represent an unprecedented escalation on what is considered one of the best and most successful AI models in existence.\n\n“To take a domestic AI champion at a time when the White House is saying that the AI race with China is equivalent to the space race during the Cold War with the Soviet Union — you do not want to take one of the crown jewels of your industry and light it on fire over something like this,” Allen said on Bloomberg. “There is a better way to resolve this dispute than the absolutist stance the administration has taken.”\n\nChris Isidore contributed to this report.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/26/tech/anthropic-rejects-pentagon-offer",
      "text": "announced"
    },
    {
      "url": "https://www.americanprogress.org/article/the-trump-administration-is-trying-to-make-an-example-of-the-ai-giant-anthropic/",
      "text": "Center for American Progress"
    }
  ],
  "hash": "f747b9a15e2da99c5871b758e5cb88bba694a31b165bc036e807aee0285ae216",
  "scraped_at": "2026-02-27T07:15:06.149912+00:00"
}