{
  "url": "https://lite.cnn.com/2026/02/16/politics/alex-pretti-fbi-evidence-state-investigators",
  "title": "Hopes that the FBI would share evidence in Alex Pretti’s killing with state investigators have shattered | CNN Politics",
  "date": "2026-02-17T07:30:28.970812+00:00",
  "authors": [
    "Holmes Lybrand, CNN"
  ],
  "text": "Source: CNN\n\nHopes that the FBI would share information gathered in the investigation intoAlex Pretti’s killingwith state investigators in Minnesota have shattered.\n\nDespiteinitial statementsin the wake of meeting with White House border czar Tom Homan, Minnesota’s Bureau of Criminal Apprehension said in a statement Monday the FBI informed it last week that it would not share information.\n\nThe BCA said it received notice from the bureau on Friday.\n\n“While this lack of cooperation is concerning and unprecedented,” state investigators said in their statement, “the BCA is committed to thorough, independent and transparent investigations of these incidents, even if hampered by a lack of access to key information and evidence.”\n\nCNN has reached out to the FBI for comment.\n\nState investigators said they “will continue to pursue all legal avenues to gain access to relevant information and evidence.” County officials and the BCA filed a lawsuit the day Pretti was fatally shot by immigration agents, suing the federal government for access to investigative material in the case.\n\nThe FBI’s refusal — which breaks precedent in such investigations — is in line with the administration’s poor and often confused handling of the recent killings by Department of Homeland Securityofficers and agents.\n\nPreviously, federal officials refused to share any evidence with the BCA and declined to open a civil rights investigation that would focus on the Border Patrol officers who shot and killed Pretti. Days later, amid continued backlash, Deputy Attorney General Todd Blanche softly reversed course, saying a civil rights investigation into Pretti’s death would be opened, but that it would simply follow the course of a normal federal investigation.\n\n“We’re looking at everything that would shed light on that day,” Blanche said last month when announcing the investigation.\n\n“I don’t want to overstate what is happening,” he added. “I don’t want the takeaway to be there is some massive civil rights investigation. I would describe it as a standard investigation by the FBI.”\n\nHomeland Security’s investigative agency was leading the probe with the FBI acting in a supporting role in the days after Pretti’s killing. When the BCA tried to access the scene after Pretti was killed in January, it was blocked by federal officials.\n\nDays after Pretti’s death, the FBI took over the case but still declined to share information with the BCA.\n\n“Minnesota needs impartial investigations into the shootings of American citizens on our streets,” Gov. Tim Walz said Monday on X. “Trump’s left hand cannot investigate his right hand. The families of the deceased deserve better.”\n\nThe lack of cooperation between federal and state local investigators extends to the killing ofRenee Goodand the case ofJulio Sosa-Celis, who was shot in the leg by an Immigration and Customs Enforcement agent, BCA said in its statement.\n\nWhen an ICE officer shot and killed Good, the FBI quickly cut out the local Minnesota investigators, essentially ending their investigation. The FBI thenshifted the focus of its probeto whether Good and those around her committed a crime against the officer, as opposed to his conduct in the shooting.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/01/24/us/alex-pretti-minneapolis-ice-shooting-invs",
      "text": "Alex Pretti’s killing"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/politics/alex-pretti-evidence-order",
      "text": "initial statements"
    },
    {
      "url": "https://www.cnn.com/2026/01/08/us/renee-nicole-good-minneapolis-ice-shooting-hnk",
      "text": "Renee Good"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/us/ice-shooting-dhs-doj-false-statements",
      "text": "Julio Sosa-Celis"
    },
    {
      "url": "https://www.cnn.com/2026/01/09/politics/investigation-minneapolis-ice-shooting-deviates-police-shooting-playbook",
      "text": "shifted the focus of its probe"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/politics/alex-pretti-fbi-evidence-state-investigators",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/16/politics/alex-pretti-fbi-evidence-state-investigators",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f7eb30a8dad236fc17edac77bc07364ec351a4312aaed2e904bd3bb9085c046c",
  "scraped_at": "2026-02-17T07:30:28.970824+00:00"
}