{
  "url": "https://lite.cnn.com/2025/11/21/style/wicked-for-good-costume-design-paul-tazewell",
  "title": "A witch in trousers? Weird | CNN",
  "date": "2026-02-18T07:32:22.728403+00:00",
  "authors": [
    "Kati Chitrakorn, CNN"
  ],
  "text": "Source: CNN\n\nIn popular culture, the archetypal look of a witch is a female figure generally depicted wearing a black dress, robe, or cloak. Typically, she also sports a pointed hat and carries a broomstick that doubles as her mode of transport. It’s an image that was largely solidified by the 1939 film “The Wizard of Oz,” featuring the Wicked Witch of the West, despite a belief in witches and witchcraft that has long existed in many cultures worldwide for centuries.\n\nAs “Wicked: For Good,” the sequel to the modern film adaptation directed by Jon M. Chu, releases in cinemas, eagle-eyed viewers may notice a subtle difference in the witchy protagonist, Elphaba, played by Cynthia Erivo. Devotees, fear not: She still has green skin and an all-encompassing uniform of black. However, for the first time, the character wears trousers. Slim fit and very discrete, they’re worn by Elphaba as she appears in the opening scene, swooping down from the sky to thwart the plight of animals, and throughout the film, as she’s on the run from a mob of angry townspeople on a witch hunt.\n\n“It was a style choice, a thematic one,” according to Paul Tazewell, the costume designer for both “Wicked” (for which hewon an Oscar this year) and “Wicked: For Good.”\n\nSpeaking from his home in Brooklyn, New York, Tazewell — who worked on the costumes for both films simultaneously — recounts Elphaba’s outfits in the first, from the black pinafore she wears as a little girl when she mourns the death of her mother, to the long, tailored coatdress with puffed sleeves seen on her arrival at Shiz University as a reserved young woman. Her whole life, “she’s othered because of the color of her skin,” said Tazewell. “She’s an oddity within the community.” That kind of prejudice is enough to make any introvert become more reticent. Yet, Elphaba doesn’t — a retaliation that is expressed through her clothes, which she “protects and armors” herself with, he added.\n\nAs the first film ends, Elphaba is seen parting ways with Glinda, the benevolent good witch played by Ariana Grande, and the decision to introduce trousers was made as her new environment required her to be more agile. “She’s in exile in the forest, so she only has access to certain things. Her dress is in tatters at this point,” said Tazewell. “We moved away from a dress silhouette to one where she can be active and also give more presence.”\n\nIndeed, while trousers allow Elphaba to move more freely, it is also indicative of her newfound liberation. “It really is about self-expression,” Tazewell continued. “Elphaba has decided that she sees herself as the most important thing, and finding and having a connection to that self-love is her drive. It’s where her power lies.”\n\nModern depictions of witches in pop culture range from Roald Dahl’s 1983 book of the same name, which portrayed witches as gruesome creatures without hair or fingernails, to more glamorous or gothic interpretations seen via Maleficent of “Sleeping Beauty” andthe witches of “Suspiria.”Others, such as “Sabrina the Teenage Witch,” Hermione Granger in “Harry Potter,” the sisters in “Charmed,” and Bonnie in “The Vampire Diaries,” appear entirely normal, taking on the guise of an ordinary girl next door.\n\nBut Elphaba is different in that she is neither ghastly nor glam. Her impact is more figurative, as she serves as a symbol of empowerment, primarily through her unwavering moral conviction and courage to defy unjust societal expectations. For some experts, there are parallels that can be drawn between Elphaba’s liberation in the new film and the kind women experienced in the mid-19th century when they started entering traditionally male-dominated spaces like the workplace and began wearing trousers more publicly.\n\nOne of the earliest iterations were floaty, wide-legged shorts known as “bloomers” — popularized by the early suffragist Amelia Bloomer, they were worn as undergarments and allowed for greater comfort and freedom of movement. The garment’s rise coincided with the adoption of once strictly male activities like riding a bicycle. But, despite its benefits, it “quickly drew ridicule because people thought it was so shocking and distracting from the cause,” said April C. Armstrong, who co-curated a recent exhibition at Princeton University contextualizingwomen’s fashion in the 19th and 20th centuries. Bloomers have since become fashionable and are no longer treated as underwear, as seen onthe high fashion runwaysand worn by celebrities likethe pop star Dua Lipa.\n\nHowever, women did not universally start wearing trousers until the 20th century, when Gabrielle “Coco” Chanel started popularizing them in her collections (the designer liked wearing pants herself andoften borrowed them from her male lovers). Silver screen stars including Katherine Hepburn, Greta Garbo and Marlene Dietrich, who all wore trousers, helped to create its association with a “modern, independent and spirited” woman, said Rhonda Garelick, the founding director of Hofstra’s Institute for Public Humanities and the Arts. “In trousers, women can not only ride a bicycle, but they can play sports; they can walk more quickly; they can get in and out of vehicles,” continued Garelick. “We tend to forget it was much more difficult for women, and to this day, I think a woman wearing trousers is still associated with independence.”\n\nWhen it came to creating the looks for “Wicked” and “Wicked: For Good,” Tazewell — whose historic win of the Academy Award’s best costume design made him the first Black man to take home the prize — placed great emphasis on ensuring harmony between the central characters, especially when Elphaba had a greater risk of being overshadowed by Glinda’s more colorful, frothy gowns. And while black is a color that typically struggles to jump off the screen, Elphaba never disappears into the background.\n\nThis can be credited to Tazewell’s choice of sumptuous textures and rich fabrics. “When something is light and pink and what we call pretty, it is easier to make that look elevated and glamorous, but with black, elements can get lost,” he said. “What I was relying on is the depth that was created, whether it was in the micro-pleating that created an undulating pattern on her Emerald City dress, or her sweeping trench coat, which is made of a wax cotton that is water repellent” — a significant detail given the belief among the film’s townsfolk that water makes Elphaba melt.\n\nThe cinematography was also an important consideration, he added, as “light reflects different textures in different ways.” He explained: “If it’s wool and felted, it will soak in. If it’s pleated, then we catch the depth of the pleats in the way it’s lit. In both films, we used an underlayer of color underneath Elphaba’s sheer black to give a more iridescent quality.”\n\nBut, as is typical of Tazewell’s work, there’s always greater meaning beyond the aesthetic. In “Wicked: For Good,” not only has Elphaba adopted trousers as part of her silhouette, but she has “a swaggering presence because she has knee high boots with a slightly higher heel. The brim of her hat becomes a little more extreme,” said Tazewell — symbolizing a refusal to adhere to societal rules and expectations. Elphaba may be ostracized, but that won’t stop her from commanding attention and taking up space. Unlike Glinda, whose delicate dresses nipped in the waist, feel like the opposite of that, as she seeks to maintain her idealized image.\n\nFor Tazewell, those nuances are key. “The spark point for me really was when Cynthia was cast as Elphaba,” he said. “It’s fueled by the fact that we have a Black woman playing a role about a woman who is vilified for the color of her skin, and the choices she makes to empower herself, to go towards what she feels is right and true. That speaks of humanity and how we relate to each other.” It may be why the story, which began as a book before being turned into a hit Broadway musical and film, has resonated with so many audiences, he said. “‘Wicked’ is unlike any other American tale that we have. It operates as an allegory for the modern systems that we have — around power, around self-evolution, and also around advocation for animals and the environment.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://cnn.com/2025/03/02/entertainment/award-winners-list-oscars",
      "text": "won an Oscar this year"
    },
    {
      "url": "https://cnn.com/style/article/suspiria-costume-designs",
      "text": "the witches of “Suspiria.”"
    },
    {
      "url": "https://library.princeton.edu/fashion-feminism-fear-symposium",
      "text": "women’s fashion in the 19th and 20th centuries"
    },
    {
      "url": "https://www.theguardian.com/fashion/2025/apr/16/another-historical-garment-is-revived-for-the-modern-fashionistas-bloomers-are-back",
      "text": "the high fashion runways"
    },
    {
      "url": "https://www.teenvogue.com/story/dua-lipa-bloomers-trend-edgy",
      "text": "the pop star Dua Lipa"
    },
    {
      "url": "https://cnn.com/style/article/coco-chanel-fashion-50-years",
      "text": "often borrowed them from her male lovers"
    },
    {
      "url": "https://www.cnn.com/2025/11/21/style/wicked-for-good-costume-design-paul-tazewell",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2025/11/21/style/wicked-for-good-costume-design-paul-tazewell",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f869f60b86e1541427f77f650c5fea4657b7d4a6d00f77fa13abfff70c63c24c",
  "scraped_at": "2026-02-18T07:32:22.728416+00:00"
}
