{
  "url": "https://lite.cnn.com/2026/02/27/science/nasa-moon-landing-artemis-schedule",
  "title": "NASA abruptly adds a new step to its path to moon landing as a race with China looms | CNN",
  "date": "2026-03-01T07:07:54.886949+00:00",
  "authors": [
    "Jackie Wattles"
  ],
  "text": "Source: CNN\n\nNASA on Friday announced an abrupt change to its pathway to getting astronauts back on the lunar surface, opting to add in an additional crewed test flight before attempting to land.\n\nSpace agency officials said that “Artemis III” — the mission name that had previously been used to refer to a moon landing slated to happen no earlier than 2028 — will now be a different mission entirely, one that involves launching a crewed NASA capsule to Earth orbit to dock with at least oneprototype lunar lander vehicle made by SpaceX or Blue Origin. NASA Administrator Jared Isaacman said he hopes the mission will get off the ground in 2027.\n\nThe moon landing mission, still slated for 2028, will now be referred to as “Artemis IV.” Isaacman said the agency is in fact pursuing up to two moon landings in 2028.\n\nOversight officials, however, have already cast serious doubt on whether the timeline is obtainable.\n\nIsaacman billed the decision as an effort to increase the pace at which NASA launches Artemis-related missions. For context, the first uncrewed test flight of the program, called Artemis I, launched in November 2022 — putting more than three years between that test flight and the Artemis II mission, the first crewed Artemis flight test slated to carry four astronauts on a slingshot trip around the moon.\n\n“We didn’t go right to Apollo 11,” Isaacman said. “We had a whole Mercury Program, Gemini — lots of Apollo missions before we ultimately landed right. Now, our program is essentially set up with an Apollo 8 and then going right to the moon. That is, again, not a pathway to success.”\n\nThe news comes as NASA continues to work to get Artemis II off the ground. That mission, which involves sending four astronauts on a test flight that will loop around the moon but will not land on its surface, was originally targeting launch windows in February.\n\nBut those plans weredashedbecause of issues with NASA’s Space Launch System rocket. Specifically, a series of hydrogen leaks and then an unexpected problem getting helium to flow to the upper portion of the launch vehicle led to a series of delays and ultimately a decision to roll the rocket back off its launchpad.\n\nArtemis II — which will make use of NASA’s Space Launch System rocket and Orion spacecraft but will not involve a lunar lander vehicle — is now expected to launch no earlier than April.\n\nWhile Artemis II is designed to serve as a pathfinder mission for a moon landing, whether NASA can pull off an actual lunar touchdown this decade has remained in question. While SLS and Orion are designed to take astronauts from Earth to lunar orbit, the agency long ago decided to contract out development of a lunar lander to the private sector. Such a vehicle is necessary to carry astronauts from the Orion spacecraft down to the moon’s surface.\n\nBoth Elon Musk’s SpaceX and Jeff Bezos’ Blue Origin have fixed-price contracts with NASA to develop lunar landers. SpaceX plans to use its Starship megarocket — a gargantuan rocket system that Musk originally billed for Mars travel — for the task. Starship is still in the early stages of development and over the past year prototypes have exploded during brief, suborbital test flights.\n\nMeanwhile, Blue Origin is building a lunar lander that looks more like a traditional, Apollo-style vehicle. But the company has not yet launched a test flight.\n\nNASA’s assertion that it could still pursue a moon landing in 2028 — and expedite and alter the Artemis III mission into a 2027 practice run in low-Earth orbit — comes as oversight officials have grown increasingly skeptical about advertised timelines.\n\nThe NASA program overseeing Blue Origin’s and SpaceX’s development of lunar landers is called HLS, or Humans Landing System.\n\n“Over the past year, programmatic and technical risks with these systems have continued to emerge and affect the overall Artemis III schedule and risk management,” according to a recently publishedreportby NASA’s independent oversight group, the Aerospace Safety Advisory Panel. “This is especially evident with the HLS, given its intricate operational design, complex concept of operations, and challenges during their ongoing flight test program. Taken together, these difficulties cast doubt on the current Artemis III timeline and the feasibility of the Artemis III mission goals.”\n\nGiven that oversight officials were skeptical that the landers could be ready for a lunar touchdown in 2028, it also remains dubious whether either vehicle could be ready to complete a crewed test mission in low-Earth orbit by next year.\n\nWhen asked about the NASA ASAP report, Isaacman said, “I think what we’re doing is directly in line with what ASAP asked us to do.”\n\n“There has to be a better way in line with our history. Again, we did not just jump right to Apollo 11,” he said. “We shouldn’t be comfortable with the current cadence.”\n\nIt’s also unclear how NASA will fund the new mission, though Isaacman said key lawmakers on Capitol Hill are on board with the idea.\n\nIn another remarkable change of course, NASA said it no longer plans to pursue an upgraded version of the SLS rocket, referred to as “Block 1b.” That iteration of the rocket was meant to include a larger, more powerful segment for use in the vacuum of space that could allow SLS to haul large pieces of cargo to the moon alongside crew.\n\n“The idea is we want to reduce complexity to the greatest extent possible,” Isaacman said.\n\nThough some stakeholders have suggested a more powerful rocket segment is necessary to help carry out NASA’s long-term goal of creating a permanent moon base, some policymakers have signaled that they hope the space agency will consider cheaper alternatives. While a specific cost breakdown is not clear, a 2024 inspector generalreportsuggested that Block 1b development was expected to reach $5.7 billion by 2028.\n\nBoeing was named as the primary contractor for the SLS rocket’s enhanced upper stage, also called the Exploration Upper Stage.\n\nWhen reached for comment, Boeing did not specifically address its role in the Exploration Upper Stage but said, “Boeing is a proud partner in the Artemis mission and honored to support NASA’s vision for American space leadership with the Space Launch System.”\n\nInstead of moving toward the beefed-up version of the rocket, Isaacman said the agency will work to better standardize the SLS rocket, aiming to make it more reliable.\n\nA Senate version of a draft NASA authorization bill, a piece of legislation that outlines the space agency’s policies and goals, would grant Isaacman the power to make such a change, according to a copy obtained by CNN.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/02/24/science/artemis-2-roll-back-launch-date",
      "text": "dashed"
    },
    {
      "url": "https://www.nasa.gov/wp-content/uploads/2024/03/asap-2025-annual-report-tagged.pdf?emrc=69a1117f11262",
      "text": "report"
    },
    {
      "url": "https://oig.nasa.gov/wp-content/uploads/2024/08/ig-24-015.pdf",
      "text": "report"
    }
  ],
  "hash": "f8a11c7d4f70fbf775a2ff2c742bd7b8dc11b5208d980a7d9644dfdf81a49bbf",
  "scraped_at": "2026-03-01T07:07:54.886959+00:00"
}