{
  "url": "https://lite.cnn.com/2026/02/17/entertainment/tyra-banks-americas-next-top-model-antm-nigel-barker",
  "title": "Photographer Nigel Barker breaks down what “America’s Next Top Model” got right — and wrong. | CNN",
  "date": "2026-02-18T07:31:05.814450+00:00",
  "authors": [
    "Lisa Respers France, CNN"
  ],
  "text": "Source: CNN\n\nIs Tyra Banks the villain? It depends on whom you ask.\n\nA new Netflix docuseries has reopened the wounds of “America’s Next Top Model,” the popular reality show that began by promising young women a chance at a real modeling career and ended as a meme machine for its problematic photo shoots and judging.\n\nOver three episodes, Banks, former contestants and other judges, including the photographer Nigel Barker, look back at the show, which ran from 2003 to 2018. Some slam Banks, while Banks herself seeks to set the record straight from her perspective. And then there is Barker, who tries, as he did on the original show, to walk a balanced line.\n\n“Were there mistakes? Yeah. Lots. Was Tyra responsible for all of them? No, of course not,” Barker told CNN last week, ahead of the Monday release of “Reality Check: Inside America’s Next Top Model.” “But was she a part of it? Yes.”\n\n“But, also,” he added, “when a woman is the head of something and a businesswoman, people often condemn women in different ways than they would if a man had done things.”\n\nBanks already had a lucrative career as a model when she created the reality show featuring young women going through a series of challenges to win the title of “top model,” which included a contract with a major agency. Banks also hosted and executive produced the program.\n\nWith its fixation on high fashion, thinness and proximity to celebrity, “America’s Next Top Model” mirrored the times in which it aired and became a cultural phenomenon. The show gained a new life during the pandemic, becoming popular among some who weren’t even born when it debuted.\n\nAs the years went on, many challenges were increasingly viewed with derision, including a photo shoot in which contestants were made up to be different races and another in which a contestant whose mother had been shot and paralyzed was made to pose as a gunshot victim. Contestants were often criticized for their weight.\n\nBarker served as a photographer and judge for 18 seasons of the show before he and his friends “the two Jays” — runway coach and judge J. Alexander, also known as Miss J, and creative director and judge Jay Manuel, also known as Mr. Jay — were let go in 2012.\n\nThese days, while he doesn’t dismiss the criticism of the show, he also sees another perspective.\n\n“A lot of times people weren’t talking about, say, petite models. They weren’t talking about plus size models. They weren’t talking about models of color, but Tyra did and brought those subjects up,” Barker told CNN. “Very touchy, very difficult subjects to talk about. And as a result, people talked about them and they got out in the open air, and then we kind of made decisions and said, oh, that was terrible.”\n\nThough time has put some of how those discussions unfolded under a new microscope, Barker said he is proud to point out that “no one was talking about it until we did it.”\n\n“And so I hope that some of that comes through too, and that there is compassion on all sides and reason on all sides,” he said.\n\nThe contents of the three-episode docuseries, which Barker saw in its entirety prior to its debut, surprised even him in some cases.\n\nOne case involves Shandi Sullivan, a contestant on cycle 2, as the seasons are called. When the show initially aired, one episode featured a scene in which Sullivan was presented as having had sex with a man she met during a trip to Milan with her fellow contestants. Others witnessed the incident, which took place in the presence of the film crew. When the show aired, Sullivan was presented as distraught after realizing she’d cheated on her boyfriend back home.\n\nIn the docuseries, Sullivan reveals she was inebriated and could not have consented to having sex with the man, whom she had met while filming, as he and others had transported the contestants during their time in the Italian city.\n\nSullivan tells the Netflix filmmakers that she was “hammered” after drinking wine during a dinner when the group of Vespa drivers were invited to come over by production.\n\n“I remember him just like on top of me,” she says in the docuseries. “I was blacked out. No one did anything to stop it. And it all got filmed, all of it.”\n\nSullivanposted on social mediaafter “Reality Check: Inside America’s Next Top Model” debuted Monday, explaining why she agreed to participate in the docuseries. She used a smiling throwback photo from before the original show aired, explaining that at the time she had gone back to her job “with a makeover and a secret that had to wait to air.”\n\n“At the age of 43, I continue to struggle with it; always smiling. That’s why I took this opportunity,” Sullivanwrote in the caption on social media.“Knowing that Tyra didn’t have control over my narrative, that the director and producers here had my back…that’s why I did it. I did it for me. Because I mattered and I still do! The love I have felt today has been immense. Thank you to everyone that heard me.”\n\nCNN has reached out to Sullivan for additional comment.\n\nIn the docuseries, Banks is asked about her memories of what happened to Sullivan and says it’s “difficult” for her to discuss what happened with production because “that’s not my territory.”\n\nBarker told CNN he knew about as much about what had happened as the viewers did at the time and worked with Sullivan multiple times after her time on the show.\n\n“When I watched it originally I was like, ‘God, that’s awful and that’s crazy.’ And the same things that go through any normal person’s head of ‘They allowed that to happen?’” he said. “Or ‘They didn’t stop that?’ Unfortunately, this is the issue with a lot of these types of shows. The idea behind them is that they look for these really outlandish moments to happen. And when they do, they just allow them to run their course and they don’t jump in.”\n\nBarker said the judges were kept separate from the contestants during much of filming and were not made privy to many of the details of production.\n\nNow that he is the father of a 20-year-old son and a 17-year-old daughter, Barker said he has a bit of a different perspective about the young people who participated on the show — especially Sullivan — saying he would be “horrified” should his kids be involved in similar situations.\n\n“When I was watching the show, I felt very, very poorly for Shandi,” he said. “She’s a very sweet, very kind, lovely woman.”\n\nCNN has reached out to representatives for Banks for comment.\n\nIt wasn’t just contestants who faced challenges in the original series. Jay Manuel, a makeup artist who became creative director and directed photo shoots on the show, shares in the docuseries how his relationship with Banks changed, going from close friends to what Manuel portrays as cold.\n\nIn the docuseries, Manuel describes trying to leave the show, only to be iced out by Banks once he is convinced to stay.\n\nAlexander, who was beloved on the show as “Miss J” and well known in the fashion industry for teaching models how to walk a runway, shares in the docuseries that he suffered a stroke in 2022, spent five weeks in coma and has been left unable to walk. He also reveals that while Barker and Manuel visited him after his health crisis, Banks did not.\n\nSpeaking to CNN, Barker showed sympathy for his friends.\n\nThe show, he also said, made his career.\n\nBarker had gotten into modeling after appearing on a televised model search called “The Clothes Show” in the UK in the late 1980s before transitioning into fashion photography years later. He then joined “America’s Next Top Model,” where much was made of him being the show’s hunky, straight guy, something that amuses Barker to this day. Since leaving it, he has gone on to launch both a line of spirits and a furniture brand, and has shot a book with superstar Taylor Swift.\n\nHe agreed to do the docuseries, he said, in part because he and “the two Jays” had already been discussing doing a documentary about the show and Netflix brought in director Mor Loushy and Daniel Sivan, who had worked on “American Manhunt: Osama bin Laden.”\n\nIn the docuseries, Banks teases bringing back the show. While Barker said he hadn’t learned any details about what that might look like — though, he has been in touch with her a few times over the years — he cautioned that she should remember how the original show went downhill once he and “the two Jays” were let go.\n\n“All I can say is, unless you’ve got the right cast or the right recipe, you’re not gonna have the right show,” he said.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.instagram.com/p/DU12kZYjFH8/?hl=en&img_index=1",
      "text": "posted on social media"
    },
    {
      "url": "https://www.instagram.com/p/DU12kZYjFH8/?hl=en&img_index=1",
      "text": "wrote in the caption on social media."
    },
    {
      "url": "https://www.cnn.com/2026/02/17/entertainment/tyra-banks-americas-next-top-model-antm-nigel-barker",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/entertainment/tyra-banks-americas-next-top-model-antm-nigel-barker",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f8e9cac5e28d34ca96ad1f45e2f6ad8337615b93c98232dbb2267022a0eaed05",
  "scraped_at": "2026-02-18T07:31:05.814462+00:00"
}