{
  "url": "https://lite.cnn.com/2026/02/24/style/burberry-night-out-winter-26",
  "title": "At Burberry, a glamorous night out in the depths of winter | CNN",
  "date": "2026-02-25T07:32:35.389627+00:00",
  "authors": [
    "Fiona Sinclair Scott"
  ],
  "text": "Source: CNN\n\nFebruary in London is a complete misery of a time. The days are still short, the ground is wet and vitamin D levels are low. Hunkering down at home is surely the best course of action. At the Burberry show on Monday night, the brand’s creative director Daniel Lee had other ideas: Suck it up and get out there.\n\nDesigned for a night out in bad weather, the new collection is about “celebrating” Britain in the winter, said Lee backstage, as those of us who haven’t seen the sun since September laughed at the idea of finding joy in February.\n\nThe show was staged in the darkened former site of London’s 19th-century Old Billingsgate, once home to the world’s largest fish market. Inside, models walked around a replica Tower Bridge (the real one looming large outside) and through resin-made “puddles” for added authenticity.\n\nThe soundtrack, a booming composition by British musician FKA Twigs, loudly propelled models into the night on what locals would call “a mission.”\n\nThe mission called for leather – lots of it, in a collection that offers up a glam but distinctly hardy wardrobe for city living. Leather coats, skirts, suits and snoods were punctuated with hints of partywear including sequin details, long silky tassels, crushed velvet and ruffles – this season’s twist on the classic trenchcoat.\n\n“It looks like we’re at a convention of flashers,” joked actor Stellan Skarsgård who was one of the many celebrities on the front row in various adaptations of the signature Burberry trench. Other stars included model Kate Moss, Thai actor Bright and musicians Olivia Dean and Skepta. Romeo Beckham walked the show in a faux fur-lined bomber.\n\nThe sultry new designs mostly appeared in an inky color palette of black, grays, midnight blues and deep purples – a toneteased by Teyana Taylor the previous nightwhen she wore a sweeping Burberry gown with a dramatic ruffled collar to the BAFTAs.\n\n“London offers such a breadth of life at night,” Lee said, noting he was thinking about clothes that could carry from daytime to wherever an evening may take you.\n\nThe collection was about rising to a challenge in many ways – something Burberry has been doing for the last few years after losing its footing between periods of creative and leadership transitions. Lee, now in his third year at Burberry, seems to be successfully edging it back into popular consciousness by offering a modern, wearable take on the 170-year brand without losing sight of its cornerstones: Britishness, outerwear and the Burberry check. At the end of the last year, Burberry made it into the top 10 of Lyst’s “hottest brands” index and reported sales growth for the first time in two years last November.\n\nAs is typical, the show marked the end of London Fashion Week but this time it also served as the closing party during a surprisingly festive 24 hours in the city. Erdem’s show on Sunday at the Tate Britain museum was a celebration of twenty years of the independent brand – a remarkable milestone in this economy. Choosing to steer clear of a traditional “retrospective,” the designer, instead presented a stunning fever dream of his world and past references. Actress Glenn Close wore Erdem twice that day, once at the show before presumably dashing across town to change into a second look and walk the BAFTAs red carpet along with more A-list stars than we’re used to seeing at the British film awards. The next afternoon the American rising star designer Conner Ives staged his vibrant show within a small ballroom of Claridges, breathing an air untethered youth into the classic Mayfair hotel.\n\nPerhaps London in February isn’t so bad after all.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/style/baftas-2026-red-carpet-fashion",
      "text": "teased by Teyana Taylor the previous night"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/style/burberry-night-out-winter-26",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/style/burberry-night-out-winter-26",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f91070401a08b694ee6f34ce95a9649d37b752947d09975faa0d8fda31519e51",
  "scraped_at": "2026-02-25T07:32:35.389639+00:00"
}