{
  "url": "https://lite.cnn.com/2026/02/18/media/fcc-brendan-carr-colbert-equal-time-talarico-view",
  "title": "Don’t be fooled: The FCC’s ‘equal-time’ push is almost all bark, no bite | CNN Business",
  "date": "2026-02-19T07:31:16.391976+00:00",
  "authors": [
    "Analysis by Brian Stelter, CNN"
  ],
  "text": "Source: CNN\n\nFCC chairman Brendan Carr said Wednesday that a nearly century-old regulation known as the “equal-time rule” is going to apply “across the board.”\n\nCarr also confirmed reports by CNN and other outlets that the FCC opened an investigation into ABC’s “The View” for a possible equal-time violation.\n\nThe FCC chair called it an “enforcement action,” which makes it sound serious, even though legal experts say it likely won’t amount to much.\n\nThe FCC’s enforcement powers are limited. At most, ABC might have to pay a fine, and ABC’s parent company Disney can certainly afford it.\n\nThe enforcement possibilities are “minimal, in terms of real jeopardy,” public interest lawyer Andrew Jay Schwartzman, who has decades of experience with the FCC, told CNN. Even the paperwork involved is minimal, “so the attorneys’ fees are not huge compared, say, to a merger or antitrust matter,” he added.\n\nThe FCC ultimately controls who holds station licenses, but the agency’s ownliteraturesays station revocations only happen in “extreme cases.” President Trump has frequently talked about punishing critics by stripping station licenses, but there aremany legal obstaclesto doing so.\n\nWhether enforceable or not, Carr’s plan to prioritize the equal-time rule is creating significant political noise, and that may well be the point.\n\nLast month, ABC’s Jimmy Kimmel called Carr’s approach “a sneaky little way of keeping viewpoints that aren’t his off the air. It’s his latest attack on free speech, and it’s a joke.”\n\nCarr said at a news conference on Wednesday that “the whole idea here is more speech, not less.” He also offered up one-liners attackingColbertandthe national news media, perhaps underscoring the “noise” aspect in all of this.\n\nCritics say the practical effect is to chill broadcasters and influence content decisions. There are already some signs of that happening.\n\nCBS lawyers contacted Stephen Colbert’s “Late Show” production team on Monday with concerns about an upcoming interview that could trigger an FCC probe like the one involving “The View.”\n\nColbert went public about it on Monday night and said the network pushed his show to scrap the interview, though CBS said it was ultimately the show’s decision to make it an “online-only exclusive” on YouTube.\n\nThat’s because the “equal-time” provision only applies to broadcast, not to cable or streaming.\n\nAnd if you think that sounds ridiculously antiquated, well, you’re not alone.\n\nThe equal-time rule was conceived at the dawn of the broadcast age. It was included in the Radio Act of 1927 and revised in the Communications Act of 1934, which established the Federal Communications Commission.\n\nWhile today’s media environment is one of unlimited choice, the environment back then was defined by scarcity. Congress sought to ensure some modicum of fairness for the powerful new tools of radio and TV broadcasting.\n\n“The general rule, as passed by Congress,” Carr said Wednesday, “is the equal-time provision: If you’re going to have a legally qualified candidate on, you have to give comparable time and airtime to all other legally qualified candidates. And we’re going to apply that law.”\n\nThe law was amended in 1959 to carve out some crucial exemptions. News interviews and documentaries are not subject to the equal-time requirements.\n\nIn recent decades, FCC officials further relaxed the rules “as candidate interviews became a broader part of the entertainment landscape,” Daniel Lyons of the American Enterprise Institute wrote in a recentblog post.\n\nA 2006 FCC ruling suggested — and stations certainly perceived — that all interviews on daytime and late-night talk shows were exempt from the rule. “This is not the case,” the FCC said in revised guidance to stations last month.\n\nThe agency said it wanted to emphasize that shows “motivated by partisan purposes” must comply with the nearly 100-year-old rules.\n\nIn practice, since the most popular shows on broadcast TV feature outspoken critics of President Trump, the guidance was seen as another way for his administration to challenge critical speech.\n\nTechnically, a local station only has to provide comparable time if a rival candidate requests it. There is a formal process for doing so, and it happens every once in a while, usually without controversy.\n\nThe FCC rule specifically covers political candidates and election cycles, so there are many times when it doesn’t apply. Pennsylvania Gov. Josh Shapiro, who is running for reelection, appeared on “The Late Show” last month, but at the time, he was not a “legally qualified” candidate.\n\nThe same is true for Georgia Democratic Sen. Jon Ossoff, who is running for reelection and is set to appear Wednesday night on Colbert’s show.\n\nBut the “equal-time rule” is sometimes conflated with broader “equal time” arguments in the never-ending attention war that is American politics.\n\nPresident Trump, for instance, attacked “always anti-Trump” late-night hosts in 2017 and asked, “Should we get Equal Time?”\n\nTrump’s complaint wasn’t relevant to the FCC because he wasn’t in an active campaign, and he wasn’t reacting to one of his campaign rivals being featured on the public airwaves.\n\nIn past decades, conservative talk radio stars like Rush Limbaugh and Sean Hannity frequently railed against the FCC, often bringing up the “Fairness Doctrine,” which was abolished in the late 1980s, as an example of government speech policing that threatened their livelihoods.\n\nThorough enforcement of equal-time rules would be a similar encroachment — though Carr has signaled he is interested in TV, not radio.\n\nLast month, the Los Angeles Times asked Hannity about Carr’s equal-time talk, and he said: “We need less government regulation and more freedom. Let the American people decide where to get their information from without any government interference.”\n\nThe Colbert controversy has renewed longstanding calls, particularly among libertarians, to “abolish the FCC” altogether.\n\nOn platforms like YouTube and TikTok, the nearly century-old rules — and the fact that they only apply to a narrow slice of the media pie — strike many observers as obsolete.\n\nThe FCC, Nick Gillespie wrote for The Free Press last year, “now serves almost exclusively as a way for politicians to police speech and block business deals they don’t like, all under the maddeningly vague cover of serving ‘the public interest.’”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.fcc.gov/general/enforcement-primer",
      "text": "literature"
    },
    {
      "url": "https://www.cnn.com/2025/09/19/media/trump-carr-fcc-abc-kimmel-license-threat",
      "text": "many legal obstacles"
    },
    {
      "url": "https://x.com/JBFlint/status/2024164251330347064",
      "text": "Colbert"
    },
    {
      "url": "https://x.com/JBFlint/status/2024160906478006750",
      "text": "the national news media"
    },
    {
      "url": "https://www.aei.org/technology-and-innovation/resurrecting-the-equal-time-rule/",
      "text": "blog post"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/media/fcc-brendan-carr-colbert-equal-time-talarico-view",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/18/media/fcc-brendan-carr-colbert-equal-time-talarico-view",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f933e45240ddbb0865f002785567039b07554a89e6e34cb7b97296b8b0daaa40",
  "scraped_at": "2026-02-19T07:31:16.391989+00:00"
}