{
  "url": "https://lite.cnn.com/2026/02/23/health/detained-immigrants-medical-care-democrats",
  "title": "Democrats decry meager medical care for detainees in funding fight | CNN",
  "date": "2026-02-24T07:32:35.404391+00:00",
  "authors": [
    "Stephanie Armour, KFF Health News"
  ],
  "text": "Fernando Viera Reyes needed a biopsy for possible prostate cancer when the Trump administration sent him to an immigration detention center in California’s Mojave Desert.\n\nThere, he waited. Reyes, now 51, made repeated requests for the procedure, according to alawsuit filed in November against the federal government, but months went by even though there was blood in his urine — a potential sign of cancer that’s spread.\n\n“It may have gone from very treatable to metastasized,” saidKyle Virgien, who, as a lawyer with the American Civil Liberties Union’s National Prison Project, is involved with the lawsuit.\n\n“There are vulnerable populations; it’s crowded. The medical care isn’t there to handle the increased number of people who are sick,” Virgien said.\n\nPresident Donald Trump’s mass deportation effort has led to a record number of immigrants being held in federal detention centers, local jails, and private prisons. The situation is putting detainees’ health at risk. Immigration and Customs Enforcement is violating standards that ensure immigrants receive initial medical screenings, routine health care, and timely responses to physical complaints, according to a review of more than 200 pages ofdetainee lawsuits,published independentandacademic researchreports, and recentcongressional investigationsby Democrats.\n\nComplaints about inadequate medical care at detention facilities risk adding to the political backlash Trump faces over his aggressive deportation campaign, including the killing oftwo U.S. citizensin Minneapolis. Democratic members of Congress have insisted on reining in federal immigration agents as part of a 2026 spending bill for the Department of Homeland Security, an impasse that threatens to largely shut down the agency.\n\nSpokespeople for ICE and ICE Health Services Corps, the Department of Homeland Security, and the White House didn’t respond to repeated requests for comment on this article. IHSC assesses health for deportation, oversees medical standards in contracted facilities, and reimburses for off-site medical care.\n\nHowever, on theIHSC website, assistant director Stewart Smith said the corps “upholds health care standards across ICE-owned and contracted facilities, and ensures the provision of required health care delivery for detained aliens.” For ICE’s part, itswebsite notesthat “many aliens may not have received recent or reliable medical treatment for existing conditions prior to entering ICE custody. For some individuals, this may represent their first access to comprehensive medical care.”\n\nSome Democratic lawmakers have demanded autopsy reports on detainees who died in custody and have publicly accused ICE of denying immigrants access to care. Rep. Kelly Morrison (D-Minn.) said that adetention facilityshe visited at the state’s historic Fort Snelling had no medical policy and “no real” on-site medical care.\n\n“It raises alarm bells from a medical and public health perspective,” Morrison, who is a doctor, told KFF Health News. “There are no beds, no blankets, minimal food. It’s freezing in there. Everyone is in leg shackles. It’s chaotic, disorganized, and frankly dangerous.”\n\nRep. Jasmine Crockett(D-Texas) recently denounced the health care given to detainees at apress briefingshe held after visitingLiam Conejo Ramos, a 5-year-old boy in Minneapolis who was sent to the Dilley Immigration Processing Center in South Texas. She went to the center following media reports that he’d developed a fever and wasin poor health.\n\n“The treatment these people are suffering under right now is worse than those who are accused and sometimes even convicted of crimes. That’s how bad it is,” she said.\n\nDHS locked down Dilley this month after two detaineescontracted measles. The facility also houses children who are vulnerable to severe complications of the illness, such as brain swelling.\n\nSen. Chris Murphy(D-Conn.) on Feb. 1 accused the administration of denying him entry to Dilley in late January to hide themeasles outbreak.\n\nAndthree measles caseswere recentlyreported at a facilityinFlorence, Arizona.\n\nPublic concern is mounting, with nearly 60% of voterssaying they disapprovedof how Trump has handled immigration, according to a recent poll conducted bySiena Universityand The New York Times.\n\nThe type and scope of health care services that adult immigrants are supposed to receive depend in part on where they’re held. ICE detention standards apply to specific centers such as private prisons that house both inmates and detainees, whileseparate standardsare required at facilities that generally houseadult immigrant detainees.\n\nDespite the differences,certain basicsare expected. Immigrants are supposed to receive a medical, dental, and mental health screening when they arrive, and they’re supposed to receive daily sick calls, round-the-clock emergency care, and other services, including preventive care, screening, diagnosis, and treatment.\n\nThe standards exist to “ensure that detainees are treated humanely; protected from harm; provided appropriate medical and mental health care; and receive the rights and protections to which they are entitled,” according to ICE’snational standards, revised last year.\n\nBut the agency’s failure to adhere to its own standards is leaving immigrant detainees at risk of medical emergencies and death, complications from untreated chronic illnesses, and infection with communicable diseases, according tolawsuits from advocates,congressional probesby Democrats, andstate reports.\n\nDHS has criticized some of the investigations as false, including a report bySen. Jon Ossoff(D-Ga.) on pregnant women and children in detention.\n\n“ICE detention facilities have higher standards than most U.S. prisons that detain American citizens. All detainees are provided with comprehensive medical care, proper meals,” DHS spokesperson Tricia McLaughlin said in anAugust statement. On Feb. 17, McLaughlin announced she would bestepping downfrom her DHS post.\n\nAccess to adequate health services has been imperiled because of the surge in detainees, a lack of oversight by the Trump administration, and a delay in processing medical claims that’s jeopardized care, say advocates, lawyers, and some doctors.\n\n“The challenges have been exacerbated because the pace of removals hasn’t kept up with the pace of detentions. It adds to the problem,” saidDrishti Pillai, an associate director at KFF, a health information nonprofit that includes KFF Health News. “There are more public health issues when facilities are crowded.”\n\nThe number of immigrants in detention swelled from about 40,000 in November 2023 under former President Joe Biden to arecord 73,000 peoplein mid-January, according to the American Immigration Council, an advocacy group that focuses on litigation and research.\n\nAt the same time, the Trump administration has weakened oversight of the conditions and health services at detention centers. It cut staff at the DHS Immigration Detention Ombudsman office, effectivelyshuttering most of its operations, according to a KFF analysis and the Economic Policy Institute, a nonprofit that focuses on economic research.\n\nTheombudsman’s missionhas been to “independently examine immigration detention to promote safe, humane conditions,” according to the agency. DHS is currently the target of a partial government shutdown because of Democrats’ opposition to afunding billfor the agency. As advanced by Republicans, that measure would zero out the ombudsman’s funding.\n\nThere are also lengthy delays to process detainee health payment claims from third-party doctors and hospitals — a holdup that advocates and the federal government have said jeopardizes care.\n\nThe Department of Veterans Affairs’ Financial Services Center long had a contract with ICE to process claims for care outside detention centers, such as oncology treatments or dialysis.\n\nCongressional Republicanscriticized the arrangementand claimed it diverted resources from veterans.\n\nVeterans Affairs in Octoberstopped processingdetainees’ claims. Documents ICE posted on a federal contracting website said the termination “created an emergency” by compromising the ability to reimburse providers and left the agency with no mechanism to provide services such as tuberculosis screening, nonemergency medical transportation, and medical equipment purchases.\n\n“It is an absolute emergency for ICE to immediately procure claims processing support because lack of this support will delay critical medical care … such as dialysis, prenatal care, oncology, chemotherapy, etc.,” according topartially redacted documentsposted in late 2025 atSam.gov, a federal system for contract data.\n\nA new claims processor,Acentra Health, has been retained, but ICE has said on its website that no claims will be processed until April 30. Advocates say it’s unclear whether detainees are getting access to off-site care as needed and say the claims delays are also discouraging medical providers from providing services to the immigrants.\n\n“DHS has signed a new contract to process these claims and is currently onboarding the vendor,” said Veterans Affairs spokesperson Pete Kasperowicz. “Meanwhile, VA is supporting this transition until May to ensure claims are processed appropriately.”\n\nICE reportsthat six detainees died in custody so far in 2026, with 32 detainee deaths in 2025 and 11 in 2024. Those figures are contested, however, by some advocates and lawmakers who say the totals exclude detainees who died while being apprehended or in the care of U.S.Customs and Border Protection.\n\nHouse Democrats on the Homeland Security Committee say 53 people have died in ICE or CBP custody since Trump took office. They aredemanding informationfrom DHS, including autopsy reports for each death, staffing requirements for medical professionals, and video footage of one detainee who died in Texas.\n\n“We are outraged” at the deaths, according to a Jan. 22 letter from the 13 lawmakers. “It is obvious yet tragic that ICE is unwilling or unable to provide basic care for detainees.”\n\nThe Democrats pointed to the death ofGeraldo Lunas Campos, 55, who was born in Cuba. He died Jan. 3 at a detention center in Fort Bliss, Texas, after ICE said he experienced medical distress. He had been taken into custody almost six months earlier.\n\n“At no time during detention is a detained alien denied emergency care,” ICE said in a Jan. 9 statement on the death.\n\nThe El Paso County Medical Examiner’s Officeruled the death a homicidethat occurred after Campos was restrained by law enforcement.\n\nMeanwhile, other immigrants are still waiting for care. Reyes, who needed a biopsy for possible prostate cancer, eventually had the screening test, but as of early February had not received results. “He is in constant agonizing pain,” according to the lawsuit filed in the Northern District of California.\n\nOn Feb. 10, a federal judge ordered ICE and DHS to provideadequate health careto detainees and to conduct external monitoring, including on-site inspections of the detention center.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.aclu.org/cases/gomez-ruiz-et-al-v-ice?document=Complaint",
      "text": "lawsuit filed in November against the federal government"
    },
    {
      "url": "https://www.aclu.org/bio/kyle-virgien",
      "text": "Kyle Virgien"
    },
    {
      "url": "https://amicacenter.org/app/uploads/2025/05/2-Amended-Class-Complaint.pdf",
      "text": "detainee lawsuits"
    },
    {
      "url": "https://firrp.org/wp-content/uploads/2026/01/Final_December-2025_Deadly-and-Dehumanizing-Conditions-in-the-Eloy-Detention-Center_June-2024-thru-Nov-2025.pdf",
      "text": "published independent"
    },
    {
      "url": "https://link.springer.com/article/10.1007/s11606-025-09837-4",
      "text": "academic research"
    },
    {
      "url": "https://www.ossoff.senate.gov/wp-content/uploads/2026/01/260114_Report_Patterns_v5.pdf",
      "text": "congressional investigations"
    },
    {
      "url": "https://www.nbcnews.com/news/us-news/minneapolis-transformed-federal-immigration-alex-pretti-renee-good-rcna256032",
      "text": "two U.S. citizens"
    },
    {
      "url": "https://www.ice.gov/detain/ice-health-service-corps",
      "text": "IHSC website"
    },
    {
      "url": "https://www.ice.gov/detain/detainee-death-reporting",
      "text": "website notes"
    },
    {
      "url": "https://x.com/KellyMorrisonMN/status/2018083448527659493",
      "text": "detention facility"
    },
    {
      "url": "https://crockett.house.gov/",
      "text": "Rep. Jasmine Crockett"
    },
    {
      "url": "https://x.com/RepJasmine/status/2016721624116965614",
      "text": "press briefing"
    },
    {
      "url": "https://x.com/RepMcClellan/status/2016994435368964118",
      "text": "Liam Conejo Ramos"
    },
    {
      "url": "https://www.huffpost.com/entry/liam-conejo-ramos-sick-ice-detention_n_696fd209e4b0559a85915488",
      "text": "in poor health"
    },
    {
      "url": "https://www.pulmonologyadvisor.com/news/two-measles-cases-found-at-texas-immigrant-detention-center/",
      "text": "contracted measles"
    },
    {
      "url": "https://www.murphy.senate.gov/",
      "text": "Sen. Chris Murphy"
    },
    {
      "url": "https://x.com/ChrisMurphyCT/status/2018156084326810084",
      "text": "measles outbreak"
    },
    {
      "url": "https://tucson.com/news/local/border/article_637bb63e-44f4-4987-a206-2f1792274922.html",
      "text": "three measles cases"
    },
    {
      "url": "https://stanton.house.gov/2026/2/stanton-kelly-ansari-grijalva-demand-answers-on-measles-outbreak-at-arizona-immigration-detention-facilities",
      "text": "reported at a facility"
    },
    {
      "url": "https://www.cnn.com/2026/01/28/health/ice-facility-measles-arizona",
      "text": "Florence, Arizona"
    },
    {
      "url": "https://www.nytimes.com/interactive/2026/01/26/polls/times-siena-national-poll-crosstabs.html",
      "text": "saying they disapproved"
    },
    {
      "url": "https://www.siena.edu/",
      "text": "Siena University"
    },
    {
      "url": "https://www.congress.gov/crs_external_products/IF/HTML/IF12623.html",
      "text": "separate standards"
    },
    {
      "url": "https://www.ice.gov/detain/detention-management/2011",
      "text": "adult immigrant detainees"
    },
    {
      "url": "https://www.kff.org/racial-equity-and-health-policy/health-issues-for-immigrants-in-detention-centers/",
      "text": "certain basics"
    },
    {
      "url": "https://www.ice.gov/doclib/detention-standards/2025/nds2025.pdf",
      "text": "national standards"
    },
    {
      "url": "https://publiccounsel.org/press-releases/adelanto-detainees-file-federal-lawsuit-challenging-inhumane-conditions-at-adelanto-ice-processing-center/",
      "text": "lawsuits from advocates"
    },
    {
      "url": "https://www.hsgac.senate.gov/wp-content/uploads/2025.12.8_ICE-Report-revised-FINAL.pdf",
      "text": "congressional probes"
    },
    {
      "url": "https://oversightdemocrats.house.gov/immigration-dashboard",
      "text": "by Democrats"
    },
    {
      "url": "https://oag.ca.gov/system/files/media/immigration-detention-2025.pdf",
      "text": "state reports"
    },
    {
      "url": "https://secure.actblue.com/donate/ossoff-ads-gs24?refcode=ads-gs-240820-launch-dtd-natl-21608134700-167125655220-710271280035-jon%20ossoff%20georgia&utm_source=google&utm_medium=gs&utm_campaign=refcode%3Dads-gs-240820-launch-dtd-natl-21608134700-167125655220-710271280035-jon%20ossoff%20georgia&gad_source=1&gad_campaignid=21608134700&gbraid=0AAAAA-CkdIpuLEvUVzhJ9UyPsKJQSd49W&gclid=CjwKCAiAv5bMBhAIEiwAqP9GuJH6zqFXAapEn7UcL-mFDowm3pVwR79Ln4Lqyggpg471bblhDoA_gxoCX40QAvD_BwE",
      "text": "Sen. Jon Ossoff"
    },
    {
      "url": "https://www.dhs.gov/news/2025/08/07/dhs-debunks-georgia-senators-false-allegations-about-ice-detention-centers",
      "text": "August statement"
    },
    {
      "url": "https://www.politico.com/news/2026/02/17/dhs-spokesperson-tricia-mclaughlin-to-leave-trump-administration-00783378",
      "text": "stepping down"
    },
    {
      "url": "https://www.kff.org/racial-equity-and-health-policy/health-issues-for-immigrants-in-detention-centers/",
      "text": "Drishti Pillai"
    },
    {
      "url": "https://www.americanimmigrationcouncil.org/blog/ice-expanding-detention-system/",
      "text": "record 73,000 people"
    },
    {
      "url": "https://www.epi.org/policywatch/trump-administration-closes-three-dhs-offices-focused-on-civil-rights-and-oversight/#:~:text=On%20March%2021%2C%202025%2C%20Bloomberg,hurdles%20and%20undermining%20DHS's%20mission.%E2%80%9D",
      "text": "shuttering most of its operations"
    },
    {
      "url": "https://www.dhs.gov/office-immigration-detention-ombudsman",
      "text": "ombudsman’s mission"
    },
    {
      "url": "https://rollcall.com/2026/01/26/spending-bill-would-solidify-trump-cuts-in-dhs-oversight/",
      "text": "funding bill"
    },
    {
      "url": "https://www.usmedicine.com/non-clinical-topics/legislation/processing-of-ice-medical-claims-by-va-sparks-controversy-in-congress-2/",
      "text": "criticized the arrangement"
    },
    {
      "url": "https://immpolicytracking.org/policies/ice-ends-contract-with-va-for-processing-detainee-health-services-claims/#/tab-policy-documents",
      "text": "stopped processing"
    },
    {
      "url": "https://sam.gov/workspace/contract/opp/53e8295e32044da2884589ad1bf37183/view",
      "text": "partially redacted documents"
    },
    {
      "url": "http://sam.gov/",
      "text": "Sam.gov"
    },
    {
      "url": "https://www.ice.gov/detain/ice-health-service-corps/ihs-managed-care",
      "text": "Acentra Health"
    },
    {
      "url": "https://www.ice.gov/detain/detainee-death-reporting",
      "text": "ICE reports"
    },
    {
      "url": "https://democrats-homeland.house.gov/imo/media/doc/chs_letter_to_noem_re_ice_and_cbp_condemning_deaths.pdf",
      "text": "demanding information"
    },
    {
      "url": "https://www.ice.gov/news/releases/ice-reports-aggravated-felon-and-convicted-child-sex-offenders-death-camp-east",
      "text": "Geraldo Lunas Campos"
    },
    {
      "url": "https://www.texastribune.org/2026/01/21/texas-el-paso-immigrant-death-ice-custody-homicide/",
      "text": "ruled the death a homicide"
    },
    {
      "url": "https://www.latimes.com/california/story/2026-02-11/california-judge-orders-government-to-provide-constitutionally-adequate-healthcare-at-ice-detention-center",
      "text": "adequate health care"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/health/detained-immigrants-medical-care-democrats",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/health/detained-immigrants-medical-care-democrats",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f9993cc27b6cbce8236ff0fe268f8396d6a1d3c8e8cfb0c1d08da1bcfb202d95",
  "scraped_at": "2026-02-24T07:32:35.404405+00:00"
}