{
  "url": "https://lite.cnn.com/2026/02/11/business/kraft-heinz-spinoff-pause",
  "title": "Kraft Mac & Cheese and Heinz Ketchup are sticking together after all | CNN Business",
  "date": "2026-02-12T21:31:11.289366+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nKraft Heinz is calling offits planned breakupand keeping the company together.\n\nThe food giantthat owns Kraft, Heinz, Oscar Meyer and Philadelphia cream cheesesaidlast year that it was splitting its business in two. The company’s sales had slumped for years, and a breakup would have separated its growing condiment lines from struggling grocery brands like Kraft Singles and Lunchables.\n\nBut the brands’ sales have deteriorated further since the split was announced, making a spinoff less appealing to investors. New Kraft Heinz CEO Steve Cahillane,who took over at the beginning of the year after running Kellogg, hit pause on the breakup Wednesday and announced a turnaround plan.\n\n“Consumer sentiment has worsened, industry trends have softened, and there is increasing volatility in the geopolitical landscape. These shifts make the path to recovery steeper,” Cahillane said in a statement.\n\nCahillane said the company will invest $600 million on marketing, sales and research and development to improve business. Once the company is growing again, it will be in a “better position to make a decision” on a spinoff, he said.\n\nThe pause on the split marked the latest twist in the Kraft Heinz saga. The two companies joined in 2015 in a deal orchestrated by Warren Buffett’s Berkshire Hathaway and the investment firm 3G Capital.\n\nBut many of the company’s brands, such as Kraft Mac & Cheese, Lunchables, and Velveeta have fallen out of favor with customers seeking healthier or organic options.\n\nKraft Heinz, like all big food companies, is also grappling with inflation-weary buyerscutting back spendingor switching to generic labels as well as the rise of GLP-1 drugs hurting demand for snack food.\n\nThe company’s $600 million investment “could be the reboot the company needs to get back on track after a decade in the wilderness,” Bernstein analyst Alexia Howard said in a note Wednesday.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2025/09/02/business/kraft-heinz-breakup",
      "text": "its planned breakup"
    },
    {
      "url": "https://www.cnn.com/2025/09/02/business/kraft-heinz-breakup",
      "text": "said"
    },
    {
      "url": "https://www.cnn.com/2025/03/18/business/snacks-economy-pepsi-campbell",
      "text": "cutting back spending"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/business/kraft-heinz-spinoff-pause",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/business/kraft-heinz-spinoff-pause",
      "text": "Cookie Settings"
    }
  ],
  "hash": "f9a1fc7b6f16b3210da72c4fc61ea86e5ccf1001d1c2915a31a33d2b0d9ed759",
  "scraped_at": "2026-02-12T21:31:11.289380+00:00"
}