{
  "url": "https://lite.cnn.com/2026/02/19/science/nasa-boeing-starliner-investigation-report",
  "title": "NASA designates botched Boeing Starliner test flight a ‘Type A mishap’ in new report | CNN",
  "date": "2026-02-20T07:28:11.739870+00:00",
  "authors": [
    "Jackie Wattles, CNN"
  ],
  "text": "Source: CNN\n\nThe botched test flight of Boeing’s Starliner spacecraft — a protracted saga that kept two astronauts in space months longer than expected — was a debacle in league with US space shuttle disasters that cost crew members their lives, according to newly revealed findings from a NASA investigation about the ordeal.\n\nWhile the crewed Starliner mission did not end in tragedy, the myriad issues discovered with the Boeing-built spacecraft “revealed critical vulnerabilities in the Starliner’s propulsion system, NASA’s oversight model, and the broader culture of commercial human spaceflight,” according to areportthe agency published Thursday.\n\nNASA Administrator Jared Isaacman discussed the incident in scathing terms at a news conference Thursday, noting that the Starliner should not have flown with crew on board when it did.\n\n“It’s decision-making and leadership that, if left unchecked, could create a culture incompatible with human spaceflight,” Isaacman said.\n\nOfficially, the Starliner test flight is now considered a “Type A” mishap— a designation that NASA defines as an incident that results in more than $2 million of damage, the loss of control or destruction of a vehicle, or a loss of life. The Columbia and Challenger Space Shuttle disasters were also classified as “Type A” incidents.\n\nIsaacman said the report and Thursday news conference were geared toward “doing the right thing” and properly investigating the Starliner mission. Initially, NASA had permitted its Commercial Crew Program, which oversees Boeing’s Starliner development, to self-investigate, agency officials said.\n\nIsaacman said that decision was “inconsistent with NASA safety culture.”\n\n“I think setting the record straight, classifying this as a Type A mishap, ensures what happened here with this mission is appropriately recorded and can be referenced for future learning,” Isaacman said. “We’re trying to send a message about what is the right and wrong way to handle situations like this so that they do not reoccur.”\n\nIsaacman, who tookNASA’s top jobafter his Senate confirmation in December, did not say whether any NASA managers would lose their positions over the incident.\n\nBoeing designed and built Starliner, though NASA holds a roughly $4 billion contract with the company to use the spacecraft for ferrying space agency astronauts to and from the International Space Station.\n\nStarliner has been under development for more than a decade, and problems with the vehicle’s thrusters also cropped up during uncrewed test flights flown prior to NASA’s inaugural Boeing Crew Flight Test in 2024, which included NASA astronauts Suni Williams and Butch Wilmore.\n\nIsaacman said that it’s now clear that the root causes of Starliner’s issues were never found — and still have not been determined.\n\nPrevious investigations into Starliner’s issues “often stopped short of the proximate or the direct cause, treated it with a fix, or accepted the issue as an unexplained anomaly,” Isaacman said.\n\nStarliner ran into problems shortly after embarking on its first crewed mission in June 2024. The astronauts helming the test flight, Wilmore and Williams, expected to fly the spacecraft to the International Space Station and dock for about a week before returning home.\n\nThose plans were quickly dashed, however, when the Starliner spacecraft endured helium leaks and thruster outages en route to the orbiting laboratory. Ultimately, NASA determined the spacecraft was not safe enough to return Williams and Wilmore home, and they became part of the next space station crew rotation, eventually returning home on a SpaceX capsule. The astronauts ultimately spent more than nine months in orbit.\n\nIsaacman also lambasted the decision-making process surrounding the astronauts’ return, saying on Thursday that “disagreements over crew return options deteriorated into unprofessional conduct while the crew remained on orbit.”\n\nOne unnamed NASA worker who was interviewed in the report said, “There was yelling in meetings. It was emotionally charged and unproductive.”\n\nAnother stated: “There are some people that just don’t like each other very much, and that really manifested itself during CFT,” the person said, using the abbreviated name for the crewed Starliner test flight.\n\nWhile long-duration stays on the space station are common, Williams and Wilmore’s saga highlighted concerning flaws with the Starliner capsule — which by 2024 was already years behind schedule.\n\nCritics also considered the Starliner’s performance to mark yet another stain on Boeing’s reputation, as the aerospace giant grappled with scandals including the 737 Maxcrashesandcover-up allegations.\n\nDespite the Starliner critiques and controversy, Boeing said in a statement Thursday that it remains “committed to NASA’s vision for two commercial crew providers” — indicating the company will continue to pursue bringing Starliner into operation.\n\n“We’re grateful to NASA for its thorough investigation and the opportunity to contribute to it,” the Boeing statement reads. “In the 18 months since our test flight, Boeing has made substantial progress on corrective actions for technical challenges we encountered and driven significant cultural changes across the team that directly align with the findings in the report.”\n\nThe Starliner incident is stunning. It placed Boeing — which has held contracts and worked closely with NASA through the space agency’s history — squarely in second place behind SpaceX, which when the Commercial Crew Program began was a relative newcomer to the space industry.\n\nNASA’s latest investigation also raises questions about the space agency’s oversight protocols and safety backstops just before the most important human spaceflight mission in decades gets off the ground: Artemis II, a 10-day trip around the moon that will send four astronauts on the first mission to deep space in more than five decades.\n\nIsaacman, when asked, said that the institutional shortcomings that led to the Starliner incident did not extend to parts of the agency that determine that safety for the Artemis moon mission.\n\nWhile Starliner was developed under a commercial contract — in which NASA gives a company a fixed price and offers only oversight during spacecraft development — the Artemis rocket and spacecraft were developed in-house at NASA, using what’s called “cost-plus” contracts.\n\nThe Artemis II mission is “very different” from Starliner, Isaacman said. The rocket NASA is using for the mission, which counts Boeing as its primary contractor, “leverages a lot of components that go back to the Space Shuttle program, procured and assembled in a more traditional way, and also with the mindset that this is now the most important human space light mission in more than a half century.”\n\n“There cannot be enough eyes on this program,” Isaacman said of the Artemis lunar mission. “I’ve dispatched second and third and fourth sets of eyes during the Artemis II campaign.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nasa.gov/wp-content/uploads/2026/02/nasa-report-with-redactions-021926.pdf?emrc=76e561",
      "text": "report"
    },
    {
      "url": "https://nodis3.gsfc.nasa.gov/npg_img/N_PR_8621_001D_/N_PR_8621_001D__Chapter1.pdf",
      "text": "Type A” mishap"
    },
    {
      "url": "https://www.cnn.com/2025/12/17/science/nasa-administrator-jared-isaacman-senate-vote",
      "text": "NASA’s top job"
    },
    {
      "url": "https://www.cnn.com/2024/03/10/business/boeing-victims-families-5th-anniversary",
      "text": "crashes"
    },
    {
      "url": "https://www.cnn.com/2024/06/18/business/boeing-whistleblower-calhoun-testimony",
      "text": "cover-up allegations"
    },
    {
      "url": "https://www.cnn.com/2026/02/19/science/nasa-boeing-starliner-investigation-report",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/19/science/nasa-boeing-starliner-investigation-report",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fa430db205339c6e607b2de2397b49ec9f14d5f398745fc052ba253f8b6d375b",
  "scraped_at": "2026-02-20T07:28:11.739885+00:00"
}