{
  "url": "https://lite.cnn.com/2026/02/17/uk/palmerston-cat-dies-uk-intl-hnk",
  "title": "Palmerston, one of the UK’s top diplocats, dies in Bermuda | CNN",
  "date": "2026-02-17T07:29:47.532767+00:00",
  "authors": [
    "Lex Harvey, CNN"
  ],
  "text": "Source: CNN\n\nPalmerston, the black and white feline who rose from the streets of London to the hallowed halls of Britain’s Foreign Office, has died in Bermuda, London’s foreign ministrysaid Monday.\n\nThe former ‘Chief Mouser’ of the Foreign Office retired from Whitehall in 2020 but returned to the spotlight in 2025 when he joined the new Governor of Bermuda Andrew Murdoch in the overseas territory, according to an Instagram post.\n\nThe cat’s X accountsaid the “diplocat extraordinaire” passed peacefully on February 12.\n\nAffectionately known as ‘Palmy,’ the feline was a “special member of the Government House team in Bermuda, and a much loved family member,” the post said.\n\n“He was a wonderful companion, with a gentle nature, and will be sorely missed.”\n\nPalmerston was rescued from the Battersea Dogs and Cats Home and joined the Foreign Office in 2016 during a turbulent time in British politics, just months before the UK voted to withdraw from the European Union.\n\nNamed after the 19th-Century Foreign Secretary and Prime Minister Viscount Palmerston, the cat quickly garnered a large online fanbase, boasting nearly 100,000 followers as of Tuesday who closely tracked his adventures across Westminster.\n\nPalmerston enjoyed a friendly rivalry with Britain’s most famous cat, 10 Downing Street’s Larry, whojust celebrated 15 years in his post.\n\n“Farewell old friend x,” Larry said on X.\n\nAmong Palmerston’s many contributions to the UK public service was pest control. Just weeks into his post, Palmerston caught his first mouse, according to acongratulatory X postfrom the former Permanent Under-Secretary for Foreign and Commonwealth Affairs Simon McDonald.\n\nHe was also a philanthropist and raised more than 3,000 British pounds ($4,082) for Battersea Dogs and Cats Home.\n\nPalmerston retired in 2020 during the Covid pandemic to “spend more time relaxing away from the limelight,” according to aletter pawed by the catand addressed to McDonald.\n\n“I will miss hearing the footsteps of an Ambassador and sprinting to my hideout to see who it is,” Palmerston wrote, adding that his departure would be a “major loss for our intelligence gathering” but it was time to “enjoy some me-time.”\n\nIn 2025, “a purr-fect role” lured Palmerston out of retirement, the beloved cat said on X.\n\nPalmerston ditched London’s grey skies and rain for the white sandy beaches and clear waters of Bermuda, where in his final days he could be seen playing with giant avocados, welcoming foreign dignitaries and handing out poppies ahead of Remembrance Day, according to his X account.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.instagram.com/p/DU04DGFDNQQ/?img_index=5",
      "text": "said Monday."
    },
    {
      "url": "https://x.com/DiploMog/status/2022412136056868910",
      "text": "’s X account"
    },
    {
      "url": "https://www.cnn.com/2026/02/16/world/video/larry-the-cat-downing-street-15-years-digvid",
      "text": "just celebrated 15 years in his post."
    },
    {
      "url": "https://x.com/SimonMcDonaldUK/status/727402807804964864?s=20",
      "text": "congratulatory X post"
    },
    {
      "url": "https://x.com/DiploMog/status/1291618656678490117?s=20",
      "text": "letter pawed by the cat"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/uk/palmerston-cat-dies-uk-intl-hnk",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/uk/palmerston-cat-dies-uk-intl-hnk",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fa77785273e05d49267d9fe0e456243fc18693a3256b14c3062182e0383ab1b0",
  "scraped_at": "2026-02-17T07:29:47.532780+00:00"
}