{
  "url": "https://lite.cnn.com/2026/02/09/politics/redacted-text-jeffrey-epstein-files",
  "title": "13 controversial redactions from the Epstein files — and what we’re learning about them | CNN Politics",
  "date": "2026-02-11T16:38:18.084987+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nThis has beena big weekin the long-running — and still very much not-over — saga ofthe Jeffrey Epstein files.\n\nThat’s because we’ve begun to learn more about the Justice Department’scontroversial redactions, as lawmakers have had an opportunity to review theunredactedfiles.\n\nOne prominent House Democrat, Rep. Jamie Raskin of Maryland, said Monday afternoon that he had reviewed the unredacted documents and saw “tons of completely unnecessary redactions.”\n\nAnd the bipartisan lawmakers who forced the Trump administration to release the Epstein files have identified six peoplewhose names, they say, were redacted inappropriately.\n\nAs millions of documents have trickled out and been sorted through, one of the major subplots is what DOJ chose to redact. Its redaction decisions in many caseswent well beyondwhat the legislation passed by Congress called for.\n\nPerhaps no redactions have garnered more attention than the suspected co-conspirators who are described in internal Justice Department documents and others who exchanged eyebrow-raising emails with Epstein.\n\nThe latter instances include emails that read as if people were evaluating and even scouting women or girls for Epstein. In other cases, they reference questionable behavior.\n\nThe redactions also raised concerns among Epstein’s survivors. Onetold CNNthat DOJ was “shielding predators.” Another said DOJ has “protected the Epstein class with blanket redactions.”\n\nThe Justice Department suggested last week that any such redactions were women or girls who might have been victims at one point, or law enforcement officials.\n\n“We did not redact any names of men, only female victims,” a DOJ official told CNN at the time.\n\nBut that hasn’t turned out to be true.\n\nSo which documents are at issue? Below are some noteworthy examples.\n\nIn a2014 email, a sender whose name is redacted emails Epstein: “Thank you for a fun night… Your littlest girl was a little naughty.”\n\nRepublican Rep. Thomas Massie of Kentucky, one of the bipartisan duo that forced the release of the Epstein files, said the email was sent by a woman.\n\n“So it may be proper to redact it. It may not be, I don’t know,” Massie said. “It seems like part of their algorithm for redaction was just to redact every woman in there, pretty much.”\n\nIn a2018 email, a redacted sender emails Epstein: “I found at least 3 very good young poor but we was so tired.”\n\nThe sender then suggests the subject of the email was women or girls: “Meet this one, not the beauty queen but we both likes her a lot.”\n\nIn a2017 email, a redacted sender emails Epstein, “I met [REDACTED] today. She is like Lolita from Nabokov , femme miniature :) So now I should send you her type of candidates only ?”\n\n“Femme miniature” in French literally translates to small woman. “Lolita from Nabokov” refers to Vladimir Nabokov’s 1955 novel about a middle-aged man who falls in love with a 12-year-old girl and sexually abuses her. (Epstein’s airplane has often been dubbed the “Lolita Express” because of allegations that it was used to exploit girls.)\n\nSome of the biggest news to come out of the latest document dump was that we finally laid eyes ona draft indictmentof Epstein from the 2000s, before he escaped with a sweetheart deal.\n\nThe draft indictment is particularly notable because it includes three co-conspirators that prosecutors apparently considered charging. The co-conspirators are described as being employed by Epstein, but their names are redacted.\n\nThe documents also includea chart, apparently from law enforcement, that shows Epstein, his accomplice Ghislaine Maxwell and his longtime assistant Lesley Groff (whose first name is misspelled as “Leslie”).\n\nBut redacted are three employees and a “girlfriend” of Epstein’s whom authorities thought might be recruiting for Epstein and in some cases otherwise participating in crimes.\n\nIt says of one of them: “Unknown if she was directly responsible for recruiting girls but at least 10 girls state she is the direct point of contact for scheduling his massage appointments.”\n\nOther such charts featuresimilar redactions.\n\nBut this week, the Justice Department did un-redact several names fromsimilar documents, including Groff; billionaire business magnate Les Wexner; and former French modeling agent Jean-Luc Brunel, who are all listed as “co-conspirators.”\n\nAn attorney for Groff, Michael Bachner, said in a statement to CNN that Groff had “never seen this document and was unaware of it.”\n\n“In fact, neither Lesley nor her counsel were ever notified that she was considered a co-conspirator. On the contrary, after Lesley voluntarily spoke with prosecutors, and answered each and every question asked of her, she was told that she was not being prosecuted,” he wrote.\n\nBrunel was found dead in prison in 2022. CNN has reached out to Wexner’s foundation for comment.\n\nA legal representative for Wexnertold a local television stationthat the characterization of Wexner as a co-conspirator was not accurate. “The Assistant U.S. Attorney in charge of the Epstein investigation stated at the time that Mr. Wexner was neither a co-conspirator nor target in any respect. Mr. Wexner cooperated fully by providing background information on Epstein and was never contacted again,” the representative said.\n\nIn a2017 email, a redacted person emails Epstein detailed information about women to be considered for an unspecified opportunity.\n\nOne is described as wanting “the job badly. But not as pretty as other applicants.” Another is labeled “not very young but beautiful and diligent, well educated and simple, not ambitious.”\n\nIn oneextended 2015 email exchangebetween Epstein and a redacted interlocutor, Epstein asks, “any friends for jeffrey while you are recovering?”\n\nThe person responds by citing a close friend described as “Sweet girl. 20y. American.” (Epstein responds that the person looks like the sender, suggesting the email included a photo.) The person later cites someone else: “She’s australian, super cool, 23y, lot of fun ;)) (dark hair girl at picture) .”\n\nThe person later adds: “I’m always think about you when I’m meeting new girls.” And then: “And this one is (i think) totally your girl. … Just medsaged her to check up.”\n\nIn a2009 email, Epstein writes a brief email to a redacted recipient that includes the words, “where are you? are you ok I loved the torture video.”\n\nAfter this piece was initially published, Massieidentified the recipient as a “A Sultan.”Deputy Attorney General Todd Blanche saidan email address of the sultan was redacted, and he linked to a document suggesting the sultan at issue was Sultan Bin Sulayem, an Emirati businessman. CNN has reached out to his business, DP World, for comment.\n\nIn a2013 email, a redacted sender from a modeling agency writes to Epstein: “New Brazilian just arrived, sexy and cute, 19yo.” The email appears to come with images attached. (CNN has reached out to the modeling agency.)\n\nIn other versions of the same email released by DOJ, the sender’s affiliation with themodeling agency is redacted. Some versions of the email also included an “=” sign in place of the “1” – the files include many documents with “=” in place of characters – leading some to believe the email described a 9-year old. Butit did not.\n\nIn a2014 email, a redacted sender emails Epstein: “I can’t take it anymore!!!!!!! I just saw the most beautiful little girl on Madison with long soft blonde hair.”\n\nIn a2018 email, a redacted sender writes an email that includes an image, but it appears as a broken image in the file that was released.\n\n“My favorite from Lithuania, [REDACTED], 19. Will meet when I am there,” the sender says.\n\nEpstein responds: “full name instagram?”\n\nIn a 2013 email, a redacted person sends Epstein an email with no text but that includes a photo of a woman posing while wearing a SpaceX shirt. The person’s face is blocked out.\n\nIn a2015 email, a redacted sender emails Epstein about teenage girls.\n\n“the key are the 14 to 15 year old girls—i am a sexual pervert because i say they are now of a reproductive age?” the sender says.\n\nThe sender adds: “being called a sexual pervert is no fun. less so if you have served time for the crime. as i have not—they are calling me one merely for not urging your death by beheading.”\n\nThis story and headline have been updated with new reporting as lawmakers have reviewed unredacted versions of the files.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/politics/live-news/trump-administration-news-02-09-26",
      "text": "a big week"
    },
    {
      "url": "https://www.cnn.com/politics/jeffrey-epstein-associates-communication-vis",
      "text": "the Jeffrey Epstein files"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/justice-department-under-scrutiny-for-revealing-victim-info-and-concealing-possible-enablers-in-epstein-files",
      "text": "controversial redactions"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/unredacted-epstein-files-doj-congress",
      "text": "whose names, they say, were redacted inappropriately"
    },
    {
      "url": "https://www.cnn.com/2025/12/22/politics/justice-department-redactions-epstein-files",
      "text": "went well beyond"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/politics/justice-department-under-scrutiny-for-revealing-victim-info-and-concealing-possible-enablers-in-epstein-files",
      "text": "told CNN"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01930501.pdf",
      "text": "2014 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02504630.pdf",
      "text": "2018 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02648868.pdf",
      "text": "2017 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01703108.pdf",
      "text": "a draft indictment"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01653418.pdf",
      "text": "a chart"
    },
    {
      "url": "https://www.nytimes.com/2026/01/30/us/epstein-inner-circle.html",
      "text": "similar redactions"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00173201.pdf",
      "text": "similar documents"
    },
    {
      "url": "https://www.nbc4i.com/news/local-news/new-albany/wexner-named-as-possible-co-conspirator-in-epstein-files-lawyer-offers-context/",
      "text": "told a local television station"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02654070.pdf",
      "text": "2017 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00840161.pdf",
      "text": "extended 2015 email exchange"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00749245.pdf",
      "text": "2009 email"
    },
    {
      "url": "https://x.com/RepThomasMassie/status/2020997755695468890",
      "text": "identified the recipient as a “A Sultan.”"
    },
    {
      "url": "https://x.com/DAGToddBlanche/status/2021039636831781134",
      "text": "an email address of the sultan was redacted"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA01187999.pdf",
      "text": "2013 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2011/EFTA02706746.pdf",
      "text": "modeling agency is redacted"
    },
    {
      "url": "https://www.yahoo.com/news/articles/fact-check-doj-epstein-librarys-095825612.html",
      "text": "it did not"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01928255.pdf",
      "text": "2014 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA01022356.pdf",
      "text": "2018 email"
    },
    {
      "url": "https://www.justice.gov/epstein/files/DataSet%209/EFTA00628112.pdf",
      "text": "2015 email"
    },
    {
      "url": "https://www.cnn.com/2026/02/09/politics/redacted-text-jeffrey-epstein-files",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/09/politics/redacted-text-jeffrey-epstein-files",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fb04c8d72368d692a9061738e8fe4401d813230885eb55371ed94d0ed198bad0",
  "scraped_at": "2026-02-11T16:38:18.085000+00:00"
}