{
  "url": "https://lite.cnn.com/2026/02/11/business/us-stocks-bonds-january-jobs-report",
  "title": "Stocks are mixed as January hiring jumps | CNN Business",
  "date": "2026-02-11T16:31:11.321218+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nA brief rally in US stocks paused Wednesday morning after new data showed the economyadded 130,000 jobsin January, exceeding economists’ expectations.\n\nStocks were mixed after opening higher. TheDowwas down 219 points, or 0.44%. The S&P 500 rose 0.05%. The tech-heavy Nasdaq Composite was down 0.1%.\n\nThe US economyadded 130,000 jobs in January, according to the Bureau of Labor Statistics, outpacing economists’ estimates for 75,000 jobs. The jobs report could boost hopes for economic growth this year — but it could also push back expectations for Federal Reserve interest-rate cuts, posing a headwind for stocks.\n\nStocks initially jumped higher Wednesday morning after the data release before turning lower as traders adjusted to the prospect of the Fed holding interest rate steady for longer. The hot jobs number decreases expectations for lower rates, said José Torres, senior economist at Interactive Brokers.\n\nThe Russell 2000, an index of smaller stocks more sensitive to interest rates, sank 1.2%.\n\nTreasury yields, which rise when bond prices fall, jumped higher as investors adjusted their expectations for stronger growth and fewer Fed interest-rate cuts. The US dollar index, which measures the dollar’s strength relative to six major currencies, rose 0.24%.\n\nWhile stocks were lower Wednesday morning, some investors were optimistic that strong jobs growth could still support a broad stock market rally.\n\n“January’s employment report was strong, which likely keeps the (Fed) on hold for now. The bigger implication may be for stocks,” Brad Conger, chief investment officer at Hirtle Callaghan, said in a note. “A stronger job market will support the ‘broadening trade’ — the rotational to industrial, cyclicals and consumer discretionary from technology.”\n\nThe stronger-than-expected job gains come after recent data had suggested a shaky economy. Shares stumbled last week on news about job openings in December hitting theirlowest level in five yearsas investors tried to assess the health of the economy and figure out whether to cash in on pricey stocks.\n\nSo with the official jobs report released Wednesday,delayed by several daysbecause of the brief partial government shutdown, investors will have to digest a stronger-than-anticipated view of the health of the economy. In addition to strong job gains, the jobless rate ticked down to 4.3% from 4.4%.\n\n“Markets may have been expecting a downshift in today’s numbers after last week’s soft data, but the jobs market hit the gas pedal instead,” Ellen Zentner, chief economic strategist at Morgan Stanley Wealth Management, said in a note.\n\nNot enough new jobs, or a loss in jobs, could have suggested an economy in trouble. Consumer spending in December wasweaker than expected, according to Commerce Department data. And last month was theworst January for hiring announcements since 2009, according to data from career services companyChallenger, Gray & Christmas.\n\nThat put extra weight on the monthly payrolls number. The healthy jobs growth could boost views that the US economy has room to run this year. Still, the large number of job gains might make Fed policymakers back off any further interest-rate cuts this year.\n\n“The (Fed’s) gaze instead will turn to the inflation picture with the economy continuing to perform above expectations,” Kay Haigh, global co-head of fixed income and liquidity solutions at Goldman Sachs Asset Management, said in a note.\n\nThe BLS’ latest benchmark annual revision also showed the US economy added fewer jobs from April 2024 to March 2025 than previously expected. But the stronger-than-anticipated January job growth, coupled with the tick-down in the unemployment rate, boosted Wall Street’s optimism about stocks that are sensitive to economic growth prospects, like energy and industrials.\n\n“We believe the rotation toward ‘old economy’ and pro‑cyclical sectors should continue,” Angelo Kourkafas, senior global strategist at Edward Jones, said in a note.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "added 130,000 jobs"
    },
    {
      "url": "https://www.cnn.com/markets",
      "text": "Dow"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/economy/us-jobs-report-january-final",
      "text": "added 130,000 jobs in January"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/economy/us-jobs-data-layoffs-hiring",
      "text": "lowest level in five years"
    },
    {
      "url": "https://www.cnn.com/2026/02/02/economy/us-shutdown-january-jobs-report-bls",
      "text": "delayed by several days"
    },
    {
      "url": "https://www.cnn.com/2026/02/10/business/retail-sales-december",
      "text": "weaker than expected"
    },
    {
      "url": "https://www.cnn.com/2026/02/05/economy/us-jobs-data-layoffs-hiring",
      "text": "worst January for hiring announcements since 2009"
    },
    {
      "url": "https://www.cnn.com/2026/02/11/business/us-stocks-bonds-january-jobs-report",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/11/business/us-stocks-bonds-january-jobs-report",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fb23ed24ed68bd72124d829e2852da295bed8b64b2c1c8f2153d824d39c9af15",
  "scraped_at": "2026-02-11T16:31:11.321233+00:00"
}