{
  "url": "https://lite.cnn.com/2026/02/26/politics/jesse-jackson-civil-rights-legacy",
  "title": "Analysis: A pivotal chapter of American history is closing with Jesse Jackson’s death | CNN Politics",
  "date": "2026-02-28T07:01:39.865938+00:00",
  "authors": [
    "Analysis by Abby Phillip"
  ],
  "text": "Source: CNN\n\nOn October 8, 1941,Jesse Jacksonwas born into a world where he could not walk into the same buildings as his White neighbors or check out a book at the local library. He could not go to school with White children who played nearby. And only three percent of eligible Black voters in the South were registered to vote.\n\nLike so many others of his generation, Jesse Jackson’s introduction to public life came through the Black church. There, he learned to lead and to reach the souls of those touched by his voice. He was mentored at the feet of a generation of men who saw the moral imperative of justice.His deathsignals that their time with us is ending quickly.\n\nThere are so many things that are improbable about Jesse Jackson’s life. Born to an unwed, teen mother in the Jim Crow South, he emerged from that upbringing with a sense of uncommon purpose. He took that drive and embedded himself in the heart of the civil rights movement to become the youngest of Rev. Martin Luther King Jr.’s staffers. In the 1970s, he branched out on his own to launch Operation PUSH.\n\nPUSH took up the final mantle carried by Dr. King until his death – and it is where Jackson’s memorial services will kick off Thursday in Chicago. With its mission of advancing the economic liberation of Black Americans and the poor, Jackson’s group quickly became a civil rights organization that had few equals in its ability to extract material changes to the practices of the monied power brokers in American society who still sought to keep Black Americans shut out of the nation’s economic life. His economic covenants opened the doors to corporate positions, franchises and real ownership for Black Americans for decades.\n\nBut perhaps the most improbable thing about Jackson’s life is his longevity.\n\nFor most of the six decades that he spent in public life, the spectre of death hung over him as it had for so many prominent Black men who were gunned down in their prime years. King was killed at 39. Medgar Evers at 37. Fred Hampton at 21.\n\nAnd yet, despite this reality, and the constant stream of threats he and his family faced, Jackson remained out front. He was a key figure in the effort to move beyond a fight for basic human rights and toward a future in which Black Americans had full economic and civic participation in the nation of their birth.\n\nIt is easy to dismiss the effort and sacrifice of these men, as imperfect as they may have been, now that the fruits of their labor are being enjoyed freely. Jim Crow style barriers to the ballot box are gone. Black Americans can be CEOs of Fortune 500 companies and owners of banks and businesses nation-wide. A Black man has been elected president, and a Black and South Asian woman elected vice president. But without the effort of Jackson and others of his generation, none of that may have come to be.\n\nThere is another lesson in Jackson’s life work and in the work of the civil rights movement that finally forced America to live up to its founding principles. It was never only for the benefit of Black Americans that they marched and sat-in and saw the insides of jail cells. It was for all Americans: women, Asian Americans, Hispanic Americans and so many others who subsequently benefited from their work.\n\nIn 1984, when Jackson ran for president the first time, his improbable campaign was a warning shot to a political establishment that had for decades accepted the votes of its constituent groups, but had not been willing to fully share power.\n\n“We are members of the party and we don’t want to leave,” Jackson told his fellow Democrats. “But our self-respect is non-negotiable.”\n\nHe was, without question, powered by the support of ordinary Black Americans. They were the first to see themselves in him – an ordinary man from the South who chose to do extraordinary things. But he offered a path forward for the entire nation that left the divisions of the past behind.\n\n“We must leave the racial battle ground and come to the economic common ground and moral higher ground. America, our time has come,” he said on the stage of the Democratic National Convention in 1984.\n\nWith his 1984 and 1988 campaigns, Jackson altered the fabric of the Democratic Party. Like many outsider candidates, he ran against the establishment. And though he didn’t win the nomination, history shows that in many ways he was prescient in his brand of populist politics and his advocacy of many issues that later became mainstream.\n\nThe Democratic Party that Jackson ran in was one with delegate rules that were meant to keep candidates like him from the nomination. By changing those rules, he created the conditions that Barack Obama utilizedto win the nominationin his history-making 2008 presidential bid. He supercharged the power of Democratic voters by registering millions to vote. And he demonstrated the resonance of an economic message focused on the shared dreams of all Americans.\n\nWhenJohn Lewis diedin 2020 at age 80, he bore the physical scars of the freedom struggle. Jesse Jackson, at 84, bore the psychological ones. Both men had been witness to the horror of racial violence from the brutal beatings at Selma to Dr. King’s assassination. They are a reminder of the sacrifices made by one of America’s greatest generations – a generation that is now quickly passing on.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/us/jesse-jackson-fast-facts",
      "text": "Jesse Jackson"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/us/reverend-jesse-jackson-death",
      "text": "His death"
    },
    {
      "url": "https://www.cnn.com/2008/POLITICS/08/27/dnc.main/index.html",
      "text": "to win the nomination"
    },
    {
      "url": "https://www.cnn.com/2020/07/17/politics/john-lewis-dead-at-80",
      "text": "John Lewis died"
    }
  ],
  "hash": "fb41fdd3208364dc6adeff52bf2a2084f4ab2d1c790bf531f9265baba9f72287",
  "scraped_at": "2026-02-28T07:01:39.865950+00:00"
}