{
  "url": "https://lite.cnn.com/2026/02/25/americas/cuba-florida-speedboat-intl-latam",
  "title": "Cuba says its forces kill four in gunfight after Florida speedboat tries to ‘infiltrate’ island | CNN",
  "date": "2026-02-27T07:16:53.145079+00:00",
  "authors": [
    "Mauricio Torres",
    "Hira Humayun",
    "Lex Harvey",
    "German Padinger"
  ],
  "text": "Source: CNN\n\nCuba said its forces fatally shot four heavily armed people attempting to “infiltrate” its territory on a Florida-registered speedboat on Wednesday, amid simmering tensions between the communist island and the US.\n\nCuban border guard troops approached the boat after it entered their territorial waters in Falcones Cay, Villa Clara province, just over 100 miles from Florida, the country’s interior ministry said in a statement.\n\nA passenger on the speedboat shot at the Cuban vessel, wounding its commander, and prompting Cuban forces to return fire, according to the statement. Six other people aboard the speedboat were wounded and are in custody and receiving medical attention.\n\nThe passengers were Cuban residents of the US and were armed with assault rifles, handguns and Molotov cocktails, and had “intended to carry out an infiltration for terrorist purposes,” according to a later statement from the ministry.\n\nTwo of the surviving passengers were previously wanted by Cuba for terrorism, the ministry added.\n\nThe vessel was not carrying US government personnel and was not on a US government operation, US Secretary of State Marco Rubio said earlier.\n\nThe registration number given by Cuban authorities, FL7726SH, matched a 24-foot power boat that was manufactured in 1981, according to maritime database records.\n\nAnother individual who was sent from the US to “facilitate the reception of the armed infiltration” was arrested and has since confessed, the Cuban interior ministry statement said. CNN has reached out to the White House regarding the latest Cuban statement.\n\nThe shootout comes amidheightened tensionsbetween the US and Cuba. Following the US ousting in January of Venezuelan leader and Cuban ally Nicolás Maduro, the administration of US President Donald Trump has set its sights on Cuba, blocking all oil deliveries to the island and talking of regime change.\n\nThe blockade has brought Cuba’s economy to its knees, with the Caribbean nation experiencing its worst era ofeconomic uncertaintyin decades and the UN warning of a potential humanitarian “collapse.”\n\nThe USeased the embargo slightlyon Wednesday, saying it would grant licenses to private Cuban entities looking to resell oil from Venezuela, the main supplier of crude and fuel to the Cuban market. That market is largely dominated by the public sector.\n\nCuba’s forces have engaged in skirmishes with US boats entering its waters in the past, though it is rare to see deadly shootouts on this scale.\n\nHavana’s ministry of the interior said itintercepted 13 US speedboatsin 2022 with 23 crew members who it accused of “carrying out human trafficking operations” taking people from Cuba to the US.\n\nThe north coast of Villa Clara province, where the speedboat was intercepted on Wednesday, is known for its white-sand beaches, shallow waters and sandbars. The US Coast Guard has previously intercepted speedboats off its coast that it said were carrying illegal migrants to the US, which is home to a Cuban exile community largely opposed to the island’s communist government.\n\nThe fatal shooting comes just one day after the 30-year anniversary of when the Cuban military downed two planes belonging to the Cuban-American humanitarian organization Brothers to the Rescue over the waters north of Havana, killing four.\n\nEarlier this month, Trumpextended a Clinton-era emergency measure, enacted after Cuba shot down the planes, which allows US authorities to board any vessel which may be headed toward Cuba.\n\nNearly one million Cubans have fled to the US in recent years, withthousands attemptingthe perilous sea journey to Florida in makeshift vessels. However, unlike previous Republican and Democratic administrations, which generally treated Cubans as political refugees and gave them a unique fast track to US residency,Trump has deported Cubansin record numbers.\n\nEarlier, US Secretary of State Marco Rubio said the US embassy in Havana was looking into the incident after being informed of it by Cuban authorities. The Department of Homeland Security and the US Coast Guard are also involved.\n\n“We’re going to find out exactly what happened here and then we’ll respond accordingly,” said Rubio, who was in the region on an official visit to Saint Kitts and Nevis.\n\n“Suffice it to say, it is highly unusual to see shootouts on open sea like that,” he added. “It’s something, frankly, that hasn’t happened over Cuba in a very long time.”\n\nOfficials from Florida called for an investigation and for the Cuban government to be held accountable.\n\nFlorida Attorney General James Uthmeier said he has directed the Office of Statewide Prosecution to help federal, state, and law enforcement authorities begin an investigation.\n\nUS Republican Congressman Carlos A. Gimenez, whose district includes the southern tip of Florida, said the incident raised concerns about the use of lethal force against people aboard a US-registered vessel and called for an investigation into the incident.\n\nRepublican Senator Rick Scott, also from Florida, called the incident “deeply concerning” and said the Cuban government “must be held accountable.”\n\nCuba ally Russia also weighed in on the incident, with a foreign ministry spokeswoman calling it an “aggressive provocation by the United States” aimed at triggering conflict, according to Russian state news agency TASS.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/2026/01/29/americas/us-cuba-oil-blockade-threat-of-war-intl-latam",
      "text": "heightened tensions"
    },
    {
      "url": "https://www.cnn.com/2026/02/18/americas/cuba-us-trump-oil-tourism-intl-latam",
      "text": "economic uncertainty"
    },
    {
      "url": "https://ofac.treasury.gov/faqs/1238",
      "text": "eased the embargo slightly"
    },
    {
      "url": "https://misiones.cubaminrex.cu/en/articulo/ministry-interior-reports-violent-incidents-related-illegal-departures-country",
      "text": "intercepted 13 US speedboats"
    },
    {
      "url": "https://www.federalregister.gov/documents/2026/02/18/2026-03272/continuation-of-the-national-emergency-with-respect-to-cuba-and-of-the-emergency-authority-relating",
      "text": "extended a Clinton-era emergency measure"
    },
    {
      "url": "https://www.cnn.com/2022/09/23/politics/immigration-cuba-haiti-ocean-coast-guard/index.html#:~:text=Subscribe-,More%20Cubans%20are%20coming%20to%20the%20US%20by,any%20time%20since%20the%201990s&text=%E2%80%A2%20Source:%20CNN-,Surfboards%20tied%20together:%20Makeshift%20boats,migrants'%20desperation%20to%20...&text=An%20alarming%20trend%20is%20emerging,fiscal%20year%20since%20the%201990s.",
      "text": "thousands attempting"
    },
    {
      "url": "https://www.cnn.com/2025/09/02/americas/cuba-deportees-us-ice-intl-latam",
      "text": "Trump has deported Cubans"
    }
  ],
  "hash": "fbd1e9bf63f6839e73d9db92e78770919eef3a7897aa2b59f379d486546c0fbf",
  "scraped_at": "2026-02-27T07:16:53.145092+00:00"
}