{
  "url": "https://lite.cnn.com/2026/02/28/politics/iran-strikes-congress-war-powers-trump",
  "title": "Congress to vote on Trump’s war powers in aftermath of Iran strikes | CNN Politics",
  "date": "2026-03-01T07:06:29.672593+00:00",
  "authors": [
    "Sarah Ferris"
  ],
  "text": "Source: CNN\n\nTop Capitol Hill Democrats, and a small number of Republicans, watched in alarm Saturday as the US launched amajor assault on Iran, decrying President Donald Trump’s call for the overthrow of another foreign government without their expressed approval.\n\nTrump ordered the strikes on Tehran just days before the GOP-led House and Senate are each set to formally debate and vote on US military action in Iran. Democrats, along with at least three Republicans, say the president’s decision, with lawmakers scattered across the nation and not planning to return to Washington for days, raises serious questions about thelegality of the attack.\n\n“It’s a slap in the face of the United States Congress. The president has launched an illegal war when there is no imminent threat. He did not consult with Congress or allow for a debate in Congress, which even George W. Bush did,” Democratic Rep. Ro Khanna of California told CNN on Saturday morning.\n\nNow, House and Senate Democratic leaders — as well as the famously anti-interventionist Republican Rep. Thomas Massie — are demanding that GOP leaders bring Congress back into session immediately to hold a formal vote on the unfolding conflict in Iran.\n\n“I am opposed to this War. This is not ‘America First,’” said Massie of Kentucky.\n\n“The Constitution conferred the power to declare or initiate war to Congress for a reason, to make war less likely,” Sen. Rand Paul, a leading Republican in the Senate effort to curb Trump’s war authority, similarly declared, adding that his “oath of office is to the Constitution, so with studied care, I must oppose another Presidential war.”\n\nThose votes to require congressional approval for military action against Iran, which were already set for midweek, will amount to a major test of loyalty for some of the GOP’s far-right flank, who have for years championed Trump’s promise of keeping America out of foreign wars. Those Republicans will be forced to take a public stance after months of simmering consternation over Trump’s legal authority as he has dramatically expanded powers abroad with Congress on the sidelines.\n\nMultiple GOP sources told CNN they believe those three Republicans — Massie, Paul and Rep. Warren Davidson, who has also publicly condemned the attack without authorization — are likely on an island in their own party. Even so, Democrats believe it might be enough to deliver the rebukes.\n\n“I do think this has a real chance of passing. And it’s going to be seen like the Iraq war vote,” Khanna added, referring to the historic 2002 vote in Congress that authorized the US invasion of Iraq.\n\nEven if the measure passes, it is subject to a presidential veto, and a two-thirds vote to override could be a challenge to reach. So while it would be unlikely to change the president’s actions, it would be seen as a stunning rebuke of the administration.\n\nOne Republican, speaking to the CNN on the condition of anonymity because they had received classified briefings on the operation, fiercely disputed that Trump was leading the nation into another conflict akin to the Iraq War. The person believed there was wide support in the party for the president’s actions.\n\nIndeed, dozens of Republicans were quick to praise Trump’s actions on Saturday morning, including Speaker Mike Johnson and Senate Majority Leader John Thune. But there have been signs of cracks in the GOP in recent days amid rumblings of an Iran assault.\n\nOne ultraconservative Republican, Davidson of Ohio, already telegraphed that he planned to support the Democratic-led bill that would have formally ordered Trump to make the case to Congress for any military actions in Iran, in a major affront to the White House.\n\n“No. War requires Congressional authorization,” Davidson, a former Army Ranger who sits on the House Foreign Affairs Committee,said Saturday, unequivocally stating he did not support the president’s action in Iran.\n\nThe attack is sure to compound months of simmering frustration among many top lawmakers about the White House’s lack of information-sharing related to operations from Iran to Venezuela. The full Congress has not received a briefing related to Iran, though Secretary of State Marco Rubio and CIA Director John Ratcliffe did deliver a classified update to the “Gang of Eight” earlier this week.\n\nAnd while Rubio notified all reachable members of the Gang of Eight congressional leaders in advance of the overnight strikes, those top lawmakers were not given a full accounting of the legal justification, multiple sources familiar with the matter told CNN.\n\nAs they publicly condemned Trump on Saturday for having overstepped his authority, Democratic leaders had already been quietly working with Massie to convince lawmakers to deliver an official rebuke to the White House.\n\nBut as with previous attempts to constrain the Trump administration from Capitol Hill, the minority party faced significant headwinds. At least three pro-Israel Democrats were opposed to such a measure, according to multiple people familiar with the plans.\n\nIt remained unclear whether those Democrats would now approach the vote differently, two people said. House Democrats will hold a caucus call on Sunday evening to discuss the party’s response to the attack, another Democratic source said.\n\nEven Republicans who support Trump’s push for regime change have said Congress needs to have more input — and particularly more briefings.\n\nSen. Thom Tillis, a retiring Republican from North Carolina, said Trump “rightfully determined that this theocratic dictatorship cannot be allowed.” But he was also clear that he expected the White House to be forthcoming about the operation’s details.\n\n“I expect all members of Congress will soon be briefed about Operation Epic Fury and determine whether a broader scope and further military action requires an authorization by Congress,” Tillis said.\n\nJust ahead of the attack, another retiring centrist, GOP Rep. Don Bacon of Nebraska, told CNN he was eager for more talks with the White House.\n\n“I’d like to have a dialogue. The president, early on, talked about regime change. Now he’s focusing on nuclear. I don’t think you’re ever going to get a nuclear-safe environment with this regime. So in the end, this regime cannot stand. It killed about 2,000 Americans so I don’t have any concerns with that,” Bacon, who spent nearly 30 years in the Air Force, said earlier this week.\n\n“We don’t want boots on the ground, but we should bomb the crap out of them,” he added.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://www.cnn.com/world/live-news/israel-iran-attack-02-28-26-hnk-intl",
      "text": "major assault on Iran"
    },
    {
      "url": "https://www.cnn.com/2026/02/28/politics/legal-experts-iran-strikes-congress-war-powers",
      "text": "legality of the attack"
    },
    {
      "url": "https://x.com/WarrenDavidson/status/2027767769014341920?s=20",
      "text": "said Saturday"
    }
  ],
  "hash": "fc2f2fbdad200e3bf6650f6294df37e7d650cd610c46ca598049879bb7eca6ed",
  "scraped_at": "2026-03-01T07:06:29.672606+00:00"
}