{
  "url": "https://lite.cnn.com/2026/02/22/us/kouri-richins-utah-trial",
  "title": "Kouri Richins wrote a book on grief after the death of her husband. Now she’s on trial for his murder | CNN",
  "date": "2026-02-24T07:32:56.210961+00:00",
  "authors": [
    "Nicki Brown, CNN"
  ],
  "text": "Source: CNN\n\nAbout a year after her husband’s death, Kouri Richins published a children’s book to help her three sons cope with their grief.\n\n“Just because he’s not present here with us physically, that doesn’t mean his presence isn’t here with us,” Richins said during an interview promoting the bookon a local news program in April 2023. “Dad is still here, it’s just in a different way.”\n\nA month later, the Utah mother was arrested and accused of poisoning her husband, Eric Richins, with a lethal dose of fentanyl in 2022.\n\nOn Monday, a jury will hear opening statements as Richins goes ontrial for the murder of her husband of nine years.Prosecutors allegeshe killed him for financial gain and to start a new life with the man with whom she was having an affair. She is also accused of attempting to poison her husband on Valentine’s Day, weeks before his death.\n\nRichins, 35, haspleaded not guiltyto charges of aggravated murder, attempted aggravated murder, insurance fraud and forgery. If convicted of the most serious charge, she could face up to life in prison.\n\nRichins faces additional financial charges in a separate case. Court records indicate she has yet to enter a plea.\n\nIn a statement to CNN, Richins’ attorneys said their client was eager to have her day in court.\n\n“Kouri has waited nearly three years for this moment: the opportunity to have the facts of this case heard by a jury, free from the prosecution’s narrative that has dominated headlines since her arrest,” her defense attorneys said in the statement. “Now the state must prove the allegations beyond a reasonable doubt.”\n\nEric Richins, 39, was found dead in the couple’s bedroom in the early morning hours of March 4, 2022.\n\nEarlier that night, Kouri Richins brought cocktails up to their room to celebrate a success with her real estate business, according to an account she gave to investigators outlined in court records.\n\nRichins told authorities one of their sons was having bad dreams, so she went to sleep in his room around 9:30 p.m., charging documents said. When she returned to the master bedroom roughly six hours later, she said she found her husband dead in their bed.\n\n“I turned over, like to put my arm around Eric and he was just cold,” she told investigators in April 2023, according to court documents. “Like it was like a – like putting your arm over a cement brick.”\n\nRichins called 911 at 3:21 a.m., and first responders arrived at the home in Kamas, outside Salt Lake City, shortly after. They noted it seemed like Eric Richins had been “dead a while,” the charging documents said.\n\nRichins told investigators she left her cellphone in the master bedroom and called 911 immediately after she found her husband dead. Prosecutors, however, said a forensic analysis of her phone showed it was unlocked six times in the 15 minutes before she made the emergency call at 3:21 a.m.\n\nThe autopsy revealed Eric Richins died from a fentanyl overdose, with about five times the lethal dose in his blood.\n\nKouri Richins told investigators her husband would sometimes take THC gummies before bed – and that she believed they could have contained fentanyl. The night of his death, she told authorities she didn’t think he had eaten one. A year later, Richins said she thought he did eat a gummy that night, prosecutors said in charging documents.\n\nThe medical examiner did not detect THC in Eric Richins’ system, and prosecutors said the gummies in his home did not test positive for fentanyl.\n\nA woman who cleaned Richins’ houses told investigators that Kouri Richins asked for fentanyl in early 2022, charging documents said. The woman said she bought more than 15 pills she thought to contain fentanyl from a drug dealer on February 11, 2022, which she then gave to Richins.\n\nA few days later, on Valentine’s Day, Richins left her husband a sandwich and a note before leaving to meet up with her “paramour,” prosecutors said in charging documents. Later that day, Eric Richins texted his wife: “I’m gonna go lay down for a bit if I don’t start getting better I’m gonna head to the hospital.”\n\nHours later, Eric Richins told two friends he felt like he was going to die after eating the sandwich, according to charging documents. “I think my wife tried to poison me,” he said to one.\n\nEric Richins told the other friend he broke out in hives, then injected himself with an EpiPen and drank a bottle of Benadryl. “You almost lost me,” he said, according to prosecutors.\n\nEric Richins did not have any food allergies, but fentanyl and other opioids can sometimes cause “pseudoallergic reactions,” prosecutors said. His wife’s attorneys have said in court records that Eric Richins believed he was having an allergic reaction, and that there is no evidence to show he ingested drugs that day.\n\nIn late February 2022, Richins allegedly asked the woman for more fentanyl, saying the previous drugs were not strong enough. Richins asked for “some of the Michael Jackson stuff,” the woman told authorities, but she couldn’t remember if the Jackson reference was made during Richins’ first alleged request or the second. Jackson died in 2009 from anoverdose of propofol.\n\nProsecutors said the woman bought more drugs from the same dealer on February 26, 2022. Her phone records, outlined in charging documents, show contact with Richins around the time she met with the dealer.\n\nWithin a week, Eric Richins was dead.\n\nKouri Richins manually deleted more than 800 messages with the woman from January to mid-March 2022, as well as a “significant amount” of cellphone data from that time period, prosecutors said. After Richins was informed of her husband’s cause of death, her phone’s internet history allegedly includedvisits to websitesabout women’s prisons in Utah, life insurance payments, and how police recover deleted cellphone data.\n\nBy that summer, Richins’ phone had been used to make various internet searches, including one that read,“if someone is poisned (sic) what does it go down on the death certificate as,” according to charging documents.\n\nA defense attorney who no longer represents Richins previously said the searches were merely a response to the investigation at the time and not indicative of guilt.\n\nShortly after her arrest, Richins told her family she asked the woman for pain pills that her husband wanted, but he threw them out because they weren’t strong enough, according to court documents. Her former defense attorney said Eric Richins was known as a “partier” who would “consume alcohol and THC in any form.”\n\nProsecutors said Richins repeatedly told law enforcement that her husband didn’t take drugs other than the occasional THC gummy.\n\nProsecutors allege Kouri Richins killed her husband to profit off his lucrative business and life insurance policies – funds she﻿could then use to support her struggling real estate business.\n\n“She also did so because she planned a future with her paramour, and divorcing Eric Richins would leave her without any proceeds from his business and possibly without custody of their children,” prosecutors wrote in court filings.\n\nRichins told a friend in December 2021 that she felt trapped in her marriage and it would be better if her husband was dead, according to charging documents.\n\nOn the day of Eric Richins’ death, his estate was worth roughly $5 million and his wife was “spiraling toward total financial collapse,”prosecutors said. Eric Richins’ life was insured for more than $2 million through several life insurance policies, one of which prosecutors allege his wife fraudulently applied for weeks before he died.\n\nHowever, Eric Richins met with a lawyer in the fall of 2020 to implement various estate planning methods that excluded his wife, charging documents said.\n\n“Eric Richins informed his lawyer that he wanted to protect himself in the short-term from recently discovered and ongoing abuse and misuse of his finances by the Defendant, and to protect his three children in the long-term by ensuring that the Defendant would never be able to manage his property after his death,” prosecutors wrote.\n\nEric Richins appointed his sister to manage his trust and removed his wife as the beneficiary of a $500,000 life insurance policy, which Kouri Richins did not realize until after his death, according to prosecutors.\n\nIn 2023, the drug dealer who allegedly provided the pills to Richins’ housecleaner confirmed he sold her fentanyl, according to court documents. Last year, however, he told investigators he had given the woman a different drug, not fentanyl, Richins’ defense attorneys said in a motion last fall.\n\n“If the state cannot place fentanyl in the hands of the defendant, the state has no case,” Richins’ lawyers wrote. “(The dealer’s) statement doesn’t just poke holes in their case, it throws a grenade in the middle of it.”\n\nProsecutors argued in their own court filing that the dealer’s recent claim isn’t credible. However, even if the jury did take the dealer’s recent statement into consideration, prosecutors said the panel could “still easily convict the Defendant.”\n\nIn theirstatement to CNN, Richins’ defense attorneys said they believe the evidence at trial will support their client’s claim of innocence.\n\n“Kouri is a mother who wants to go home to her children,” her attorneys said. “We are confident this jury will make that possible.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.abc4.com/news/northern-utah/childrens-book-author-accused-killing-husband-good-things-utah-one-month-before-arrest/",
      "text": "on a local news program in April 2023"
    },
    {
      "url": "https://www.cnn.com/2023/05/09/us/utah-mom-childrens-book-husband-killing-cec",
      "text": "Prosecutors allege"
    },
    {
      "url": "https://www.cnn.com/2024/08/27/us/kouri-richins-hearing-verdict-husband",
      "text": "pleaded not guilty"
    },
    {
      "url": "https://www.cnn.com/2013/09/24/showbiz/michael-jackson-death-trial",
      "text": "overdose of propofol"
    },
    {
      "url": "https://www.cnn.com/2023/06/12/us/utah-mom-husband-killing-court-documents",
      "text": "visits to websites"
    },
    {
      "url": "https://www.cnn.com/2026/02/22/us/kouri-richins-utah-trial",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/22/us/kouri-richins-utah-trial",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fcbe48aa2f61b97c552df9c76d4e637d84354fbf591b92b6693c2def6b493da0",
  "scraped_at": "2026-02-24T07:32:56.210975+00:00"
}