{
  "url": "https://lite.cnn.com/2026/02/15/style/the-timeless-allure-of-apres-ski-culture",
  "title": "Why skiing will forever be the most glamorous sport | CNN",
  "date": "2026-02-16T07:34:32.193368+00:00",
  "authors": [],
  "text": "Source: CNN\n\nFor over a century, skiing has been more than transportation or sport. It’s been a lifestyle, emphasis on the second syllable.\n\nErnest Hemingway drew a romantically colorful portrait of spending a few winters in the Austrian Alps in the early 1920s. At the end of his biographical “A Moveable Feast,” his chronicle of carefree mountain living is an aspirational vibe of downhill thrills and après chills. By day, he and his wife Hadley hiked up pre-chairlift mountains, traversing logging trails with skis strapped to their backs. By night they were in Alpine hüttes or local watering holes, indulging in beer, mulled wine, Schnapps, singing and other cozy fun.\n\nAnd since the dawn of skiing-as-pastime, every devotee has known that the appeal is part downhill bliss, part après activity. They are two sides of the same piste, a ski culture embracing carefree adventure, indulgence, bonhomie and individual style.\n\nThis escapist history of ski culture is visually captured in Erin Isakov’s photography book, “Après Ski: The Scene, the Style, the Menu.” Page after page of fashion-distinctive skiers and mountain partiers, including Charlie Chaplin, Clark Gable, Audrey Hepburn, Jane Birkin, David Bowie and Hunter S. Thompson fill the archive. Hemingway, too, gets a mention — although it’s far too brief, simply noting that the author moved to Ketchum, Idaho (where he also died) to be near the first US ski resort, Sun Valley.\n\nThe book is less about the best places for skiing than about the places to best beseenskiing. It points to historically choice resorts, such as Switzerland’s Verbier and Jackson Hole in America’s Wyoming, and includes recipes for throwing your ownaprèsskifête(in other words, the fun that follows the recreational sport), including hot chocolate, an Aperol Spritz, fondue and upscale nachos. The leisurely environment is also captured: See skiers sunbathing or drinking slope side, or lounging in cabins in either activewear or comfortable, yet still stylish clothing.\n\nLike the history of big wave surfing, skiing has evolved over generations of gear design, fashion and location hot spots (some expert only). As for the origin story ofesprit de ski, at least for the rich and famous, Isakov makes the case for Switzerland’s St. Moritz in the 1860s. It then snowballed in popularity in Europe after the first World War.\n\nThe US joined the trend in the 1930s and when European-stationed American soldiers returned from World War II with alpine skills, they helped usher in a generation of new resorts, including Colorado’s Vail and Aspen, known for their ski scene even today.\n\nThe largest section of the book is devoted to ski fashion, the author’s particular and familial passion. Isakov was practically baptized in powder, as her parents met at a California ski resort where they worked. She is also the cofounder of the skiwear brand Erin Snow.\n\nWe learn that women’s skiwear in the early 1900s commonly featured long, ankle-length wool skirts, but quickly gave way to the practicality of pants in the 1920s. Then came slimmer-fit, synthetic stretch fabrics after WWII, with fashion designers such as Emilio Pucci, magazine editors and celebrities barreling into the trend. Over the decades the classic ski look has been complimented by Norwegian sweaters, glare-shunning sunglasses and furry boots.\n\nThe 1980s’ ski fashion stands out for its trends of neon glowing lycra pants and puffy jackets reflected in mirrored, glacier-style sunglasses. The decade rightly gets its own section in the book. The ‘80s also saw the birth of snowboarding, which would become so popular in the ‘90s it added grunge-plaid shirts, wraparound goggles and baggy pants to sartorial mountain style — an era glossed over in “Après Ski.”\n\nIsakov believes that we’re now in a revival era of classically slim and sexy design, albeit with more technological and environmentally minded materials. And while that certainly defines Isakov’s own brand, the resort reality is more complex than that.\n\nAs with all fashion today, what you spot on the slopes and in the chalets is an anything-goes multiverse of retro and contemporary, flashy and simple. Others may be more apt to judge you on your ability to negotiate the mountain than your outfit: Better to ski well while wearing a faded jacket and jeans, than to be dressed in the latest design while taking a spill on a beginner run, many would agree.\n\nAs for the après of the title, it takes all comers as well. It’s not just a party, it’s community. It can take place in a bar, hot tub or cabin. Depending on the location, après “can be rowdy or relaxed, family friendly or far from it,” Isakov writes.\n\nUltimately, the ethos of après ski is to have a good time. Wear what you like but more importantly enjoy yourself. The food, the fireplace, the drink, the company, the relaxation — even non-skiers can appreciate a moveable feast of the senses, and the scene.\n\nImages: Excerpted from “Après Ski: The Scene, the Style, the Menu” © 2025 Erin Isakov. Used with permission from Artisan. All rights reserved.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/15/style/the-timeless-allure-of-apres-ski-culture",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/15/style/the-timeless-allure-of-apres-ski-culture",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fcf5ed6a0fcc1eb4fe166e0f77ca9b00e174852f70a92171438d2a5bb994f655",
  "scraped_at": "2026-02-16T07:34:32.193382+00:00"
}