{
  "url": "https://lite.cnn.com/2026/02/24/health/states-sue-trump-childhood-vaccine-recommendations",
  "title": "States sue Trump administration over changes to childhood vaccine recommendations | CNN",
  "date": "2026-02-25T07:31:46.135407+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "SACRAMENTO, Calif. (AP) — More than a dozen states sued the Trump administration Tuesday over its rollback ofvaccine recommendations for children, calling the move an illegal threat to public health.\n\nThe states argue that the Centers for Disease Control and Prevention put children’s lives at risk whenit announced last monththat it would stop recommending all children get immunized against the flu, rotavirus, hepatitis A, hepatitis B, some forms of meningitis and RSV. Under the new guidance, which was met with criticism from medical experts, protections against those diseases are recommended only for certain groups deemed high risk or when doctors recommend them in what’s called “shared decision-making.”\n\nThe newvaccinerecommendations ignore long-standing medical guidance and will make states have to spend more to protect against outbreaks, the states, including Arizona and California, said.\n\n“The health and safety of children across the country is not a political issue,” said Arizona Attorney General Kris Mayes, a Democrat, at a news conference. “It is not a culture war talking point.”\n\nThe CDC and Department of Health and Human Services did not respond to requests for comment on the lawsuit.\n\nThe lawsuit escalates an ongoing battle between Democratic-led states and Republican President Donald Trump’s administration over the federal government’schanges to public health policyunder Health Secretary Robert F. Kennedy Jr. The Trump administration has laid off thousands of workers at federal public health agencies, cut funding for scientific research and altered government guidance on fluoride and other topics.\n\nKennedy last yearousted every memberof a vaccine advisory committee and replaced them with his own picks, which Tuesday’s complaint alleges was unlawful.\n\nThe lawsuit comes months after the Democratic governors of California, Washington state and Oregonlaunched an allianceto establish their own vaccine recommendations. The governors said the Trump administration was risking people’s health by politicizing the CDC.\n\nStates, not the federal government, have the authority to require vaccinations for schoolchildren, though the CDC’s requirements typically influence state regulations.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://apnews.com/article/childhood-vaccine-schedule-trump-rfk-hhs-9b8df9e2767c1261aaac4e2331e77fa3",
      "text": "vaccine recommendations for children"
    },
    {
      "url": "https://apnews.com/article/childhood-vaccine-schedule-trump-rfk-measles-flu-b31b4d6815d4395d72745f3a18f2263c",
      "text": "it announced last month"
    },
    {
      "url": "https://apnews.com/article/childhood-vaccine-schedule-trump-rfk-hhs-9b8df9e2767c1261aaac4e2331e77fa3",
      "text": "vaccine"
    },
    {
      "url": "https://apnews.com/article/rfk-jr-kennedy-trump-health-hhs-maha-5e1e9e3208c42b6a185facad26e3b457",
      "text": "changes to public health policy"
    },
    {
      "url": "https://apnews.com/article/kennedy-cdc-acip-vaccines-3790c89f45b6314c5c7b686db0e3a8f9",
      "text": "ousted every member"
    },
    {
      "url": "https://apnews.com/article/cdc-west-coast-vaccines-trump-fd5ce557532a3c9f37b77ff9f14b07b9",
      "text": "launched an alliance"
    },
    {
      "url": "https://www.cnn.com/2026/02/24/health/states-sue-trump-childhood-vaccine-recommendations",
      "text": "See Full Web Article"
    },
    {
      "url": "https://lite.cnn.com/2026/02/24/health/states-sue-trump-childhood-vaccine-recommendations",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fdc0ee491ca1af37b37bc5e8064038177d917863a0524c302b9445055a220230",
  "scraped_at": "2026-02-25T07:31:46.135417+00:00"
}