{
  "url": "https://lite.cnn.com/2026/02/08/middleeast/israel-netanyahu-west-bank-dc-intl",
  "title": "Israel tightens grip on West Bank ahead of Netanyahu’s visit to US | CNN",
  "date": "2026-02-11T16:32:33.941276+00:00",
  "author": "Unknown",
  "text": "Source: CNN\n\nAhead of Israeli Prime MinisterBenjamin Netanyahu’s visit to Washington, DC, this week, Israel has taken a series of sweeping steps to tighten its grip on the occupied West Bank.\n\nOn Sunday, Israel’s security cabinet approved measures that expand the country’s enforcement powers and allow the state to buy land for the expansion of settlements in a way that far-right Finance Minister Bezalel Smotrich said would “fundamentally change the legal and civil reality” in the West Bank. The territory is held by the United Nations and the international community for a future Palestinian state.\n\nThe Israeli steps include expanding Israeli enforcement in Areas A and B of theWest Bank, which were designated under the Oslo Accords as areas that fall under Palestinian administrative control. The two areas together make up approximately 40% of the territory.\n\nIsrael will also restart its Land Acquisition Committee, which allows the state to proactively purchase lands in the West Bank for the expansion of settlements. Another measure grants the civil administration and the tiny Jewish settler minority in the city of Hebron building and municipal powers, allowing the settlement to expand without a need to consult with the Palestinian municipality of Hebron.\n\nThe security cabinet also approved measures that will make it easier for settlers to purchase land in the occupied West Bank, a move designed to expand settlement activity and entrench the Jewish population.\n\nSmotrich, who has openly boasted of his efforts to kill the idea of a Palestinian state, said in a statement, “We are normalizing life in the territories, removing bureaucratic barriers, fighting for the land, and deepening our presence throughout the Land of Israel.” Smotrich, who also serves as a minister in the Defense Ministry, has pushed for a rapid expansion of settlements, particularly under US President Donald Trump.\n\n“We will continue to extinguish the idea of a Palestinian state,” Smotrich said.\n\nIn response to the latest steps, a Trump administration official emphasized that the US does not support Israeli annexation of the occupied territory. “As the President has clearly stated, he does not support Israel annexing the West Bank,” the official said. “A stable West Bank keeps Israel secure and is in line with this administration’s goal to achieve piece in the region.”\n\nThe Palestinian Authority (PA) condemned the latest measures, calling them “a continuation of the comprehensive war waged by the occupation government against the Palestinian people and an unprecedented escalation targeting the Palestinian presence and its national and historical rights across all Palestinian land.”\n\nIn a statement, the presidency of the PA said it amounts to “the practical implementation of annexation and displacement plans.”\n\nHazem Qassem, a spokesman for Hamas, said in a statement the decisions taken by Israel “confirm its colonial program aimed at swallowing all Palestinian land and displacing its indigenous people.”\n\nIsrael captured the West Bank from Jordan in the 1967 war and subsequently began establishing Jewish settlements there, which are considered illegal under international law, the United Nations and by much of the international community. The UN also regards the West Bank and East Jerusalem as occupied territory, which the Palestinians seek for a future state.\n\nIn an interview with Time Magazine in October, Trumpsaid he would notallow Israel to annex the West Bank. “It won’t happen because I gave my word to the Arab countries,” he said. “Israel would lose all of its support from the United States if that happened.” The Trump administration’s 20-point Gaza ceasefire plan also speaks of a pathway to “Palestinian self-determination and statehood.”\n\nBut Israel has pursued a policy that critics equate to de facto annexation, expanding Jewish settlements in the occupied territory and deepening the country’s grip on the West Bank with the declared intent of making a Palestinian state impossible. Last May, Israel authorized the largest expansion of settlements in the West Bank in decades, approving the establishment of 22 new settlements.\n\nIn response to the latest measures, the anti-settlement watchdog Peace Now said, “Netanyahu promised to dismantle Hamas in Gaza, but in practice he chose to dismantle the Palestinian Authority, annul agreements Israel itself signed, and impose de facto annexation – in complete contradiction to the will of the people, Israel’s national interest, and the clear position of President Trump.”\n\nGershon Baskin, a peace activist who has played a crucial role in Israeli-Palestinian negotiations over the years, said in a blunt statement on social media, “The Israeli occupation is illegal and now the government of Israel is taking more steps against international law.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.cnn.com/2026/02/07/politics/trump-board-of-peace-meeting-gaza",
      "text": "Benjamin Netanyahu’"
    },
    {
      "url": "https://www.cnn.com/world/middleeast/palestinians-west-bank-erasure-israel",
      "text": "West Bank"
    },
    {
      "url": "https://www.cnn.com/2025/09/25/politics/trump-says-he-wont-allow-israel-to-annex-west-bank",
      "text": "said he would not"
    },
    {
      "url": "https://www.cnn.com/2026/02/08/middleeast/israel-netanyahu-west-bank-dc-intl",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/08/middleeast/israel-netanyahu-west-bank-dc-intl",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fe08f9e4225bf227332a4302f0c4648664702080845e2dd543e07cf359a9448b",
  "scraped_at": "2026-02-11T16:32:33.941293+00:00"
}