{
  "url": "https://lite.cnn.com/2026/02/23/science/saturn-rings-moon-cosmic-collision",
  "title": "Saturn’s rings and largest moon might be the result of a collision | CNN",
  "date": "2026-02-24T07:32:10.460846+00:00",
  "authors": [
    "Jacopo Prisco, CNN"
  ],
  "text": "Source: CNN\n\nSaturn’s largest moon, Titan, is one of the solar system’s oddities. Now, researchers have unlocked key insights about this mysterious moon, including how it came to be. The answer may also shed light on the origin of Saturn’s beautiful rings.\n\nShrouded in a thick haze, Titan is about half the size of Earth and even larger than Mercury — so massive that its gravitational pull makes Saturn wobble and tilt. Titan is also moving away from Saturn at a rate of 11 centimeters (4.3 inches) a year, far faster than astronomerspreviously thought. Eventually, the moon could beejectedfrom its orbit entirely.\n\nBut Titan’s drifting orbit is just one ofmany puzzlesthat astronomers are trying to solve about Saturn and some of its274 moons. Many of the questions have arisen from data collected byCassini, a spacecraft that explored the Saturnian system from 2004 to 2017.\n\nNew research has combinedprevious theories of Titan’s formation, data from Cassini and computer simulations to suggest a novel origin story for Saturn’s largest moon. The study was published this month on the open-access repository ArXiv and accepted for publication in The Planetary Science Journal.\n\n“In this paper, I tried to put all these things together, and I propose that there was an extra moon about half a billion years ago that collided with Titan, that actually became part of Titan,” said lead author Matija Ćuk, a research scientist at the SETI Institute in Mountain View, California. SETI is a nonprofit organization that explores topics such as planetary science, the origin of life and extraterrestrial intelligence.\n\nThe collision could also have producedHyperion, the largest of Saturn’s nonspherical moons, which is far smaller than Titan at about 5% of its diameter. According to this theory, Hyperion could either be a fragment that resulted from the collision between Titan and the lost moon, or it may have formed later from debris that accumulated around Titan’s orbit.\n\nThe merger between Titan and the lost moon could also have led to the formation of Saturn’s rings, Ćuk added. “From this event, Titan could have perturbed some of the inner moons into more collisions, which created the rings sometime later, maybe 100 million years ago,” he said.\n\nThe researchers foundtelltale signsof an ancient collision in Saturn’s tilt, which is made obvious by its rings; the gas giant rotates at an angle of26.7 degreescompared with the plane at which it orbits the sun.\n\nBefore Cassini’s mission, astronomersbelievedthat gravitational disturbances inflicted by neighbor Neptune’s orbit caused Saturn’s tilt over time.\n\n“The orbit of Neptune has a bit of a wobble in space,” Ćuk said. “The orbits of planets are huge and have huge energy. But the spins of planets are much, much smaller, so if you connect these two motions — the orbit of Neptune and the spin of Saturn — it is the spin of Saturn that will change.”\n\nHowever, Cassini’s data showed that the two planets are not exactly in sync, pointing to a missing element. In 2022, astronomers suggested thata lost moon, which they named Chrysalis, was a probable explanation for Saturn’s current tilt. It once orbited the planet, for billions of years, contributing to Saturn’s resonance with Neptune, but around 160 million years ago the moon came too close to Saturn and was pulled apart in an event that created the planet’s rings and shifted its tilt.\n\nĆuk and his colleagues refined that idea. They hypothesize that the event was not just a moon grazing Saturn and then disintegrating but a collision between predecessors of both Titan and Hyperion. “I call it proto-Hyperion, but it was 1,000 times larger — it was like a smaller version of Titan,” Ćuk said.\n\nThis lost moon collided with Titan and lost much of its mass, an event that would explain Titan’s drifting orbit and Saturn’s spin. “Right now, Saturn is wobbling a little bit too fast,” Ćuk said. “But if you go back a few hundreds of millions of years when we saw this happen, the wobble was just short of what we needed to have the resonance with Neptune. And if you add an extra moon, you make it exact. And that explains everything.”\n\nIn other words, the gravity and mass of the lost moon kept Saturn and Neptune in sync, and only its disappearance explains why they are now slightly misaligned.\n\nIf the collision also created Hyperion in its current form — a smaller, tumbling, misshapen rock — it would explain why its orbit is locked with Titan’s. But it remains unclear, Ćuk said, whether Hyperion is a fragment of Titan’s precursor or of the lost moon that merged with it.\n\nAccording to the study,Saturn’s rings could have formed hundreds of millions of years after the event. Titan’s expanding orbit interacted with some of Saturn’s inner moons, disturbing them to the point of making them smash into each other. Some of the resulting debris survived as the rings.\n\nApaperpublished in February, which postulates that Titan’s surface is as young as 300 million years old based on the lack of impact craters, lends credibility to the collision scenario, according to Ćuk.\n\nBut the best way to test the theory is using NASA’sDragonfly— a nuclear-powered, car-size rotorcraft that will fly over Titan’s surface and land in different spots to collect and analyze samples with its onboard instruments. It is currently scheduled to launch in 2028 for arrival on Titan by late 2034.\n\nThe evolution of the moons in the Saturn system and the origin of the rings are interesting puzzles that have intrigued scientists, said Linda Spilker, a senior research and planetary scientist at NASA’s Jet Propulsion Laboratory who was not involved with the study.\n\n“The rings may be as young as just a few hundred million years, or were formed at the same time as Saturn,” Spilker added in an email. “This study provides compelling evidence for Hyperion and Saturn’s rings forming well after Saturn formed.”\n\nLike an intricate musical clock, Saturn and its satellites spin and orbit with a variety of beats and resonances, according to William B. Hubbard, professor emeritus of planetary sciences at the University of Arizona who was also not part of the research.\n\nSaturn wobbles like a spinning top at a frequency that is suspiciously close to a basic frequency of the solar system, but it is not quite in tune, suggesting that some sort of relatively recent disruption may have occurred, Hubbard explained in an email.\n\n“A 2022 study proposed that there was an extinct satellite, dubbed Chrysalis, responsible for forming the rings, but the probability of such an event was disappointingly low,” he wrote. “The new study by Ćuk et al shows that a variant of this process, involving the still existing satellite Hyperion, is more probable.”\n\nThe scenario proposed by Ćuk and his colleagues provides a complicated but highly plausible sequence of events that explains the Saturnian system as scientists see it today, according to Carl Murray, an emeritus professor of mathematics and astronomy at Queen Mary University of London. Murray was not involved in the work but was a member of the Cassini team.\n\nAstronomers long suspected that the Saturn system had evolved since its formation, but detailing the extent of change had always been a problem, he noted in an email.\n\n“It’s a bit like ‘CSI: Saturn’ — we have clear forensic evidence that something unusual had happened,” he said, “but until Cassini we were effectively only dealing with a snapshot of the crime scene and left trying to deduce possible culprits.”\n\nOne of the many legacies of Cassini’s 13 years of detailed measurements, combined with historical data, has been the discovery that Titan’s orbit is expanding much faster than had been expected, Murray continued.\n\n“The Saturn system is a dynamicist’s paradise with numerous numerical relationships — called resonances — between the orbital periods of pairs of its moons. ‘It’s complicated’ is a fair description of all these dynamical relationships over the past 400 million years, but the authors identify Titan’s role as key to our understanding of the Saturn system.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.nasa.gov/centers-and-facilities/jpl/saturns-moon-titan-drifting-away-faster-than-previously-thought/",
      "text": "previously thought"
    },
    {
      "url": "https://arxiv.org/abs/2110.05550",
      "text": "ejected"
    },
    {
      "url": "https://science.nasa.gov/solar-system/10-things-unsolved-mysteries-of-saturns-moons/",
      "text": "many puzzles"
    },
    {
      "url": "https://science.nasa.gov/saturn/moons/",
      "text": "274 moons"
    },
    {
      "url": "https://science.nasa.gov/mission/cassini/about-the-mission/",
      "text": "Cassini"
    },
    {
      "url": "https://arxiv.org/abs/2602.09281",
      "text": "New research has combined"
    },
    {
      "url": "https://science.nasa.gov/saturn/moons/hyperion/",
      "text": "Hyperion"
    },
    {
      "url": "https://www.seti.org/news/saturns-moon-titan-could-have-formed-in-a-merger-of-two-old-moons/",
      "text": "telltale signs"
    },
    {
      "url": "https://science.nasa.gov/missions/hubble/hubble-views-saturn-ring-plane-crossing/",
      "text": "26.7 degrees"
    },
    {
      "url": "https://iopscience.iop.org/article/10.1086/424533",
      "text": "believed"
    },
    {
      "url": "https://news.mit.edu/2022/saturn-rings-tilt-missing-moon-0915",
      "text": "a lost moon, which they named Chrysalis"
    },
    {
      "url": "https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2025GL116041",
      "text": "paper"
    },
    {
      "url": "https://science.nasa.gov/mission/dragonfly/",
      "text": "Dragonfly"
    },
    {
      "url": "https://www.cnn.com/2026/02/23/science/saturn-rings-moon-cosmic-collision",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/23/science/saturn-rings-moon-cosmic-collision",
      "text": "Cookie Settings"
    }
  ],
  "hash": "fef194c94475697d89904dbe330733abff9b07ea50934257845562834ccb2845",
  "scraped_at": "2026-02-24T07:32:10.460860+00:00"
}