{
  "url": "https://lite.cnn.com/2026/02/26/health/organ-donation-circulatory-death",
  "title": "More organs are being donated after the heart stops, not brain death. Policies are changing, too | CNN",
  "date": "2026-02-28T07:01:01.201756+00:00",
  "authors": [
    "Associated Press"
  ],
  "text": "Source: CNN\n\nThe vast majority of organ donations once came from people who were brain-dead. Now they’re increasingly coming from people who died whentheir heart stopped beating,a major shift that can boost transplants but alsoraises public confusion, researchers reported Thursday.\n\nWhat’s called donation after circulatory death, or DCD, jumped dramatically in a short period: It accounted for 49% of alldeceased donorsin the U.S. last year, up from 2% in 2000.\n\nTechnology has helped overcome barriers to using those organs — ways to keep them from deteriorating as the heartbeat winds down — spurring this type of donation at the same time the nation is hunting ways to overcome a dire shortage. More than 100,000 people are on the transplant waiting list and thousands die waiting. Just over 49,000 transplants were performed last year.\n\nBut specialists from NYU Langone Health found donation after circulatory death is far more common in some parts of the country than others. That suggests better educating the public and local hospitals about the option could further increase access to lifesaving transplants.\n\nThe findings, published in the medical journal JAMA, come as some rare but scary reports of potential donors who showed signs of life haveshaken trustin the transplant system.\n\nAdditional safeguards are being developed by both federal officials and the nonprofit organ procurement organizations, or OPOs, that the government certifies to coordinate donation. The new findings may aid that policymaking.\n\nDonation after circulatory death is complex and “we need to make sure we are doing it well,” said Dr. Babak Orandi, an NYU transplant surgeon and study co-author. “If we stop doing it or severely restrict it, there would be pretty significant repercussions for patients.”\n\nWhile living donors can provide certain organs, most transplants are thanks to donations from the deceased. Brain death is declared when testing shows someone has no remaining brain function. If they’re a possible organ donor, the body is kept on a ventilator to support the organs until they’re retrieved.\n\nDonation after circulatory death can be an option if someone has a nonsurvivable injury but all brain function hasn’t ceased, and the family chooses to end life support. Death occurs after the heart gradually stops beating. Once that happens there’s a mandatory wait — five minutes, according to guidelines from the American Society of Transplant Surgeons — to be sure it won’t restart. Then the person’s doctor declares death.\n\nBy law, donation and transplant groups can’t participate in the decision to end life support, and they’re not in the room when it’s withdrawn. Organ retrieval cannot begin until death is declared. If death doesn’t occur quickly enough, within about two hours, the organs aren’t usable and retrieval isn’t attempted.\n\nTo track the donor evolution, the NYU team analyzed data from the nation’s Organ Procurement and Transplantation Network, and from 55 OPOs that recover organs in assigned regions around the country.\n\nLast year, circulatory death accounted for more than half the donors at 24 organ donation agencies. But it varied widely, with some accounting for as little as 11% of donors.\n\nHospital resources play a role, according to the Association for Organ Procurement Organizations. Decisions to withdraw life support are common, but small or rural hospitals may not be as familiar with the extra steps involved with donation.\n\nAnother factor is whether hospitals have adopted that new technology. The quality of organs can suffer as the heart stops, briefly depriving them of oxygen. After death is declared, a tool called normothermic regional perfusion allows surgeons to temporarily restore that blood flow to organs in the chest or abdomen — avoiding the brain — while they do the delicate work of removing them.\n\nIt has helped enable use of organs from older, sicker donors after their hearts stop. But even temporarily restoring blood flow after death has raised ethical questions.\n\nThe Health Resources and Services Administration is preparing new national policies to improve safeguards for this type of donation. One proposal would allow anyone involved with a potential donor who questions if their condition is right for life-support withdrawal to call for a pause in those preparations.\n\nOther proposals would require OPOs to document that the hospitals caring for the potential donor are performing appropriate neurological exams, and to educate families of potential DCD donors about the steps required.\n\nThe Association of Organ Procurement Organizations has some similar guidelines and some OPOs already have created checklists to help hospitals.\n\nThe group also urges withdrawing life support in the critical care unit, not in an operating room, to help avoid public confusion about when death occurs and when organ groups step in, said association president Jeff Trageser.\n\nDonation after circulatory death “requires a lot of buy-in from the community, including the local hospitals, to make this happen,” said NYU’s Orandi. “A couple of cases out of many, many cases has led to a loss of trust.”\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://apnews.com/article/heart-transplants-donation-dcd-11a296d03631aef6ff6d84099463a586",
      "text": "their heart stopped beating,"
    },
    {
      "url": "https://apnews.com/article/organ-transplant-donor-kentucky-donation-8a08c81ae213651fc602d3f53a4f2a7b",
      "text": "raises public confusion"
    },
    {
      "url": "https://apnews.com/article/organ-donor-deceased-transplant-7e9318a61497a3a32ac3258a78961247",
      "text": "deceased donors"
    },
    {
      "url": "https://apnews.com/article/kidney-transplant-donation-organ-62e62719a29675c0888bc006b50a04c1",
      "text": "shaken trust"
    }
  ],
  "hash": "ff111c7349d76623f8ef4fa399691b0cc3b534dd3af74ff3d2deff0b930c6b93",
  "scraped_at": "2026-02-28T07:01:01.201769+00:00"
}