{
  "url": "https://lite.cnn.com/2026/02/17/weather/fire-oklahoma-texas-kansas-colorado-climate",
  "title": "4 dead in 30-vehicle pileup in Colorado as powerful winds slam Plains, fueling multiple wildfires | CNN",
  "date": "2026-02-19T07:32:01.857982+00:00",
  "authors": [
    "CNN Meteorologists Chris Dolce, Briana Waxman"
  ],
  "text": "Source: CNN\n\nAt least four people are dead in a multi-vehicle pileup in Colorado and multiple fires are breaking out across the Plains as powerful winds wreak havoc across the region, forcing thousands to evacuate.\n\nThe pileup on Interstate 25 south of Pueblo, Colorado, involving over 30 vehicles, occurred after winds gusted up to 61 mph, blowing dust and dirt around, reducing visibility and causing “brown out” conditions.\n\nIn addition to the four deaths, at least 29 people were taken to the hospital with injuries, according to the Colorado State Patrol. Their injuries were described as minor to moderate, with a “few” described as serious.\n\n“Visibility was next to nothing,” Colorado State Police Maj. Brian Lyons said, describing the wind event as moving in very quickly.\n\nMore than 750,000 people in parts of five states across the Plains on Tuesday are facing Level 3 of 3 extremely critical fire weather conditions – damaging wind gusts up to 70 mph, extremely dry air and ample dead, dry vegetation. The National Weather Service called it a rare “Particularly Dangerous Situation” in a red flag warning.\n\nA wildfire that broke out in Woodward, Oklahoma – a city of about 12,000 residents in northwestern Oklahoma – forced 3,000 to 4,000 people to evacuate in the southwest quadrant of the city, the Woodward County emergency manager, Matt Lehenbauer, told CNN affiliate KOCO. The majority of these evacuation orderswere liftedby late Tuesday.\n\nNorthwestern Oklahoma State University’s Woodward campus was evacuated and closed until further notice because of the fires, the schoolsaid on X.\n\nAnother fire that broke out earlier in the morning in Beaver County, Oklahoma, rapidly crossed into southwest Kansas in just a few hours. The Ranger Road Fire had burned about 15,000 acres by Tuesday afternoon, but by Tuesday evening it had exploded to an estimated 145,000 acres, according to theOklahoma Forestry Service.\n\nThe Ranger Road Fire traveled 65 miles from Oklahoma into Kansas and forced evacuations of more than 11,000 people in the towns of Englewood, Ashland and Tyrone, according to CNN affiliateKAKE.\n\nSmoke billowed from the plains as a farmer raced to dig a fire line near Hooker, Oklahoma, a video from Jaden Pappenheim at SevereStudios showed.\n\nWinds whipped and livestock fled as first responders tried to quell the intense flames, another video showed.\n\nOklahoma Gov. Kevin Stitt said he was being briefed on the fire response and is coordinating with the state’s forestry service and emergency management agencies, as well as local first responders.\n\n“With high fire danger expected to continue over the next several days, I urge all Oklahomans to remain alert, follow evacuation orders, and avoid any activity that could spark new fires,” the governor said in apost on X.\n\nStitt requested air assets from Texas to help with the fires in his state, but it’s been too windy to fly, the governor told KOCO.\n\n“I’ve instructed all the forestry assets from the eastern part of the state that are already on their way – most of them are already there – just to put every fire hose we have and every bulldozer, make sure that we get those lines prepared,” he said.\n\n“We’ve got quite a mess going on … we’re still coordinating trying to get more firefighters,” Lehenbauer, the county emergency manager, told KOCO.\n\nFarther south, officials issued a fire warning Tuesday evening in the Texas Panhandle for a “dangerous wildfire” about 18 miles northwest of Amarillo, Texas, that was moving east at 3 to 5 mph.\n\nWind gusts cranked up across a widespread area in the Plains and increased through the afternoon. Burlington, Colorado, clocked a gust of 71 mph and gusts over 60 mph were observed in western Kansas and the Oklahoma and Texas panhandles.\n\nPast wildfires sparked in similar conditions have been devastating:2024’s Smokehouse Creek Firein the Texas Panhandle, the state’s largest wildfire, burned through more than 500 structures.\n\nThe fire weather concerns peaked Tuesday afternoon when winds were strongest and relative humidity bottomed out between 10 and 15%. Conditions will remain dangerous into the early evening hours before easing up overnight.\n\nAnother storm could kick up winds and increase fire danger to critical conditions, the second-highest level, tomorrow afternoon in the southern High Plains, from eastern New Mexico and West Texas into the Oklahoma Panhandle, southwest Kansas and southeast Colorado.\n\nSee Full Web Article",
  "links": [
    {
      "url": "https://lite.cnn.com/",
      "text": "CNN"
    },
    {
      "url": "https://www.facebook.com/woodwardpolicedepartment/posts/pfbid0M8X8ATwykWa9fd9ZjoXX1Hw9tDGnwTtRUNf2fMB4dwi8gsJaiMhrGvBq9gDE9BHRl?rdid=6wq41JgvItAm2GNX",
      "text": "were lifted"
    },
    {
      "url": "https://x.com/NWOSU/status/2023894249289187444?s=20",
      "text": "said on X"
    },
    {
      "url": "https://www.facebook.com/OklahomaForestry/posts/pfbid0pdXv2RrQb4BzDhNeG6eYXkrneP4MPkmhLwsTeWV5FYKLFCshA6x3dcLwrAAr6d3Hl?rdid=k0RbBx8st9ufRSwh",
      "text": "Oklahoma Forestry Service"
    },
    {
      "url": "https://www.kake.com/home/live-updates-ashland-being-evacuated-as-large-wildfire-crosses-into-kansas/article_143ef2c7-bd1e-4001-8f8e-272c138785c0.html",
      "text": "KAKE"
    },
    {
      "url": "https://x.com/GovStitt/status/2023892194688422078",
      "text": "post on X"
    },
    {
      "url": "https://www.cnn.com/2024/03/01/us/texas-panhandle-smokehouse-creek-fire-oklahoma-friday",
      "text": "2024’s Smokehouse Creek Fire"
    },
    {
      "url": "https://www.cnn.com/2026/02/17/weather/fire-oklahoma-texas-kansas-colorado-climate",
      "text": "See Full Web Article"
    },
    {
      "url": "https://www.cnn.com/",
      "text": "Go to the full CNN experience"
    },
    {
      "url": "https://www.cnn.com/terms",
      "text": "Terms of Use"
    },
    {
      "url": "https://www.cnn.com/privacy",
      "text": "Privacy Policy"
    },
    {
      "url": "https://www.cnn.com/ad-choices",
      "text": "Ad Choices"
    },
    {
      "url": "https://lite.cnn.com/2026/02/17/weather/fire-oklahoma-texas-kansas-colorado-climate",
      "text": "Cookie Settings"
    }
  ],
  "hash": "ff294512e18062015dfa2e0f7930e5eb1530502f87a0671582342949df4935d6",
  "scraped_at": "2026-02-19T07:32:01.857996+00:00"
}